[
    {
      "url": "https://www.allrecipes.com/recipe/269649/skillet-chicken-with-sun-dried-tomato-sauce/",
      "name": "Chicken with Creamy Sun-Dried Tomato Sauce",
      "rating": "5.0",
      "ratingcount": "2",
      "ingredients": "4 pounds boneless skinless chicken breasts; salt and pepper to taste; 10 tablespoons butter, divided; 6 cloves garlic, minced; 2 teaspoons Italian seasoning; ½ teaspoon red pepper flakes; 1 cup dry white wine (such as Chardonnay); 2 cups chicken broth; 1 ½ cups heavy whipping cream; 1 cup oil-packed sun-dried tomatoes, thinly sliced; 1 cup thinly sliced fresh basil",
      "directions": "1. Place chicken breasts in a resealable plastic bag and pound to an even thickness. If breasts are very large, cut them in half. Season lightly with salt and pepper. 2. Melt 4 tablespoons butter in a large nonstick skillet over medium heat and cook 1/2 of the chicken breasts until they are no longer pink in the center and the juices run clear, 5 to 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from skillet and set aside. Melt another 4 tablespoons butter and repeat with the remaining chicken breasts. Set aside. 3. Melt remaining 2 tablespoons butter in the same skillet and add garlic, Italian seasoning, and red pepper flakes. Cook, stirring constantly, for 1 minute. Pour in wine and bring to a boil. Reduce heat and simmer for 2 minutes. Pour in chicken broth, return to a boil, reduce heat, and simmer for 5 minutes. Stir in cream and sun-dried tomatoes. Simmer for 5 minutes. 4. Stir in basil and return chicken to the skillet. Cook until chicken is thoroughly heated and sauce has thickened, about 5 minutes.",
      "prep": "20 mins",
      "cook": "30 mins",
      "total": "50 mins",
      "calories": "495"
    },
    {
      "url": "https://www.allrecipes.com/recipe/265537/zucchini-smoothie/",
      "name": "Zucchini Smoothie",
      "rating": "4.7",
      "ratingcount": "3",
      "ingredients": "½ cup ice cubes, or as needed (Optional); ½  zucchini, shredded; ½  frozen banana; ½ cup orange juice",
      "directions": "1. Combine ice cubes, zucchini, banana, and orange juice in a blender. Blend until smooth.",
      "prep": "5 mins",
      "cook": "",
      "total": "5 mins",
      "calories": "118"
    },
    {
      "url": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/",
      "name": "World's Best Lasagna",
      "rating": "4.8",
      "ratingcount": "20",
      "ingredients": "1 pound sweet Italian sausage; ¾ pound lean ground beef; ½ cup minced onion; 2 cloves garlic, crushed; 1 (28 ounce) can crushed tomatoes; 2 (6.5 ounce) cans canned tomato sauce; 2 (6 ounce) cans tomato paste; ½ cup water; 2 tablespoons white sugar; 4 tablespoons chopped fresh parsley, divided; 1 ½ teaspoons dried basil leaves; 1 ½ teaspoons salt, divided, or to taste; 1 teaspoon Italian seasoning; ½ teaspoon fennel seeds; ¼ teaspoon ground black pepper; 12  lasagna noodles; 16 ounces ricotta cheese; 1  egg; ¾ pound mozzarella cheese, sliced; ¾ cup grated Parmesan cheese",
      "directions": "1. Gather all your ingredients. 2. Cook sausage, ground beef, onion, and garlic in a Dutch oven over medium heat until well browned. 3. Stir in crushed tomatoes, tomato sauce, tomato paste, and water. Season with sugar, 2 tablespoons parsley, basil, 1 teaspoon salt, Italian seasoning, fennel seeds, and pepper. Simmer, covered, for about 1 1/2 hours, stirring occasionally. 4. Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. 5. In a mixing bowl, combine ricotta cheese with egg, remaining 2 tablespoons parsley, and 1/2 teaspoon salt. 6. Preheat the oven to 375 degrees F (190 degrees C). 7. To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with 1/2 of the ricotta cheese mixture. Top with 1/3 of the mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. 8. Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray or make sure the foil does not touch the cheese. 9. Bake in the preheated oven for 25 minutes. Remove the foil and bake for an additional 25 minutes. 10. Rest lasagna for 15 minutes before serving.",
      "prep": "30 mins",
      "cook": "2 hrs 30 mins",
      "total": "3 hrs 15 mins",
      "calories": "448"
    },
    {
      "url": "https://www.allrecipes.com/recipe/21014/good-old-fashioned-pancakes/",
      "name": "Good Old-Fashioned Pancakes",
      "rating": "4.6",
      "ratingcount": "18",
      "ingredients": "1 ½ cups all-purpose flour; 3 ½ teaspoons baking powder; 1 tablespoon white sugar; ¼ teaspoon salt, or more to taste; 1 ¼ cups milk; 3 tablespoons butter, melted; 1  egg",
      "directions": "1. Sift flour, baking powder, sugar, and salt together in a large bowl. Make a well in the center and add milk, melted butter, and egg; mix until smooth. 2. Heat a lightly oiled griddle or pan over medium-high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake; cook until bubbles form and the edges are dry, about 2 to 3 minutes. Flip and cook until browned on the other side. Repeat with remaining batter.",
      "prep": "5 mins",
      "cook": "15 mins",
      "total": "20 mins",
      "calories": "158"
    },
    {
      "url": "https://www.allrecipes.com/recipe/143069/super-delicious-zuppa-toscana/",
      "name": "Super-Delicious Zuppa Toscana",
      "rating": "4.8",
      "ratingcount": "3",
      "ingredients": "1 pound bulk mild Italian sausage; 1 ¼ teaspoons crushed red pepper flakes; 4 slices bacon, cut into 1/2 inch pieces; 1 large onion, diced; 1 tablespoon minced garlic; 5 (13.75 ounce) cans chicken broth; 6 medium potatoes, thinly sliced; 1 cup heavy cream; ¼ bunch fresh spinach, tough stems removed",
      "directions": "1. Cook Italian sausage and red pepper flakes in a Dutch oven over medium-high heat until crumbly, browned, and no longer pink, 10 to 15 minutes. Drain and set aside. 2. Cook bacon in the same Dutch oven over medium heat until crisp, about 10 minutes. Drain, leaving a few tablespoons of drippings with the bacon in the bottom of the Dutch oven. Stir in onions and garlic; cook until onions are soft and translucent, about 5 minutes. 3. Stir in chicken broth and bring to a boil over high heat. Add potatoes and simmer until fork tender, about 20 minutes. Reduce heat to medium; stir in cream, cooked sausage, and spinach. Cook and stir until spinach has wilted and sausage is warmed through; serve.",
      "prep": "20 mins",
      "cook": "55 mins",
      "total": "1 hr 15 mins",
      "calories": "554"
    },
    {
      "url": "https://www.allrecipes.com/recipe/275252/grilled-halloumi-with-herbed-berry-salsa/",
      "name": "Grilled Halloumi with Herbed Berry Salsa",
      "rating": "5.0",
      "ratingcount": "1",
      "ingredients": "4 ounces fresh blueberries; 3 ounces red currants; 3 tablespoons chopped fresh mint, divided; 3 tablespoons chopped fresh cilantro, divided; 1 tablespoon fresh marjoram, stems removed; 1  habanero pepper, seeded and minced; 2 tablespoons olive oil; 2 tablespoons agave syrup; 2  limes, divided; ½ cup cashews; 8 ounces halloumi cheese, cut into 8 slices",
      "directions": "1. Place blueberries and red currants into a mixing bowl. Add 2 tablespoons mint, 2 tablespoons cilantro, marjoram, habanero, olive oil, agave syrup, and juice of 1 lime. Mix and set aside. 2. Heat a nonstick griddle over medium-high heat. Cook cashews until browned, stirring often to keep from burning, 8 to 10 minutes. Transfer cashews to a plate and set aside. Reduce heat to medium and brown halloumi cheese slices, 2 to 3 minutes per side. 3. Place halloumi cheese onto a plate, top with berry salsa mixture and remaining 1 tablespoon mint and cilantro. Chop cashews and spread on top of halloumi. Garnish with lime wedges from remaining lime. Serve immediately.",
      "prep": "20 mins",
      "cook": "15 mins",
      "total": "35 mins",
      "calories": "406"
    },
    {
      "url": "https://www.allrecipes.com/recipe/268796/spicy-gluten-free-chicken-and-cheddar-waffles-with-blackberry-maple-syrup/",
      "name": "Spicy Gluten-Free Chicken and Cheddar Waffles with Blackberry-Maple Syrup",
      "rating": "5.0",
      "ratingcount": "2",
      "ingredients": "4  fresh blackberries; 1 teaspoon ancho chile powder; ¼ teaspoon red pepper flakes; 1 cup pure maple syrup; 2 pounds chicken tenders; 1  orange, zested and juiced; salt and ground black pepper to taste; ½ cup coconut flour; ½ cup almond flour; 1 teaspoon minced garlic; 1 teaspoon smoked paprika; 2 ¼ cups gluten-free all purpose baking flour; 1 tablespoon baking powder; ½ teaspoon dried rosemary; ½ teaspoon ground thyme; ¼ teaspoon sea salt; cooking spray; 1 stick butter, softened; 1 tablespoon maple syrup; 1 cup shredded sharp Cheddar cheese; 3  eggs; 1 ¾ cups almond milk; ¼ cup blackberries for garnish",
      "directions": "1. Muddle 4 blackberries in the bottom of a microwave-safe glass serving jar. Add chile powder and red pepper flakes, then maple syrup; stir syrup briskly until well combined. 2. Place chicken in a large, shallow baking dish. Drizzle with orange juice and season liberally with salt and pepper. Refrigerate until needed. Whisk orange zest with coconut flour, almond flour, garlic, and paprika. Set dredging mixture aside. 3. Mix gluten-free flour, baking powder, rosemary, thyme, and sea salt together in another bowl to start the waffle batter. 4. Preheat the oven to 400 degrees F (200 degrees C). Preheat a waffle iron according to manufacturer's instructions and spray with cooking spray. 5. Beat butter and maple syrup together in a bowl using an electric mixer until creamy. Add eggs 1 at a time. Gradually add the gluten-free flour mixture and milk in 3 alternating batches. Stir in Cheddar cheese just until combined. Pour batter into the preheated waffle iron. Cook until crisp and deeply brown, 6 to 8 minutes per waffle. Place waffles on a baking sheet and keep warm in the preheating oven while preparing chicken. 6. Line another baking sheet with parchment paper. Gently shake excess orange juice off each chicken tender and press all sides into the reserved coconut flour mixture. Place coated chicken on the prepared baking sheet. Remove waffles from oven and keep warm. 7. Bake chicken in the preheated oven, flipping halfway, until browned on both sides, about 20 minutes total. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 8. Microwave syrup until warm, about 1 minute. Top each waffle with a warm chicken tender or two and a handful of blackberries. Drizzle with the warmed spicy maple syrup.",
      "prep": "35 mins",
      "cook": "35 mins",
      "total": "1 hr 10 mins",
      "calories": "678"
    },
    {
      "url": "https://www.allrecipes.com/recipe/279625/pb-j-smoothie/",
      "name": "PB & J Smoothie",
      "rating": "5.0",
      "ratingcount": "3",
      "ingredients": "6  frozen strawberries, or more to taste; ¾ cup milk; 1 ½ tablespoons peanut butter; 1 tablespoon blue agave nectar, or more to taste; 1 tablespoon flax seeds",
      "directions": "1. Combine strawberries, milk, peanut butter, blue agave, and flax seeds in a blender and blend until well combined.",
      "prep": "5 mins",
      "cook": "",
      "total": "5 mins",
      "calories": "381"
    },
    {
      "url": "https://www.allrecipes.com/recipe/6874/best-ever-muffins/",
      "name": "Best Ever Muffins",
      "rating": "4.5",
      "ratingcount": "1",
      "ingredients": "2 cups all-purpose flour; 3 teaspoons baking powder; ½ teaspoon salt; ¾ cup white sugar; 1  egg; 1 cup milk; ¼ cup vegetable oil",
      "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Grease a 12-cup muffin tin or line cups with paper liners. 2. Stir flour, baking powder, salt, and sugar together in a large bowl; make a well in the center. 3. Beat egg with a fork in a small bowl or 2-cup measuring cup; whisk in milk and oil. Pour egg mixture all at once into flour mixture; mix quickly and lightly with a fork until just moistened. The batter will be lumpy. (Fold in additional ingredients if using; see variations below). Spoon batter into the prepared muffin cups, filling each 3/4 full. 4. Bake in the preheated oven until tops spring back when lightly pressed, about 25 minutes.",
      "prep": "10 mins",
      "cook": "25 mins",
      "total": "35 mins",
      "calories": "182"
    },
    {
      "url": "https://www.allrecipes.com/recipe/267120/vegan-pumpkin-pancakes/",
      "name": "Vegan Pumpkin Pancakes",
      "rating": "5.0",
      "ratingcount": "1",
      "ingredients": "2 cups almond milk; 2 tablespoons distilled white vinegar; 5 tablespoons water; 2 tablespoons flaxseed meal; 2 cups all-purpose flour; 2 tablespoons coconut sugar; 1 tablespoon baking powder; 1 tablespoon ground cinnamon; 2 teaspoons baking soda; 1 teaspoon salt; 1 cup pumpkin puree; 2 tablespoons coconut oil; ¼ cup toasted chopped pecans",
      "directions": "1. Combine almond milk and vinegar together in a measuring cup; set aside for 10 minutes. 2. Combine water and flaxseed meal together in a bowl; allow to rest until gelatinous, about 5 minutes. 3. Combine flour, coconut sugar, baking powder, cinnamon, baking soda, and salt in a medium bowl. 4. Add almond milk mixture, flaxseed meal mixture, pumpkin puree, and coconut oil to the bowl with the flour mixture. Mix until well blended. Fold in pecans. 5. Heat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.",
      "prep": "15 mins",
      "cook": "10 mins",
      "total": "25 mins",
      "calories": "288"
    },
    {
      "url": "https://www.allrecipes.com/recipe/285442/maple-cupcakes/",
      "name": "Maple Cupcakes",
      "rating": "4.0",
      "ratingcount": "3",
      "ingredients": "1 cup maple syrup; 5 tablespoons margarine; 1 large egg; 1 ½ cups all-purpose flour; ½ cup whole wheat flour; 2 ¼ teaspoons baking powder; ½ teaspoon ground nutmeg; ½ teaspoon salt; ¼ teaspoon ground ginger; ½ cup milk",
      "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease two 12-cup muffin tins. 2. Beat maple syrup and margarine together in a large bowl until well mixed and creamy. Mix in egg until combined. 3. Combine all-purpose and whole wheat flours, baking powder, nutmeg, salt, and ginger in a small bowl. Add dry ingredients to the wet ingredients in batches, alternating with the milk, beating batter briefly after each addition. Fill the prepared muffin cups 3/4 full with batter. 4. Bake in the preheated oven until a toothpick inserted in the centers comes out clean, 20 to 30 minutes.",
      "prep": "15 mins",
      "cook": "20 mins",
      "total": "35 mins",
      "calories": "97"
    },
    {
      "url": "https://www.allrecipes.com/recipe/35151/traditional-filipino-lumpia/",
      "name": "Traditional Filipino Lumpia",
      "rating": "4.8",
      "ratingcount": "507",
      "ingredients": "1 tablespoon vegetable oil; 1 pound ground pork; ½ cup chopped onion; 2 cloves garlic, crushed; ½ cup minced carrots; ½ cup chopped green onions; ½ cup thinly sliced green cabbage; 2 tablespoons chopped fresh cilantro (Optional); 1 teaspoon ground black pepper; 1 teaspoon salt; 1 teaspoon garlic powder; 1 teaspoon soy sauce; 30  lumpia wrappers; 2 cups vegetable oil for frying, or as needed",
      "directions": "1. Heat 1 tablespoon vegetable oil in a wok or large skillet over high heat. Add pork; cook and stir until crumbly and no pink is showing, 5 to 7 minutes. Remove pork from the pan and set aside. Drain grease from the pan, leaving just a thin coating. 2. Add onion and garlic to the pan; cook and stir until fragrant, about 2 minutes. Stir in the cooked pork, carrots, green onions, cabbage, and cilantro. Season with pepper, salt, garlic powder, and soy sauce. Remove from the heat, and set aside until cool enough to handle, about 5 minutes. 3. Assemble lumpia: Place 3 heaping tablespoons of filling diagonally near one corner of a lumpia wrapper, leaving a 1 1/2 inch space at both ends. Fold the side along the length of the filling over the filling, tuck in both ends, and roll neatly and tightly to close. Moisten the other side of the wrapper with water to seal the edge. Transfer to a plate and cover with plastic wrap to retain moisture. Repeat to assemble remaining lumpia. 4. Heat 1/2 inch vegetable oil in a heavy skillet over medium heat for 5 minutes. 5. Slide 3 to 4 lumpia into the hot oil, making sure the seams are facing down. Fry, turning occasionally, until all sides are golden brown, 1 to 2 minutes. Transfer to a paper towel-lined plate to drain. Repeat to fry remaining lumpia. Serve immediately.",
      "prep": "40 mins",
      "cook": "25 mins",
      "total": "1 hr 10 mins",
      "calories": "168"
    },
    {
      "url": "https://www.allrecipes.com/recipe/47015/quick-and-easy-pancit/",
      "name": "Quick and Easy Pancit",
      "rating": "4.3",
      "ratingcount": "492",
      "ingredients": "1 (12 ounce) package dried rice noodles; 1 teaspoon vegetable oil; 1  onion, finely diced; 3 cloves garlic, minced; 2 cups diced cooked chicken breast meat; 1 small head cabbage, thinly sliced; 4  carrot, thinly sliced; ¼ cup soy sauce; 2  lemons - cut into wedges, for garnish",
      "directions": "1. Place rice noodles in a large bowl; cover with warm water and let soften for 8 to 10 minutes. Drain and set aside. 2. Meanwhile, heat oil in a wok or large skillet over medium-low heat. Add onion and garlic; cook and stir until onion is tender, about 3 to 5 minutes. Stir in chicken, cabbage, carrots, and soy sauce. Cook until cabbage begins to soften. Toss in noodles and cook, stirring constantly, until heated through. 3. Transfer pancit to a serving dish and garnish with lemon wedges.",
      "prep": "15 mins",
      "cook": "15 mins",
      "total": "30 mins",
      "calories": "369"
    },
    {
      "url": "https://www.allrecipes.com/recipe/9889/seven-layer-bars/",
      "name": "Seven Layer Bars",
      "rating": "4.7",
      "ratingcount": "664",
      "ingredients": "½ cup unsalted butter; 1 ½ cups graham cracker crumbs; 1 cup semisweet chocolate chips; 1 cup butterscotch chips; 1 cup chopped walnuts; 1 (14 ounce) can sweetened condensed milk; 1 ⅓ cups shredded coconut",
      "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Put butter in 13x9-inch baking pan and place in oven until melted. Swirl to coat bottom and sides with butter. 3. Spread graham cracker crumbs evenly over bottom of pan. Layer chocolate chips, butterscotch chips, and walnuts over crumbs. Pour condensed milk over walnuts and sprinkle with coconut. 4. Bake in preheated oven until edges are golden brown, about 25 minutes. 5. Cool and cut into 36 bars.",
      "prep": "15 mins",
      "cook": "25 mins",
      "total": "1 hr",
      "calories": "155"
    },
    {
      "url": "https://www.allrecipes.com/recipe/11991/egg-noodles/",
      "name": "Easy Egg Noodles",
      "rating": "4.7",
      "ratingcount": "957",
      "ingredients": "2 ½ cups all-purpose flour; 1 pinch salt; 2  eggs, beaten; ½ cup milk; 1 tablespoon butter",
      "directions": "1. Stir flour and salt together in a large bowl. Add eggs, milk, and butter. 2. Knead dough until smooth, about 5 minutes. Let rest in a covered bowl for 10 minutes. 3. On a floured surface, roll dough out to a thickness of 1/8 to 1/4 inch. Cut into desired lengths and shapes. 4. Allow to air-dry before cooking, 10 to 15 minutes. 5. Cook noodles in a large pot of salted boiling water until al dente, about 5 minutes.",
      "prep": "15 mins",
      "cook": "5 mins",
      "total": "40 mins",
      "calories": "206"
    },
    {
      "url": "https://www.allrecipes.com/recipe/217155/dry-onion-soup-mix/",
      "name": "Dry Onion Soup Mix",
      "rating": "4.8",
      "ratingcount": "218",
      "ingredients": "¼ cup dried onion flakes; 2 tablespoons low-sodium beef bouillon granules; ¼ teaspoon onion powder; ¼ teaspoon parsley flakes; ⅛ teaspoon celery seed; ⅛ teaspoon paprika; ⅛ teaspoon ground black pepper",
      "directions": "1. Stir onion flakes, beef bouillon granules, onion powder, parsley flakes, celery seed, paprika, and black pepper together in a bowl. 2. Use as a substitute for a 1-ounce envelope of dry onion soup mix.",
      "prep": "5 mins",
      "cook": "",
      "total": "5 mins",
      "calories": "34"
    },
    {
      "url": "https://www.allrecipes.com/recipe/282261/baked-apple-cider-donuts/",
      "name": "Baked Apple Cider Donuts",
      "rating": "4.5",
      "ratingcount": "38",
      "ingredients": "2 cups fresh apple cider; 2 cups all-purpose flour; ¾ teaspoon baking powder; ¾ teaspoon baking soda; ¼ teaspoon fine salt; 1 teaspoon ground cinnamon; 1 pinch ground cardamom; 1 pinch freshly grated nutmeg; ½ cup white sugar; ½ cup packed brown sugar; ½ cup warm milk; 6 tablespoons unsalted butter, melted, divided; ¾ teaspoon vanilla extract; 1 large egg; 1 cup white sugar, or as needed; 1 tablespoon ground cinnamon, or as needed",
      "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Butter two 6-cup donut pans. 2. Pour apple cider into a saucepan and place over medium heat. Bring to a simmer and let it cook, watching carefully, until the cider is reduced to 1/2 cup. If it reduces too much, add enough water to make 1/2 cup. Set aside until needed. 3. Add flour, baking powder, baking soda, salt, 1 teaspoon cinnamon, cardamom, and nutmeg to a large bowl. Mix with a whisk until combined and set aside until needed. 4. Whisk 1/2 cup white sugar, brown sugar, milk, 2 tablespoons melted butter, vanilla extract, and egg together in another bowl until combined. Add the apple cider reduction and the dry ingredients. Whisk together to form a slightly thick batter; do not overmix. 5. Spoon or pipe the batter into the prepared donut pans, filling them about 3/4 of the way up. 6. Bake in the center of the preheated oven until the tops are lightly browned, and the donuts spring back slightly to the touch, 10 to 12 minutes. Let cool for 10 minutes in the pans before removing to a sheet pan lined with a silicone baking mat. Cut out any donut holes as necessary. 7. If desired, while still slightly warm, brush the donuts lightly with remaining melted butter. 8. Mix 1 cup white sugar and 1 tablespoon cinnamon together for the topping in a shallow dish; toss in donuts to coat. Let cool completely before serving.",
      "prep": "15 mins",
      "cook": "20 mins",
      "total": "45 mins",
      "calories": "295"
    },
    {
      "url": "https://www.allrecipes.com/recipe/46982/pesto-pasta-with-chicken/",
      "name": "Pesto Pasta with Chicken",
      "rating": "4.5",
      "ratingcount": "1",
      "ingredients": "1 (16 ounce) package bow tie pasta; 1 teaspoon olive oil; 2 cloves garlic, minced; 2  skinless, boneless chicken breasts, cut into bite-sized pieces; 1 pinch crushed red pepper flakes, or to taste; ½ cup pesto sauce; ⅓ cup oil-packed sun-dried tomatoes, drained and cut into strips",
      "directions": "1. Bring a large pot of lightly salted water to a boil. Add pasta and cook until al dente, 8 to 10 minutes; drain. 2. Heat oil in a large skillet over medium heat. Sauté garlic until tender, then stir in chicken and season with red pepper flakes. Cook until chicken is golden and cooked through. 3. Combine pasta, chicken, pesto, and sun-dried tomatoes in a large bowl; toss to coat evenly.",
      "prep": "10 mins",
      "cook": "20 mins",
      "total": "30 mins",
      "calories": "328"
    },
    {
      "url": "https://www.allrecipes.com/recipe/17991/stuffed-green-peppers-i/",
      "name": "Stuffed Green Peppers",
      "rating": "4.5",
      "ratingcount": "3",
      "ingredients": "6  green bell peppers; salt to taste; 1 pound ground beef; ⅓ cup chopped onion; salt and pepper to taste; 1 (14.5 ounce) can whole peeled tomatoes, chopped; ½ cup water; ½ cup uncooked rice; 1 teaspoon Worcestershire sauce; 1 cup shredded Cheddar cheese; 2 (10.75 ounce) cans  condensed tomato soup; water as needed",
      "directions": "1. Bring a large pot of salted water to a boil. Cut the tops off bell peppers and remove the seeds. Cook bell peppers in boiling water for 5 minutes; drain. Sprinkle salt inside each bell pepper and set aside. 2. Place ground beef and onion in a large skillet over medium heat; cook and stir until beef is browned, about 5 minutes. Drain off excess fat and season with salt and pepper. Stir in tomatoes, 1/2 cup water, rice, and Worcestershire sauce; reduce heat to low, cover, and simmer until rice is tender, about 15 minutes. Remove from heat and stir in cheese. 3. Preheat the oven to 350 degrees F (175 degrees C). 4. Stuff each bell pepper with beef and rice mixture; arrange open-side up in a baking dish. 5. Combine tomato soup with just enough water in a medium bowl to make the soup a gravy consistency; pour over the bell peppers and cover with aluminum foil. 6. Bake in the preheated oven until heated through and cheese is melted and bubbly, about 25 to 30 minutes.",
      "prep": "30 mins",
      "cook": "30 mins",
      "total": "1 hr",
      "calories": "463"
    },
    {
      "url": "https://www.allrecipes.com/recipe/141949/doggie-birthday-cake/",
      "name": "Doggie Birthday Cake",
      "rating": "4.8",
      "ratingcount": "589",
      "ingredients": "1  egg; ⅓ cup honey (Optional); ¼ cup peanut butter; ¼ cup cooking oil; 1 teaspoon vanilla extract; 1 cup shredded carrots; 1 cup whole wheat or white flour; 1 teaspoon baking soda",
      "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 6-cup ring mold or fluted tube pan. 2. Combine egg, honey, peanut butter, oil, and vanilla in a large bowl; blend well. Stir in carrots until well-combined. Sift together flour and baking soda and fold into carrot mixture. Spoon cake batter into the prepared pan. 3. Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 40 minutes. Let cake cool in the pan for 10 minutes, then turn out onto a wire rack to cool completely.",
      "prep": "15 mins",
      "cook": "40 mins",
      "total": "1 hr 5 mins",
      "calories": ""
    },
    {
      "url": "https://www.allrecipes.com/recipe/9965/mexican-wedding-cakes-ii/",
      "name": "Mexican Wedding Cakes",
      "rating": "4.6",
      "ratingcount": "300",
      "ingredients": "1 cup unsalted butter, softened; ½ teaspoon vanilla extract; 2 cups all-purpose flour; 1/2 cup confectioners' sugar, plus more for finishing; 2 cups finely chopped walnuts",
      "directions": "1. Preheat the oven to 350 degrees F (180 degrees C). Line baking sheets with parchment paper. 2. Cream butter with an electric mixer in a large bowl. Mix in vanilla, then gradually mix in flour and confectioners' sugar until incorporated. Mix in walnuts. Roll dough into small balls and place onto the prepared baking sheets. 3. Bake in the preheated oven for 10-12 minutes. Remove from the oven and let cool completely, 20 to 30 minutes. 4. Roll cooled cookies in additional confectioners' sugar.",
      "prep": "25 mins",
      "cook": "10 mins",
      "total": "55 mins",
      "calories": "67"
    },
    {
      "url": "https://www.allrecipes.com/recipe/56803/very-chocolate-ice-cream/",
      "name": "Very Chocolate Ice Cream",
      "rating": "4.8",
      "ratingcount": "647",
      "ingredients": "1 cup milk; ¾ cup sugar; 2 tablespoons unsweetened cocoa powder; ¼ teaspoon salt; 3  egg yolk, lightly beaten; 2 ounces semisweet chocolate, chopped; 2 cups heavy cream; 1 teaspoon vanilla extract",
      "directions": "1. Combine milk, sugar, cocoa powder, and salt in a saucepan over medium heat. Bring to a simmer, stirring constantly. 2. Place egg yolks into a small bowl. Gradually whisk in about 1/2 cup of hot milk mixture, then return to the saucepan. Heat and stir until thickened, but do not boil. 3. Remove from the heat and stir in chopped chocolate until melted. 4. Pour into a chilled bowl and refrigerate, stirring occasionally, until cold, about 2 hours. 5. Stir in cream and vanilla. Pour into an ice cream maker and freeze according to manufacturer's directions.",
      "prep": "10 mins",
      "cook": "10 mins",
      "total": "4 hrs 20 mins",
      "calories": "353"
    },
    {
      "url": "https://www.allrecipes.com/recipe/151593/campbells-tuna-noodle-casserole/",
      "name": "Campbell's Tuna Noodle Casserole",
      "rating": "4.4",
      "ratingcount": "509",
      "ingredients": "4 cups hot cooked medium egg noodles; 2 (10.5 ounce) cans Campbell's® Condensed Cream of Mushroom Soup (regular or 25% Lower Sodium); 2 (10 ounce) cans tuna, drained; 2 cups frozen peas; 1 cup milk; 2 tablespoons dry bread crumbs; 1 tablespoon butter, melted",
      "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Stir cooked noodles, condensed soup, tuna, peas, and milk in a 3-quart casserole. 3. Bake in the preheated oven until hot, about 30 minutes; stir well. 4. Mix bread crumbs with melted butter in a bowl; sprinkle over tuna casserole and continue to bake until bread crumbs are golden brown and crispy, 5 minutes more.",
      "prep": "10 mins",
      "cook": "35 mins",
      "total": "45 mins",
      "calories": ""
    },
    {
      "url": "https://www.allrecipes.com/recipe/12801/rockin-oysters-rockefeller/",
      "name": "Rockin' Oysters Rockefeller",
      "rating": "4.8",
      "ratingcount": "166",
      "ingredients": "48  fresh, unopened oysters; 1 ½ cups beer; 2 cloves garlic; 7  black peppercorns; seasoned salt to taste; ½ cup butter; 1  onion, chopped; 1 clove garlic, crushed; 1 (10 ounce) package frozen chopped spinach, thawed and drained; 8 ounces Monterey Jack cheese, shredded; 8 ounces fontina cheese, shredded; 8 ounces mozzarella cheese, shredded; ½ cup milk; 2 teaspoons salt, or to taste; 1 teaspoon ground black pepper; 2 tablespoons fine bread crumbs",
      "directions": "1. Clean oysters, and place them in a large stockpot. Pour in beer and enough water to cover oysters; add 2 cloves of garlic, peppercorns, and seasoned salt. Bring to a boil. Remove from heat, drain, and cool. 2. Preheat the oven to 425 degrees F (220 degrees C.) 3. Once oysters are cooled, break off and discard the top shell. Arrange oysters on a baking sheet. 4. Melt butter in a saucepan over medium heat. Cook onion and garlic in butter until soft. Reduce heat to low; stir in spinach, Monterey Jack, fontina, and mozzarella. Cook until cheese melts, stirring frequently. Stir in milk; season with salt and pepper. Spoon sauce over each oyster, just filling the shell. Sprinkle with bread crumbs. 5. Bake in the preheated oven until golden and bubbly, approximately 8 to 10 minutes.",
      "prep": "30 mins",
      "cook": "30 mins",
      "total": "1 hr",
      "calories": "248"
    },
    {
      "url": "https://www.allrecipes.com/recipe/71111/down-home-chitterlings/",
      "name": "Down Home Chitterlings",
      "rating": "4.6",
      "ratingcount": "57",
      "ingredients": "10 pounds frozen chitterlings, thawed and cleaned; 1  onion, roughly chopped; 2 teaspoons salt; 1 teaspoon minced garlic; 1 teaspoon crushed red pepper flakes",
      "directions": "1. Place cleaned chitterlings in a 6-quart pot and cover with cold water. Bring to a rolling boil; add onion and season with salt, garlic, and red pepper flakes. Simmer until chitterlings are clear to white in color and reach desired tenderness, 3 to 4 hours.",
      "prep": "1 hr",
      "cook": "3 hrs",
      "total": "4 hrs",
      "calories": "312"
    },
    {
      "url": "https://www.allrecipes.com/recipe/240641/salt-dough/",
      "name": "Salt Dough",
      "rating": "4.5",
      "ratingcount": "42",
      "ingredients": "2 cups all-purpose flour; 1 cup salt; 1 cup cold water",
      "directions": "1. Preheat the oven to 250 degrees F (120 degrees C). Line a baking sheet. 2. Combine flour and salt in a bowl. Add water, a few tablespoons at a time, mixing well after each addition. Knead dough for 10 minutes. Wrap and let rest for 20 minutes. 3. Transfer dough to a floured work surface and knead until soft and pliable. Roll out to a thickness of 1/8 inch; cut desired festive shapes with cookie cutters. Transfer onto the prepared baking sheet; use a toothpick to make a hole in each ornament for hanging. 4. Bake in the preheated oven until dry and hard, about 2 hours. Allow to cool completely before decorating.",
      "prep": "20 mins",
      "cook": "2 hrs",
      "total": "2 hrs 40 mins",
      "calories": ""
    },
    {
      "url": "https://www.allrecipes.com/recipe/219164/the-best-parmesan-chicken-bake/",
      "name": "The Best Parmesan Chicken Bake",
      "rating": "4.4",
      "ratingcount": "2",
      "ingredients": "2 tablespoons olive oil; 2 cloves garlic, crushed and finely chopped; ¼ teaspoon crushed red pepper flakes, or to taste; 6  skinless, boneless chicken breast halves; 2 cups prepared marinara sauce; ¼ cup chopped fresh basil; 1 (8 ounce) package shredded mozzarella cheese, divided; ½ cup grated Parmesan cheese, divided; 1 (5 ounce) package garlic croutons",
      "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Coat the bottom of a 9x13-inch casserole dish with olive oil, and sprinkle with garlic and red pepper flakes. 3. Arrange chicken breasts in the bottom of the dish. 4. Pour marinara sauce over chicken. Sprinkle basil over marinara sauce, and top with 1/2 of the mozzarella cheese, followed by 1/2 of the Parmesan cheese, and croutons. 5. Top with remaining mozzarella cheese and remaining Parmesan cheese. 6. Bake in the preheated oven until cheese and croutons are golden brown and the chicken is no longer pink inside, about 35 minutes to an hour, depending on the shape and thickness of your chicken breasts. An instant-read thermometer inserted into the thickest part of a chicken breast should read at least 160 degrees F (70 degrees C). 7. Serve hot and enjoy!",
      "prep": "15 mins",
      "cook": "35 mins",
      "total": "50 mins",
      "calories": "477"
    },
    {
      "url": "https://www.allrecipes.com/recipe/81904/parmesan-crusted-chicken/",
      "name": "Parmesan Crusted Chicken",
      "rating": "4.8",
      "ratingcount": "8",
      "ingredients": "3 pounds chicken breasts; 1 (12 fluid ounce) bottle Lawry's Herb & Garlic Marinade with Lemon Juice; 1 ½ cups Parmesan cheese, grated; ½ teaspoon garlic powder; 1 teaspoon paprika; 1 teaspoon dried oregano",
      "directions": "1. Thoroughly rinse chicken and pat dry with a paper towel. You can remove the skin if you like. 2. Deeply pierce each piece of chicken 5 or 6 times with a knife or fork. In a large re-sealable plastic bag, combine chicken parts and the Marinade. Try to eliminate most of the air as you seal the bag. Gently shake to make sure all pieces are coated. Marinate in refrigerator for at least 30 minutes (or overnight). 3. Preheat oven to 350 degrees F. Prepare a baking rack; oil or use a vegetable spray. 4. Pour the Parmesan cheese onto a plate. Mix in the garlic powder, paprika and oregano. 5. Remove chicken from marinade, discarding used marinade. Shake off excess liquid. Roll chicken onto the cheese to coat. Arrange the chicken on rack in a roasting pan. Bake in preheated 350 degrees F oven until meat is no longer pink and juices run clear. This will be about 40 to 45 minutes (approx. 180 degrees F).",
      "prep": "",
      "cook": "",
      "total": "",
      "calories": "602"
    },
    {
      "url": "https://www.allrecipes.com/recipe/240708/broccoli-and-chicken-stir-fry/",
      "name": "Broccoli and Chicken Stir-Fry",
      "rating": "4.3",
      "ratingcount": "733",
      "ingredients": "⅔ cup soy sauce; ¼ cup brown sugar; ½ teaspoon ground ginger; 1 pinch red pepper flakes, or to taste; 2 tablespoons water; 2 tablespoons cornstarch; 2 teaspoons vegetable oil, or to taste; 3  skinless, boneless chicken breast halves, cut into chunks; 1  onion, sliced; 3 cups broccoli florets",
      "directions": "1. Gather all ingredients. 2. Stir soy sauce, brown sugar, ginger, and red pepper flakes together in a bowl until sugar dissolves. Mix water and cornstarch together in a small bowl; stir with a whisk until cornstarch dissolves completely. 3. Heat oil in a large skillet over high heat. Fry chicken and onion in hot oil until chicken is no longer pink in the center and onion is tender, 5 to 7 minutes. 4. Stir in broccoli with chicken and onion; sauté until broccoli is hot, about 5 minutes. 5. Push chicken and vegetable mixture to the side of the skillet. Pour soy sauce mixture into the vacant part of the skillet. Stir cornstarch slurry into soy sauce mixture until the color is consistent. 6. Move chicken and vegetables back into the center of the pan; sauté until sauce thickens and coats chicken and vegetables, about 5 minutes more.",
      "prep": "15 mins",
      "cook": "20 mins",
      "total": "35 mins",
      "calories": "356"
    },
    {
      "url": "https://www.allrecipes.com/recipe/240522/easy-rib-eye-roast/",
      "name": "Easy Rib Eye Roast",
      "rating": "4.8",
      "ratingcount": "198",
      "ingredients": "1 cup softened butter; 6 cloves garlic, minced; 1 (4 pound) bone-in rib-eye roast; sea salt and cracked black pepper to taste",
      "directions": "1. Preheat the oven to 500 degrees F (260 degrees C). 2. Beat butter and garlic together in a bowl. 3. Poke several holes in rib eye with a sharp knife. Rub butter mixture all over meat and season with salt and pepper. Place rib eye fat-side up in a roasting pan. 4. Roast in the preheated oven for 20 minutes. 5. Reduce heat to 325 degrees F (165 degrees C) and continue cooking until rib eye is reddish-pink and juicy in the center, 1 1/2 to 2 hours. An instant-read thermometer inserted into the center will read 145 degrees F (63 degrees C) for medium.",
      "prep": "10 mins",
      "cook": "1 hr 30 mins",
      "total": "1 hr 40 mins",
      "calories": "472"
    },
    {
      "url": "https://www.allrecipes.com/recipe/12963/greek-lemon-chicken-soup/",
      "name": "Greek Lemon Chicken Soup",
      "rating": "4.5",
      "ratingcount": "603",
      "ingredients": "8 cups chicken broth; ½ cup fresh lemon juice; ½ cup shredded carrots; ½ cup finely chopped onion; ½ cup finely chopped celery; 6 tablespoons chicken soup base; ¼ teaspoon ground white pepper; ¼ cup margarine; ¼ cup all-purpose flour; 8  egg yolks; 1 cup cooked white rice; 1 cup diced, cooked chicken meat; 16 slices  lemon",
      "directions": "1. Combine chicken broth, lemon juice, carrots, onions, celery, soup base, and white pepper in a large pot. Bring to a boil over high heat, then reduce heat and simmer for 15 to 20 minutes, or until the vegetables are tender. 2. Blend margarine and flour in a small bowl; gradually stir into soup mixture. Simmer, stirring frequently, for 8 to 10 minutes. 3. Meanwhile, beat egg yolks in a bowl until light in color. Gradually whisk in some hot soup, using a ladle to pour in a thin stream while whisking the egg yolks vigorously. Add egg mixture to the pot in same manner, and heat through. 4. Add rice and chicken; cook until warmed through. Ladle hot soup into bowls and garnish with lemon slices.",
      "prep": "20 mins",
      "cook": "30 mins",
      "total": "50 mins",
      "calories": "124"
    },
    {
      "url": "https://www.allrecipes.com/recipe/230999/sweet-jalapeno-cornbread/",
      "name": "Sweet Jalapeño Cornbread",
      "rating": "4.7",
      "ratingcount": "151",
      "ingredients": "⅔ cup margarine, softened; ⅔ cup white sugar; 2 cups cornmeal; 1 ⅓ cups all-purpose flour; 4 ½ teaspoons baking powder; 1 teaspoon salt; 3  large eggs; 1 ⅔ cups milk; 1 cup chopped fresh jalapeno peppers, or to taste",
      "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking pan. 2. Beat margarine and sugar together in a large bowl until smooth. 3. Combine cornmeal, flour, baking powder, and salt in another bowl. Gently stir eggs and milk together in a third bowl. Pour 1/3 of the milk mixture and 1/3 of the flour mixture alternately into margarine mixture; whisk until just mixed. Repeat with remaining flour and milk mixtures; stir in jalapeño peppers. Spread mixture evenly into the prepared baking pan. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 22 to 26 minutes. Cool in the pan for 10 minutes before slicing.",
      "prep": "15 mins",
      "cook": "25 mins",
      "total": "50 mins",
      "calories": "294"
    },
    {
      "url": "https://www.allrecipes.com/recipe/18990/banana-pudding-i/",
      "name": "Homemade Banana Pudding",
      "rating": "4.4",
      "ratingcount": "366",
      "ingredients": "⅔ cup white sugar; ⅓ cup all-purpose flour; ¼ teaspoon salt; 3  eggs, beaten; 2 cups milk; 2 tablespoons butter, softened; ½ teaspoon vanilla extract; 2  bananas, peeled and sliced; ½ (12 ounce) package vanilla wafer cookies",
      "directions": "1. Combine sugar, flour, and salt together in a medium saucepan. Add eggs and stir well. Stir in milk, and cook over low heat, stirring constantly. 2. When the mixture has thickened enough to coat the back of a metal spoon, remove from heat and continue to stir, cooling slightly. Stir in butter and vanilla until smooth. 3. Layer pudding with bananas and vanilla wafers in a serving dish. Chill at least 1 hour in the refrigerator before serving.",
      "prep": "10 mins",
      "cook": "20 mins",
      "total": "1 hr 30 mins",
      "calories": "666"
    },
    {
      "url": "https://www.allrecipes.com/recipe/13804/pumpkin-crumb-cake/",
      "name": "Pumpkin Crumb Cake",
      "rating": "4.7",
      "ratingcount": "576",
      "ingredients": "1 (15.25 ounce) package yellow cake mix, divided; 1 large egg, beaten; ½ cup unsalted butter, melted; 1 (15 ounce) can pumpkin puree; ½ cup white sugar; ¼ cup packed brown sugar; 3 large eggs, beaten; 1 ½ teaspoons ground cinnamon; ½ cup white sugar; 3 tablespoons unsalted butter, softened; ½ cup chopped walnuts (Optional)",
      "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan. 2. Make crust: Measure 1 cup cake mix into a medium bowl; set aside for topping. Combine remaining cake mix, melted butter, and egg in a large bowl; mix until well combined. Pat mixture into the bottom of the prepared pan. 3. Make pumpkin layer: Mix pumpkin puree, white sugar, brown sugar, eggs, and cinnamon in a large bowl until well combined. Pour over crust. 4. Make topping: Add sugar and softened butter to the reserved cake mix and stir until crumbly. Sprinkle topping over pumpkin layer, then scatter walnuts over top. 5. Bake in the preheated oven until a toothpick inserted in the center comes out clean, 40 to 45 minutes.",
      "prep": "15 mins",
      "cook": "40 mins",
      "total": "55 mins",
      "calories": "287"
    },
    {
      "url": "https://www.allrecipes.com/recipe/42890/turkey-a-la-king/",
      "name": "Turkey à la King",
      "rating": "4.4",
      "ratingcount": "258",
      "ingredients": "2 tablespoons butter; 3  fresh mushrooms, sliced; 1 tablespoon all-purpose flour; 1 cup chicken broth; 1 cup chopped cooked turkey; ½ cup heavy cream; ⅓ cup frozen peas, thawed; salt and pepper to taste",
      "directions": "1. Cook and stir butter in a large skillet over medium-low heat until golden brown. 2. Add mushrooms to the skillet and cook in browned butter, stirring occasionally, until tender. Stir in flour until smooth. Slowly whisk in chicken broth; cook until slightly thickened. 3. Stir in turkey, cream, and peas. Reduce heat to low; cook until thickened. Season with salt and pepper.",
      "prep": "10 mins",
      "cook": "15 mins",
      "total": "25 mins",
      "calories": "233"
    },
    {
      "url": "https://www.allrecipes.com/recipe/16409/spinach-and-strawberry-salad/",
      "name": "Spinach and Strawberry Salad",
      "rating": "4.8",
      "ratingcount": "1",
      "ingredients": "2 bunches spinach, rinsed and torn into bite-size pieces; 4 cups sliced strawberries; ½ cup vegetable oil; ½ cup white sugar; ¼ cup white wine vinegar; 2 tablespoons sesame seeds; 1 tablespoon poppy seeds; ¼ teaspoon paprika",
      "directions": "1. Toss together spinach and strawberries in a large bowl. 2. Whisk oil, sugar, vinegar, sesame seeds, poppy seeds, and paprika together in a medium bowl. Pour over the spinach and strawberries, and toss to coat.",
      "prep": "10 mins",
      "cook": "",
      "total": "10 mins",
      "calories": "235"
    },
    {
      "url": "https://www.allrecipes.com/recipe/260883/caramel-cake/",
      "name": "Caramel Cake",
      "rating": "4.6",
      "ratingcount": "89",
      "ingredients": "3 cups white sugar; 1 ½ cups butter; 5 large eggs; 3 ½ cups all-purpose flour; ½ teaspoon baking powder; ¼ teaspoon salt; 1 ¼ cups whole milk; 1 teaspoon vanilla extract; 1 (16 ounce) package brown sugar; 1 cup butter; ¼ teaspoon salt; ⅔ cup evaporated milk; 1 (16 ounce) package confectioners' sugar, sifted; 2 teaspoons pure vanilla extract",
      "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch cake pans. 2. Make cake: Place white sugar and butter into a mixing bowl. Beat with an electric mixer on medium speed until light and fluffy. Add eggs, one at a time, mixing well after each addition. 3. Combine flour, baking powder, and salt in a separate bowl. Add flour mixture in batches, alternating with milk, beating batter briefly after each addition. Add vanilla extract; beat until batter makes ribbons when falling from the beaters. Divide batter among the prepared cake pans. 4. Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 30 minutes. Cool on a wire rack for 5 minutes. Run a table knife around the edges to loosen. Invert carefully onto a cooling rack. Let cool, about 30 minutes. 5. Make icing: Combine brown sugar, butter, and salt in a saucepan over medium heat. Stir until brown sugar is dissolved, about 3 minutes. Add evaporated milk and continue stirring. Bring to a gentle boil and let bubble for about 4 minutes, stirring constantly to avoid sticking. Remove from heat and allow to cool, about 5 minutes. 6. Mix confectioners' sugar and vanilla extract into brown sugar mixture using an electric mixer until icing caramelizes and thickens to the desired consistency. 7. Spread icing onto cooled cake layers. Stack layers; ice top and sides.",
      "prep": "40 mins",
      "cook": "40 mins",
      "total": "2 hrs 25 mins",
      "calories": "1019"
    },
    {
      "url": "https://www.allrecipes.com/recipe/25080/mmmmm-brownies/",
      "name": "MMMMM... Brownies",
      "rating": "4.6",
      "ratingcount": "2",
      "ingredients": "½ cup white sugar; 2 tablespoons butter; 2 tablespoons water; 1 ½ cups semisweet chocolate chips; 2 large eggs, beaten; ½ teaspoon vanilla extract; ⅔ cup all-purpose flour; ½ teaspoon salt; ¼ teaspoon baking soda",
      "directions": "1. Gather all ingredients. 2. Preheat the oven to 325 degrees F (165 degrees C). Grease an 8-inch square pan. 3. Combine sugar, butter, and water in a medium saucepan; cook and stir over medium heat until boiling. Remove from heat and stir in chocolate chips until melted and smooth; mix in eggs and vanilla. Combine flour, salt, and baking soda; stir into the chocolate mixture. Spread brownie batter evenly into the prepared pan. 4. Bake in the preheated oven until top is dry and edges have started to pull away from the sides of the pan, about 20 to 30 minutes. 5. Let cool completely before cutting into squares.",
      "prep": "25 mins",
      "cook": "25 mins",
      "total": "1 hr",
      "calories": "141"
    },
    {
      "url": "https://www.allrecipes.com/recipe/239712/blueberry-simple-syrup/",
      "name": "Blueberry Simple Syrup",
      "rating": "4.4",
      "ratingcount": "110",
      "ingredients": "1 cup blueberries; 1 cup warm water; 1 cup white sugar; 1 teaspoon lemon juice",
      "directions": "1. Mix blueberries, water, and sugar together using a whisk in a small saucepan over low heat until sugar is dissolved, about 5 minutes. Increase heat to medium and bring a gentle boil, stirring often, until syrup is thickened, about 15 minutes. 2. Whisk lemon juice into syrup; serve immediately or cool.",
      "prep": "15 mins",
      "cook": "20 mins",
      "total": "35 mins",
      "calories": "72"
    },
    {
      "url": "https://www.allrecipes.com/recipe/7506/caramel-frosting-i/",
      "name": "Caramel Frosting",
      "rating": "4.5",
      "ratingcount": "322",
      "ingredients": "2 tablespoons butter; ½ cup packed brown sugar; 3 tablespoons milk, or more as needed; 1 cup confectioners' sugar; ½ teaspoon vanilla extract",
      "directions": "1. Melt butter in a saucepan over medium heat. Stir in brown sugar and 3 tablespoons milk. Boil vigorously for 1 minute. 2. Remove from heat and stir in 1/2 cup confectioners' sugar. Cool slightly, then beat in vanilla and remaining 1/2 cup confectioners' sugar. Add more milk if mixture is too thick.",
      "prep": "10 mins",
      "cook": "5 mins",
      "total": "15 mins",
      "calories": "93"
    },
    {
      "url": "https://www.allrecipes.com/recipe/132703/chicken-with-lemon-caper-sauce/",
      "name": "Chicken with Lemon-Caper Sauce",
      "rating": "4.6",
      "ratingcount": "441",
      "ingredients": "½ cup all-purpose flour; 1 pinch salt; 2 (6 ounce) skinless, boneless chicken breast halves; 2 tablespoons olive oil; ¼ cup dry white wine; ¼ cup lemon juice; ¼ cup cold unsalted butter, cut into pieces; 2 tablespoons capers, drained; 2  lemon wedges",
      "directions": "1. Mix together flour and salt in a medium dish or resealable plastic bag. Coat chicken in flour mixture; shake off excess. 2. Heat olive oil in a skillet over medium-high heat. Cook chicken in hot oil until golden brown and cooked through, 3 to 4 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Transfer chicken to a plate; cover and keep warm. 3. Pour white wine into the skillet; allow to boil while scraping the cooked bits from the bottom of the pan. Add lemon juice; boil until reduced by half, 2 to 3 minutes. 4. Sprinkle cubed butter into boiling sauce. Swirl and shake the pan vigorously until butter is completely incorporated and sauce thickens. (Butter must never come to rest, or sauce will separate and become oily.) Remove from heat and stir in capers. 5. Pour lemon-caper sauce over chicken; serve with lemon wedges.",
      "prep": "10 mins",
      "cook": "20 mins",
      "total": "30 mins",
      "calories": "662"
    },
    {
      "url": "https://www.allrecipes.com/recipe/218772/mile-high-green-chili/",
      "name": "Mile High Green Chili",
      "rating": "4.6",
      "ratingcount": "109",
      "ingredients": "4  fresh tomatillos - husked, peeled, and halved; 3  Anaheim chile peppers - seeded and halved; 3  jalapeno peppers - seeded and halved lengthwise; 1 medium onion, halved; 1  green bell pepper, seeded and halved lengthwise; 2 tablespoons olive oil, divided; salt and ground black pepper to taste; 1 ½ pounds pork shoulder, cut into 1-inch chunks; ½ (12 fluid ounce) can or bottle lager-style beer; 2  tomatoes, chopped; 4 cloves garlic, chopped; 2 tablespoons chopped fresh oregano; 1 tablespoon chopped fresh parsley; 1 tablespoon ground cumin; 1 teaspoon chili powder; 1  beef bouillon cube; 4 ounces cream cheese at room temperature",
      "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Arrange the halved tomatillos, Anaheim chiles, jalapeños, onion, and bell pepper on a baking sheet. Drizzle vegetables with 1 tablespoon olive oil and sprinkle with salt. 3. Roast vegetables in the preheated oven until they begin to show brown spots, about 30 minutes. Allow to cool, then chop vegetables into bite-sized pieces. 4. Heat remaining 1 tablespoon olive oil in a large skillet over high heat. Add pork and fry until browned, seasoning with salt and black pepper as it cooks, about 12 minutes. Transfer pork to a slow cooker; stir in roasted vegetables. Mix in beer, tomatoes, garlic, oregano, parsley, cumin, chili powder, and bouillon. Cover and cook on Low until pork is tender, 4 to 6 hours. 5. About 1/2 hour before serving, place cream cheese into a bowl and stir in about 1 tablespoon of the chili liquid until thoroughly combined. Continue stirring in chili broth, a tablespoon at a time, until the cream cheese is almost a liquid. Stir cream cheese mixture back into the chili.",
      "prep": "30 mins",
      "cook": "4 hrs 30 mins",
      "total": "5 hrs",
      "calories": "174"
    },
    {
      "url": "https://www.allrecipes.com/recipe/155182/pfeffernusse-cookies/",
      "name": "Pfeffernusse Cookies",
      "rating": "4.7",
      "ratingcount": "235",
      "ingredients": "½ cup molasses; ¼ cup honey; ¼ cup shortening; ¼ cup margarine; 2 large eggs; 4 cups all-purpose flour; ¾ cup white sugar; ½ cup brown sugar; 2 teaspoons anise extract; 2 teaspoons ground cinnamon; 1 ½ teaspoons ground cardamom; 1 ½ teaspoons baking soda; 1 teaspoon ground cloves; 1 teaspoon ground nutmeg; 1 teaspoon ground ginger; 1 teaspoon ground black pepper; ½ teaspoon salt; 1 cup confectioners' sugar for dusting",
      "directions": "1. Place molasses, honey, shortening, and margarine in a saucepan over medium heat; cook and stir until creamy. 2. Remove from heat and allow to cool to room temperature. Beat in eggs. 3. Combine flour, white sugar, brown sugar, anise, cinnamon, cardamom, baking soda, cloves, nutmeg, ginger, black pepper, and salt in a large bowl. 4. Add molasses mixture; stir until thoroughly combined. Refrigerate dough until well chilled, about 2 hours. 5. Preheat the oven to 325 degrees F (165 degrees C). 6. Roll dough into acorn-sized balls and place 1 inch apart on baking sheets. 7. Bake in the preheated oven until firm to the touch with slight cracking, 10 to 15 minutes. Cool on the baking sheets briefly before removing them to a wire rack to cool completely. 8. Dust cooled cookies with confectioners' sugar. Store in an airtight container.",
      "prep": "15 mins",
      "cook": "15 mins",
      "total": "2 hrs 30 mins",
      "calories": "284"
    }
  ]