[{
  "url": "https://www.allrecipes.com/recipe/267040/opera-cake/",
  "name": "Opera Cake",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "6 large egg whites, at room temperature; 2 tablespoons white sugar; 2 cups almond flour; 2 cups confectioners' sugar, sifted; 4 large eggs; 2 large egg yolks; ½ cup all-purpose flour; ½ cup boiling water; ⅓ cup white sugar; 1 ½ tablespoons instant coffee powder; 2 tablespoons boiling water; 2 tablespoons instant coffee powder; 1 cup white sugar; ¼ cup water; ½ teaspoon vanilla extract; 1 large egg; 1 large egg yolk; 14 tablespoons unsalted butter, at room temperature; 8 ounces dark chocolate, finely chopped; ½ cup whole milk; ¼ cup heavy cream; 4 tablespoons unsalted butter, at room temperature",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Line 2 jelly roll pans with parchment paper. 2. Beat egg whites in a glass, metal, or ceramic bowl until soft peaks form. Slowly add white sugar and whip on high speed until whites are stiff and glossy. 3. Beat almond flour, confectioners' sugar, eggs, and egg yolks in a separate bowl for 3 minutes. Add flour and beat on low speed until combined. Gently fold egg whites into almond mixture until combined. Divide batter between the jelly roll pans; spread evenly. 4. Bake cake layers in the preheated oven until lightly browned, about 5 minutes. Invert onto cooling racks and peel off parchment paper; let cool. 5. Make coffee syrup while cake is cooling. Combine boiling water, sugar, and coffee powder in a small bowl; stir until dissolved. 6. Stir 2 tablespoons boiling water and coffee powder together for buttercream. Set aside. 7. Combine sugar, 1/4 cup water, and vanilla extract in a small saucepan. Bring to a boil. Cook, without stirring, until an instant-read thermometer inserted into mixture reaches 255 degrees F (124 degrees C). 8. Meanwhile, beat egg and egg yolk in a stand mixer on high speed until pale and foamy. Pour hot sugar syrup carefully down the side of the mixer bowl, mixing continuously until the bottom of the bowl feels cool to the touch. 9. Beat butter in a separate bowl until creamy. Add butter gradually to egg mixture, beating until frosting is fluffy. Add dissolved coffee mixture and beat until well incorporated. 10. Place dark chocolate in a heat-proof bowl. Bring milk and cream to a boil in a saucepan. Pour over chocolate; stir until melted and smooth. Whisk in butter until ganache looks smooth and creamy. Let cool. 11. Cut cooled cake layers in half crosswise. Place 1 piece on a rectangular serving plate. Sprinkle some coffee syrup on top. Add an even layer of buttercream. Repeat with a second cake layer: more coffee syrup and another layer of buttercream. Spread 1/2 of the ganache on top. Repeat with remaining cake layers: coffee syrup and buttercream. Top cake with remaining ganache.",
  "prep": "1 hr",
  "cook": "20 mins",
  "total": "1 hr 20 mins",
  "calories": "645"
},
{
  "url": "https://www.allrecipes.com/recipe/267521/cheddar-keto-biscuits/",
  "name": "Cheddar Keto Biscuits",
  "rating": "5.0",
  "ratingcount": "16",
  "ingredients": "1 ½ cups shredded mozzarella cheese; ½ (8 ounce) package cream cheese, softened; ⅔ cup almond flour; 2  large eggs; 4 teaspoons baking powder; ½ teaspoon garlic powder; 1 cup shredded Cheddar cheese; 1 teaspoon butter, or as needed",
  "directions": "1. Combine mozzarella cheese and cream cheese in a large microwave-safe bowl. Heat in the microwave on high power until slightly melted, about 45 seconds. Remove from microwave and stir. Repeat, heating for about 20 seconds more. Remove from microwave again and stir; consistency should be very sticky and cheese should be completely melted. Return to microwave, if necessary, until all cheese is melted. 2. Mix almond flour, eggs, baking powder, and garlic powder together in a bowl. Add mixture to the large bowl with melted cheese and mix well. Add Cheddar cheese and stir into the dough. 3. Lay a sheet of plastic wrap on a flat surface and dust lightly with almond flour. Pour dough onto the middle of the plastic wrap and roll up to form a ball. Place in the refrigerator until slightly hardened, 20 to 30 minutes. 4. Preheat the oven to 425 degrees F (220 degrees C). Grease a dark baking sheet with butter. 5. Remove dough from the refrigerator and cut into 8 equal-sized pieces. Roll each into a ball and place on the prepared baking sheet, spacing equally and avoiding the sides, as biscuits will spread while cooking. 6. Bake in the preheated oven until golden brown, checking at 10 minutes. Remove from oven immediately and cool completely before serving, about 15 minutes.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "1 hr 5 mins",
  "calories": "244"
},
{
  "url": "https://www.allrecipes.com/recipe/277315/keto-air-fryer-salmon-cakes-with-sriracha-mayo/",
  "name": "Keto Air Fryer Salmon Cakes with Sriracha Mayo",
  "rating": "4.7",
  "ratingcount": "10",
  "ingredients": "¼ cup mayonnaise; 1 tablespoon Sriracha; 1 pound skinless salmon fillets, cut into 1-inch pieces; ⅓ cup almond flour; 1 large egg, lightly beaten; 1  green onion, coarsely chopped; 1 ½ teaspoons seafood seasoning (such as Old Bay®); cooking spray; 1 pinch seafood seasoning (such as Old Bay®) (Optional)",
  "directions": "1. Make Sriracha mayo: Whisk together mayonnaise and Sriracha in a small bowl. Place 1 tablespoon Sriracha mayo in the bowl of a food processor and refrigerate the rest until ready to use. 2. Prepare salmon cakes: Add salmon, almond flour, egg, green onion, and 1 1/2 teaspoons seafood seasoning to Sriracha mayo in the bowl of a food processor; pulse quickly for 4 to 5 seconds until ingredients are just combined, but small chunks of salmon remain. (Do not overprocess as the mixture will become mushy.) 3. Line a plate with waxed paper and spray hands with cooking spray. Form salmon mixture into 8 small patties; transfer to the plate. Place in the refrigerator until chilled and firm, about 15 minutes. 4. Preheat the air fryer to 390 degrees F (200 degrees C). Spray the air fryer basket with cooking spray. 5. Remove salmon cakes from refrigerator. Mist both sides with cooking spray and gently place in the air fryer basket, working in batches if necessary to avoid overcrowding. 6. Cook in the preheated air fryer for 6 to 8 minutes. Place on a serving platter and serve with remaining Sriracha mayo and a light sprinkling of Old Bay seasoning.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "340"
},
{
  "url": "https://www.allrecipes.com/recipe/283627/chocolate-almond-breakfast-donuts/",
  "name": "Chocolate Almond Breakfast Donuts",
  "rating": "4.5",
  "ratingcount": "15",
  "ingredients": "nonstick vegetable oil cooking spray; 2 large eggs; 2 tablespoons vegetable oil; 3 tablespoons maple syrup; 1 ¼ cups finely ground almond flour; 1 ½ teaspoons baking powder; ½ teaspoon kosher salt; 2 tablespoons Dutch-process cocoa powder",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Generously spray or brush a nonstick donut pan with cooking spray; set aside until needed. 2. Place eggs, vegetable oil, and maple syrup into a mixing bowl and whisk thoroughly until the mixture is emulsified, light, and a little bit foamy, 3 to 4 minutes. Add almond flour, baking powder, salt, and cocoa powder; mix everything together thoroughly with a spatula until all the almond flour is incorporated and you've achieved a very thick batter. 3. Transfer batter into a pastry bag, or a plastic zip-top bag with one of the corners cut off. Pipe the batter evenly into the prepared donut pan. 4. Dip a finger in water and smooth the tops of the batter to even out. Tap the pan on a work surface a few times to settle the batter even more. 5. Bake in the center of the preheated oven until a wooden skewer inserted into a donut comes out clean, 9 to 10 minutes. Let cool in the pan for 10 minutes before inverting onto a wire cooling rack. Cool completely before serving.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "45 mins",
  "calories": "246"
},
{
  "url": "https://www.allrecipes.com/recipe/269522/oatmeal-banana-pancakes/",
  "name": "Oatmeal-Banana Pancakes",
  "rating": "3.5",
  "ratingcount": "6",
  "ingredients": "½ cup old-fashioned oatmeal; ¾ cup almond milk; ½ cup almond flour; 1  ripe banana; 2 tablespoons white sugar; 1 teaspoon vanilla extract; ½ teaspoon ground cinnamon; ½ teaspoon baking powder; ¼ teaspoon salt; cooking spray",
  "directions": "1. Place oats in a blender and blend into a fine powder. Add almond milk, almond flour, banana, sugar, vanilla extract, cinnamon, baking powder, and salt; blend until well mixed. Let batter sit until thickened, about 10 minutes. 2. Heat a skillet over medium-high heat and coat with cooking spray. Drop 1/4 cup batter onto the hot skillet and cook until bubbles form and edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "393"
},
{
  "url": "https://www.allrecipes.com/recipe/238012/banana-blueberry-almond-flour-muffins-gluten-free/",
  "name": "Banana Blueberry Almond Flour Muffins (Gluten-Free)",
  "rating": "4.4",
  "ratingcount": "64",
  "ingredients": "1 cup almond meal; ½ teaspoon ground flax seed (Optional); ½ teaspoon chia seeds (Optional); ¼ teaspoon baking soda; 2  eggs; 1 tablespoon honey; ½ teaspoon apple cider vinegar; ½  ripe banana; ¾ cup fresh blueberries",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line 4 muffin cups with paper liners. 2. Mix almond meal, flax seed, chia seeds, and baking soda together in a small bowl. Whisk eggs, honey, and apple cider vinegar together in a separate bowl. Stir almond meal mixture into egg mixture until batter is just mixed. Mash banana into batter and fold in blueberries. Scoop batter into the prepared muffin cups. 3. Bake in the preheated oven until slightly browned, about 15 minutes. Cool muffins in a pan for 30 minutes.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "1 hr",
  "calories": "199"
},
{
  "url": "https://www.allrecipes.com/recipe/255310/keto-low-carb-lemon-poppy-seed-muffins/",
  "name": "Keto Low-Carb Lemon Poppy Seed Muffins",
  "rating": "4.5",
  "ratingcount": "53",
  "ingredients": "⅓ cup low-calorie natural sweetener (such as Swerve®); ¼ cup almond flour; ¼ cup coconut flour; 1 tablespoon poppy seeds; 1  lemon, zested; ½ teaspoon baking powder; ½ teaspoon salt; ¼ teaspoon xanthan gum (Optional); 3 large eggs; 3 tablespoons butter; 2 tablespoons sour cream; ½ teaspoon vanilla extract; 2 tablespoons heavy whipping cream, or more to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a muffin tin or line with paper muffin liners. 2. Mix sweetener, almond flour, coconut flour, poppy seeds, lemon zest, baking powder, salt, and xanthan gum together in a bowl. 3. Beat eggs in a bowl with an electric mixer on high speed until fluffy, about 2 minutes. Beat in butter, sour cream, and vanilla. Add sweetener mixture. Stir in cream slowly until batter is thick and smooth. Pour into the prepared muffin tin. 4. Bake in the preheated oven until tops are golden, 15 to 20 minutes.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "116"
},
{
  "url": "https://www.allrecipes.com/recipe/256860/steel-cut-oats-and-quinoa-breakfast/",
  "name": "Steel-Cut Oats and Quinoa Breakfast",
  "rating": "5.0",
  "ratingcount": "13",
  "ingredients": "3 cups water; ½ cup quinoa; ½ cup steel-cut oats; 2 tablespoons almond meal; 2 tablespoons flaxseed meal; 1 tablespoon ground cinnamon",
  "directions": "1. Bring water to a boil in a saucepan; add quinoa and oats. Simmer, stirring frequently, until water is absorbed and quinoa is tender, 15 to 20 minutes. 2. Stir almond meal and flaxseed meal into oat-quinoa mixture; pour into a glass container and top with cinnamon. Let cool for about 15 minutes. Transfer to the refrigerator for storage.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "191"
},
{
  "url": "https://www.allrecipes.com/recipe/239755/perfect-paleo-pumpkin-bread/",
  "name": "Perfect Paleo Pumpkin Bread",
  "rating": "4.7",
  "ratingcount": "55",
  "ingredients": "1 ½ cups almond flour; ½ cup coconut flour; 5 teaspoons pumpkin pie spice; 1 ½ teaspoons baking soda; 1 ½ teaspoons baking powder; 1 teaspoon kosher salt; 1 (15 ounce) can pumpkin puree; 4  large eggs; ½ cup maple syrup; 5 tablespoons coconut oil, melted; 2 teaspoons pure vanilla extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a 9x5-inch loaf pan baking parchment. 2. Stir almond flour, coconut flour, pumpkin pie spice, baking soda, baking powder, and kosher salt together in a bowl with a whisk to mix. 3. Beat pumpkin puree, eggs, maple syrup, coconut oil, and vanilla extract together in a separate bowl until smooth; add to the flour mixture and gently stir just until the dry ingredients are moistened. Pour the batter into the prepared loaf pan. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 55 to 70 minutes. Cool in the pan 15 to 20 minutes before removing to cool completely on a wire rack.",
  "prep": "15 mins",
  "cook": "55 mins",
  "total": "1 hr 25 mins",
  "calories": "188"
},
{
  "url": "https://www.allrecipes.com/recipe/237292/gluten-free-donuts/",
  "name": "Gluten-Free Donuts",
  "rating": "4.4",
  "ratingcount": "16",
  "ingredients": "1 quart olive oil for frying, or as needed; 5 tablespoons coconut milk; ¼ cup gluten-free all-purpose baking flour; 1  egg; 2 tablespoons almond flour; 2 tablespoons coconut flour; 2 teaspoons honey; ¼ teaspoon guar gum; ½ cup confectioners' sugar (Optional)",
  "directions": "1. Heat oil in a deep fryer or in a large saucepan to 300 degrees F (150 degrees C). 2. Beat coconut milk, all-purpose flour, egg, almond flour, coconut flour, honey, and guar gum together in a bowl using a hand blender until batter resembles thick pancake batter. 3. Drop batter by rounded spoonfuls, working in batches, into the hot oil; fry until donuts are dark brown, 3 to 5 minutes. Remove donuts with a slotted spoon. Pour confectioners' sugar into a shallow bowl. Roll donuts in confectioners' sugar until coated.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "391"
},
{
  "url": "https://www.allrecipes.com/recipe/281841/almond-flour-lemon-muffins/",
  "name": "Almond Flour Lemon Muffins",
  "rating": "4.0",
  "ratingcount": "3",
  "ingredients": "3 cups almond flour; 3 teaspoons baking powder; ¼ teaspoon baking soda; ¾ cup white sugar; 2 large eggs; ½ cup plain fat-free Greek yogurt; ¼ cup unsalted butter, melted; 2 tablespoons freshly squeezed lemon juice; 1 tablespoon lemon zest; ½ cup almond flour; 3 tablespoons brown sugar; 2 tablespoons unsalted butter, melted; 1 cup powdered sugar; 1 tablespoon half-and-half; 1 tablespoon fresh lemon juice",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line 10 muffin cups with paper liners. 2. Sift almond flour, baking powder, and baking soda together into a bowl and set aside. 3. Mix sugar, eggs, Greek yogurt, butter, lemon juice, and lemon zest in a bowl with an electric mixer until smooth and creamy. Add flour mixture into the wet ingredients and mix until well combined, but be careful not to overmix. Distribute the batter evenly between the prepared muffin cups, filling the cups all the way to the top. 4. Make the topping by mixing almond flour, brown sugar, and butter together until crumbly. Set aside. 5. Bake muffins in the preheated oven for 15 minutes, then remove from the oven and sprinkle crumble mixture over the tops. Continue baking until the edges are golden and a toothpick inserted into the center of one of the muffins comes out clean, 3 to 5 minutes. Cool muffins in the pan on a wire rack for 5 minutes. 6. While the muffins are cooling, mix powdered sugar, half-and-half, and lemon juice together in a small bowl for the glaze. Remove the muffins from the pan and drizzle the glaze over the top.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "462"
},
{
  "url": "https://www.allrecipes.com/recipe/234702/quick-almond-flour-pancakes/",
  "name": "Quick Almond Flour Pancakes",
  "rating": "4.2",
  "ratingcount": "346",
  "ingredients": "1 cup almond flour; ¼ cup water; 2  eggs; 1 tablespoon maple syrup; ¼ teaspoon salt; 1 teaspoon oil, or as needed",
  "directions": "1. Whisk together almond flour, water, eggs, maple syrup, and salt in a large bowl until smooth. 2. Heat oil on a griddle over medium heat. 3. Drop batter by large spoonfuls onto the griddle. Cook until bubbles form and edges are dry, 3 to 5 minutes. Flip and cook until bottoms are browned, 3 to 5 minutes. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "240"
},
{
  "url": "https://www.allrecipes.com/recipe/246002/almond-flour-bread/",
  "name": "Almond Flour Bread",
  "rating": "4.4",
  "ratingcount": "172",
  "ingredients": "1 ½ cups almond flour; ⅓ cup flaxseed meal; 4 large eggs; ¼ cup unsweetened almond milk; 2 tablespoons olive oil; 2 teaspoons baking powder; ½ teaspoon salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease an 8x4-inch loaf pan, or line with parchment paper. 2. Mix almond flour, flaxseed meal, eggs, almond milk, olive oil, baking powder, and salt together in a bowl until a soft dough forms. Transfer to the prepared loaf pan. 3. Bake in the preheated oven until golden brown on top, about 40 minutes. Cool in the loaf pan for 10 minutes before transferring to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/283581/almond-flour-blueberry-muffins/",
  "name": "Almond Flour Blueberry Muffins",
  "rating": "4.7",
  "ratingcount": "15",
  "ingredients": "2 cups finely ground almond flour; ½ teaspoon baking soda; ¼ teaspoon salt; ¼ cup coconut oil, melted and cooled; ¼ cup pure maple syrup; 3 large eggs; 1 tablespoon lemon zest; 1 teaspoon vanilla extract; 1 cup frozen blueberries",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a 12-cup muffin tin with paper liners. 2. Whisk almond flour, baking soda, and salt together in a large bowl. Add coconut oil, maple syrup, eggs, lemon zest, and vanilla; mix until combined. Fold in frozen blueberries and spoon into the prepared muffin cups. 3. Bake in the preheated oven until tops spring back when lightly pressed, 18 to 20 minutes. Cool in the tin for 5 minutes. Transfer to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "203"
},
{
  "url": "https://www.allrecipes.com/recipe/263032/90-second-keto-bread-in-a-mug/",
  "name": "90-Second Keto Bread in a Mug",
  "rating": "4.7",
  "ratingcount": "429",
  "ingredients": "1 tablespoon butter; ⅓ cup blanched almond flour; 1  egg; ½ teaspoon baking powder; 1 pinch salt",
  "directions": "1. Microwave butter in a microwave-safe mug until melted, about 15 seconds. Swirl the mug to coat with butter. 2. Add almond flour, egg, baking powder, and salt to the mug; whisk until smooth. 3. Microwave on high until set, about 90 seconds. Let cool for 2 minutes before slicing.",
  "prep": "5 mins",
  "cook": "2 mins",
  "total": "9 mins",
  "calories": "408"
},
{
  "url": "https://www.allrecipes.com/recipe/223234/macaron-french-macaroon/",
  "name": "Macarons (French Macaroons)",
  "rating": "4.3",
  "ratingcount": "365",
  "ingredients": "3  egg whites; ¼ cup white sugar; 1 ⅔ cups confectioners' sugar; 1 cup finely ground almonds",
  "directions": "1. Line a baking sheet with a silicone baking mat. 2. Beat egg whites in the bowl of a stand mixer fitted with a whisk attachment until foamy. Add white sugar and beat until egg whites are glossy, fluffy, and hold soft peaks. 3. Sift confectioners' sugar and ground almonds in a separate bowl; quickly fold almond mixture into egg whites, about 30 strokes. 4. Spoon a small amount of batter into a plastic bag with a small corner cut off and pipe a test disk of batter, about 1 1/2 inches in diameter, onto the prepared baking sheet. If the disk of batter holds a peak instead of flattening immediately, gently fold batter a few more times and retest. 5. When batter is mixed enough to flatten immediately into an even disk, spoon into a pastry bag fitted with a plain round tip. Pipe batter onto the baking sheet in rounds, leaving space between the disks. Let piped cookies stand out at room temperature until they form a hard skin on top, about 1 hour. 6. Preheat the oven to 285 degrees F (140 degrees C). 7. Bake cookies in preheated oven until set but not browned, about 10 minutes. 8. Let cookies cool completely before filling, about 30 minutes.",
  "prep": "30 mins",
  "cook": "10 mins",
  "total": "2 hrs 10 mins",
  "calories": "92"
},
{
  "url": "https://www.allrecipes.com/recipe/110926/almond-flour-waffles/",
  "name": "Almond Flour Waffles",
  "rating": "4.0",
  "ratingcount": "123",
  "ingredients": "1 cup almond flour; 1 teaspoon baking soda; 1 pinch salt; 4  eggs; ¼ cup honey; 1 teaspoon vanilla extract; cooking spray",
  "directions": "1. Preheat a waffle iron according to the manufacturer's instructions. 2. Combine almond flour, baking soda, and salt in a large bowl. Whisk eggs, honey, and vanilla together in a separate bowl. Stir flour mixture into egg mixture until smooth. 3. Spray the preheated waffle iron with cooking spray. Spoon batter onto waffle iron; cook until golden brown and the iron stops steaming, about 5 minutes. Repeat with remaining batter. Serve hot.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "214"
},
{
  "url": "https://www.allrecipes.com/recipe/278328/chaffles-with-almond-flour/",
  "name": "Chaffles with Almond Flour",
  "rating": "4.6",
  "ratingcount": "36",
  "ingredients": "1 large egg; 1 tablespoon blanched almond flour; ¼ teaspoon baking powder; ½ cup shredded mozzarella cheese; cooking spray",
  "directions": "1. Whisk egg, almond flour, and baking powder together in a bowl. Stir in mozzarella cheese; set batter aside. 2. Preheat a waffle iron according to the manufacturer's instructions. 3. Spray both sides of the preheated waffle iron with cooking spray. Pour 1/2 of the batter onto the waffle iron and spread it out from the center with a spoon. Close the waffle maker and cook until chaffle reaches your desired doneness, about 3 minutes. Carefully lift chaffle out of the waffle iron and repeat with remaining batter. Allow chaffles to cool and crisp up, about 2 to 3 minutes.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "132"
},
{
  "url": "https://www.allrecipes.com/recipe/268796/spicy-gluten-free-chicken-and-cheddar-waffles-with-blackberry-maple-syrup/",
  "name": "Spicy Gluten-Free Chicken and Cheddar Waffles with Blackberry-Maple Syrup",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "4  fresh blackberries; 1 teaspoon ancho chile powder; ¼ teaspoon red pepper flakes; 1 cup pure maple syrup; 2 pounds chicken tenders; 1  orange, zested and juiced; salt and ground black pepper to taste; ½ cup coconut flour; ½ cup almond flour; 1 teaspoon minced garlic; 1 teaspoon smoked paprika; 2 ¼ cups gluten-free all purpose baking flour; 1 tablespoon baking powder; ½ teaspoon dried rosemary; ½ teaspoon ground thyme; ¼ teaspoon sea salt; cooking spray; 1 stick butter, softened; 1 tablespoon maple syrup; 1 cup shredded sharp Cheddar cheese; 3  eggs; 1 ¾ cups almond milk; ¼ cup blackberries for garnish",
  "directions": "1. Muddle 4 blackberries in the bottom of a microwave-safe glass serving jar. Add chile powder and red pepper flakes, then maple syrup; stir syrup briskly until well combined. 2. Place chicken in a large, shallow baking dish. Drizzle with orange juice and season liberally with salt and pepper. Refrigerate until needed. Whisk orange zest with coconut flour, almond flour, garlic, and paprika. Set dredging mixture aside. 3. Mix gluten-free flour, baking powder, rosemary, thyme, and sea salt together in another bowl to start the waffle batter. 4. Preheat the oven to 400 degrees F (200 degrees C). Preheat a waffle iron according to manufacturer's instructions and spray with cooking spray. 5. Beat butter and maple syrup together in a bowl using an electric mixer until creamy. Add eggs 1 at a time. Gradually add the gluten-free flour mixture and milk in 3 alternating batches. Stir in Cheddar cheese just until combined. Pour batter into the preheated waffle iron. Cook until crisp and deeply brown, 6 to 8 minutes per waffle. Place waffles on a baking sheet and keep warm in the preheating oven while preparing chicken. 6. Line another baking sheet with parchment paper. Gently shake excess orange juice off each chicken tender and press all sides into the reserved coconut flour mixture. Place coated chicken on the prepared baking sheet. Remove waffles from oven and keep warm. 7. Bake chicken in the preheated oven, flipping halfway, until browned on both sides, about 20 minutes total. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 8. Microwave syrup until warm, about 1 minute. Top each waffle with a warm chicken tender or two and a handful of blackberries. Drizzle with the warmed spicy maple syrup.",
  "prep": "35 mins",
  "cook": "35 mins",
  "total": "1 hr 10 mins",
  "calories": "678"
},
{
  "url": "https://www.allrecipes.com/recipe/261182/low-carb-almond-cinnamon-butter-cookies/",
  "name": "Low-Carb Almond Cinnamon Butter Cookies",
  "rating": "4.3",
  "ratingcount": "88",
  "ingredients": "2 cups blanched almond flour; ½ cup unsalted butter, softened; ½ cup low-calorie natural sweetener (such as Swerve®); 1 large egg; 1 teaspoon sugar-free vanilla extract; 1 teaspoon ground cinnamon",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Mix almond flour, butter, sweetener, egg, vanilla, and cinnamon together in a bowl until well combined. Roll dough into twelve 1-inch balls. Place balls onto the prepared baking sheet. Press down twice with a fork onto each ball to make a crisscross. 3. Bake in the preheated oven until the edges are golden, 12 to 15 minutes. Cool on the baking sheet briefly before transferring to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "196"
},
{
  "url": "https://www.allrecipes.com/recipe/263033/best-keto-bread/",
  "name": "Best Keto Bread",
  "rating": "4.5",
  "ratingcount": "203",
  "ingredients": "cooking spray; 7 large eggs, at room temperature; ½ cup butter, melted and cooled; 2 tablespoons olive oil; 2 cups blanched almond flour; 1 teaspoon baking powder; ½ teaspoon xanthan gum; ½ teaspoon sea salt",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease a silicone loaf pan with cooking spray. 3. Whisk eggs in a bowl until smooth and creamy, about 3 minutes. Add melted butter and olive oil; mix until well combined. 4. Combine almond flour, baking powder, xanthan gum, and salt in a separate bowl; mix well. Add gradually to the egg mixture, mixing well until a thick batter is formed. 5. Pour batter into the prepared pan and smooth the top with a spatula. 6. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "247"
},
{
  "url": "https://www.allrecipes.com/recipe/261641/whole30-banana-bread-drop-muffins/",
  "name": "Whole30 Banana Bread Drop Muffins",
  "rating": "4.4",
  "ratingcount": "64",
  "ingredients": "2 teaspoons coconut oil; 3 ½ cups almond flour; 1 teaspoon salt; 1 teaspoon baking soda; 2 large ripe bananas; ¼ cup coconut oil, melted and cooled; 2  large eggs",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a rimmed baking sheet with 2 teaspoons coconut oil. 2. Whisk almond flour, salt, and baking soda together in a bowl. 3. Break bananas into pieces and place into a microwave-safe bowl. Microwave until soft, about 30 seconds. 4. Mash bananas until creamy. Add 1/4 cup melted coconut oil and eggs; mix until well combined. Stir in dry ingredients until incorporated. Drop batter onto the prepared baking sheet, making 12 biscuit-shaped mounds. 5. Bake in the preheated oven until peaks are lightly browned, about 17 minutes. Remove from the oven and allow to cool slightly before serving.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "290"
},
{
  "url": "https://www.allrecipes.com/recipe/239620/bread-machine-almond-bread/",
  "name": "Bread Machine Almond Bread",
  "rating": "4.8",
  "ratingcount": "12",
  "ingredients": "1 ¼ cups water; 4 teaspoons almond oil; 1 teaspoon salt; ¼ cup honey; 1 cup almond flour; 2 cups whole wheat flour; ¼ cup vital wheat gluten; 1 teaspoon xanthan gum; 1 (.25 ounce) package dry yeast",
  "directions": "1. Combine water, almond oil, salt, honey, almond flour, whole wheat flour, vital wheat gluten, xanthan gum, and yeast, respectively in a bread machine. Follow manufacturers' instructions for a 2-pound loaf.",
  "prep": "10 mins",
  "cook": "",
  "total": "3 hrs 10 mins",
  "calories": "117"
},
{
  "url": "https://www.allrecipes.com/recipe/273073/keto-fathead-bread/",
  "name": "Keto Fathead Bread",
  "rating": "4.9",
  "ratingcount": "17",
  "ingredients": "¾ cup shredded mozzarella cheese; 2 ounces cream cheese; 1 large egg; ⅓ cup almond flour; 2 teaspoons baking powder; ¼ teaspoon garlic powder; ½ cup shredded Cheddar cheese",
  "directions": "1. Place mozzarella cheese and cream cheese in a microwave-safe bowl. Microwave on high, 20 seconds at a time, until melted. 2. Whisk egg in a bowl until beaten. Mix in almond flour, baking powder, and garlic powder until well combined. Work mozzarella mixture into the dough until sticky. Stir in Cheddar cheese. 3. Transfer the dough to a sheet of plastic wrap and fold plastic wrap over the dough. Gently work the dough into a ball. Refrigerate for 30 minutes. 4. Preheat the oven to 425 degrees F (220 degrees C). Grease a baking sheet or line with parchment paper. 5. Remove the dough from the refrigerator and unwrap. Cut dough into 4 equal pieces and roll each piece into a ball. Cut each ball in half to form a top and bottom bun. Place dough, cut-side down, on the prepared baking sheet. 6. Bake in the preheated oven until golden and set up, 10 to 12 minutes.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "55 mins",
  "calories": "240"
},
{
  "url": "https://www.allrecipes.com/recipe/278092/air-fryer-keto-pork-chops/",
  "name": "Air Fryer Keto Pork Chops",
  "rating": "4.5",
  "ratingcount": "8",
  "ingredients": "4  boneless pork chops, 1/2-inch thick; 1 pinch salt and ground black pepper to taste; 1  egg; ⅓ cup grated Parmesan cheese; ⅓ cup almond flour; ½ teaspoon salt; ¼ teaspoon pepper; ¼ teaspoon garlic powder; 1  serving avocado oil cooking spray",
  "directions": "1. Season pork chops with salt and pepper on both sides. 2. Beat egg in a medium bowl. Mix Parmesan cheese, almond flour, 1/2 teaspoon salt, 1/4 teaspoon pepper, and garlic powder together in a second bowl. 3. Dip each pork chop in egg, then in Parmesan-flour mixture to coat. Place in the air fryer basket and spritz with avocado oil. 4. Cook in an air fryer at 375 degrees F (190 degrees C) until lightly browned, 8 to 10 minutes. Flip pork chops over, spritz with avocado oil and cook until pork is no longer pink in the center, 3 to 4 minutes more.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "365"
},
{
  "url": "https://www.allrecipes.com/recipe/239025/almond-flour-banana-bread/",
  "name": "Almond Flour Banana Bread",
  "rating": "4.1",
  "ratingcount": "175",
  "ingredients": "cooking spray; 3 large eggs, beaten; 1 tablespoon apple cider vinegar; 3 medium ripe bananas, mashed; ¼ cup coconut oil, melted; ¼ cup honey; 1 teaspoon vanilla extract; 3 cups almond flour; 1 teaspoon ground cinnamon; ¾ teaspoon baking powder; ½ teaspoon ground nutmeg; ½ teaspoon salt",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). Spray a 9x5-inch loaf pan with cooking spray. 2. Whisk eggs and vinegar together in a bowl. Stir in bananas, coconut oil, honey, and vanilla until blended. 3. Sift almond flour, cinnamon, baking powder, nutmeg, and salt together in a large bowl; stir into wet ingredients until well blended. Pour into the prepared bread pan. 4. Bake in the preheated oven until a knife inserted into the center comes out clean, about 1 hour; cover with foil if it begins to brown too much. Cool in the pan for 10 minutes, then remove loaf and cool completely on a wire rack.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "332"
},
{
  "url": "https://www.allrecipes.com/recipe/223233/french-macaroons/",
  "name": "French Macaroons",
  "rating": "4.5",
  "ratingcount": "93",
  "ingredients": "3  egg whites; 6 tablespoons superfine (castor) sugar; 1 cup almond meal; 1 ⅓ cups confectioners' sugar",
  "directions": "1. Preheat the oven to 320 degrees F (160 degrees C). Line baking sheets with parchment paper or a silicone mat. 2. Whisk egg whites in a clean metal mixing bowl until thick, about 5 minutes. Whisk superfine sugar into egg whites until thick, glossy, and stiff peaks form, 5 to 8 more minutes. 3. Sift almond meal and confectioners' sugar over beaten egg whites; gently fold in, retaining as much air as possible. 4. Divide meringue into separate bowls to flavor and color, if desired. 5. Spoon meringue into a piping bag fitted with a 3/8-inch tip. Pipe 1-inch disks of meringue onto the prepared baking sheets, leaving about 2 inches between cookies. 6. Let cookies stand at room temperature to form a thin skin, about 15 minutes. 7. Lift the baking sheets; let drop from several inches above the work surface to adhere cookies to the baking sheets. 8. Bake in the preheated oven until tops are dry, about 15 minutes; let cool completely on the baking sheets before peeling off the parchment paper, about 45 minutes.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "1 hr 35 mins",
  "calories": "61"
},
{
  "url": "https://www.allrecipes.com/recipe/7570/battenburg-cake/",
  "name": "Battenburg Cake",
  "rating": "4.6",
  "ratingcount": "30",
  "ingredients": "1 cup butter, softened; 1 cup white sugar; 3  eggs; ¼ teaspoon vanilla extract; 2 cups all-purpose flour; 1 teaspoon baking powder; ⅛ teaspoon salt; 2 drops red food coloring; 1 cup apricot preserves; 2 cups ground almonds; 3 cups confectioners' sugar; 1  egg, room temperature; 1 ½ teaspoons lemon juice; ¼ teaspoon almond extract",
  "directions": "1. Cream butter and 1 cup sugar together. Beat in 3 eggs, one at a time. Mix in vanilla. Stir in flour, baking powder and salt gently. Add milk if needed. 2. Divide batter into 2 equal parts. Add food coloring to 1 part to make a deep pink color. Grease two 7 inch square pans. Spread batters into pans. 3. Bake at 350 degrees F (175 degrees C) until an inserted wooden pick comes out clean, about 25 to 30 minutes. Let stand in pans 5 minutes. Turn out on racks to cool. 4. Trim edges from both cakes. Cut each cake lengthwise into 4 strips as wide as the cake is thick. Trim to make strips match. Heat jam slightly. Spread on sides to glue 2 pink and 2 white strips together checkerboard fashion. Spread all 4 sides of completed cake with jam. Repeat with remaining pink and white stripes. Makes two cakes. 5. To Make Almond Paste: Mix almonds, confectioners' sugar, egg, lemon juice, and almond extract together. Knead until smooth, adding a bit of lemon juice or water if too dry to roll. Add only 1/2 teaspoon at a time. It will be stiff. Divide into 2 equal parts. 6. Roll 1/2 of paste 1/8 inch or so thick on a surface lightly dusted with confectioners' sugar. Cut to fit length of cake, and long enough to cover 4 sides leaving ends uncovered. Lay cake on one end of paste. Wrap to completely enclose all 4 sides of cake pinching paste to seal. Roll in granulated sugar. Place with seal underneath on serving plate, or store in plastic bag. Repeat for second cake. Chill. Slice thinly to serve.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr 30 mins",
  "calories": "646"
},
{
  "url": "https://www.allrecipes.com/recipe/283483/almond-ricotta-cake/",
  "name": "Almond Ricotta Cake",
  "rating": "4.3",
  "ratingcount": "13",
  "ingredients": "½ cup unsalted butter, at room temperature; ¾ cup white sugar; 2 teaspoons vanilla sugar; 1 large lemon, zested and juiced; 4 large eggs, separated; 2 cups blanched almond flour; 9 ounces ricotta cheese; ⅓ cup white sugar; ¼ cup sliced almonds, or to taste; 1 tablespoon confectioners' sugar for dusting",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease an 8-inch springform pan and line with parchment paper. 2. Combine butter and 3/4 cup sugar in a large bowl; beat with an electric mixer until creamy, about 3 minutes. Add vanilla sugar, lemon zest, and lemon juice; mix until well combined. Add egg yolks, 1 at a time, beating well after each addition. 3. Fold in almond flour and ricotta cheese with a silicone spatula. 4. Wash and dry the beaters and beat egg whites in a glass, metal, or ceramic bowl until foamy. Gradually add 1/3 cup sugar, continuing to beat until stiff peaks form. Fold stiff egg whites into the batter. Pour batter into the prepared pan. Sprinkle with sliced almonds. 5. Bake on the center rake of the preheated oven until edges of the cake are lightly browned, about 50 minutes. Cake will still be a little wobbly in the middle. 6. Remove from the oven and let the cake to cool completely in the pan before transferring to a cake platter, about 1 hour. Dust with confectioners' sugar before serving.",
  "prep": "20 mins",
  "cook": "50 mins",
  "total": "2 hrs 10 mins",
  "calories": "397"
},
{
  "url": "https://www.allrecipes.com/recipe/7740/marzipan/",
  "name": "Marzipan",
  "rating": "3.6",
  "ratingcount": "22",
  "ingredients": "2 cups confectioners' sugar; ½ pound finely ground blanched almonds; 2  egg whites; ½ teaspoon salt; ½ teaspoon almond extract",
  "directions": "1. Blend the confectioner's sugar, finely ground almonds, egg whites, salt, and almond extract in a blender until perfectly blended. Cover and chill until firm, 24 hours.",
  "prep": "30 mins",
  "cook": "",
  "total": "1 day 30 mins",
  "calories": "143"
},
{
  "url": "https://www.allrecipes.com/recipe/281145/almond-flour-chocolate-chip-muffins/",
  "name": "Almond Flour Chocolate Chip Muffins",
  "rating": "5.0",
  "ratingcount": "5",
  "ingredients": "3 cups blanched almond flour; 3 teaspoons baking powder; ½ teaspoon salt; ¼ teaspoon baking soda; 2  eggs; ⅔ cup white sugar; ½ cup unsalted butter, melted; ½ cup nonfat Greek yogurt; 1 teaspoon vanilla extract; 1 cup semisweet chocolate chips, divided; 1 tablespoon blanched almond flour",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Sift 3 cups almond flour together with baking powder, salt, and baking soda into a bowl and set aside. 3. Mix eggs, sugar, melted butter, Greek yogurt, and vanilla extract together in a bowl with an electric mixer until smooth and creamy. Add flour mixture into the wet ingredients and mix until well combined, but be careful not to overmix. 4. Toss 3/4 cup of the chocolate chips with 1 tablespoon almond flour in a bowl so that the chips are lightly coated. Fold the coated chocolate chips into the batter. Distribute the batter evenly between 10 paper-lined muffin cups, filling the cups all the way to the top. Sprinkle remaining chocolate chips over the tops of the muffins. 5. Bake in a preheated oven for 5 minutes, then reduce heat to 350 degrees F (175 degrees C). Continue baking until the tops are golden and a toothpick inserted into the center of one of the muffins comes out clean, 12 to 15 minutes. 6. Cool muffins in the pan on a wire rack for at least 5 minutes before serving.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "458"
},
{
  "url": "https://www.allrecipes.com/recipe/239793/keto-cheesecake-cupcakes/",
  "name": "Keto Cheesecake Cupcakes",
  "rating": "4.7",
  "ratingcount": "209",
  "ingredients": "½ cup almond meal; ¼ cup butter, melted; 2 (8 ounce) packages cream cheese, softened; 2  eggs; ¾ cup granular no-calorie sucralose sweetener (such as Splenda®); 1 teaspoon vanilla extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line 12 muffin cups with paper liners. 2. Mix almond meal and butter together in a bowl; spoon into the bottoms of the paper liners and press into a flat crust. 3. Beat cream cheese, eggs, sweetener, and vanilla extract together in a bowl with an electric mixer set to medium until smooth; spoon over the crust layer in the paper liners. 4. Bake in the preheated oven until the cream cheese mixture is nearly set in the middle, 15 to 17 minutes. 5. Let cupcakes cool at room temperature until cool enough to handle. Refrigerate 8 hours to overnight before serving.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "8 hrs 25 mins",
  "calories": "209"
},
{
  "url": "https://www.allrecipes.com/recipe/278007/almond-meal-pancakes/",
  "name": "Almond Meal Pancakes",
  "rating": "4.3",
  "ratingcount": "33",
  "ingredients": "2 large eggs; 2 tablespoons olive oil; 2 tablespoons maple syrup; ¾ teaspoon vanilla extract; 1 pinch salt; 1 cup finely ground almond meal; 1 teaspoon baking powder; 1 teaspoon butter, or as needed",
  "directions": "1. Combine eggs, olive oil, maple syrup, vanilla extract, salt, almond meal, and baking powder in a bowl. Whisk until thoroughly combined. Let batter sit for 10 minutes to marry the flavors and activate the baking powder. 2. Butter a nonstick pan or griddle over medium heat. Scoop in batter into any size pancake(s) you like. Cook until edges are set and bottom is golden brown, 2 or 3 minutes. Flip and cook until slightly springy to the touch, another 2 to 3 minutes. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "497"
},
{
  "url": "https://www.allrecipes.com/recipe/270264/eggplant-fritters/",
  "name": "Eggplant Fritters",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "1 large eggplant, sliced very thinly; sea salt and ground black pepper to taste; 1 cup almond meal; 1 cup finely grated Parmesan cheese; ½ cup toasted sesame seeds; 3  eggs, lightly beaten; 2 tablespoons grapeseed oil for frying",
  "directions": "1. Place eggplant slices in a colander and sprinkle lightly with salt. Set aside. 2. Combine almond meal, Parmesan cheese, and sesame seeds in a bowl. Season with salt and pepper. Place beaten eggs in another bowl. Gently pat eggplant slices dry and dip first in eggs, shaking off excess, and then into almond meal mixture. Place breaded eggplant on a plate near the cooking area. 3. Preheat the oven to 200 degrees F (95 degrees C). Line a baking sheet with parchment paper. 4. Heat oil in a skillet over medium heat. Add eggplant slices to the hot skillet and cook in batches, turning occasionally until golden on both sides, about 5 minutes per batch. Place cooked eggplant on the prepared baking sheet and keep warm in the preheated oven.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "336"
},
{
  "url": "https://www.allrecipes.com/recipe/242357/gluten-free-shake-and-bake-almond-chicken/",
  "name": "Gluten-Free Shake and Bake Almond Chicken",
  "rating": "4.4",
  "ratingcount": "66",
  "ingredients": "½ cup almond meal; 1 teaspoon ground paprika; 1 teaspoon sea salt; 1 teaspoon ground black pepper; 4  skinless, boneless chicken thighs",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Combine almond meal, paprika, sea salt, and black pepper together in a resealable bag. Put each chicken thigh into bag, 1 at a time; close bag and shake until evenly coated. Place chicken in a glass baking dish. 3. Bake in the preheated oven until no longer pink in the center and the juices run clear, 25 to 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "249"
},
{
  "url": "https://www.allrecipes.com/recipe/277441/low-carb-cheesecake/",
  "name": "Low-Carb Cheesecake",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "2 cups blanched almond flour; ⅓ cup butter, melted; 3 tablespoons powdered erythritol sweetener; 1 teaspoon vanilla extract; 4 (8 ounce) packages cream cheese, softened; 1 ¼ cups powdered erythritol sweetener; 3 large eggs; 1 tablespoon lemon juice; 1 teaspoon vanilla extract; ¼ teaspoon lemon zest",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch springform pan and line the bottom with parchment paper. Wrap the bottom and sides of the pan with aluminum foil if worried about leakage. 2. Stir almond flour, butter, erythritol, and vanilla extract together in a small bowl until well combined; the mixture will be crumbly. Press into the prepared pan bottom. 3. Bake on the center rack in the preheated oven until just golden, 10 to 12 minutes. Allow to cool for 10 minutes. 4. Meanwhile, beat cream cheese and powdered sweetener together using an electric stand or hand mixer at low speed until fluffy. Beat in eggs, one at a time. Add lemon juice, vanilla extract, and lemon zest; beat until well combined. 5. Bake on the center rack in the preheated oven until almost set and slightly jiggly in the center, 45 to 55 minutes. 6. Remove from the oven and let cool in the pan. Keep in the pan, cover, and refrigerate to fully set, at least 4 hours to overnight. Run a knife gently around the sides, unclamp, and carefully remove the pan; it should come right off.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "5 hrs 10 mins",
  "calories": "335"
},
{
  "url": "https://www.allrecipes.com/recipe/259205/fluffy-keto-pancakes/",
  "name": "Fluffy Keto Pancakes",
  "rating": "4.4",
  "ratingcount": "66",
  "ingredients": "1 cup almond flour; ¼ cup coconut flour; 2 tablespoons low-calorie natural sweetener (such as Swerve®); 1 teaspoon salt; 1 teaspoon baking powder; ½ teaspoon ground cinnamon (Optional); 6  eggs, at room temperature; ¼ cup heavy whipping cream, at room temperature; 2 tablespoons butter, melted; 1 teaspoon vanilla extract",
  "directions": "1. Mix almond flour, coconut flour, sweetener, salt, baking powder, and cinnamon together in a bowl. Whisk in eggs, heavy cream, butter, and vanilla extract slowly until batter is just blended. 2. Heat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "383"
},
{
  "url": "https://www.allrecipes.com/recipe/255634/cauliflower-almond-pizza-crust/",
  "name": "Cauliflower Almond Pizza Crust",
  "rating": "4.2",
  "ratingcount": "27",
  "ingredients": "1 head cauliflower, chopped; 1 cup almond flour; 3  eggs; ½ teaspoon oregano; ½ teaspoon thyme; ½ teaspoon rosemary; 1 dash salt; 1 teaspoon all-purpose flour",
  "directions": "1. Preheat oven to 450 degrees F (230 degrees C). 2. Place cauliflower in a food processor or blender; pulse until broken down into grains the size of rice. Spread on a baking sheet. 3. Roast in the preheated oven until soft, about 10 minutes. 4. Transfer softened cauliflower to a large bowl; add almond flour, eggs, oregano, thyme, and rosemary. Stir well until dough pulls into a ball. 5. Dust a pizza pan with flour; spread dough on the pan with a spatula to form the crust. 6. Bake crust in the preheated oven until golden brown and edges are crispy, about 20 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "138"
},
{
  "url": "https://www.allrecipes.com/recipe/254787/keto-brownies/",
  "name": "Keto Brownies",
  "rating": "3.8",
  "ratingcount": "62",
  "ingredients": "¾ cup cocoa powder; ½ teaspoon baking soda; ⅔ cup coconut oil, divided; ½ cup boiling water; 1 cup stevia sugar substitute (such as Truvia®); 2  eggs; 1 ⅓ cups almond flour; 1 teaspoon vanilla extract; ¼ teaspoon salt",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Lightly grease an 8-inch square pan with coconut oil. 2. Whisk cocoa powder and baking soda together in a bowl. Add 1/3 cup coconut oil and boiling water; mix until well blended. Add remaining 1/3 cup coconut oil, stevia, and eggs; blend well. Fold almond flour, vanilla extract, and salt into the batter. 3. Pour batter into the greased pan. 4. Bake in the preheated oven until top is dry and edges have started to pull away from the sides of the pan, 30 to 40 minutes. Let cool before cutting into 12 squares.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "222"
},
{
  "url": "https://www.allrecipes.com/recipe/268690/keto-coconut-cookies/",
  "name": "Keto Coconut Cookies",
  "rating": "3.4",
  "ratingcount": "14",
  "ingredients": "¾ cup granular sucralose sweetener (such as Splenda®); ½ cup butter; 3  eggs; ½ tablespoon heavy cream; 1 teaspoon almond milk; ½ cup unsweetened coconut flakes; 6 tablespoons coconut flour; ¼ cup almond flour; 1 teaspoon baking powder; 1 teaspoon baking soda; ½ teaspoon salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Beat sweetener and butter together in a bowl until creamy. Add eggs, heavy cream, and almond milk; beat until smooth. Scrape down sides with a spatula. 3. Mix coconut flakes, coconut flour, almond flour, baking powder, baking soda, and salt together in a separate bowl. Beat into the butter mixture until dough comes together. 4. Drop teaspoonfuls of cookie dough onto the baking sheets. 5. Bake in the preheated oven until golden brown, about 17 minutes. Cool on the baking sheet for 3 minutes before transferring to a wire rack.",
  "prep": "15 mins",
  "cook": "17 mins",
  "total": "35 mins",
  "calories": "98"
},
{
  "url": "https://www.allrecipes.com/recipe/264211/cheesy-keto-biscuits/",
  "name": "Cheesy Keto Biscuits",
  "rating": "4.6",
  "ratingcount": "74",
  "ingredients": "2 cups almond flour; 1 tablespoon baking powder; 2 ½ cups shredded Cheddar cheese; 4  eggs; ¼ cup half-and-half",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Combine almond flour and baking powder in a large bowl. Mix in Cheddar cheese by hand. Create a small well in the middle of the bowl; add eggs and half-and-half to the center. Use a large fork, spoon, or your hands to blend in the flour mixture until a sticky batter forms. 3. Drop 9 portions of batter onto the prepared baking sheet. 4. Bake in the preheated oven until golden, about 20 minutes.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "329"
},
{
  "url": "https://www.allrecipes.com/recipe/268501/gluten-free-fruitcake/",
  "name": "Gluten-Free Fruitcake",
  "rating": "5.0",
  "ratingcount": "6",
  "ingredients": "¼ cup raisins; ¼ cup golden raisins; ¼ cup dried cranberries; ¼ cup dried cherries; 5 ½ fluid ounces spiced rum; 1  orange, zested and juiced; ½ cup brown rice flour; ½ cup almond meal; ⅓ cup potato starch; ¼ cup tapioca starch; 1 teaspoon ground cinnamon; ½ teaspoon ground nutmeg; ¼ teaspoon ground cloves; ¼ teaspoon ground cardamom; ¼ teaspoon ground ginger; 1 teaspoon baking powder; 6  dates, pitted and chopped; 2  large dried figs, chopped; ¼ cup candied mixed fruit, chopped; ⅔ cup butter, at room temperature; ½ cup raw cane sugar; 1 teaspoon vanilla extract; 2  eggs, at room temperature; ½ cup unsweetened applesauce; ¼ cup whole raw hazelnuts; ¼ cup raw walnut halves; ¼ cup raw pecan halves; ¼ cup raw whole almonds; 1 ounce candied mixed fruit slices; 3 tablespoons cherry brandy liqueur",
  "directions": "1. Put raisins, golden raisins, cranberries, and cherries in a bowl. Pour rum and orange juice over dried fruit. Set aside. 2. Preheat the oven to 325 degrees F (165 degrees C). Butter a 9x5-inch loaf pan. 3. Whisk brown rice flour, almond meal, potato and tapioca starches, cinnamon, nutmeg, cloves, cardamom, and ginger together in a bowl. Set aside 3 tablespoons of this mixture. Add baking powder to remaining larger portion; mix well. 4. Combine orange zest, dates, figs, and 1/4 cup candied mixed fruit in a bowl. Sprinkle in 2 tablespoons reserved flour mixture and toss to coat. 5. Beat butter and sugar together with an electric mixer until creamy. Mix in vanilla. Add eggs, one at a time, beating well after each addition. Mix in applesauce. 6. Drain dried fruit, reserving soaking liquid. Add drained fruit to date mixture and toss with remaining 1 tablespoon reserved flour mixture. 7. Mix soaking liquid into butter mixture. Gradually add flour mixture, stirring just until combined; do not overmix. Fold in hazelnuts, walnut halves, and pecan halves. 8. Pour batter into the prepared loaf pan. Decorate top with almonds and candied fruit slices. 9. Bake in the preheated oven for 1 hour. Reduce oven temperature to 290 degrees F (145 degrees C). Continue baking until browned on top and a toothpick inserted into the center comes out clean, about 30 minutes more. 10. Remove from the oven and let cool for at least 15 minutes before removing from the pan. Brush cherry brandy on top. Let cake rest 24 hours for best results.",
  "prep": "40 mins",
  "cook": "1 hr 30 mins",
  "total": "1 day 2 hrs 25 mins",
  "calories": "401"
},
{
  "url": "https://www.allrecipes.com/recipe/246003/easy-gluten-free-turkey-burgers/",
  "name": "Easy Gluten-Free Turkey Burgers",
  "rating": "4.4",
  "ratingcount": "5",
  "ingredients": "1 pound ground turkey; ½  white onion, finely chopped; ¼ cup almond flour; 1  large egg; 3 cloves garlic, minced; 2 sprigs fresh basil, chopped; 1 pinch garlic and herb seasoning blend (such as Mrs. Dash®), or to taste; ground black pepper to taste",
  "directions": "1. Preheat grill on medium heat and lightly oil the grate. 2. Mix ground turkey, onion, almond flour, egg, garlic, basil, seasoning blend, and black pepper together thoroughly in a bowl. Form 5 burger patties using about 1/3 cup of the turkey mixture for each. 3. Cook turkey burgers on preheated grill until no longer pink in the center and the juices run clear, 7 to 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "192"
},
{
  "url": "https://www.allrecipes.com/recipe/241527/amazing-almond-flour-pancakes-gluten-free-and-paleo-friendly/",
  "name": "Amazing Almond Flour Pancakes (Gluten-Free and Paleo-Friendly)",
  "rating": "4.3",
  "ratingcount": "109",
  "ingredients": "1 cup almond flour; 1 tablespoon chocolate chips (such as Enjoy Life®), or more to taste (Optional); ½ teaspoon baking soda; 1 pinch salt; 1 pinch ground cinnamon, or to taste (Optional); 1  egg; 1  egg white; 1 tablespoon honey; 2 teaspoons vanilla extract; ¼ cup water, or as needed",
  "directions": "1. Preheat a lightly oiled griddle to 375 degrees F (190 degrees C). 2. Whisk almond flour, chocolate chips, baking soda, salt, and cinnamon together in a bowl. Whisk egg, egg white, honey, and vanilla extract together in a separate bowl. Stir flour mixture into egg mixture, adding enough water to reach a pancake batter consistency. 3. Drop batter by large spoonfuls onto the prepared griddle and cook until pancakes are golden brown and edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "57"
},
{
  "url": "https://www.allrecipes.com/recipe/272657/keto-open-faced-chicken-cordon-bleu/",
  "name": "Keto Open-Faced Chicken Cordon Bleu",
  "rating": "4.6",
  "ratingcount": "25",
  "ingredients": "1 pound chicken cutlets, pounded to 1/4-inch thickness; salt and freshly ground black pepper to taste; 2 large eggs; 1 teaspoon Dijon mustard; ⅔ cup almond flour; ⅓ cup freshly grated Parmesan cheese; ½ teaspoon garlic powder; ¼ cup avocado oil; ¼ pound shaved deli ham; 1 cup shredded Swiss cheese",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Season chicken cutlets with salt and pepper; set aside. 3. Whisk eggs and Dijon mustard together in a shallow bowl. Combine almond flour, Parmesan cheese, and garlic powder in a separate shallow bowl. Dip chicken cutlets into egg mixture, letting excess drip off. Dredge with almond flour mixture, then set on a plate. 4. Heat oil in a large skillet over medium-high heat. Add chicken cutlets and cook until golden brown, 3 to 4 minutes. Flip over and cook until chicken is no longer pink inside and the juices are running clear, 3 to 4 minutes more. 5. Place chicken cutlets on a baking sheet. Top with ham slices and cover with Swiss cheese. 6. Bake in the preheated oven until cheese has melted, 4 to 5 minutes. Serve immediately.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "606"
},
{
  "url": "https://www.allrecipes.com/recipe/246149/cauliflower-patties/",
  "name": "Cauliflower Patties",
  "rating": "4.0",
  "ratingcount": "30",
  "ingredients": "1 head cauliflower, broken into florets; 1 cup almond flour; 2  eggs; ½ teaspoon cayenne pepper; salt and ground black pepper to taste; 2 tablespoons extra-virgin olive oil, or as needed",
  "directions": "1. Bring water to boil in a saucepan. Add cauliflower; boil until tender, about 15 minutes. Strain cauliflower, transfer to a bowl, and mash with a fork. 2. Stir almond flour, eggs, cayenne pepper, salt, and black pepper into cauliflower until well-combined; form into 1/4-cup sized patties. 3. Heat 1 teaspoon olive oil in a skillet over medium heat. Fry patties in a single layer until golden brown, about 5 minutes per side. Repeat with remaining patties and olive oil.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "157"
},
{
  "url": "https://www.allrecipes.com/recipe/239606/gluten-free-waffles/",
  "name": "Gluten-Free Waffles",
  "rating": "4.8",
  "ratingcount": "33",
  "ingredients": "1 ⅓ cups milk; 1 cup buckwheat flour; 1 cup almond flour; ⅓ cup vegetable oil; 2  eggs; 1 tablespoon baking powder; 2 teaspoons white sugar; 1 teaspoon salt",
  "directions": "1. Preheat a waffle iron according to manufacturer's instructions. 2. Stir milk, buckwheat, almond flour, vegetable oil, eggs, baking powder, sugar, and salt together in a bowl until batter is smooth. 3. Working in batches, ladle batter into preheated waffle iron and cook until waffles are golden and crisp, 3 to 5 minutes.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "278"
},
{
  "url": "https://www.allrecipes.com/recipe/273257/keto-chicken-cordon-bleu-meatballs/",
  "name": "Keto Chicken Cordon Bleu Meatballs",
  "rating": "4.4",
  "ratingcount": "24",
  "ingredients": "1 pound ground chicken; ⅓ cup blanched almond flour; ½ teaspoon salt; ½ teaspoon garlic powder; ½ teaspoon onion powder; 1  egg, lightly beaten; 6 ounces ham steak, cubed into 20 even pieces; 1 tablespoon olive oil; 1 tablespoon butter; ¾ cup chicken broth; 1 teaspoon Dijon mustard; ½ cup heavy cream; 1 cup shredded Swiss cheese; 1 pinch cracked black pepper to taste; 2 tablespoons minced fresh parsley (Optional)",
  "directions": "1. Combine chicken, almond flour, salt, garlic powder, onion powder, and egg in a bowl. Form a small portion of chicken mixture into a 1 1/2-inch ball around a cube of ham; place on a plate. Repeat with remaining chicken mixture and ham, making 20 meatballs total. 2. Heat olive oil in a large skillet over medium-high heat. Brown meatballs for 3 minutes on one side; turn and cook an additional 3 to 4 minutes. Transfer meatballs onto a clean plate. 3. Return the skillet to medium heat and melt butter. Whisk in chicken broth and Dijon mustard; bring to a simmer for 3 to 4 minutes. Stir in heavy cream and whisk until sauce begins to simmer. Whisk in Swiss cheese until completely melted. Return meatballs to skillet and simmer until sauce has slightly thickened, 3 to 4 minutes. Season with cracked black pepper and parsley. Serve immediately. Sauce will further thicken upon cooling.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "349"
},
{
  "url": "https://www.allrecipes.com/recipe/266535/keto-coconut-lime-bars/",
  "name": "Low-Carb Coconut Lime Bars",
  "rating": "4.2",
  "ratingcount": "26",
  "ingredients": "1 cup finely ground almond flour; ¼ cup low-calorie natural sweetener (such as Swerve®); 2 tablespoons coconut flour; 1 teaspoon lime zest; ¼ teaspoon salt; 3 tablespoons butter, softened; 1 cup lime juice; ½ cup coconut milk; ½ cup low-calorie natural powdered sweetener (such as Swerve®); 1 tablespoon butter, melted; 1 teaspoon lime zest; 5 large eggs, beaten; 2 tablespoons unsweetened shredded coconut; ½ tablespoon lime zest, or to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish. 2. Make the crust: Mix almond flour, sweetener, coconut flour, lime zest, and salt in a large bowl together in a large bowl until thoroughly combined. Cut in butter with a fork until combined and no lumps remain. Press crust mixture into the bottom of the prepared baking dish. 3. Bake in the preheated oven until lightly browned, 10 to 15 minutes. Remove from the oven; keep the oven on. 4. Make the filling: Whisk lime juice, coconut milk, sweetener, melted butter, and lime zest in a medium saucepan over medium heat. Mix until sweetener is dissolved; do not let boil. Gradually add beaten eggs, whisking constantly, until mixture is foamy and airy and starts to thicken, 5 to 10 minutes. Remove filling from the heat and spread evenly over the crust. 5. Return to the oven and bake until filling is set in the middle, 10 to 15 minutes. 6. While the bars are baking, make the topping: Toast shredded coconut in a small skillet over medium heat until lightly browned, 2 to 3 minutes. Remove from the heat and toss in lime zest. 7. Remove bars from the oven and sprinkle topping over the surface. Let cool for 15 minutes, then transfer to the refrigerator until chilled, about 2 hours. 8. Cut into 12 bars.",
  "prep": "25 mins",
  "cook": "25 mins",
  "total": "3 hrs 5 mins",
  "calories": "160"
},
{
  "url": "https://www.allrecipes.com/recipe/263113/keto-ny-cheesecake/",
  "name": "Keto NY Cheesecake",
  "rating": "4.9",
  "ratingcount": "16",
  "ingredients": "⅔ cup almond meal; 5 tablespoons butter, melted; 2 (8 ounce) packages cream cheese; ¾ cup low-calorie natural sweetener (such as Swerve®); ¼ cup heavy whipping cream; 2 tablespoons water; 3  eggs; ½ cup sour cream; 2 tablespoons almond flour; 1 ½ teaspoons vanilla extract",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a 12-cup muffin pan with paper liners. 2. Mix almond meal and butter together in a bowl. Spoon into bottoms of the paper liners; press down to form a flat crust. 3. Stir cream cheese and sweetener together in a bowl just until smooth. Mix in whipping cream and water. Add eggs one at a time, whisking well after each addition. Stir in sour cream, almond flour, and vanilla extract. Spoon into paper liners. 4. Bake in the preheated oven until cream cheese mixture is almost set in the middle, 15 to 18 minutes. Be careful not to overcook. 5. Let cool at room temperature; refrigerate 8 hours to overnight.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "8 hrs 25 mins",
  "calories": "273"
},
{
  "url": "https://www.allrecipes.com/recipe/223232/macarons/",
  "name": "Macarons",
  "rating": "4.7",
  "ratingcount": "34",
  "ingredients": "4  extra large egg whites; 1 ⅔ cups confectioners' sugar; 1 ⅓ cups almond flour; ⅛ teaspoon salt; ¼ cup superfine (castor) sugar; ¼ cup seedless raspberry jam",
  "directions": "1. Place egg whites into a metal mixing bowl and refrigerate overnight. The next day, bring egg whites to room temperature. 2. Preheat the oven to 280 degrees F (138 degrees C). Line two baking sheets with parchment paper. 3. Whisk confectioners' sugar and almond flour together in a bowl. 4. Beat egg whites with salt in a metal bowl with an electric mixer on medium speed until foamy, about 1 minute. Increase speed to high and gradually beat in superfine sugar, about 1 tablespoon at a time, until egg whites are glossy and hold stiff peaks, 3 to 5 more minutes. 5. Gently fold almond flour mixture into whipped egg whites until thoroughly incorporated; spoon meringue into a pastry bag fitted with a 3/8-inch tip. Pipe 1-inch disks of meringue onto the prepared baking sheets, leaving 2 inches of space between macarons. The batter will spread. 6. Lift the baking sheets a few inches above the work surface and hit them lightly on the work surface several times to remove any air bubbles from the macarons; let stand at room temperature until the shiny surfaces become dull and a thin skin forms, about 25 to 30 minutes. 7. Place the baking sheets in the preheated oven and bake until macarons surfaces are completely dry, about 19 to 20 minutes. Let macarons cool completely on the baking sheets before peeling parchment paper off. 8. Spread half of the macaron cookies with any desired filling; top with remaining macarons to make sandwich cookies, and refrigerate at least 2 hours to overnight to let them soften.",
  "prep": "40 mins",
  "cook": "20 mins",
  "total": "11 hrs 30 mins",
  "calories": "73"
},
{
  "url": "https://www.allrecipes.com/recipe/255594/pear-and-almond-tart-dairy-and-gluten-free/",
  "name": "Pear and Almond Tart (Dairy and Gluten Free)",
  "rating": "4.9",
  "ratingcount": "9",
  "ingredients": "1 ¼ cups almond meal; ¼ cup gluten-free oat flour; ½ teaspoon gluten-free baking powder; 1 large egg, beaten; ¼ cup maple syrup; 2 tablespoons coconut oil, melted; 1 teaspoon vanilla extract; ¼ teaspoon sea salt; ¼ teaspoon almond extract; 1 ½ (16 ounce) cans pear halves, drained and patted dry",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease the bottom of a tart pan with a removable bottom and line with parchment paper. 2. Mix together almond meal, oat flour, and baking powder in a medium bowl. 3. Whisk egg, maple syrup, coconut oil, vanilla, salt, and almond extract in a large bowl. Fold in almond meal mixture to form a sticky dough. 4. Press dough into the prepared tart pan. Arrange pears on top. 5. Bake in the preheated oven until golden brown, 22 to 25 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "234"
},
{
  "url": "https://www.allrecipes.com/recipe/265043/coconut-almond-flour-chocolate-chip-cookies/",
  "name": "Coconut Almond Flour Chocolate Chip Cookies",
  "rating": "5.0",
  "ratingcount": "5",
  "ingredients": "1 cup softened butter; ¾ cup packed brown sugar; ¾ cup white sugar; 1 teaspoon vanilla extract; 2  eggs; 1 ¼ cups almond flour; 1 cup coconut flour; 1 teaspoon baking soda; 1 teaspoon salt; ½ cup chocolate chips, or to taste; ¼ cup rolled oats (Optional); ¼ cup shredded coconut",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Line 2 baking sheets with parchment paper. 2. Combine butter, brown sugar, and white sugar in a large bowl; beat with an electric mixer until creamy. Add vanilla extract. Beat in eggs one at a time. 3. Combine almond flour, coconut flour, baking soda, and salt in a separate bowl. Mix into the creamed butter mixture until just combined. Add chocolate chips, oats, and coconut; stir again just until combined. 4. Scoop cookie dough onto the prepared baking sheets. 5. Bake in the preheated oven until browned, 12 to 15 minutes.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "151"
},
{
  "url": "https://www.allrecipes.com/recipe/255452/lower-carb-banana-protein-muffins/",
  "name": "Lower-Carb Banana Protein Muffins",
  "rating": "4.2",
  "ratingcount": "10",
  "ingredients": "1 ½ cups rolled oats; 2  ripe bananas, mashed; ½ cup creamy natural peanut butter; 2  eggs; ¼ cup flax seed meal; ¼ cup almond flour; ¼ cup plain non-fat Greek-style yogurt; ¼ cup agave nectar; 2 tablespoons vanilla extract; 1 tablespoon powdered stevia baking blend; 1 tablespoon ground cinnamon; 1 teaspoon maple-flavored extract (Optional); 1 teaspoon baking powder; ½ teaspoon baking soda",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease 15 muffin cups or line with aluminum foil liners. 2. Mix oats, bananas, peanut butter, eggs, flax meal, almond flour, yogurt, agave nectar, vanilla extract, stevia, cinnamon, maple-flavored extract, baking powder, and baking soda in a stand mixer or food processor until batter is smooth. Fill each muffin cup 3/4-full with batter. 3. Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 25 minutes. Cool muffins in the muffin cups for 5 minutes before transferring to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "55 mins",
  "calories": "155"
},
{
  "url": "https://www.allrecipes.com/recipe/278143/air-fryer-vegan-sweet-potato-fritters/",
  "name": "Air Fryer Vegan Sweet Potato Fritters",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "1 ½ cups shredded sweet potato; ½ cup almond flour; ¼ cup finely diced onions; ½ tablespoon olive oil; ½ teaspoon salt; ½ teaspoon freshly ground black pepper; ¼ teaspoon ground turmeric; avocado oil cooking spray",
  "directions": "1. Preheat an air fryer to 350 degrees F (175 degrees C). 2. Combine shredded sweet potato, almond flour, onions, olive oil, salt, pepper, and turmeric in a bowl; stir until well combined. Scoop into 9 balls using a large cookie scoop and form into patties. Place patties into the air fryer basket making sure they are not touching. Spray tops with cooking spray. 3. Cook in the preheated air fryer until fritters start to brown at the edges, 10 to 12 minutes. Flip fritters over, spray with cooking spray, and air-fry an additional 6 to 8 minutes. Let rest for 1 minute before removing from the air fryer basket.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "66"
},
{
  "url": "https://www.allrecipes.com/recipe/246328/french-macarons/",
  "name": "French Macarons",
  "rating": "4.1",
  "ratingcount": "45",
  "ingredients": "3  extra-large egg whites; ⅓ cup white sugar; 1 ⅔ cups confectioners' sugar; 1 cup almond flour; 1 pinch salt; ½ cup butter, softened; ⅔ cup confectioners' sugar; ½ teaspoon vanilla extract",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). Line a baking sheet with parchment paper. 2. Beat egg whites in a glass, metal, or ceramic bowl with an electric mixer on medium speed until foamy, about 30 seconds. Add white sugar and continue to beat until peaks are stiff enough and stay in place when the bowl is turned upside down, about 5 minutes. 3. Sift 1 2/3 cup confectioners' sugar, almond flour, and salt together twice. Fold into egg whites until batter is creamy and falls slowly off the lifted spatula, about 50 turns with a spatula. Transfer batter to a piping bag fitted with a round tip. 4. Pipe batter onto the parchment paper, using a circular motion to make macarons 1 inch in diameter. Tap the baking sheet against the counter about 10 times to release any air bubbles. 5. Bake in the preheated oven for 9 minutes. Rotate the baking sheet and continue baking until macarons are shiny and rise slightly to form feet (ruffles around the edge), about 9 minutes more. Peel off parchment paper and allow to cool completely, about 30 minutes. 6. Beat butter, 2/3 cup confectioners' sugar, and vanilla extract with an electric mixer until creamy and thick, about 10 minutes. Transfer filling to a piping bag fitted with a round tip. 7. Pipe a small amount of filling in the center on the flat side of 1 macaron; top with another macaron and press gently to sandwich together.",
  "prep": "45 mins",
  "cook": "18 mins",
  "total": "1 hr 33 mins",
  "calories": "125"
},
{
  "url": "https://www.allrecipes.com/recipe/265434/grain-free-butter-bread/",
  "name": "Grain-Free Butter Bread",
  "rating": "4.4",
  "ratingcount": "79",
  "ingredients": "6 large eggs; 1 ½ cups finely ground almond flour; 2 teaspoons baking powder; 1 teaspoon fine salt; ¼ cup melted butter; ⅛ teaspoon cream of tartar",
  "directions": "1. Separate eggs. Crack each egg into your hand and let the whites run into a bowl. Place yolks in a second bowl. 2. Preheat the oven to 375 degrees F (190 degrees C). Butter a loaf pan and line the bottom with parchment paper. 3. Place almond flour in a food processor. Add baking powder, salt, and egg yolks. Pour in melted butter. Pulse, scraping down the sides once or twice, until mixture comes together. 4. Sprinkle cream of tartar into egg whites. Whisk until soft peaks form. Transfer about 1/3 of the mixture into the food processor. Pulse on and off, scraping mixture down with a spatula as needed, until well blended. Scrape mixture into the bowl with egg whites. Fold together until well combined but still airy. Pour batter into the prepared loaf pan. 5. Bake in the preheated oven until golden brown and a toothpick inserted into the center comes out clean, about 30 minutes. 6. Run a thin knife along the edge bread and let rest for 10 minutes. Turn bread out onto a wire rack and cool to room temperature before slicing.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "241"
},
{
  "url": "https://www.allrecipes.com/recipe/238387/chef-johns-blackberry-buckle/",
  "name": "Chef John's Blackberry Buckle",
  "rating": "4.6",
  "ratingcount": "64",
  "ingredients": "3 cups fresh blackberries; 2 tablespoons white sugar; 1 teaspoon vanilla extract; 1 ¼ cups all-purpose flour; ¾ cup white sugar; ½ cup almond meal; 2 teaspoons baking powder; ¼ teaspoon salt; 1 pinch ground cinnamon; 1 cup milk; 7 tablespoons butter, divided; 3 tablespoons sliced almonds, or to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Stir blackberries, 2 tablespoons sugar, and vanilla extract together in a bowl; let rest, 15 to 20 minutes. 3. Whisk flour, 3/4 cup sugar, almond meal, baking powder, salt, and cinnamon together in a bowl. Stir milk into flour mixture until batter is just combined. 4. Melt 6 tablespoons butter in a skillet over medium-high heat; pour into the bottom of an 8x12-inch baking dish. Pour batter on top of melted butter and use a spatula to gently distribute batter without mixing it into butter, leaving a 1-inch butter border around the sides of the dish. 5. Scatter blackberries over the batter and spoon any accumulated blackberry juices over the top. 6. Bake buckle in the preheated oven until crisped and browned around the edges, about 1 hour. 7. Melt remaining butter in a small skillet over medium-high heat. Cook and stir almonds in hot butter until golden brown and toasted, 2 to 3 minutes. Sprinkle toasted almonds over blackberry buckle and cool buckle to room temperature.",
  "prep": "15 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 50 mins",
  "calories": "339"
},
{
  "url": "https://www.allrecipes.com/recipe/276476/gluten-free-gingersnap-cookies/",
  "name": "Gluten-Free Gingersnap Cookies",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "¾ cup unsalted butter, softened; ½ cup brown sugar; ½ cup unbleached cane sugar; 1  egg; ¼ cup blackstrap molasses; 1 teaspoon vanilla extract; 1 cup oat flour; ½ cup almond flour; ⅓ cup coconut flour; 1 (1/4 inch thick) slice fresh ginger, grated; 1 tablespoon ground ginger; 1 teaspoon baking soda; 1 teaspoon ground cinnamon; 1 teaspoon ground nutmeg; ½ teaspoon ground cloves; ¼ cup unbleached cane sugar, or as needed; ½ teaspoon ground cinnamon, or as needed; ¼ teaspoon ground nutmeg, or as needed",
  "directions": "1. Beat butter, brown sugar, and 1/2 cup cane sugar together in a bowl using an electric mixer until creamy. Add egg and mix to combine. Mix in molasses and vanilla extract. 2. Mix oat flour, almond flour, coconut flour, fresh ginger, ground ginger, baking soda, 1 teaspoon cinnamon, 1 teaspoon nutmeg, and cloves together in a separate bowl. Add to butter mixture slowly and combine. Refrigerate dough for at least 1 hour, to overnight; dough will be very wet before it's chilled. 3. Preheat the oven to 350 degrees F (175 degrees C). Line 2 large baking sheets with parchment paper. 4. Combine 1/4 cup cane sugar, 1/2 teaspoon cinnamon, and 1/4 teaspoon nutmeg in a shallow dish. 5. Scoop dough by tablespoonfuls and roll into balls. Roll balls in cinnamon-sugar mixture to coat and place onto the prepared baking sheets, making sure not to overcrowd the sheets as they will flatten and spread. 6. Bake in the preheated oven until set and golden, 10 to 12 minutes. Let cookies sit for 5 minutes before transferring to a wire rack to cool. Serve warm or let cool completely before storing in an airtight container.",
  "prep": "30 mins",
  "cook": "10 mins",
  "total": "1 hr 45 mins",
  "calories": "123"
},
{
  "url": "https://www.allrecipes.com/recipe/265673/keto-crackers/",
  "name": "Keto Crackers",
  "rating": "4.1",
  "ratingcount": "20",
  "ingredients": "½ cup shredded mozzarella cheese; ⅓ cup finely ground almond flour; ⅛ teaspoon garlic powder; ⅛ teaspoon salt; 1 large egg yolk",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper. 2. Combine mozzarella cheese, almond flour, garlic powder, and salt in a microwave-safe bowl. Heat in the microwave for 30 seconds. 3. Use your hands to knead mozzarella dough until fully mixed. Add egg yolk and continue kneading until completely blended into dough. 4. Lay a piece of parchment paper on a flat surface and place dough on top. Place a second piece of parchment paper on top of dough. Press down on dough with your hands until ready for a rolling pin. 5. Roll into a very thin rectangle with even sides. Gently poke holes in dough using a fork to prevent it from bubbling while baking. Cut dough into 1-inch squares with a knife. 6. Lay squares on the prepared baking sheet, leaving a little space between them 7. Bake in the preheated oven for 5 to 6 minutes. Remove the baking sheet from the oven and turn crackers over. Continue baking until lightly browned and crisp, about 2 more minutes. Watch them closely to prevent burning.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "11"
},
{
  "url": "https://www.allrecipes.com/recipe/265860/fresh-fruit-frangipane-tart/",
  "name": "Fresh Fruit Frangipane Tart",
  "rating": "4.7",
  "ratingcount": "13",
  "ingredients": "3  puff pastry rectangles; 1 ½ tablespoons butter, softened; ⅓ cup white sugar; 1 tablespoon white sugar; 1 large egg; ¾ cup almond flour; ¼ teaspoon fine salt; ⅛ teaspoon vanilla extract; ¼ teaspoon almond extract (Optional); 3  pluots, or to taste; 3 tablespoons apricot jam (Optional); 2 teaspoons water (Optional)",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Place 1 piece of puff pastry on a baking sheet lined with a silicone mat or parchment paper. Lightly moisten one of the short edges with water. Connect the end of other puff pastry to the moistened edge. Press pieces together to form a long rectangle, trimming off loose ends with a dough scraper as needed. 3. Cut third puff pastry piece lengthwise into 1-inch strips. Moisten the outer edges of the long rectangle with your finger; stick pastry strips on top. Poke shallow holes all over bottom of dough using a fork. Do not prick the raised border. 4. Bake pastry shell in the preheated oven until it starts to turn golden brown, about 15 minutes. Remove from oven. Reduce oven temperature to 375 degrees F (190 degrees C). Readjust the borders and push the bottom down with the flat side of a fork. Let cool completely while preparing filling. 5. Place butter and 1/3 cup plus 1 tablespoon sugar in a bowl; smear together using a spatula until combined. Whisk in egg until mixture is creamy. Add almond flour, salt, vanilla extract, and almond extract. Mix thoroughly. Cut each pluot into 6 wedges. Fill pastry shell with almond paste. Stick pluots snugly, but not too deeply, into filling. 6. Bake in the preheated oven until browned and almond filling is set, 30 to 40 minutes. Transfer tart onto a wire rack and let cool completely, at least 40 minutes. 7. Combine apricot jam and water in a microwave-safe bowl. Bring to a boil in the microwave. Let cool until warm. Brush glaze over cooled tart.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 55 mins",
  "calories": "397"
}]