[{
  "url": "https://www.allrecipes.com/recipe/10539/almond-shortbread-i/",
  "name": "Almond Shortbread I",
  "rating": "4.3",
  "ratingcount": "204",
  "ingredients": "1 cup butter, room temperature; ½ cup white sugar; 2 teaspoons almond extract; 2 ½ cups sifted all-purpose flour; ⅓ cup granulated sugar for decoration",
  "directions": "1. In a large bowl, beat butter with 1/2 cup sugar and almond extract until light and fluffy. With a wooden spoon, stir in flour until smooth and well combined. Divide dough into 2 parts. Wrap in plastic and refrigerate for 2 hours. 2. Preheat oven to 300 degrees F (150 degrees C). 3. On lightly sugared surface, roll out dough, one part at a time, about 1/2-inch thick. Cut out cookies with a 1 1/2-inch round cookie cutter. Place on ungreased cookie sheet 1 inch apart. Make an indentation in the center of each cookie with the end of a wooden spoon. 4. Bake in preheated oven until cookies are light golden brown around the edges, 25 to 30 minutes. While still warm, roll in sugar. Cool completely on a wire rack. Store in an air-tight container.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "2 hrs 40 mins",
  "calories": "191"
},
{
  "url": "https://www.allrecipes.com/recipe/146819/spooky-witches-fingers/",
  "name": "Spooky Witches' Fingers",
  "rating": "4.5",
  "ratingcount": "852",
  "ingredients": "1 cup butter, softened; 1 cup confectioners' sugar; 1  egg; 1 teaspoon almond extract; 1 teaspoon vanilla extract; 2 ⅔ cups all-purpose flour; 1 teaspoon baking powder; 1 teaspoon salt; ¾ cup whole almonds; 1 (.75 ounce) tube red decorating gel",
  "directions": "1. Combine the butter, sugar, egg, almond extract, and vanilla extract in a mixing bowl. Beat together with an electric mixer; gradually add the flour, baking powder, and salt, continually beating; refrigerate 20 to 30 minutes. 2. Preheat oven to 325 degrees F (165 degrees C). Lightly grease baking sheets. 3. Remove dough from refrigerator in small amounts. Scoop 1 heaping teaspoon at a time onto a piece of waxed paper. Use the waxed paper to roll the dough into a thin finger-shaped cookie. Press one almond into one end of each cookie to give the appearance of a long fingernail. Squeeze cookie near the tip and again near the center of each to give the impression of knuckles. You can also cut into the dough with a sharp knife at the same points to help give a more finger-like appearance. Arrange the shaped cookies on the baking sheets. 4. Bake in the preheated oven until the cookies are slightly golden in color, 20 to 25 minutes. 5. Remove the almond from the end of each cookie; squeeze a small amount of red decorating gel into the cavity; replace the almond to cause the gel to ooze out around the tip of the cookie.",
  "prep": "35 mins",
  "cook": "20 mins",
  "total": "1 hr 15 mins",
  "calories": "68"
},
{
  "url": "https://www.allrecipes.com/recipe/261939/crunchy-sugar-free-granola/",
  "name": "Crunchy Sugar-Free Granola",
  "rating": "4.7",
  "ratingcount": "13",
  "ingredients": "3 ¾ cups rolled oats; ½ cup chopped almonds; ¼ cup dried unsweetened coconut; ¼ cup sesame seeds; 2 teaspoons ground cinnamon; ¼ teaspoon salt; 3  large egg whites; 1 teaspoon vanilla extract (Optional)",
  "directions": "1. Preheat oven to 225 degrees F (110 degrees C). Line a baking sheet with parchment paper. 2. Combine oats, almonds, coconut, sesame seeds, cinnamon, and salt in a large bowl. 3. Beat egg whites in a glass, metal, or ceramic bowl until stiff peaks form. Beat in vanilla extract. Fold egg whites into the oat mixture. Spread on the prepared baking sheet. 4. Bake in the preheated oven, stirring every 20 minutes, until granola is crispy, about 1 hour.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "332"
},
{
  "url": "https://www.allrecipes.com/recipe/15723/vaselopita-greek-new-years-cake/",
  "name": "Vaselopita - Greek New Years Cake",
  "rating": "4.5",
  "ratingcount": "74",
  "ingredients": "1 cup butter; 2 cups white sugar; 3 cups all-purpose flour; 6  eggs; 2 teaspoons baking powder; 1 cup warm milk (110 degrees F/45 degrees C); ½ teaspoon baking soda; 1 tablespoon fresh lemon juice; ¼ cup blanched slivered almonds; 2 tablespoons white sugar",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Generously grease a 10 inch round cake pan. 2. In a medium bowl, cream the butter and sugar together until light. Stir in the flour and mix until the mixture is mealy. Add the eggs one at a time, mixing well after each addition. Combine the baking powder and milk, add to the egg mixture, mix well. Then combine the lemon juice and baking soda, stir into the batter. Pour into the prepared cake pan. 3. Bake for 20 minutes in the preheated oven. Remove and sprinkle the nuts and sugar over the cake, then return it to the oven for 20 to 30 additional minutes, until cake springs back to the touch. Gently cut a small hole in the cake and place a quarter in the hole. Try to cover the hole with sugar. Cool cake on a rack for 10 minutes before inverting onto a plate. 4. Serve cake warm. Each person in the family gets a slice starting with the youngest. The person who gets the quarter in their piece, gets good luck for the whole year!",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "447"
},
{
  "url": "https://www.allrecipes.com/recipe/239620/bread-machine-almond-bread/",
  "name": "Bread Machine Almond Bread",
  "rating": "4.8",
  "ratingcount": "12",
  "ingredients": "1 ¼ cups water; 4 teaspoons almond oil; 1 teaspoon salt; ¼ cup honey; 1 cup almond flour; 2 cups whole wheat flour; ¼ cup vital wheat gluten; 1 teaspoon xanthan gum; 1 (.25 ounce) package dry yeast",
  "directions": "1. Combine water, almond oil, salt, honey, almond flour, whole wheat flour, vital wheat gluten, xanthan gum, and yeast, respectively in a bread machine. Follow manufacturers' instructions for a 2-pound loaf.",
  "prep": "10 mins",
  "cook": "",
  "total": "3 hrs 10 mins",
  "calories": "117"
},
{
  "url": "https://www.allrecipes.com/recipe/282681/lace-cookies-florentine-cookies/",
  "name": "Lace Cookies (Florentine Cookies)",
  "rating": "4.2",
  "ratingcount": "22",
  "ingredients": "1 ½ cups whole raw almonds; ½ cup unsalted butter; ¾ cup light brown sugar; ¼ cup honey; ½ teaspoon vanilla extract; 1 pinch salt; 3 tablespoons all-purpose flour; 1 cup semisweet chocolate chips, melted",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with a silicone liner (such as Silpat®). 2. Place almonds into the bowl of a food processor; alternate pulsing and running at full speed every few seconds until finely chopped and crumblike. Be careful not to go too far; you don't want them too fine and pasty. 3. Combine butter, brown sugar, and honey in a saucepan over medium heat. Stir a few times and cook until melted and dissolved. Bring to a boil, then carefully remove from the heat. 4. Add vanilla extract, salt, and flour, and whisk until smooth. Add chopped almonds and mix with a spatula until everything is combined. 5. Drop eight uniformly sized, rounded spoonfuls of batter (each about 2 teaspoons, or 15 grams) onto the prepared sheet. Fine-tune the cookie shapes and make sure they are evenly spaced. 6. Place in the center of the preheated oven and bake until golden brown and a bit darker around the outsides, 10 to 12 minutes, rotating the pan halfway through. 7. Remove from the oven and slide the silicone liner off the baking sheet and directly onto the countertop. Allow to sit until cool and crisp, 3 to 5 minutes, then gently peel cookies off the liner. Repeat to bake remaining batches. 8. Spread melted chocolate over the flat side of one cookie. Place a second cookie, flat-side down, on top to make a sandwich and press very gently to seal. Repeat to form remaining cookies. Let sit until chocolate has firmed up, about 30 minutes.",
  "prep": "50 mins",
  "cook": "1 hr",
  "total": "2 hrs 20 mins",
  "calories": "213"
},
{
  "url": "https://www.allrecipes.com/recipe/159901/almond-bear-claws/",
  "name": "Almond Bear Claws",
  "rating": "4.6",
  "ratingcount": "41",
  "ingredients": "⅓ cup almond paste; 2 ¾ cups ground almonds; ½ cup white sugar; 1 pinch salt; 2 tablespoons butter; 2  egg whites; ½ teaspoon almond extract; 2 teaspoons amaretto liqueur; 3 pounds puff pastry; 1  egg; 1 tablespoon water; 3 tablespoons sliced almonds, for garnish; 3 tablespoons confectioners' sugar for dusting",
  "directions": "1. In a large bowl, beat almond paste with an electric mixer to break it apart. Add the almonds, sugar, and salt; continue to mix until the almond paste is no longer lumpy. Stir in the butter, egg whites, almond extract and amaretto liqueur on high speed until its as fluffy as you can get it. Set aside. 2. Using half of the dough at a time, roll it out on a lightly floured surface into a rectangle that is about 8 inches wide and 1/4 inch thick. Trim the edges of the dough. Cut the dough in half lengthwise to make two 4 inch wide strips. 3. Preheat the oven to 400 degrees F (200 degrees C). Line baking sheets with parchment paper. 4. Fill a pastry bag halfway with the almond filling and pipe a stripe of filling down the center of each strip. Whisk together the egg and water. Brush onto one edge of each strip. Fold each strip over the filling and press gently to seal it. Brush each piece with egg wash and sprinkle sliced almonds over the top. Cut into 3 to 4 inch pieces, then cut 1/2 inch slits into the sealed edge to make the ''claws''. Place the bear claws at least two inches apart on baking sheets. Refrigerate and repeat with the second half of the dough. 5. Bake in the preheated oven until almonds are toasted and pastry is golden brown, 25 to 30 minutes. Cool and dust with confectioners' sugar right before serving.",
  "prep": "2 hrs",
  "cook": "25 mins",
  "total": "2 hrs 25 mins",
  "calories": "419"
},
{
  "url": "https://www.allrecipes.com/recipe/80734/galette-des-rois/",
  "name": "Galette des Rois",
  "rating": "4.9",
  "ratingcount": "52",
  "ingredients": "¼ cup almond paste; ¼ cup white sugar; 3 tablespoons unsalted butter, softened; 1  egg; ¼ teaspoon vanilla extract; ¼ teaspoon almond extract; 2 tablespoons all-purpose flour; 1 pinch salt; 1 (17.25 ounce) package frozen puff pastry, thawed; 1  dry kidney bean; 1  egg, beaten; 1 tablespoon confectioners' sugar for dusting",
  "directions": "1. Place the almond paste into a food processor or blender with about half of the sugar, and process until well blended. Add the butter and remaining sugar using and process until smooth, then blend in 1 egg, vanilla extract, almond extract, flour and salt. Set aside. 2. Preheat the oven to 425 degrees F (220 degrees C). Butter a baking sheet or line with parchment paper, and set aside. 3. Roll out one sheet of the puff pastry into an 11-inch square. Keep the pastry cool, do not knead or stretch. Use a large pie plate, cake pan or frying pan to trace an 11 inch circle onto the dough using the tip of a small knife. Place the circle of pastry onto the prepared baking sheet. Repeat with the second sheet of pastry. Refrigerate both sheets. 4. Mound the almond filling onto the center of the pastry that is on the baking sheet. Leave about 1 1/2 inch margin at the edges. Press the bean or feve down into the filling. Place the second sheet of pastry on top, and press down the edges to seal. Beat the remaining egg with a fork, and lightly brush onto the top of the galette. Use a knife to make a crisscross pattern in the egg wash, and then prick several small slits in the top to vent steam while baking. 5. Bake for 15 minutes in the preheated oven. Do not open the oven until the time is up, as the pastry will not fully puff. Remove from the oven, and dust with confectioners' sugar. Return to the oven, and cook for an additional 12 to 15 minutes, or until the top is a deep golden brown. Transfer to a wire rack to cool. 6. Lay a golden paper crown gently on top of the cake. This will be used to crown the person who finds the bean or feve. Serve warm or cold. Make sure to tell everyone about the bean or feve.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/159939/almond-crusted-tilapia/",
  "name": "Almond-Crusted Tilapia",
  "rating": "4.5",
  "ratingcount": "509",
  "ingredients": "2  eggs; 1 teaspoon lemon pepper; 1 teaspoon garlic pepper; 1 cup ground almonds; 1 cup freshly grated Parmesan cheese; 8 (6 ounce) tilapia fillets; ¼ cup all-purpose flour for dusting; 6 tablespoons butter; salt to taste; 1 cup freshly grated Parmesan cheese; 8 sprigs parsley; 8  lemon wedges",
  "directions": "1. Beat the eggs with the lemon pepper and garlic pepper until blended; set aside. Stir together ground almonds with 1 cup of Parmesan cheese in a shallow dish until combined; set aside. Dust the tilapia fillets with flour, and shake off excess. Dip the tilapia in egg, then press into the almond mixture. 2. Melt butter in a large skillet over medium-high heat. Cook tilapia in melted butter until golden brown on both sides, 2 to 3 minutes per side. Reduce heat to medium, and season fillets with salt if desired. Sprinkle the tilapia with the remaining Parmesan cheese, cover, and continue cooking until the Parmesan cheese has melted, about 5 minutes. 3. Transfer the tilapia to a serving dish, and garnish with parsley springs and lemon wedges to serve.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "424"
},
{
  "url": "https://www.allrecipes.com/recipe/171151/sweet-and-spicy-almonds/",
  "name": "Sweet and Spicy Almonds",
  "rating": "4.8",
  "ratingcount": "132",
  "ingredients": "¼ cup white sugar; 1 ½ teaspoons kosher salt; 1 teaspoon cayenne pepper; 2 ½ cups whole almonds; 1 tablespoon water; 1 tablespoon honey; 1 teaspoon olive oil",
  "directions": "1. Preheat an oven to 350 degrees F (175 degrees C). Spread the almonds onto a baking sheet, and toast until the nuts start to turn golden brown and become fragrant, about 10 minutes. Watch the nuts carefully as they bake: they burn quickly. 2. Stir together the sugar, salt, and cayenne pepper in a mixing bowl; set aside. 3. Stir together the water, honey, and olive oil in a large skillet over medium heat. Once the mixture begins to bubble, stir in the toasted almonds until evenly moistened. Pour the almonds into the sugar and spice mixture, and toss until evenly coated. Spread onto baking sheets in a single layer, and cool to room temperature.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "1 hr 25 mins",
  "calories": "236"
},
{
  "url": "https://www.allrecipes.com/recipe/215385/devils-on-horseback/",
  "name": "Devils on Horseback",
  "rating": "4.6",
  "ratingcount": "52",
  "ingredients": "20  wooden toothpicks; ¼ cup reduced-sodium soy sauce; ½ teaspoon ground ginger; ¾ cup dark brown sugar; 20  dates, pitted and left whole; 20  whole smoked almonds; 10  bacon slices, cut in half crosswise",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Soak the toothpicks in a bowl of water. Grease a 9x13-inch baking dish. 2. In a bowl, mix together the soy sauce and ground ginger. Place the brown sugar into a shallow bowl. Spread open a pitted date, then stuff it with a smoked almond. Wrap the date with half a bacon slice, secure it with a toothpick, dip the bundle in soy sauce mixture, and then dip it into brown sugar. Place the wrapped dates into the prepared baking dish. If desired, sprinkle a little more brown sugar over the bundles. 3. Bake in the preheated oven until the bacon is brown and crisp, 15 to 25 minutes. Allow to cool for about 15 minutes before serving; serve warm or at room temperature.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "1 hr",
  "calories": "118"
},
{
  "url": "https://www.allrecipes.com/recipe/64780/danish-almond-puff/",
  "name": "Danish Almond Puff",
  "rating": "4.4",
  "ratingcount": "50",
  "ingredients": "1 cup all-purpose flour; ½ cup butter, softened; 2 tablespoons water; ½ cup butter; 1 cup water; 1 teaspoon almond extract; 3  eggs, beaten; 1 cup all-purpose flour; 1 cup confectioners' sugar; 1 teaspoon almond extract; 1 tablespoon milk, or as needed; 2 tablespoons candy sprinkles",
  "directions": "1. Place 1 cup of flour in a medium bowl. Mix in butter using a fork or a pastry blender. Sprinkle 2 tablespoons of water over, and stir with a fork until dough comes together. Divide into two balls. Pat dough into two long strips on an ungreased baking sheet, about 14 inches long and 3 inches wide. Set aside. 2. Preheat the oven to 350 degrees F (175 degrees C). 3. In a saucepan, combine 1/2 cup of butter and 1 cup of water. Bring to a rolling boil. Add 1 teaspoon of almond extract and remove from the heat. Immediately stir in 1 cup of flour until the mixture pulls away from the sides of the pan. Gradually stir in the eggs until well blended. Divide evenly, and spread over the two crusts on the baking sheet. 4. Bake in the preheated oven until golden, about 1 hour. Allow to cool almost to room temperature before frosting. 5. To make the frosting, mix together the confectioners' sugar, 1 teaspoon of almond extract and a splash of milk in a small bowl until smooth. Add more milk if necessary to make a pourable glaze. Drizzle over the Danish, and decorate with candy sprinkles if desired.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "2 hrs",
  "calories": "424"
},
{
  "url": "https://www.allrecipes.com/recipe/23746/italian-almond-cookies-ii/",
  "name": "Italian Almond Cookies II",
  "rating": "4.5",
  "ratingcount": "103",
  "ingredients": "2 pounds almond paste; 1 cup all-purpose flour; 8  egg whites; 2 cups white sugar; 2 cups confectioners' sugar; 2 cups sliced almonds",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. 2. In a large bowl, use your hands to mix together the almond paste, flour, egg whites, white sugar and confectioners' sugar until well blended. The mixture will be very sticky. Place the sliced almonds into a small bowl. Scoop out rounded teaspoonfuls of the dough and drop them into the almonds. Roll until completely coated. Place 2 inches apart onto the prepared cookie sheets. 3. Bake for 15 to 20 minutes in the preheated oven, until golden brown. Cool on cookie sheets for a few minutes before removing to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "116"
},
{
  "url": "https://www.allrecipes.com/recipe/15779/chocolate-almond-bark/",
  "name": "Chocolate Almond Bark",
  "rating": "4.3",
  "ratingcount": "57",
  "ingredients": "½ cup chopped almonds; 2 cups milk chocolate chips; 1 tablespoon shortening",
  "directions": "1. Line a 9x13 inch baking pan with parchment paper. Set aside. Put chopped almonds In a skillet. Cook, stirring often over medium high heat, until golden brown. Remove from heat. 2. In a metal bowl over a pan of simmering water, melt chocolate chips and shortening until smooth. Remove from heat and stir in 1/2 the toasted almonds. Spread onto the prepared baking pan. Sprinkle with remaining almonds, and chill 30 minutes, or until solid. Break into bite-size pieces to serve.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "45 mins",
  "calories": "130"
},
{
  "url": "https://www.allrecipes.com/recipe/283483/almond-ricotta-cake/",
  "name": "Almond Ricotta Cake",
  "rating": "4.3",
  "ratingcount": "13",
  "ingredients": "½ cup unsalted butter, at room temperature; ¾ cup white sugar; 2 teaspoons vanilla sugar; 1 large lemon, zested and juiced; 4 large eggs, separated; 2 cups blanched almond flour; 9 ounces ricotta cheese; ⅓ cup white sugar; ¼ cup sliced almonds, or to taste; 1 tablespoon confectioners' sugar for dusting",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease an 8-inch springform pan and line with parchment paper. 2. Combine butter and 3/4 cup sugar in a large bowl; beat with an electric mixer until creamy, about 3 minutes. Add vanilla sugar, lemon zest, and lemon juice; mix until well combined. Add egg yolks, 1 at a time, beating well after each addition. 3. Fold in almond flour and ricotta cheese with a silicone spatula. 4. Wash and dry the beaters and beat egg whites in a glass, metal, or ceramic bowl until foamy. Gradually add 1/3 cup sugar, continuing to beat until stiff peaks form. Fold stiff egg whites into the batter. Pour batter into the prepared pan. Sprinkle with sliced almonds. 5. Bake on the center rake of the preheated oven until edges of the cake are lightly browned, about 50 minutes. Cake will still be a little wobbly in the middle. 6. Remove from the oven and let the cake to cool completely in the pan before transferring to a cake platter, about 1 hour. Dust with confectioners' sugar before serving.",
  "prep": "20 mins",
  "cook": "50 mins",
  "total": "2 hrs 10 mins",
  "calories": "397"
},
{
  "url": "https://www.allrecipes.com/recipe/11593/italian-biscotti/",
  "name": "Italian Biscotti",
  "rating": "4.7",
  "ratingcount": "219",
  "ingredients": "12 ounces butter; 1 ¾ cups white sugar; 6  eggs; 1 teaspoon anise extract; 2 teaspoons vanilla extract; 6 cups all-purpose flour; ½ teaspoon salt; 2 teaspoons baking powder; 8 ounces chopped almonds",
  "directions": "1. Preheat oven to 350 degrees F ( 165 degrees C ). 2. In a large bowl, cream the butter and sugar together. Add eggs one at a time; beat until fluffy. Stir in the anise and vanilla extracts. Sift together the flour, baking powder, and salt; Add them to the egg mixture along with the chopped almonds. Stir with a spoon and as the dough comes together, Knead by hand. 3. Divide the dough into 4 parts. Roll each piece into a log about 15 inches long. Place logs onto cookie sheets, 2 to a sheet, the long way. Flatten the logs out until they are about 3 inches wide with a slight hump going down the middle. Bake for 25 to 30 minutes in the preheated oven, loaves should be firm. Cut the loaves into diagonal slices 1/2 inch wide, place the slices onto the cookie sheets and return to the oven. Toast on one side, then turn them over to do the other side. This will take about 7 to 10 minutes.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "275"
},
{
  "url": "https://www.allrecipes.com/recipe/281636/air-fryer-roasted-almonds/",
  "name": "Air Fryer Roasted Almonds",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "¾ tablespoon very hot water; ¾ teaspoon Himalayan pink salt, or to taste; 2 cups raw almonds; 1 tablespoon olive oil; salt to taste",
  "directions": "1. Preheat an air fryer to 325 to 350 degrees F (165 to 175 degrees C) according to manufacturer's instructions. Line a baking sheet with aluminum foil. 2. Combine water and 3/4 teaspoon pink salt in a small shot glass; stir until salt is mostly dissolved. 3. Place almonds in a medium ceramic or stainless mixing bowl and pour salt water over top; stir until coated. Spread almonds evenly on the prepared baking sheet. 4. Bake in the preheated air fryer for 6 to 7 minutes. Remove baking sheet, stir almonds, and return to the air fryer; bake until almonds turn brown inside, 5 to 6 minutes more. 5. Transfer almonds back to the mixing bowl, add olive oil and salt, and stir until completely coated. Allow to cool before serving, either in the bowl or spread out on the counter.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "220"
},
{
  "url": "https://www.allrecipes.com/recipe/7401/rich-dark-fruitcake/",
  "name": "Rich Dark Fruitcake",
  "rating": "4.8",
  "ratingcount": "35",
  "ingredients": "6 cups golden raisins; 3 cups dried currants; 1 ½ cups pitted dates; 6 cups raisins; 1 pound candied mixed citrus peel; ½ pound candied cherries; 2 cups almonds; 2 cups butter; 3 ¼ cups all-purpose flour; 3 teaspoons baking powder; ½ teaspoon baking soda; ½ teaspoon salt; 2 teaspoons ground allspice; 4 teaspoons ground cinnamon; 1 teaspoon ground nutmeg; ½ teaspoon ground cloves; 1 tablespoon vanilla extract; 1 tablespoon almond extract; 2 cups white sugar; 12  egg yolks; ½ cup molasses; 12  egg whites; ½ cup grape juice; ½ cup strong brewed coffee",
  "directions": "1. Wash and dry the raisins and the currants. Wash, dry, pit, and chop the dates. Chop the raisins and the citrus peel. Slice the cherries. Blanch the almonds, and slice them lengthwise. Combine fruits and nuts in large bowl. 2. Grease and line 3 standard Christmas cake pans (these round pans are at least 3 inches deep and come in a set of three sizes- 5, 7, and 9 inch across) with 4 layers of heavy waxed paper, or 3 layers of brown paper. Grease again. Preheat oven to 275 degrees F (135 degrees C). 3. Sift together flour, baking powder, soda, salt, and spices onto a piece of waxed paper. Remove 1 cup of this flour mixture, and combine with fruit and nuts. Mix until fruit is well coated. 4. Cream the butter until fluffy. Add extracts. Gradually add sugar, mixing until creamy. Beat egg yolks until light and lemon-colored, and beat into the butter mixture. Stir in the molasses, and beat together well. Add half of the remaining flour mixture, and blend thoroughly. 5. Beat egg whites until stiff but not dry; fold into batter. Stir in lightly the remaining flour mixture alternately with grape juice and coffee. Add floured fruit and nuts, blending in until fruit is well distributed. 6. Turn batter into prepared cake tins, filling each about 2/3 full and spreading batter evenly. Bake in center of oven. Bake small cake 2 1/2 hours, medium cake 3 1/2 hours, and large cake 4 to 4 1/2 hours. Remove from oven and allow to stand 5 minutes, then turn out on wire rack to cool.",
  "prep": "1 hr",
  "cook": "4 hrs 30 mins",
  "total": "6 hrs",
  "calories": "451"
},
{
  "url": "https://www.allrecipes.com/recipe/15034/mandarin-almond-salad/",
  "name": "Mandarin Almond Salad",
  "rating": "4.6",
  "ratingcount": "254",
  "ingredients": "1 head romaine lettuce - rinsed, dried and chopped; 2 (11 ounce) cans mandarin oranges, drained; 6  green onions, thinly sliced; 2 tablespoons white sugar; ½ cup sliced almonds; ¼ cup red wine vinegar; ½ cup olive oil; 1 tablespoon white sugar; ⅛ teaspoon crushed red pepper flakes; ground black pepper to taste",
  "directions": "1. In a large bowl, combine the romaine lettuce, oranges and green onions. 2. Heat 2 tablespoons sugar with the almonds in saucepan over medium heat. Cook and stir while sugar starts to melt and coat almonds. Stir constantly until almonds are light brown. Turn onto a plate, and cool for 10 minutes. 3. Combine red wine vinegar, olive oil, one tablespoon sugar, red pepper flakes and black pepper in a jar with a tight fitting lid. Shake vigorously until sugar is dissolved. 4. Before serving, toss lettuce with salad dressing until coated. Transfer to a decorative serving bowl, and sprinkle with sugared almonds.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "235"
},
{
  "url": "https://www.allrecipes.com/recipe/7740/marzipan/",
  "name": "Marzipan",
  "rating": "3.6",
  "ratingcount": "22",
  "ingredients": "2 cups confectioners' sugar; ½ pound finely ground blanched almonds; 2  egg whites; ½ teaspoon salt; ½ teaspoon almond extract",
  "directions": "1. Blend the confectioner's sugar, finely ground almonds, egg whites, salt, and almond extract in a blender until perfectly blended. Cover and chill until firm, 24 hours.",
  "prep": "30 mins",
  "cook": "",
  "total": "1 day 30 mins",
  "calories": "143"
},
{
  "url": "https://www.allrecipes.com/recipe/256321/dark-chocolate-almond-rocks/",
  "name": "Dark Chocolate Almond Rocks",
  "rating": "4.8",
  "ratingcount": "14",
  "ingredients": "½ cup almonds, crushed into chunks; 7 ounces dark chocolate chips (50% cacao)",
  "directions": "1. Spread almonds in a large skillet; toast over medium heat until starting to brown, 3 to 5 minutes. Pour almonds into a bowl. 2. Melt chocolate in top of a double boiler over simmering water, stirring frequently and scraping down the sides to avoid scorching, about 5 minutes. Remove from heat; pour in almonds and stir until evenly coated. 3. Drop spoonfuls of chocolate-almond mixture onto a plate lined with waxed paper. 4. Chill until set, about 10 minutes.",
  "prep": "10 mins",
  "cook": "8 mins",
  "total": "28 mins",
  "calories": "60"
},
{
  "url": "https://www.allrecipes.com/recipe/228025/bircher-muesli-swiss-oatmeal/",
  "name": "Bircher Muesli (Swiss Oatmeal)",
  "rating": "4.7",
  "ratingcount": "46",
  "ingredients": "2 cups rolled oats; 1  green apple, chopped; 1 cup 2% milk; 1 cup nonfat plain yogurt; 1  banana, chopped; ¼ cup raisins; 1 tablespoon chopped walnuts; 1 tablespoon slivered almonds; 1 tablespoon brown sugar; 1 tablespoon honey; 1 tablespoon orange juice",
  "directions": "1. Mix oats, apple, milk, yogurt, banana, raisins, walnuts, almonds, brown sugar, honey, and orange juice together in a bowl. Chill in refrigerator for at least 1 hour to set.",
  "prep": "15 mins",
  "cook": "",
  "total": "1 hr 15 mins",
  "calories": "344"
},
{
  "url": "https://www.allrecipes.com/recipe/231553/easy-almond-butter-cookies/",
  "name": "Easy Almond Butter Cookies",
  "rating": "4.2",
  "ratingcount": "50",
  "ingredients": "2 cups all-purpose flour; 1 cup crushed almonds; 1 cup butter, softened; 7 tablespoons white sugar; ½ teaspoon vanilla extract; ½ teaspoon almond extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Mix all-purpose flour, almonds, butter, sugar, vanilla extract, and almond extract in a large bowl until well blended. 3. Roll the dough into walnut-sized balls and place 2 inches apart onto ungreased baking sheets. 4. Bake in preheated oven until golden brown, about 15 minutes.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "143"
},
{
  "url": "https://www.allrecipes.com/recipe/10396/almond-squares-ii/",
  "name": "Almond Squares II",
  "rating": "4.5",
  "ratingcount": "89",
  "ingredients": "1 cup butter; ¾ cup white sugar; 1  egg; ½ cup almond paste; 1 teaspoon almond extract; 2 cups all-purpose flour; 2 ½ ounces sliced almonds",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Cream butter in a large mixing bowl; gradually add sugar, beating until light and fluffy. Add egg yolk (reserve egg white), almond paste, and flavoring; beat until well blended. Stir in flour. 3. Spread mixture in a 13 x 9 x 2 inch baking pan. Beat egg white (at room temperature) until foamy; brush over entire surface of dough, and sprinkle with almonds. Bake for 35 minutes or until lightly browned. Cool thoroughly, and cut into 2 inch squares. Store in airtight containers.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "345"
},
{
  "url": "https://www.allrecipes.com/recipe/259205/fluffy-keto-pancakes/",
  "name": "Fluffy Keto Pancakes",
  "rating": "4.4",
  "ratingcount": "66",
  "ingredients": "1 cup almond flour; ¼ cup coconut flour; 2 tablespoons low-calorie natural sweetener (such as Swerve®); 1 teaspoon salt; 1 teaspoon baking powder; ½ teaspoon ground cinnamon (Optional); 6  eggs, at room temperature; ¼ cup heavy whipping cream, at room temperature; 2 tablespoons butter, melted; 1 teaspoon vanilla extract",
  "directions": "1. Mix almond flour, coconut flour, sweetener, salt, baking powder, and cinnamon together in a bowl. Whisk in eggs, heavy cream, butter, and vanilla extract slowly until batter is just blended. 2. Heat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "383"
},
{
  "url": "https://www.allrecipes.com/recipe/72467/gulab-jamun/",
  "name": "Gulab Jamun",
  "rating": "3.7",
  "ratingcount": "47",
  "ingredients": "1 cup dry milk powder; 3 tablespoons all-purpose flour; 2 tablespoons ghee (clarified butter), melted; ½ teaspoon baking powder; ½ cup warm milk; 1 tablespoon chopped almonds (Optional); 1 tablespoon chopped pistachio nuts (Optional); 1 tablespoon golden raisins (Optional); 1 pinch ground cardamom; 1 quart vegetable oil for deep frying; 1 ¼ cups white sugar; 7 fluid ounces water; 1 teaspoon rose water; 1 pinch ground cardamom",
  "directions": "1. In a large bowl, stir together the milk powder, flour, baking powder, and cardamom. Stir in the almonds, pistachios and golden raisins. Mix in the melted ghee, then pour in the milk, and continue to mix until well blended. Cover and let rest for 20 minutes. 2. In a large skillet, stir together the sugar, water, rose water and a pinch of cardamom. Bring to a boil, and simmer for just a minute. Set aside. 3. Fill a large heavy skillet halfway with oil. Heat over medium heat for at least 5 minutes. Knead the dough, and form into about 20 small balls. Reduce the heat of the oil to low, and fry the balls in one or two batches. After about 5 minutes, they will start to float, and expand to twice their original size, but the color will not change much. After the jamun float, increase the heat to medium, and turn them frequently until light golden. Remove from the oil to paper towels using a slotted spoon, and allow to cool. Drain on paper towels and allow to cool slightly. 4. Place the balls into the skillet with the syrup. Simmer over medium heat for about 5 minutes, squeezing them gently to soak up the syrup. Serve immediately, or chill.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "144"
},
{
  "url": "https://www.allrecipes.com/recipe/260575/chef-johns-almond-biscotti/",
  "name": "Chef John's Almond Biscotti",
  "rating": "4.8",
  "ratingcount": "73",
  "ingredients": "2 cups all-purpose flour; 1 teaspoon baking powder; ¼ teaspoon fine salt; 3 tablespoons unsalted butter, room temperature; 1 cup white sugar; 1 tablespoon white sugar; 1 tablespoon olive oil; 2  large eggs; ¼ teaspoon vanilla extract; ¾ teaspoon almond extract; ½ cup whole roasted almonds; ½ cup chopped roasted almonds",
  "directions": "1. Whisk flour, baking powder, and salt together in a mixing bowl. 2. Place butter, 1 cup plus 1 tablespoon sugar, olive oil in a separate mixing bowl. Mix together thoroughly until mixture has a creamy texture. Add 1 egg; mix into butter/sugar mixture. Whisk in 2nd egg, vanilla extract, and almond extract; whisk until smooth. Add flour mixture. Mix until flour is incorporated. Add whole almonds and chopped almonds; mix in evenly. Cover bowl with plastic wrap; refrigerate 30 minutes. 3. Preheat oven to 350 degrees F (175 degrees C). Line a rimmed baking sheet with a silicone mat. 4. Divide dough in half. Place each half on a length of plastic wrap and shape into a log. Wrap with the plastic wrap and press into a shape about 3 or 4 inches wide and about 1/2 inch high. Transfer both pieces to prepared baking sheet leaving about 3 or 4 inches of space between them to allow for spreading. 5. Bake in center of preheated oven until turning golden and a toothpick inserted into the center comes out clean, about 30 minutes. Let cool 15 minutes before slicing. 6. Reduce oven temperature to 325 degrees F (165 degrees C). 7. Cut each piece at a slight angle into 1/2- to 1 -inch thick slices with a serrated knife. Transfer pieces back to baking sheet in a single layer. Bake 12 minutes; remove from oven and flip pieces over. Return pan to oven and bake until biscotti are golden brown and crunchy, about 20 minutes. 8. Transfer biscotti to a cooling rack; let cool to room temperature.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "2 hrs",
  "calories": "200"
},
{
  "url": "https://www.allrecipes.com/recipe/10453/tea-cookies-i/",
  "name": "Tea Cookies I",
  "rating": "4.5",
  "ratingcount": "63",
  "ingredients": "1 cup butter, softened; ½ cup confectioners' sugar; 1 ½ teaspoons vanilla extract; 2 cups all-purpose flour; 1 pinch salt; 1 ½ teaspoons baking powder; ¾ cup chopped walnuts; ⅓ cup confectioners' sugar for dusting",
  "directions": "1. Beat together the butter and confectioners' sugar till creamy. Add vanilla. 2. Mix the dry ingredients, stir into creamy mixture. Blend well. 3. Add the nuts, mix well, roll the dough out into two balls. Wrap in plastic wrap and chill for at least 1 hour in the refrigerator. 4. Flatten dough out and cut into 15 or 20 equal size pieces, shape into balls. Place on ungreased cookie sheet. 5. Bake at 375 degrees F (190 degrees C) for 10 to 12 minutes till firm but not brown. While still warm roll into confectioners' sugar, let cool and roll again.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "295"
},
{
  "url": "https://www.allrecipes.com/recipe/11433/banket/",
  "name": "Banket",
  "rating": "4.7",
  "ratingcount": "63",
  "ingredients": "2 cups all-purpose flour; 1 cup butter; ½ cup water; 1 ½ cups almond paste; 2  eggs; ¾ cup white sugar; ¼ teaspoon almond extract; 1 pinch salt; 1  egg white, beaten",
  "directions": "1. In a large bowl, cut cold butter or margarine into flour until the mixture has a crumb-like texture. Make a well in the center, add cold water. Mix together until the mixture forms a ball. Do not overmix. Chill dough. 2. Preheat oven to 450 degrees F (225 degrees C). Grease cookie sheets. 3. In a medium bowl, blend together almond paste, eggs, 3/4 cup sugar, almond extract and salt. 4. Divide dough in 4 parts, and roll into 15 inch strips. Place filling along the center of each long strip of dough. Roll up, and pinch the ends to seal. Place strips 2 inches apart on cookie sheet. Brush with egg white, and sprinkle with the remaining sugar. 5. Bake for 15 to 20 minutes, or until golden.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "202"
},
{
  "url": "https://www.allrecipes.com/recipe/25247/rice-with-almonds-and-raisins/",
  "name": "Rice with Almonds and Raisins",
  "rating": "4.4",
  "ratingcount": "42",
  "ingredients": "1 tablespoon butter; ⅓ cup finely chopped onion; 1 cup uncooked white rice; 2 tablespoons raisins; 1 ½ cups chicken broth; salt and pepper to taste; ¼ cup sliced almonds",
  "directions": "1. Melt butter in a medium saucepan over medium heat. Saute onion, stirring, until tender. Stir in the rice, raisins, broth, salt and pepper. Bring to a boil. 2. Reduce heat to low, cover and simmer 15 to 20 minutes, or until rice is cooked and liquid is absorbed. Stir in almonds before serving.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "262"
},
{
  "url": "https://www.allrecipes.com/recipe/182298/romesco-sauce/",
  "name": "Romesco Sauce",
  "rating": "4.6",
  "ratingcount": "59",
  "ingredients": "6  roma (plum) tomatoes, halved; 1 large red bell pepper, quartered; 12 cloves garlic; ⅔ cup olive oil; kosher salt to taste; 1 slice bread; ½ cup toasted whole almonds; ½ cup red wine vinegar; ½ teaspoon Spanish paprika; 1 pinch crushed red pepper flakes, or to taste",
  "directions": "1. Preheat an oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil. 2. Place the tomatoes, bell pepper, and garlic cloves onto the prepared baking sheet. Brush the vegetables with some of the olive oil, then sprinkle with kosher salt. Bake in the preheated oven until the garlic has turned golden brown, 15 to 20 minutes. Remove from the oven, and allow to cool for 10 minutes. While the vegetables are cooling, bake the bread slice on one of the oven racks until golden brown. Remove and allow to cool. 3. Scrape the vegetables and any juices from the pan into a food processor or blender. Break the bread into pieces, and add to the food processor along with the toasted almonds, vinegar, paprika, and red pepper flakes. Puree until finely ground, then drizzle in the remaining olive oil with the machine running. Season to taste with additional salt if necessary.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "196"
},
{
  "url": "https://www.allrecipes.com/recipe/242444/bacon-wrapped-dates/",
  "name": "Bacon Wrapped Dates",
  "rating": "4.8",
  "ratingcount": "32",
  "ingredients": "16  fresh or dried pitted dates, such as Medjool; 16  smoked almonds; 8 thick slices applewood-smoked bacon, halved crosswise; Reynolds Wrap® Aluminum Foil",
  "directions": "1. Preheat oven to 400 degrees F. Cut a slit in each date. Place almonds inside slits. Press together the dates to close slits. Wrap each date with a piece of bacon. 2. Line a shallow baking pan with Reynolds Wrap® Aluminum Foil. Add a roasting rack; place the dates on rack. Roast for 15 to 20 minutes or until bacon is crisp. Serve immediately with toothpicks. Dates will be hot inside.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "64"
},
{
  "url": "https://www.allrecipes.com/recipe/212813/shahi-tukra-indian-bread-pudding/",
  "name": "Shahi Tukra (Indian Bread Pudding)",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "1 quart oil for deep frying; 8 slices white bread, crusts removed and cut into 4 squares; ¼ cup cashews; ¼ cup sliced almonds; 2 tablespoons pistachio nuts; 1 ¼ cups whole milk; 5 tablespoons evaporated milk; ¾ cup white sugar; 1 teaspoon ground cardamom; 1 pinch saffron",
  "directions": "1. Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Fry the bread slices in the hot oil until deep, golden brown; drain on a plate lined with paper towels. Fry the cashews, almonds, and pistachio nuts in the hot oil until golden brown; remove from oil and set aside to cool. Chop roughly. 2. Bring the milk to a gentle boil in a heavy-bottomed pan over medium-low heat; continue boiling until the volume of milk reduces by about half. Pour the evaporated milk into the pan and add the sugar, cardamom, and saffron; simmer together 5 to 10 minutes. Remove from heat and allow to cool completely. 3. Arrange the fried bread pieces in a shallow dish large enough to allow them to be laid in a single layer. Evenly pour the milk mixture over the bread. Scatter the chopped nuts over the bread. Chill in refrigerator until completely cold, 1 to 2 hours.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "2 hrs 55 mins",
  "calories": "324"
},
{
  "url": "https://www.allrecipes.com/recipe/8499/basic-chicken-salad/",
  "name": "Best Chicken Salad",
  "rating": "4.6",
  "ratingcount": "776",
  "ingredients": "½ cup blanched slivered almonds; ½ cup mayonnaise; 1 tablespoon lemon juice; ¼ teaspoon ground black pepper; 2 cups chopped, cooked chicken meat; 1 stalk celery, chopped",
  "directions": "1. Gather all ingredients. 2. Place almonds in a frying pan. Toast over medium-high heat, shaking frequently. Watch carefully, as they burn easily. 3. Mix together mayonnaise, lemon juice, and pepper in a medium bowl. 4. Toss with chicken, toasted almonds, and celery. 5. Enjoy!",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "779"
},
{
  "url": "https://www.allrecipes.com/recipe/73412/best-toffee-ever-super-easy/",
  "name": "Best Toffee Ever - Super Easy",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "2 cups unsalted butter; 2 cups white sugar; ¼ teaspoon salt; 2 cups semisweet chocolate chips; 1 cup finely chopped almonds",
  "directions": "1. Combine butter, sugar, and salt in a large, heavy-bottomed saucepan over medium heat; stir constantly in one direction until butter is melted, about 5 minutes. 2. Meanwhile, line a 9x13-inch baking dish with a sheet of parchment paper, letting it overhang two sides of the dish. 3. Once the butter has melted, stop stirring and bring mixture to a boil. Once boiling, cook, stirring only 2 to 3 times, until it turns a dark amber color and the temperature reaches 285 degrees F (137 degrees C) on a candy thermometer, 20 to 30 minutes. 4. Immediately pour toffee into the prepared baking dish. Sprinkle chocolate chips on top and let sit until they soften, 1 to 2 minutes. Use a spatula to spread softened chocolate into a thin, even layer. Sprinkle nuts over the chocolate and press down slightly; wearing a plastic bag over your hand will minimize the mess. 5. Place toffee in the refrigerator until set, about 1 hour. 6. Lift hardened toffee out of the baking dish with the parchment paper. Break into pieces and store in an airtight container.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "1 hr 40 mins",
  "calories": "226"
},
{
  "url": "https://www.allrecipes.com/recipe/245336/almond-crescent-cookies/",
  "name": "Almond Crescent Cookies",
  "rating": "4.2",
  "ratingcount": "27",
  "ingredients": "½ cup salted butter, at room temperature; ⅓ cup confectioners' sugar, plus extra for dusting; 1 teaspoon vanilla extract; 1 teaspoon almond extract; ⅛ teaspoon salt; ¾ cup all-purpose flour, sifted; 2 tablespoons all-purpose flour, sifted; ½ cup almonds, finely chopped",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Beat butter and confectioners' sugar in a bowl using an electric mixer until smooth and creamy. Add vanilla extract, almond extract, and salt; mix briefly to incorporate. Gradually stir 3/4 cup plus 2 tablespoons flour into the creamed butter, add almonds, and mix until dough is just combined. 3. Shape dough into tiny crescents; place on an ungreased baking sheet about 2 inches apart. 4. Bake cookies in preheated oven until edges are golden, about 15 minutes. Cool on the baking sheet for 5 minutes before transferring to a wire rack to cool completely. 5. Roll cookies in sifted confectioners' sugar when cooled.",
  "prep": "45 mins",
  "cook": "15 mins",
  "total": "1 hr",
  "calories": "70"
},
{
  "url": "https://www.allrecipes.com/recipe/15542/mexican-wedding-cookies/",
  "name": "Mexican Wedding Cookies",
  "rating": "4.6",
  "ratingcount": "356",
  "ingredients": "1 cup unsalted butter, softened; ½ cup white sugar; 2 teaspoons vanilla extract; 2 teaspoons water; 2 cups all-purpose flour; 1 cup finely chopped almonds; ¼ teaspoon salt; ½ cup powdered sugar, or more as needed",
  "directions": "1. Beat butter and sugar in a medium bowl with an electric mixer until light and fluffy. Mix in vanilla and water. Add flour, almonds, and salt; beat on low speed until dough is just combined. Cover and chill for 1 to 3 hours. 2. Preheat the oven to 325 degrees F (165 degrees C). 3. Shape chilled dough into 1-inch balls and place 2 inches apart onto unlined cookie sheets. 4. Bake in the preheated oven for 15 to 20 minutes. Remove cookies from the sheets and transfer to wire racks to cool, 20 to 30 minutes. 5. Place powdered sugar in a shallow bowl. Roll cooled cookies in powdered sugar to coat. Transfer to an airtight container and store at room temperature.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "1 hr 55 mins",
  "calories": "104"
},
{
  "url": "https://www.allrecipes.com/recipe/25095/nanaimo-bars-iii/",
  "name": "Nanaimo Bars",
  "rating": "4.6",
  "ratingcount": "362",
  "ingredients": "1 cup butter, softened, divided; 5 tablespoons unsweetened cocoa powder; ¼ cup white sugar; 1  egg, beaten; 1 ¾ cups graham cracker crumbs; 1 cup flaked coconut; ½ cup finely chopped almonds (Optional); 3 tablespoons heavy cream; 2 tablespoons custard powder; 2 cups confectioners' sugar; 4 (1 ounce) squares semisweet baking chocolate; 2 teaspoons butter",
  "directions": "1. In the top of a double boiler, combine 1/2 cup softened butter, cocoa powder, and sugar. Stir occasionally until melted and smooth. Beat in egg and stir until thick, 2 to 3 minutes. 2. Remove from the heat and mix in graham cracker crumbs, coconut, and almonds. Press into the bottom of an ungreased 8x8-inch pan. 3. For the middle layer, beat remaining 1/2 cup softened butter, heavy cream, and custard powder until light and fluffy. Mix in confectioners' sugar until smooth. Spread over the bottom layer in the pan. Chill to set. 4. While the second layer is chilling, melt semisweet chocolate and 2 teaspoons butter together in the microwave or over low heat. 5. Spread melted chocolate mixture over chilled bars. Let the chocolate set before cutting into squares.",
  "prep": "30 mins",
  "cook": "",
  "total": "30 mins",
  "calories": "311"
},
{
  "url": "https://www.allrecipes.com/recipe/10431/italian-wedding-cookies-iii/",
  "name": "Italian Wedding Cookies",
  "rating": "4.6",
  "ratingcount": "371",
  "ingredients": "1 ½ cups unsalted butter; ¾ cup confectioners' sugar; ¾ teaspoon salt; 1 ½ cups finely ground almonds; 4 ½ teaspoons vanilla extract; 3 cups sifted all-purpose flour; ⅓ cup confectioners' sugar for rolling",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Place butter, 3/4 cup confectioners' sugar, and salt in a large bowl; beat with an electric mixer until smooth and creamy, about 2 to 3 minutes. Mix in almonds and vanilla. Blend in flour gradually until well-combined. 3. Shape into balls (or crescents) using about 1 teaspoon for each cookie; place 1 inch apart on ungreased cookie sheets. 4. Bake in the preheated oven until just browned, 15 to 20 minutes. 5. Let sit until slightly cooled, about 15 minutes. Roll cookies in remaining confectioners' sugar.",
  "prep": "45 mins",
  "cook": "15 mins",
  "total": "1 hr 15 mins",
  "calories": "70"
},
{
  "url": "https://www.allrecipes.com/recipe/152931/candied-almonds/",
  "name": "Candied Almonds",
  "rating": "4.6",
  "ratingcount": "451",
  "ingredients": "1 cup white sugar; ½ cup water; 1 tablespoon ground cinnamon; 2 cups whole almonds",
  "directions": "1. Line a baking sheet with waxed paper. 2. Combine sugar, water, and cinnamon in a saucepan over medium heat; bring to a boil. Add almonds; cook and stir mixture until liquid evaporates and leaves a syrupy coating on almonds. 3. Pour almonds onto the prepared baking sheet; use two forks to separate clumps and spread into an even layer. Allow to cool for about 15 minutes.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "304"
},
{
  "url": "https://www.allrecipes.com/recipe/11570/amazing-gluten-free-layer-bars/",
  "name": "Amazing Gluten-Free Layer Bars",
  "rating": "4.1",
  "ratingcount": "99",
  "ingredients": "7 ounces sweetened flaked coconut, divided; 1 cup butterscotch chips; 6 ounces semisweet chocolate chips; 8 ounces unsalted peanuts; ½ cup sliced almonds; 1 (14 ounce) can sweetened condensed milk",
  "directions": "1. Preheat oven to 350 degrees F ( 175 degrees C ). Generously grease one 13x9-inch baking pan. 2. Spread 2/3 of the flaked coconut evenly on the bottom of the baking pan. Sprinkle the butterscotch morsels, chocolate chips, and peanuts evenly over the coconut layer. Pour condensed milk evenly over the whole pan. Top with sliced almonds and remaining coconut. 3. Bake in preheated oven for 20 minutes. Cool completely before cutting into squares.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "185"
},
{
  "url": "https://www.allrecipes.com/recipe/15720/cinnamon-roasted-almonds/",
  "name": "Cinnamon-Roasted Almonds",
  "rating": "4.7",
  "ratingcount": "754",
  "ingredients": "1 large egg white; 1 teaspoon cold water; 4 cups whole almonds; ½ cup white sugar; ½ teaspoon ground cinnamon; ¼ teaspoon salt",
  "directions": "1. Preheat the oven to 250 degrees F (120 degrees C). Lightly grease a 10x15-inch jellyroll pan. 2. Lightly beat egg white in a large bowl. Add water; beat until frothy but not stiff. Stir in nuts until well coated. 3. Mix sugar, cinnamon, and salt in a small bowl. Sprinkle sugar mixture over nuts; toss to coat. Spread evenly onto the prepared pan. 4. Bake in the preheated oven, stirring occasionally, until golden, about 1 hour. Allow to cool, then store nuts in an airtight container.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "231"
},
{
  "url": "https://www.allrecipes.com/recipe/24009/creamed-chicken-for-biscuits/",
  "name": "Creamed Chicken for Biscuits",
  "rating": "4.5",
  "ratingcount": "225",
  "ingredients": "⅓ cup butter; ⅓ cup all-purpose flour; 2 cups chicken broth; 2 cups heavy cream; ¼ teaspoon garlic powder; 1 teaspoon salt; ½ teaspoon ground black pepper; 3 cups cooked, chopped chicken breast meat; 2 cups frozen green peas, thawed and drained; 1 cup toasted sliced almonds",
  "directions": "1. Melt butter in a large saucepan over medium heat. Stir in flour, then add broth, cream, garlic powder, salt, and pepper. Mix together and cook until thickened. 2. Stir in chicken, peas, and almonds. Heat through and serve.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "511"
},
{
  "url": "https://www.allrecipes.com/recipe/262841/no-egg-chocolate-mug-cake/",
  "name": "No Egg Chocolate Mug Cake",
  "rating": "3.8",
  "ratingcount": "65",
  "ingredients": "4 tablespoons all-purpose flour; 4 tablespoons white sugar; 3 tablespoons milk; 2 tablespoons unsweetened cocoa powder; ½ tablespoon olive oil; 1 pinch baking powder; 1 tablespoon semisweet chocolate chips; 1 tablespoon sliced almonds",
  "directions": "1. Gather all ingredients. 2. Mix flour, sugar, milk, cocoa powder, olive oil, and baking powder in a large mug until well combined. Stir in chocolate chips and almonds. 3. Place mug in the microwave and cook until cake has risen by 50 percent, 30 seconds to 2 minutes.",
  "prep": "5 mins",
  "cook": "2 mins",
  "total": "7 mins",
  "calories": "586"
},
{
  "url": "https://www.allrecipes.com/recipe/10022/pignoli-cookies-i/",
  "name": "Pignoli Cookies",
  "rating": "4.4",
  "ratingcount": "191",
  "ingredients": "cooking spray; 12 ounces almond paste; ½ cup white sugar; 1 cup confectioners' sugar; 4  egg whites, divided; 1 ½ cups pine nuts; all-purpose flour for rolling",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Line 2 cookie sheets with foil; lightly grease the foil with cooking spray. 2. Place almond paste and white sugar in a food processor; blend until combined. Add confectioners' sugar and 2 egg whites; blend until smooth. 3. Whisk remaining 2 egg whites in a small bowl. Place pine nuts on a shallow plate. 4. With lightly floured hands, roll dough into 1-inch balls. Coat balls in egg whites, shaking off excess, then roll in pine nuts, pressing lightly to stick. Arrange balls on cookie sheets, and flatten slightly to form a 1 1/2-inch round. 5. Bake in the preheated oven until lightly browned, 15 to 18 minutes. Let stand on cookie sheets briefly, then transfer to a wire rack to cool.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "101"
},
{
  "url": "https://www.allrecipes.com/recipe/275305/green-beans-almondine/",
  "name": "Green Beans Almondine",
  "rating": "4.7",
  "ratingcount": "6",
  "ingredients": "1 pound fresh green beans; 1 ½ ounces slivered almonds; 2 tablespoons butter; 2 cloves garlic, minced, or more to taste; salt and ground black pepper to taste",
  "directions": "1. Place beans into a microwave-safe casserole dish with enough water to cover the bottom. Microwave on high power until almost tender, 8 to 10 minutes. Drain in a colander and refresh under cold running water to keep the nice green color. 2. Heat a frying pan over medium heat. Add almonds and cook until just starting to turn golden, about 5 minutes, watching closely so as to not burn. Take pan off of heat and add butter to melt. Return to heat and add garlic. Mix in green beans, season with salt and pepper, and continue to stir until heated through, 5 to 7 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "152"
},
{
  "url": "https://www.allrecipes.com/recipe/254503/arugula-and-strawberry-salad-with-feta-cheese/",
  "name": "Arugula and Strawberry Salad with Feta Cheese",
  "rating": "4.8",
  "ratingcount": "9",
  "ingredients": "4 cups arugula; 8  strawberries, stemmed and sliced; 2 tablespoons aged balsamic vinegar, or to taste; 2 tablespoons extra-virgin olive oil, or to taste; 2 tablespoons toasted almonds; 1 ounce crumbled feta cheese; sea salt to taste",
  "directions": "1. Combine arugula, strawberries, balsamic vinegar, olive oil, almonds, feta cheese, and sea salt together in a bowl; toss until well combined.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "118"
},
{
  "url": "https://www.allrecipes.com/recipe/216889/al-kabsa-traditional-saudi-rice-and-chicken/",
  "name": "Al Kabsa (Traditional Saudi Rice and Chicken)",
  "rating": "4.5",
  "ratingcount": "52",
  "ingredients": "½ teaspoon saffron; ½ teaspoon ground cinnamon; ½ teaspoon ground allspice; ½ teaspoon dried whole lime powder; ¼ teaspoon ground cardamom; ¼ teaspoon ground white pepper; ¼ cup butter; 1  onion, finely chopped; 6 cloves garlic, minced; 1 (3 pound) whole chicken, cut into 8 pieces; ¼ cup tomato puree; 1 (14.5 ounce) can diced tomatoes, undrained; 3  carrots, peeled and grated; 2  whole cloves; 1 pinch ground nutmeg; 1 pinch ground cumin; 1 pinch ground coriander; salt and freshly ground black pepper to taste; 3 ¼ cups hot water, plus more if needed; 1 cube chicken bouillon; 2 ¼ cups unrinsed basmati rice; ¼ cup raisins; ¼ cup toasted slivered almonds",
  "directions": "1. Make spice mix: Stir together saffron, cinnamon, allspice, lime powder, cardamom, and white pepper in a small bowl; set aside. 2. Make dish: Melt butter in a large stockpot or Dutch oven over medium heat. Cook and stir onion and garlic in butter until onion has softened and turned translucent, about 5 minutes. Add chicken and cook over medium-high heat, stirring occasionally, until lightly browned, about 10 minutes. Mix in tomato purée. 3. Stir in canned tomatoes with juice, carrots, cloves, nutmeg, cumin, coriander, salt, black pepper, and reserved spice mix. Cook for about 3 minutes; pour in water and add chicken bouillon cube. 4. Bring sauce to a boil, then reduce heat, and cover the pot. Simmer until chicken is no longer pink and the juices run clear, about 30 minutes. 5. Gently stir in rice. Cover the pot and simmer until rice is tender and almost dry, about 25 minutes; add raisins and a little more hot water, if necessary. Cover and cook until rice grains separate, 5 to 10 minutes. 6. Transfer rice to a large serving platter and arrange chicken on top. Sprinkle with toasted slivered almonds.",
  "prep": "40 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs 10 mins",
  "calories": "528"
},
{
  "url": "https://www.allrecipes.com/recipe/246002/almond-flour-bread/",
  "name": "Almond Flour Bread",
  "rating": "4.4",
  "ratingcount": "172",
  "ingredients": "1 ½ cups almond flour; ⅓ cup flaxseed meal; 4 large eggs; ¼ cup unsweetened almond milk; 2 tablespoons olive oil; 2 teaspoons baking powder; ½ teaspoon salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease an 8x4-inch loaf pan, or line with parchment paper. 2. Mix almond flour, flaxseed meal, eggs, almond milk, olive oil, baking powder, and salt together in a bowl until a soft dough forms. Transfer to the prepared loaf pan. 3. Bake in the preheated oven until golden brown on top, about 40 minutes. Cool in the loaf pan for 10 minutes before transferring to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/246463/torrone-italian-nut-and-nougat-confection/",
  "name": "Torrone (Italian Nut and Nougat Confection)",
  "rating": "4.3",
  "ratingcount": "41",
  "ingredients": "2  (8x10-inch) sheets wafer paper; 3 cups roasted almonds; 1 cup roasted pistachios; 1 ⅓ cups honey; 1 cup white sugar; 3 tablespoons white sugar; 2 large egg whites, at room temperature; 1 pinch salt; 1 tablespoon lemon zest; ¼ teaspoon vanilla extract",
  "directions": "1. Line an 8x11-inch baking dish with plastic wrap, allowing ends to hang over the sides. Place 1 sheet wafer paper in the bottom of the lined dish. Place almonds and pistachios in a warm place to make them easier to mix in at the end. 2. Pour honey into a heavy-bottomed pot. Add 1 cup plus 3 tablespoons sugar; cook over low heat with a spatula, stirring constantly, until mixture turns from grainy to silky and smooth, about 30 minutes. Remove the pot from heat. 3. Place egg whites and salt in a mixing bowl. Whisk until whites form soft peaks, 3 to 4 minutes. Place the pot with honey mixture back on low heat. Gradually whisk 1/4 of the whipped egg whites into honey mixture; whisk in remaining egg whites in 3 more batches. 4. Continue cooking over low heat, stirring constantly with a spatula, until mixture turns a brighter white and a ribbon of mixture on the surface does not immediately incorporate, about 40 minutes. You can add a few drops of mixture to a small bowl of ice cold water to test the consistency; ideally it should feel like soft clay. 5. Whisk in lemon zest and vanilla. Add warm almonds and pistachios; stir to incorporate evenly. Transfer nougat mixture to the prepared baking dish; smooth the top with a clean, oiled spatula. Top nougat with remaining sheet wafer paper, shiny-side up. Lay plastic wrap over the top and press down evenly, tamping mixture down gently but firmly. Remove top plastic wrap. 6. Allow nougat to sit at room temperature until cool, firm, and ready to cut, 1 or 2 hours. 7. Lift the edges of overhanging plastic wrap to release nougat from the baking dish. Invert and remove plastic wrap from the bottom. Trim off the edges if plastic wrap is hard to remove. Cut torrone into 1-inch squares using a sharp serrated knife.",
  "prep": "15 mins",
  "cook": "1 hr 15 mins",
  "total": "2 hrs 30 mins",
  "calories": "137"
},
{
  "url": "https://www.allrecipes.com/recipe/229252/apple-and-pear-crumble/",
  "name": "Apple and Pear Crumble",
  "rating": "4.5",
  "ratingcount": "66",
  "ingredients": "1 ½ cups rolled oats; 1 ½ cups brown sugar, divided; ½ cup all-purpose flour; ½ cup butter, softened; 2 cups peeled and diced apples; 2 cups peeled and diced pears; 1 teaspoon ground cinnamon; ½ cup sliced almonds, or to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix oats, 3/4 cup brown sugar, flour, and butter together in a bowl until crumbly. 3. Mix apples, pears, remaining 3/4 cup brown sugar, and cinnamon together in a separate bowl; spread into the bottom of a 9x9-inch glass pan. Sprinkle oat mixture atop apple-pear mixture; top with almonds. 4. Bake in the preheated oven until the top is golden brown, about 40 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "366"
},
{
  "url": "https://www.allrecipes.com/recipe/245597/baked-brie-en-croute/",
  "name": "Baked Brie en Croute",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "1  egg; 1 tablespoon water; 1 (17.3 ounce) package frozen puff pastry (such as Pepperidge Farm®), thawed; ½ cup apricot preserves; ¾ cup dried cranberries; ½ cup sliced almonds; 1 (7 inch) wheel Brie cheese",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper. 2. Whisk egg and water together to make egg wash. 3. Roll out puff pastry gently to a 14-inch square. Trim corners with a knife or pizza cutter to make a circle. Spread apricot preserves over the pastry, leaving a 1-inch margin around the edge. Sprinkle cranberries and almonds over the pastry, and place Brie cheese in the center. 4. Brush the edges of the pastry with some of the egg wash. Fold top and bottom of pastry over the dough; trim 2 inches off each edge. Fold remaining pastry on top to cover the Brie cheese completely. Press the seams with your fingers to seal. Remove any excess apricot preserves that leaks out. 5. Transfer wrapped cheese, seam-side down, to baking sheet. Brush top with egg wash. 6. Bake in the preheated oven until top is golden brown, about 20 minutes. Let stand before serving, about 30 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "497"
},
{
  "url": "https://www.allrecipes.com/recipe/230159/sweet-salty-spicy-party-nuts/",
  "name": "Sweet, Salty, Spicy Party Nuts",
  "rating": "4.8",
  "ratingcount": "428",
  "ingredients": "cooking spray; 1 cup untoasted walnut halves; 1 cup untoasted pecan halves; 1 cup unsalted, dry roasted almonds; 1 cup unsalted, dry roasted cashews; 1 teaspoon salt; ½ teaspoon freshly ground black pepper; ¼ teaspoon ground cumin; ¼ teaspoon cayenne pepper; ½ cup white sugar; ¼ cup water; 1 tablespoon butter",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil and lightly coat with cooking spray. 2. Combine walnuts, pecans, almonds, and cashews in a large bowl. Add salt, black pepper, cumin, and cayenne; toss to coat. 3. Heat sugar, water, and butter in a small saucepan over medium heat. Cook until butter is melted and sugar is dissolved, about 1 minute. Slowly pour butter mixture over nuts and stir to coat. 4. Transfer nuts to the prepared baking sheet and spread into a single layer. 5. Bake nuts in the preheated oven for 10 minutes. Stir nuts to coat with warm syrup; spread out in a single layer. Return to the oven and bake until nuts are sticky and roasted, about 6 more minutes. Allow to cool before serving.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "219"
},
{
  "url": "https://www.allrecipes.com/recipe/229881/honey-roasted-almonds/",
  "name": "Honey-Roasted Almonds",
  "rating": "4.7",
  "ratingcount": "65",
  "ingredients": "2 cups whole almonds; ¼ cup white sugar; ½ teaspoon kosher salt; 3 tablespoons honey; 3 tablespoons water; 1 tablespoon almond oil",
  "directions": "1. Spread almonds in a single layer on a baking sheet and place in a cold oven. 2. Turn the oven on to 350 degrees F (175 degrees C). Bake almonds, stirring occasionally, until light tan and fragrant, 12 to 15 minutes. The nuts will continue to cook after removing them from the oven. 3. Meanwhile, mix sugar and salt together in a small bowl; sprinkle 1 tablespoon sugar mixture into a large bowl. 4. Stir honey, water, and almond oil together in a saucepan; bring to a boil. Add almonds; cook and stir until almonds have absorbed all the liquid, about 5 minutes. 5. Transfer coated almonds to the large bowl sprinkled with sugar mixture. Sprinkle remaining sugar mixture over almonds; toss to coat evenly. 6. Spread almonds onto waxed paper to cool completely. Store at room temperature in a tightly covered container or resealable plastic bag.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "268"
},
{
  "url": "https://www.allrecipes.com/recipe/246000/black-rice/",
  "name": "Black Rice",
  "rating": "4.8",
  "ratingcount": "27",
  "ingredients": "2 tablespoons butter; 1 cup black rice; ¼ cup diced onion; ¼ cup slivered almonds; 1 ¾ cups water; 1 cube chicken bouillon",
  "directions": "1. Melt butter in a saucepan over medium heat. Add black rice, onion, and almonds; cook and stir until lightly toasted, 5 to 10 minutes. Add water and bouillon; bring to a boil. Reduce the heat to low, cover, and simmer until rice is tender and liquid is absorbed, 25 to 30 minutes.",
  "prep": "5 mins",
  "cook": "35 mins",
  "total": "40 mins",
  "calories": "266"
},
{
  "url": "https://www.allrecipes.com/recipe/110926/almond-flour-waffles/",
  "name": "Almond Flour Waffles",
  "rating": "4.0",
  "ratingcount": "123",
  "ingredients": "1 cup almond flour; 1 teaspoon baking soda; 1 pinch salt; 4  eggs; ¼ cup honey; 1 teaspoon vanilla extract; cooking spray",
  "directions": "1. Preheat a waffle iron according to the manufacturer's instructions. 2. Combine almond flour, baking soda, and salt in a large bowl. Whisk eggs, honey, and vanilla together in a separate bowl. Stir flour mixture into egg mixture until smooth. 3. Spray the preheated waffle iron with cooking spray. Spoon batter onto waffle iron; cook until golden brown and the iron stops steaming, about 5 minutes. Repeat with remaining batter. Serve hot.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "214"
},
{
  "url": "https://www.allrecipes.com/recipe/10573/linzer-tarts/",
  "name": "Linzer Tarts",
  "rating": "4.4",
  "ratingcount": "168",
  "ingredients": "1 ¼ cups unsalted butter, softened; ⅔ cup white sugar; 2 cups sifted all purpose flour; 1 ¾ cups ground almonds; ⅛ teaspoon ground cinnamon; 5 tablespoons raspberry jam, or as needed; 1/4 cup confectioners' sugar for decoration, or as needed",
  "directions": "1. Beat butter and sugar in a mixing bowl with an electric mixer until light and fluffy, 2 to 3 minutes. Mix in 1/2 cup flour, then ground almonds and cinnamon. Mix in remaining flour, 1/2 cup at a time, until well combined and dough stiffens a bit. 2. Divide dough in half and form each half into a disk. Wrap each disk tightly in plastic wrap and refrigerate for 1 hour. 3. Preheat the oven to 325 degrees F (165 degrees C). Line two baking sheets with parchment paper. 4. Working with one dough disk at a time, roll dough on a lightly floured surface to a thickness of 1/8 inch. Use a 2 1/2-inch round cookie cutter to cut as many circles from the dough as you can; you should have about 12. Arrange dough circles 1 inch apart onto a prepared baking sheet. Place the baking sheet into the refrigerator. 5. Knead any leftover scraps into a ball and roll out again into a 1/8-inch-thick sheet. Cut out more circles; you should have about 12 more circles. 6. Place the second batch of circles onto the second baking sheet. Use a 1/2-inch round cookie cutter to cut out the center from 1/2 of all the cookies. 7. Bake cookies in the preheated oven until light brown, 10 to 15 minutes. Remove from the oven and transfer to a wire rack to cool for 20 minutes. 8. Spread a thin coating of jam onto the bottom sides of the fully round cookies. Place a cut-out cookie on top of each one, pressing together to form a sandwich. Return to the wire rack and repeat to form 11 more cookies. 9. Sift confectioners' sugar over the cookies, then spoon a dab of jam into the cut-out part of each cookie.",
  "prep": "45 mins",
  "cook": "10 mins",
  "total": "2 hrs 15 mins",
  "calories": "442"
},
{
  "url": "https://www.allrecipes.com/recipe/73059/umm-ali/",
  "name": "Umm Ali",
  "rating": "4.5",
  "ratingcount": "25",
  "ingredients": "1 sheet frozen puff pastry, thawed; ¼ cup raisins; ¼ cup slivered almonds; ¼ cup pine nuts; ¼ cup chopped pistachio nuts; ¼ cup sweetened, flaked coconut; 5 cups milk; 1 cup white sugar; 1 teaspoon vanilla extract",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Unroll 1 puff pastry sheet onto a lightly floured surface and roll out to about 17x12-inches. Place on a baking tray. 3. Bake in the preheated oven until puffed and golden brown, about 15 minutes. 4. Break puff pastry into pieces and place in a large bowl. Add raisins, almonds, pine nuts, pistachios, and coconut; toss until well combined. Spread evenly in a 9x13-inch glass baking dish. 5. Pour milk into a saucepan; stir in sugar and vanilla. Cook over medium-high heat, stirring occasionally, until hot but not quite boiling. Pour over puff pastry mixture in the baking dish. 6. Return to the oven and bake for 15 minutes. Turn on the broiler and continue baking until the top is browned, about 2 minutes. Let stand for 5 minutes before serving warm.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "605"
},
{
  "url": "https://www.allrecipes.com/recipe/240547/homemade-almond-milk/",
  "name": "Homemade Almond Milk",
  "rating": "4.9",
  "ratingcount": "29",
  "ingredients": "1 cup raw almonds; water to cover; 3 cups water; 1 tablespoon agave nectar, or more to taste; 1 pinch sea salt",
  "directions": "1. Place almonds in a bowl and pour in enough water to cover; soak at least 12 hours. Drain water. 2. Blend almonds and 3 cups water in a blender on low speed for 10 seconds. Turn blender off for 5 seconds. Blend almonds and water on high speed for 60 seconds. Pour mixture through cheesecloth or a nut bag into a bowl. Discard the pulp or save for another use. 3. Clean the blender and return milk to blender; add agave nectar and salt. Blend milk until smooth.",
  "prep": "15 mins",
  "cook": "",
  "total": "12 hrs 15 mins",
  "calories": "440"
},
{
  "url": "https://www.allrecipes.com/recipe/233448/low-carb-yellow-squash-casserole/",
  "name": "Low-Carb Yellow Squash Casserole",
  "rating": "4.7",
  "ratingcount": "218",
  "ingredients": "1 tablespoon olive oil; 1 teaspoon butter; 1 small onion, chopped; 2 cloves garlic, minced; 4 cups peeled and cubed yellow squash; 1 teaspoon kosher salt; ½ teaspoon freshly ground black pepper; ⅓ cup finely chopped raw almonds; 1 cup shredded Colby-Monterey Jack cheese, divided; ½ cup heavy whipping cream; 2 large eggs; ⅓ cup coarsely chopped roasted, salted almonds",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Heat olive oil and butter in a skillet over medium-high heat; cook and stir onion and garlic in the hot oil-butter mixture until softened, about 3 minutes. Add squash, salt, and pepper; stir to combine. Cover skillet and cook, stirring occasionally, until squash is softened, about 5 minutes. Transfer squash mixture to a large bowl. 3. Mix raw almonds and 1/2 cup shredded cheese together in a bowl; stir into squash mixture. Whisk cream and eggs together in a measuring cup or small bowl; stir into squash mixture. Pour squash mixture into a 9x13-inch casserole dish; top with remaining shredded cheese and roasted almonds. 4. Bake in the preheated oven until casserole is golden brown and bubbling, 25 to 30 minutes.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "228"
},
{
  "url": "https://www.allrecipes.com/recipe/223583/easy-broccoli-slaw-salad/",
  "name": "Broccoli Slaw",
  "rating": "4.5",
  "ratingcount": "42",
  "ingredients": "⅔ cup olive oil; ⅔ cup white sugar; ⅓ cup cider vinegar; 2 (3 ounce) packages chicken ramen noodles, broken; 10 ounces broccoli coleslaw mix; ¾ cup sliced almonds; ¾ cup golden raisins (Optional); ½ cup sliced green onions; ½ cup chopped green bell pepper",
  "directions": "1. Whisk olive oil, sugar, vinegar, and ramen noodle seasoning packets together in a small bowl. 2. Combine broccoli coleslaw mix, broken ramen noodles, almonds, raisins, green onions, and green bell pepper together in a salad bowl; fold in dressing. Refrigerate at least 2 hours. Stir again before serving.",
  "prep": "10 mins",
  "cook": "",
  "total": "2 hrs 10 mins",
  "calories": "439"
},
{
  "url": "https://www.allrecipes.com/recipe/239025/almond-flour-banana-bread/",
  "name": "Almond Flour Banana Bread",
  "rating": "4.1",
  "ratingcount": "175",
  "ingredients": "cooking spray; 3 large eggs, beaten; 1 tablespoon apple cider vinegar; 3 medium ripe bananas, mashed; ¼ cup coconut oil, melted; ¼ cup honey; 1 teaspoon vanilla extract; 3 cups almond flour; 1 teaspoon ground cinnamon; ¾ teaspoon baking powder; ½ teaspoon ground nutmeg; ½ teaspoon salt",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). Spray a 9x5-inch loaf pan with cooking spray. 2. Whisk eggs and vinegar together in a bowl. Stir in bananas, coconut oil, honey, and vanilla until blended. 3. Sift almond flour, cinnamon, baking powder, nutmeg, and salt together in a large bowl; stir into wet ingredients until well blended. Pour into the prepared bread pan. 4. Bake in the preheated oven until a knife inserted into the center comes out clean, about 1 hour; cover with foil if it begins to brown too much. Cool in the pan for 10 minutes, then remove loaf and cool completely on a wire rack.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "332"
}]