[{
  "url": "https://www.allrecipes.com/recipe/246073/high-fiber-bread/",
  "name": "High Fiber Bread",
  "rating": "4.7",
  "ratingcount": "6",
  "ingredients": "1 ⅔ cups warm water; 4 teaspoons molasses; 1 tablespoon active dry yeast; 2 ⅔ cups whole wheat flour; ¾ cup ground flax seed; ⅔ cup bread flour; ½ cup oat bran; ⅓ cup rolled oats; ⅓ cup amaranth seeds; 1 teaspoon salt",
  "directions": "1. Place water, molasses, yeast, wheat flour, ground flax seed, bread flour, oat bran, rolled oats, amaranth seeds, and salt in the pan of a bread machine in the order recommended by the manufacturer. Select dough cycle; press start and allow machine to run complete dough cycle. 2. Turn dough onto a lightly floured surface. Form dough into 2 loaves and place on a baking stone. Cover loaves with a damp cloth and let rise until doubled in volume, about 1 hour. 3. Preheat the oven to 375 degrees F (190 degrees C). 4. Bake in the preheated oven until top is golden brown, 20 to 25 minutes. Slide loaf onto a work surface and gently tap bottom of loaf. If it sounds hollow, the bread is done.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "2 hrs 30 mins",
  "calories": "101"
},
{
  "url": "https://www.allrecipes.com/recipe/283371/french-apple-pie-with-streusel-topping/",
  "name": "French Apple Pie with Streusel Topping",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 ½ cups all-purpose flour; 1 ½ teaspoons white sugar; ¾ teaspoon salt; ½ cup vegetable oil; 2 tablespoons milk; 4 cups apples - peeled, cored, and cut into chunks; 1 cup white sugar; 1 tablespoon all-purpose flour; ½ teaspoon ground cinnamon; ½ cup all-purpose flour; ¼ cup brown sugar; ¼ cup unsalted butter, cubed",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Prepare crust: mix flour, sugar, and salt together in a bowl. Whisk oil and milk together in a separate bowl, then add to the dry mixture. Mix to combine and press into a 10-inch pie plate. 3. Prepare filling: mix apples, sugar, flour, and cinnamon together in a large bowl. Place on top of the unbaked crust. 4. Prepare topping: Mix flour, brown sugar, and butter in a bowl with a fork until crumbles are formed. Sprinkle on top of apple filling 5. Bake in the preheated oven until filling is bubbly and topping is golden brown, about 1 hour.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "360"
},
{
  "url": "https://www.allrecipes.com/recipe/240814/peanut-butter-and-amaranth-cookies/",
  "name": "Peanut Butter and Amaranth Cookies",
  "rating": "4.3",
  "ratingcount": "4",
  "ingredients": "1 ½ cups water; ½ cup amaranth; 1 cup peanut butter; 1 cup white sugar; ½ cup butter, softened; 1  large egg; 1 ½ cups all-purpose flour; 1 ½ cups whole wheat pastry flour; 1 cup quick-cooking oats; 1 teaspoon baking powder; 1 teaspoon baking soda; ½ teaspoon salt",
  "directions": "1. Combine water and amaranth together in a saucepan; bring to a boil, reduce heat to medium-low, and simmer until water is absorbed and amaranth grains are fluffy, about 20 minutes. Cool for 10 to 15 minutes. 2. Preheat oven to 375 degrees F (190 degrees C). 3. Beat cooked amaranth and peanut butter together in a large bowl until smooth. Beat in sugar until completely dissolved. Add butter to amaranth mixture and mix; stir in egg until smooth. 4. Whisk all-purpose flour, pastry flour, oats, baking powder, baking soda, and salt together in a bowl. Gradually add flour mixture to amaranth mixture, stirring until the dough starts to come away from the sides of the bowl. 5. Form dough into small balls and place 2-inches apart on a baking sheet. Dip a fork into flour and press dough balls with fork to flatten. 6. Bake in the preheated oven until set, about 15 minutes. Cool on the baking sheet for 3 to 5 minutes before removing to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr 10 mins",
  "calories": "140"
},
{
  "url": "https://www.allrecipes.com/recipe/236213/amaranth-pancakes/",
  "name": "Amaranth Pancakes",
  "rating": "4.0",
  "ratingcount": "3",
  "ingredients": "½ cup rice flour; ½ cup sorghum flour; ½ cup amaranth; 1 teaspoon baking powder; 1 teaspoon ground cinnamon; 1 cup almond milk; ½ cup unsweetened applesauce; 1  egg; cooking spray",
  "directions": "1. Heat a griddle over medium heat. 2. Whisk rice flour, sorghum flour, amaranth, baking powder, and cinnamon together in a bowl. Stir almond milk, applesauce, and egg into flour mixture until batter is just combined. 3. Spray griddle with cooking spray. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "273"
},
{
  "url": "https://www.allrecipes.com/recipe/245657/mighty-granola/",
  "name": "Mighty Granola",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "8 cups rolled oats; 1 cup amaranth; 1 cup sunflower seeds; 1 cup finely chopped pecans; 1 cup finely chopped walnuts; 1 cup sliced almonds; 1 cup flaxseed meal; 1 cup ground chia seeds; 1 cup honey; 1 cup maple syrup; 1 cup coconut oil; ½ cup brown sugar; ¼ cup butter; 2 tablespoons vanilla extract; 2 tablespoons ground cinnamon; 2 teaspoons salt; 2 cups raisins; 1 cup dried cherries; ½ cup dried blueberries",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). Line two baking sheets with parchment paper. 2. Combine oats, amaranth, sunflower seeds, pecans, walnuts, almonds, flaxseed meal, and ground chia seeds in a very large bowl; stir until thoroughly mixed. 3. Mix honey, maple syrup, coconut oil, brown sugar, butter, vanilla extract, cinnamon, and salt together in a large saucepan over medium heat. Bring to a boil, stirring constantly. Cook and stir, about 1 minute. Remove maple syrup mixture from heat. 4. Pour maple syrup mixture over oat mixture in the bowl; stir until oat mixture is moist. Spread evenly on the baking sheets. 5. Bake in the preheated oven until toasted, stirring mixture halfway through, about 20 minutes. Remove from oven and let cool, about 5 minutes. Transfer to a very large bowl. Add raisins, cherries, and blueberries; stir until thoroughly mixed.",
  "prep": "25 mins",
  "cook": "26 mins",
  "total": "56 mins",
  "calories": "154"
},
{
  "url": "https://www.allrecipes.com/recipe/238465/amaranth-ginger-cookies/",
  "name": "Amaranth Ginger Cookies",
  "rating": "1.0",
  "ratingcount": "1",
  "ingredients": "1 cup boiling water; ¼ cup amaranth; 1 ½ cups all-purpose flour; 2 teaspoons baking powder; ½ teaspoon baking soda; ½ teaspoon salt; 1 cup white sugar; ½ cup butter, softened; 2  eggs; 1 cup quick-cooking oats; 1 cup chopped crystallized ginger; ½ cup finely chopped walnuts",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Grease a large baking sheet. 2. Bring water and amaranth to a boil in a small saucepan. Reduce heat to low, cover, and simmer until amaranth is tender and water has been absorbed, about 10 minutes. Remove saucepan from heat and cool amaranth to room temperature. 3. Whisk flour, baking powder, baking soda, and salt together in a bowl. 4. Beat sugar and butter together in a bowl using an electric mixer until smooth and creamy. Beat 1 egg into creamed butter mixture until smoothly incorporated; repeat with second egg. Add amaranth, oats, ginger, and walnuts to creamed butter mixture and beat until mixed. 5. Stir flour mixture into creamed butter mixture until dough is just combined. Drop dough by the teaspoonful onto the prepared baking sheet. 6. Bake in the preheated oven until cookies are lightly browned on top, about 10 minutes. Remove baking sheet from oven and allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "120"
},
{
  "url": "https://www.allrecipes.com/recipe/238514/gluten-free-banana-bread/",
  "name": "Gluten-Free Banana Bread",
  "rating": "4.5",
  "ratingcount": "6",
  "ingredients": "1 teaspoon margarine, or as needed, softened; ¾ cup almond milk; 1 tablespoon vinegar; 1 ¼ cups rice flour; ½ cup brown sugar; ¼ cup amaranth flour; ¼ cup soy flour; ¼ cup flax seed meal; 1 teaspoon baking powder; 1 teaspoon baking soda; 1 teaspoon sea salt; 2 large bananas, mashed; 1  egg, beaten; 1 tablespoon coconut oil, melted",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Lightly grease an 8-inch square metal baking dish with margarine. 2. Mix almond milk and vinegar together in a cup. 3. Mix rice flour, brown sugar, amaranth flour, soy flour, flax seed meal, baking powder, baking soda, and sea salt together in a large mixing bowl. 4. Beat bananas, almond milk mixture, egg, and coconut oil together in a separate bowl; add to rice flour mixture and stir until dry ingredients are completely moistened. Spread the mixture into the prepared baking dish. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 35 minutes.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "223"
}]