[{
  "url": "https://www.allrecipes.com/recipe/216386/apricot-pecan-sweet-potatoes/",
  "name": "Apricot-Pecan Sweet Potatoes",
  "rating": "4.7",
  "ratingcount": "14",
  "ingredients": "3 pounds sweet potatoes, peeled and cut into chunks; 1 cup packed brown sugar; 5 teaspoons cornstarch; ¼ teaspoon salt; ⅛ teaspoon ground cinnamon; 1 cup apricot nectar; ½ cup hot water; 2 teaspoons grated orange peel; 2 tablespoons butter; ½ cup chopped pecans",
  "directions": "1. Place the sweet potatoes into a large pot and cover with water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. 2. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 3. Mix together brown sugar, cornstarch, salt, cinnamon, apricot nectar, water, and orange peel in a saucepan; bring to a boil over medium heat. Reduce heat to medium-low, and cook for 2 minutes, stirring constantly. When the sauce is thick, stir in the butter and pecans. Place the sweet potato chunks into the prepared baking dish, and pour the sauce over to coat all the potatoes. 4. Bake in the preheated oven until tender and bubbling, 25 to 30 minutes.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "348"
},
{
  "url": "https://www.allrecipes.com/recipe/88470/apricot-glazed-carrots/",
  "name": "Apricot Glazed Carrots",
  "rating": "4.1",
  "ratingcount": "135",
  "ingredients": "2 pounds carrots, peeled and diagonally sliced; 3 tablespoons butter, melted; ⅓ cup apricot preserves; ¼ teaspoon ground nutmeg; ¼ teaspoon salt; 1 teaspoon orange zest; 2 teaspoons fresh lemon juice; chopped fresh parsley for garnish",
  "directions": "1. Add carrots to a pot of lightly salted water, and bring to a low boil. Simmer until carrots are tender. Drain. 2. Put melted butter in a bowl, and stir in apricot preserves. Stir in nutmeg, salt, orange zest, and lemon juice. Add carrots, and stir well to coat. Sprinkle with chopped parsley.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "119"
},
{
  "url": "https://www.allrecipes.com/recipe/230418/fruit-stuffed-pork-loin/",
  "name": "Fruit-Stuffed Pork Loin",
  "rating": "4.3",
  "ratingcount": "13",
  "ingredients": "¾ cup chopped pitted prunes; ¾ cup chopped dried apricots; 1 tablespoon grated fresh ginger; 1 teaspoon grated orange zest; ½ teaspoon ground cumin; ½ teaspoon ground cinnamon; salt and ground black pepper to taste; 1 (4 pound) boneless pork loin roast, butterflied; ¼ cup packed brown sugar; 2 teaspoons all-purpose flour; 2 teaspoons cider vinegar; 1 teaspoon ground cumin; 1 teaspoon mustard powder; ½ cup water; 1 teaspoon cornstarch; 1 tablespoon water",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Mix prunes, apricots, ginger, orange zest, 1/2 teaspoon cumin, and cinnamon in a bowl; season with salt and black pepper. 3. Open pork roast and spoon stuffing down the center; fold meat over stuffing and tie securely in several places with kitchen twine. Set roast onto a rack in a roasting pan. 4. Combine brown sugar, flour, cider vinegar, 1 teaspoon cumin, and mustard powder into a paste; spread brown sugar mixture over the roast. 5. Bake in the preheated oven until a meat thermometer inserted into center of stuffing reads 160 degrees F (70 degrees C), about 1 1/2 hours. Transfer roast to a serving platter and tent with aluminum foil while you make gravy. 6. Skim fat from roasting pan and transfer defatted drippings into a small saucepan. Pour 1/2 cup water into roasting pan and scrape up and dissolve any browned bits of food into water; pour into saucepan with pan juices. Bring pan juices to a boil over medium heat. Dissolve cornstarch in 1 tablespoon water in a small bowl and whisk cornstarch mixture into pan juices, stirring constantly until thickened, about 1 minute. Strain gravy into a gravy boat. Serve gravy with roast.",
  "prep": "20 mins",
  "cook": "1 hr 40 mins",
  "total": "2 hrs",
  "calories": "435"
},
{
  "url": "https://www.allrecipes.com/recipe/162826/apricot-glazed-ham/",
  "name": "Apricot Glazed Ham",
  "rating": "4.6",
  "ratingcount": "9",
  "ingredients": "1 (8 pound) fully-cooked, bone-in ham; ¼ cup whole cloves (Optional); ½ cup apricot preserves; 3 tablespoons honey mustard",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Score the fatty side of the ham with a sharp knife in a diamond pattern, spacing the lines about 1 inch apart. Insert whole cloves at the intersections, if desired. Place the ham in a shallow roasting pan and cover with aluminum foil. 3. Bake the ham in the preheated oven for about 90 minutes. About 10 minutes before the ham is finished, measure the apricot preserves into a small saucepan. Warm over medium heat until liquid, then remove from the heat and stir in the honey mustard. 4. Brush the glaze onto the ham, and return to the oven, uncovered, and bake for an additional 15 to 20 minutes, or until the glaze is nicely browned. Let the ham stand for about 10 minutes before carving and serving.",
  "prep": "10 mins",
  "cook": "1 hr 55 mins",
  "total": "2 hrs 5 mins",
  "calories": "678"
},
{
  "url": "https://www.allrecipes.com/recipe/152952/espresso-biscotti/",
  "name": "Espresso Biscotti",
  "rating": "4.2",
  "ratingcount": "22",
  "ingredients": "¼ cup unsalted butter; ¾ cup white sugar; 3  eggs; 1 teaspoon vanilla extract; 3 ¼ cups pastry flour; 1 teaspoon ground cinnamon; 1 teaspoon baking powder; 1 teaspoon instant espresso powder; 2 teaspoons grated orange zest; ½ cup chocolate chips; ½ cup dried apricots; ½ cup dried cranberries; ½ cup slivered almonds; 1  egg white, lightly beaten",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a cookie sheet or line it with parchment paper. 2. Cream together butter and sugar in a bowl until light and fluffy. Beat in eggs and vanilla. 3. Sift together the flour, cinnamon, and baking powder in a separate bowl. Mix dry ingredients into the egg mixture. Stir in the espresso powder, orange zest, chocolate chips, dried apricots, dried cranberries and almonds. 4. Shape dough into two equal logs approximately 12 inches long by 2 inches diameter. Place logs on baking sheet, and flatten out to about 1 inch thickness. Brush the log with egg wash. 5. Bake in the preheated oven until edges are golden and the center is firm, about 35 to 40 minutes. Remove from oven to cool on the pans. When loaves are cool enough to handle, use a serrated knife to slice the loaves diagonally into 1/2 inch thick slices. Return the slices to the baking sheet. 6. Reduce oven temperature to 325 degrees F (165 degrees C). Bake until they start turning light brown, 15 to 20 minutes. Cool completely, and store in an airtight container at room temperature.",
  "prep": "25 mins",
  "cook": "1 hr",
  "total": "1 hr 25 mins",
  "calories": "151"
},
{
  "url": "https://www.allrecipes.com/recipe/25647/apricot-balls/",
  "name": "Apricot Balls",
  "rating": "3.9",
  "ratingcount": "32",
  "ingredients": "½ pound dried apricots; ½ cup brown sugar; ½ cup flaked coconut; ½ (14 ounce) can sweetened condensed milk; 1 cup flaked coconut for rolling",
  "directions": "1. Mince apricots in a food processor. Place in a bowl and toss with brown sugar. Stir in 1/2 cup coconut and condensed milk. Shape into 1 inch balls and roll in coconut. Keep refrigerated.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "210"
},
{
  "url": "https://www.allrecipes.com/recipe/11408/apricot-cookies/",
  "name": "Apricot Cookies",
  "rating": "4.1",
  "ratingcount": "30",
  "ingredients": "1 cup unsalted butter, softened; 1 cup white sugar; 3 cups all-purpose flour; 1 large egg; 1 teaspoon vanilla extract; 1 teaspoon baking powder; ½ teaspoon salt; 1 cup apricot preserves; ⅓ cup confectioners' sugar for decoration",
  "directions": "1. Cream butter and sugar in a medium mixing bowl. Mix in flour, egg, vanilla, baking powder, and salt until incorporated. Cover and refrigerate for 1 hour. 2. Preheat the oven to 350 degrees F (175 degrees C). 3. Roll dough on a lightly floured surface to a thickness of 1/4 inch. Cut dough into circles with a round cookie cutter or glass. Using the tip of a teaspoon, place a small drop of apricot preserves into the middle of each circle. Brush the edges with water and fold the dough in half into a half-moon shape. Press to seal the edges. Arrange cookies on ungreased cookie sheets. 4. Bake in the preheated oven until golden brown, 8 to 12 minutes. Remove from the oven and transfer to wire racks to cool. Dust hot cookies with powdered sugar.",
  "prep": "25 mins",
  "cook": "10 mins",
  "total": "1 hr 35 mins",
  "calories": "68"
},
{
  "url": "https://www.allrecipes.com/recipe/20310/aileens-punch/",
  "name": "Aileen's Punch",
  "rating": "4.7",
  "ratingcount": "151",
  "ingredients": "1 (46 fluid ounce) can pineapple juice; 1 (46 fluid ounce) can apricot nectar; 1 (6 ounce) can frozen limeade concentrate; 2 liters lemon-lime flavored carbonated beverage",
  "directions": "1. In a punch bowl combine pineapple juice, apricot nectar and limeade; finally, pour in the lemon-lime soda.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "93"
},
{
  "url": "https://www.allrecipes.com/recipe/17478/apricot-danish-coffee-cake/",
  "name": "Apricot Danish Coffee Cake",
  "rating": "4.5",
  "ratingcount": "71",
  "ingredients": "1 (15.25 ounce) package white cake mix; 3 large eggs; 1 ½ cups sour cream; 1 (15 ounce) can apricot halves, drained; 1 tablespoon butter; ½ cup slivered almonds; 1 (8 ounce) package cream cheese; 2 tablespoons milk; ⅔ cup confectioners' sugar; 2 teaspoons water, or as needed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 10x15-inch jelly roll pan. Set aside 1/2 cup of the dry cake mix. 2. Mix together eggs and sour cream in a medium bowl. Stir in package of cake mix. Batter will be lumpy. Spread batter into the prepared pan. Using the back of a spoon, make 15 wells in the batter, 3 rows of 5. Beat together cream cheese and milk in another bowl until fluffy. Place a tablespoon of the cream cheese mixture into each well. Place 1 apricot half, cut side up, onto each well of cream cheese. 3. Combine 1/2 cup reserved cake mix with butter in a small bowl. Stir in butter until the mixture is crumbly. Stir in slivered almonds and sprinkle the mixture evenly over the Danish batter. 4. Bake in the preheated oven until a toothpick inserted into the cake comes out clean, 30 to 35 minutes. 5. To make the glaze: Stir together confectioners' sugar and water until smooth, adding another teaspoon of water if necessary. Drizzle over the Danish when cool.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "332"
},
{
  "url": "https://www.allrecipes.com/recipe/285573/spicy-air-fryer-pork-chops-with-apricot-glaze/",
  "name": "Spicy Air Fryer Pork Chops with Apricot Glaze",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "4 cups water; 2 tablespoons kosher salt; 2 tablespoons white sugar; 4 (5 ounce) bone-in center loin pork chops, about 3/4-inch thick; 1 teaspoon chili powder, or to taste; 1 teaspoon onion powder; ½ teaspoon salt; ¼ teaspoon white pepper; ½ cup apricot all-fruit spread; 3 tablespoons hoisin sauce; 1 (1 inch) piece ginger root, peeled and grated; 2 cloves minced garlic; 1 ½ teaspoons Asian chili-garlic sauce; ½ medium lime, juiced; cooking spray; 2 tablespoons finely minced fresh parsley",
  "directions": "1. Combine water, salt, and sugar in a bowl and stir until the crystals are dissolved. Add pork chops, cover, and refrigerate for at least 2 hours, or up to 4 hours. 2. Remove pork chops from the brine and shake off excess. Discard the remaining brine. Pat chops dry with paper towels and place on a plate or cutting board. 3. Combine chili powder, onion powder, salt, and white pepper in a small bowl. Distribute 1/2 of the rub mixture among the 4 chops and rub to coat the entire surface. Turn the chops and repeat. Allow chops to come to room temperature, about 30 minutes. 4. Meanwhile, combine apricot all-fruit spread, hoisin sauce, ginger, garlic, chili-garlic sauce, and lime juice for the glaze in a medium, microwave-safe bowl. 5. Microwave mixture on high for 3 minutes, stirring halfway through. Carefully remove glaze and set aside. 6. Preheat air fryer to 400 degrees F (200 degrees C) if recommended by manufacturer. Spray each side of seasoned and rubbed chops with cooking spray. 7. Place chops in the air fryer in a single layer and air-fry for 8 minutes, turning halfway through. 8. Brush the tops of the chops with prepared glaze and air-fry until pork chops are no longer pink in the center, 2 to 3 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). 9. Sprinkle chops with minced parsley, and serve with remaining glaze.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "3 hrs",
  "calories": "275"
},
{
  "url": "https://www.allrecipes.com/recipe/13539/ma-lipos-apricot-glazed-turkey-with-roasted-onion-and-shallot-gravy/",
  "name": "Ma Lipo's Apricot-Glazed Turkey with Roasted Onion and Shallot Gravy",
  "rating": "4.7",
  "ratingcount": "84",
  "ingredients": "1 cup apricot nectar; 1 cup apricot preserves; 2 tablespoons minced fresh ginger root; 1 tablespoon honey; ¾ cup unsalted butter, softened; 3 tablespoons chopped fresh sage; 1 ½ teaspoons salt; 1 teaspoon ground black pepper; 2 tablespoons unsalted butter; 3  onions, thinly sliced; 6 ounces thinly sliced shallots; 22 pounds whole turkey; 2 cups low-sodium chicken broth; 1 teaspoon chopped fresh thyme; ½ teaspoon dried sage; 2 cups low-sodium chicken broth; salt and pepper to taste",
  "directions": "1. Combine apricot nectar, preserves, ginger, and honey in a small saucepan and bring to boil. Reduce heat to medium-low, and simmer until thickened and reduced to 1-1/4 cups, about 15 minutes. 2. Blend 3/4 cup unsalted butter at room temperature, 3 tablespoons chopped fresh sage, salt, and pepper in small bowl. Set aside. 3. Melt 2 tablespoons unsalted butter in a large heavy skillet over medium heat. Add onions and shallots; saute until very soft and light brown, about 20 minutes. 4. Position rack in lowest third of oven. Preheat to 400 degrees F (200 degrees C). 5. Season turkey cavity with salt and pepper. Place turkey, breast side up, on a rack in a large roasting pan. Slide hand under skin of turkey breast to loosen skin. Spread half of herb butter over breast under skin. Rub remaining herb butter over outside of turkey. 6. If stuffing turkey, spoon stuffing loosely into main cavity; it will expand as it cooks. Tie legs together loosely to hold shape of turkey. 7. Roast turkey for 30 minutes in the preheated oven. Reduce oven temperature to 325 degrees F (165 degrees C), and continue roasting 1 hour 30 minutes, basting occasionally with pan drippings. Tent turkey with aluminum foil; roast 45 minutes longer. 8. Add onion mixture, 1 cup broth, thyme, and 1/2 teaspoon chopped fresh sage to the roasting pan. Roast 15 more minutes before brushing 1/2 cup apricot glaze over turkey. Continue to roast turkey uncovered, brushing occasionally with glaze. Add more broth to the pan if necessary. Bake 40 minutes longer for unstuffed turkey, and 1 hour 10 minutes longer for stuffed turkey, or until meat thermometer inserted into the thickest part of the thigh registers 165 degrees F (75 degrees C). Place turkey on a platter, and tent with foil. Let stand 30 minutes. Reserve mixture in pan for gravy. 9. Pour contents of roasting pan into a strainer set over a large bowl. Skim fat from pan juices using a large spoon. Transfer the onion mixture to a blender. Add 1 cup pan juices, and puree until smooth, adding more pan juices and chicken broth if necessary to thin sauce to desired consistency. Transfer sauce to a large saucepan, and bring to a boil. Cook until color deepens, skimming off any foam, about 5 minutes. Season with salt and pepper.",
  "prep": "30 mins",
  "cook": "4 hrs 30 mins",
  "total": "5 hrs 30 mins",
  "calories": "591"
},
{
  "url": "https://www.allrecipes.com/recipe/13699/apricot-brandy-and-peach-schnapps-pound-cake/",
  "name": "Apricot Brandy and Peach Schnapps Pound Cake",
  "rating": "5.0",
  "ratingcount": "11",
  "ingredients": "3 cups white sugar; 1 cup butter, softened; 6  eggs, beaten; 3 cups all-purpose flour; ¼ teaspoon baking soda; ½ teaspoon salt; 1 cup sour cream; ¼ cup apricot brandy; 1 teaspoon lemon zest; 1 cup white sugar; ½ cup peach schnapps; 1 cup water; 1 teaspoon lemon zest; 1 cup apricot preserves; ½ cup apricot brandy; 1 teaspoon lemon zest; ½ cup almonds",
  "directions": "1. Butter and flour one angle food tube cake pan. Preheat oven to 325 degrees F (175 degrees C). 2. In a mixing bowl, cream together butter and sugar for 5 minutes. Add eggs one at a time. Beat well. Sift flour with soda and salt; add sour cream and brandy ending with flour. Bake for 1 hour 15 minutes. 3. Prepare the syrup in a sauce pan by combining the sugar, peach flavored liqueur, water and lemon zest. Boil for 1 minute. 4. Turn cake out onto plate and punch holes in bottom of cake with ice pick or something similar. Slowly pour all of syrup into holes until cake is penetrated and syrup is absorbed. Immediately turn cake right side up onto serving plate. 5. Prepare the topping/glaze by combining the apricot preserves, apricot brandy and lemon zest in a sauce pan and boiling for 1 minute. Drizzle over top of cake. Place sliced almonds on top of glaze along with a little lemon zest if desired. 6. Serve the cake with sliced fresh peaches and coat with 1/2 cup citrus juice. Add one basket blueberries and mix together. Pour 1/2 cup peach flavored liqueur and 1/2 cup simple syrup over fruit. (simple syrup made from 1/2 cup sugar boiled in 1 cup water for 1 minute and cooled)",
  "prep": "40 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 55 mins",
  "calories": "751"
},
{
  "url": "https://www.allrecipes.com/recipe/27294/apricot-muffins/",
  "name": "Apricot Muffins",
  "rating": "4.5",
  "ratingcount": "114",
  "ingredients": "1 cup chopped dried apricots; 1 cup boiling water; 2 cups all-purpose flour; ¾ cup white sugar; 1 teaspoon baking soda; ½ teaspoon salt; ¼ cup melted butter; ¼ cup vegetable oil; 1 cup buttermilk; 1  egg",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Grease a 12 cup muffin pan, or line with paper muffin cups. Place apricots into a small bowl, and pour the boiling water over them. Let stand for 5 minutes. 2. In a medium bowl stir together the flour, sugar, baking soda and salt. In a separate bowl, whisk together the melted butter, oil, buttermilk and egg. Pour the wet ingredients into the dry ingredients, and stir until just blended. It is okay for the batter to have some lumps. Drain water from apricots, and mix them into the batter. Spoon into the prepared muffin cups. 3. Bake for 15 minutes in the preheated oven, or until the top springs back when lightly pressed. Cool in the pan over a wire rack.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "239"
},
{
  "url": "https://www.allrecipes.com/recipe/214001/apricot-and-honey-ham-glaze/",
  "name": "Apricot and Honey Ham Glaze",
  "rating": "4.6",
  "ratingcount": "25",
  "ingredients": "½ cup apricot jam; 3 tablespoons honey; 1 tablespoon hot English mustard; 2 tablespoons orange marmalade",
  "directions": "1. Stir together the apricot jam, honey, hot English mustard, and orange marmalade in a bowl until the mixture is well combined.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "57"
},
{
  "url": "https://www.allrecipes.com/recipe/282831/moroccan-lamb-stew-with-apricots/",
  "name": "Moroccan Lamb Stew with Apricots",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "2 pounds boneless leg of lamb, cut into 1-inch cubes; 2 teaspoons ground coriander; 1 teaspoon ground cumin; 1 teaspoon sweet paprika; ½ teaspoon cayenne pepper; ½ teaspoon ground cardamom; ½ teaspoon ground turmeric; 2 teaspoons kosher salt; 2 tablespoons olive oil; 2 cups finely chopped onion; 4 cloves garlic, minced; 1 tablespoon minced fresh ginger root; 2 (3 inch) cinnamon sticks; 2 cups low-sodium chicken stock; 1 cup dried apricots, halved; 2 (3 inch) orange peel strips; 1 tablespoon honey; ¼ cup chopped fresh cilantro; ¼ cup toasted pine nuts",
  "directions": "1. Combine lamb, coriander, cumin, paprika, cayenne, cardamom, turmeric, and salt in a large bowl; toss together until lamb is evenly coated. 2. Heat oil in a large Dutch oven or tagine over medium heat. Add onions; cook, stirring occasionally until soft and translucent, about 5 minutes. Stir in garlic, ginger, and cinnamon; cook, stirring frequently, until fragrant, about 1 minute. Add seasoned lamb; cook, stirring frequently until light brown, being careful not to caramelize, about 2 minutes. Add chicken stock and bring to a gentle boil over medium heat. Reduce heat to low and simmer, covered, until the lamb is just tender, about 1 hour and 15 minutes. 3. Stir in apricots, orange peels, and honey; continue to simmer over low heat, uncovered, until the liquid has thickened slightly and lamb is fork-tender, about 30 minutes. Remove from the heat, discard cinnamon sticks and orange peels. 4. Divide evenly among 4 bowls. Garnish each bowl with a tablespoon each of cilantro and pine nuts.",
  "prep": "30 mins",
  "cook": "1 hr 55 mins",
  "total": "2 hrs 25 mins",
  "calories": "553"
},
{
  "url": "https://www.allrecipes.com/recipe/7840/apricot-nectar-cake-ii/",
  "name": "Apricot Nectar Cake II",
  "rating": "4.1",
  "ratingcount": "21",
  "ingredients": "1 (18.25 ounce) package yellow cake mix; 4  eggs; ¾ cup vegetable oil; ¾ cup apricot nectar; ⅓ cup hot water; 2 cups confectioners' sugar; 6 tablespoons lemon juice; 1 (3 ounce) package lemon flavored Jell-O® mix",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease one 10 inch tube or Bundt pan. 2. Mix the cake mix, eggs, vegetable oil, and apricot nectar together. 3. Dissolve the gelatin in the hot water and add to cake batter. Mix well and pour the batter into the prepared pan. 4. Bake at 350 degrees F (175 degrees C) for 45 to 60 minutes. Invert cake onto a plate and cool for several minutes. Pour glaze over cake while it is still warm. 5. To Make Glaze: Combine the confectioner's sugar and the lemon juice. Use immediately to pour over still warm cake.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "445"
},
{
  "url": "https://www.allrecipes.com/recipe/23732/apricot-brandy-pound-cake-iii/",
  "name": "Apricot Brandy Pound Cake III",
  "rating": "4.9",
  "ratingcount": "22",
  "ingredients": "3 cups sifted all-purpose flour; ¼ teaspoon baking soda; ½ teaspoon salt; 1 cup sour cream; ½ teaspoon rum flavored extract; 1 teaspoon orange extract; ¼ teaspoon almond extract; ½ teaspoon lemon extract; 1 teaspoon vanilla extract; ½ cup apricot brandy; 1 cup butter; 3 cups white sugar; 6  eggs",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch tube pan. Mix together the flour, baking soda and salt. Set aside. 2. Combine the sour cream, rum flavoring, orange extract, almond extract, lemon extract, vanilla extract and apricot brandy. Set aside. In a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time. Beat in the flour mixture alternately with the sour cream and flavorings mixture, stirring just until incorporated. 3. Pour batter into prepared pan. Bake in the preheated oven for 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "436"
},
{
  "url": "https://www.allrecipes.com/recipe/223063/homemade-apricot-jam/",
  "name": "Homemade Apricot Jam",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 ½ pounds fresh apricots, pitted and finely chopped; ⅓ cup lemon juice; 5 ¾ cups white sugar; ½ teaspoon butter; 1 (1.75 ounce) package powdered fruit pectin",
  "directions": "1. Stir apricots, lemon juice, and sugar together in a large pot over medium heat; add butter to reduce foaming. Bring apricot mixture to a rolling boil, stirring constantly. Quickly stir in pectin; return to a full boil until pectin is dissolved, 1 minute. Remove from heat and skim off any foam with a metal spoon. 2. Sterilize jars and lids in boiling water for at least 5 minutes. Pack apricot jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. 3. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 5 minutes. 4. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, for at least 24 hours. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). It may take up to 2 weeks for jam to set. Store in a cool, dark area.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "1 day 20 mins",
  "calories": "90"
},
{
  "url": "https://www.allrecipes.com/recipe/217069/energy-bars/",
  "name": "Energy Bars",
  "rating": "4.6",
  "ratingcount": "27",
  "ingredients": "2  eggs; 1 large ripe banana, mashed; 1 cup quick-cooking rolled oats; ½ cup unsalted raw sunflower seeds; ½ teaspoon ground cinnamon; ½ cup nonfat dry milk powder; ½ cup chopped pitted dates; ½ cup raisins; ½ cup chopped walnuts; ½ cup chopped dried apricots; ½ cup toasted wheat germ; ⅓ cup pure maple syrup; ¼ cup whole-wheat pastry flour",
  "directions": "1. Preheat an oven to 350 degrees F (175 degrees C). Lightly oil a 9x13-inch baking dish. 2. Mix the eggs, banana, oats, sunflower seeds, cinnamon, milk powder, dates, raisins, walnuts, apricots, wheat germ, maple syrup, and whole-wheat pastry flour together in a large bowl until thoroughly combined; spread the mixture evenly into the prepared baking dish. 3. Bake in the preheated oven for 20 minutes; set aside to cool. Cut into 9 bars and wrap with plastic to store.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "1 hr 35 mins",
  "calories": "309"
},
{
  "url": "https://www.allrecipes.com/recipe/239539/apricot-cheesecake/",
  "name": "Apricot Cheesecake",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "1 ⅓ cups almond flour; 3 tablespoons brown sugar; 2 tablespoons sliced almonds, chopped; 2 tablespoons butter, melted; 8 ounces dried apricots; water to cover; 2 tablespoons amaretto liqueur; 1 teaspoon white sugar, or to taste; 3 (8 ounce) packages cream cheese, softened; ¾ cup white sugar; ½ cup sour cream; 2 tablespoons cornstarch; 1 ½ teaspoons vanilla extract; 3  eggs, at room temperature; 1 ½ cups sour cream; 3 tablespoons white sugar; 1 teaspoon vanilla extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a 9-inch springform pan with parchment paper. 2. Combine almond flour, brown sugar, and almonds in a bowl. Add melted butter; stir with a fork until the mixture resembles wet sand. Spread on the bottom of the parchment-lined pan. 3. Combine apricots and water in a saucepan; bring to a boil and simmer until very soft, about 10 minutes. Drain; mash apricots into a pulp. Add amaretto; mix well. Sweeten with 1 teaspoon white sugar. 4. Beat cream cheese, 3/4 cup white sugar, 1/2 cup sour cream, cornstarch, and 1 1/2 teaspoons vanilla extract in a bowl using an electric mixer on low speed. Add eggs one at a time; mix well. Fold in 2 tablespoons of apricot pulp; reserve remainder for topping. Pour cheesecake batter into the pan, covering the crust. 5. Bake in the preheated oven until edges are puffed and surface of cheesecake is firm except for a small spot in the center that will jiggle when the pan is gently shaken, about 45 minutes. 6. Beat 1 1/2 cups sour cream, 3 tablespoons white sugar, and 1 teaspoon vanilla extract together until combined. Remove cheesecake from the hot oven; spoon topping over the surface and return cake to the oven for 8 minutes more. 7. Cool to room temperature, about 1 hour. Refrigerate for 6 to 8 hours. Top with remaining apricot pulp.",
  "prep": "40 mins",
  "cook": "1 hr 8 mins",
  "total": "8 hrs 48 mins",
  "calories": "536"
},
{
  "url": "https://www.allrecipes.com/recipe/166101/apricot-chicken-with-balsamic-vinegar/",
  "name": "Apricot Chicken with Balsamic Vinegar",
  "rating": "4.1",
  "ratingcount": "134",
  "ingredients": "2 tablespoons extra-virgin olive oil; 2 pounds chicken breast tenderloins, cut into bite-size pieces; salt and pepper to taste; 1 large onion, chopped (Optional); ¼ cup balsamic vinegar, or to taste; 20  dried apricots; 1 cup chicken stock; 1 cup apricot preserves; 1 tablespoon chopped fresh thyme; 3 tablespoons chopped fresh flat-leaf parsley (Optional)",
  "directions": "1. Heat the olive oil in a large skillet with a lid over medium-high heat. Season the chicken with salt and pepper, and cook in the hot oil until golden brown around the edges, but still pink in the center, about 5 minutes. Stir in the onion, and cook for about 3 minutes more. Pour in the balsamic vinegar, bring it to a simmer, and allow it to reduce for a few minutes. 2. Cut half of the apricots in half, leaving the others whole. Place the apricots into the skillet, and pour in the chicken stock. Bring to a simmer, then stir in the apricot preserves and thyme. Reduce the heat to medium-low, cover, and simmer until the apricots have softened, 10 to 15 minutes. Sprinkle with chopped parsley to serve.",
  "prep": "25 mins",
  "cook": "30 mins",
  "total": "55 mins",
  "calories": "327"
},
{
  "url": "https://www.allrecipes.com/recipe/281337/easy-apricot-glazed-salmon/",
  "name": "Easy Apricot-Glazed Salmon",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "2 tablespoons apricot preserves; 1 teaspoon spicy brown mustard; 4 (8 ounce) fresh salmon fillets",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil. 2. Mix apricot preserves with mustard. 3. Place salmon fillets on the prepared baking sheet. Brush 1/2 of the apricot mixture over top. 4. Bake on the top rack of the preheated oven for 16 minutes. Pull from the oven and brush with remaining apricot mixture. Cook until salmon flakes easily with a fork, about 2 more minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "269"
},
{
  "url": "https://www.allrecipes.com/recipe/191359/great-grandmother-bubbies-hamantaschen/",
  "name": "Great-Grandmother Bubbie's Hamantaschen",
  "rating": "4.5",
  "ratingcount": "28",
  "ingredients": "2 cups pitted prunes, cooked, drained and mashed; 2 cups dried apricots, cooked drained and mashed; 3  eggs; 1 cup white sugar; ½ cup safflower oil; 1  lemon, zested; 1  orange, zested; 4 cups unbleached all-purpose flour; 2 teaspoons baking powder; 1 tablespoon lemon juice; ½ cup chopped walnuts; ⅓ cup white sugar, or to taste",
  "directions": "1. Place prunes and apricots into a large pot filled with water and bring to a rolling boil over high heat. Cook the fruit uncovered, stirring occasionally, until the fruit is tender, about 15 minutes. Drain fruit in a colander and mash together in a bowl using a fork. Set aside. 2. Preheat an oven to 350 degrees F (175 degrees C). 3. Whisk eggs, 1 cup sugar, oil, lemon zest, and orange zest together in a bowl and set aside. Sift flour and baking powder together in a large bowl. Stir in the egg mixture, kneading with hands until the dough comes together. Roll out dough to about 1/4 inch in thickness on a lightly floured surface. Cut circles out using a cookie cutter or the rim of a drinking glass. 4. Mix prune and apricot mixture, lemon juice, walnuts, and 1/3 cup sugar in a bowl. Place a tablespoon of the filling in the center of the cookie. Pinch the edges firmly together to create a triangle, leaving the center open to expose the filling. Repeat with the remaining cookies. 5. Bake in the preheated oven until golden brown, about 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "2 hrs 50 mins",
  "calories": "163"
},
{
  "url": "https://www.allrecipes.com/recipe/215113/apricot-salsa/",
  "name": "Apricot Salsa",
  "rating": "4.7",
  "ratingcount": "11",
  "ingredients": "3 cups chopped fresh apricot; 1 cup shallots, julienned; ½ cup chopped green bell pepper; ½ cup chopped red bell pepper; ½ cup chopped fresh pineapple; ¼ cup chopped cherry tomatoes; 1  habanero pepper, seeded and minced; 2 cloves garlic, minced; 1 teaspoon minced fresh cilantro; ½ teaspoon cumin; ¼ cup fresh lime juice",
  "directions": "1. Mix the apricots, shallots, green bell pepper, red bell pepper, pineapple, cherry tomatoes, habanero pepper, garlic, cilantro, cumin, and lime juice together in a bowl; refrigerate at least 2 hours before serving.",
  "prep": "40 mins",
  "cook": "",
  "total": "2 hrs 40 mins",
  "calories": "30"
},
{
  "url": "https://www.allrecipes.com/recipe/77008/rosemary-scented-pork-loin-stuffed-with-roasted-garlic-dried-apricots-and-cranberries-and-port-wine-pan-sauce/",
  "name": "Apricot and Cranberry Stuffed Roast Pork Loin With Port Wine Pan Sauce",
  "rating": "4.8",
  "ratingcount": "238",
  "ingredients": "3 tablespoons olive oil; 16  whole peeled garlic cloves; 2 tablespoons minced garlic cloves; 1 (8 pound) whole boneless pork loin, patted dry, at room temperature; Salt and freshly ground pepper; 3 tablespoons minced fresh rosemary (snip with scissors), divided; 16  dried apricots (or similar amount of your favorite dried fruit); ⅓ cup dried cranberries; ¼ cup apple jelly; ¼ cup port; ½ cup chicken broth; 2 tablespoons apple jelly; 2 teaspoons cornstarch",
  "directions": "1. Adjust oven rack to upper-middle position and heat oven to 250 degrees. Heat oil in a small skillet over medium-low heat. Add whole garlic cloves and cook, stirring occasionally, until soft and golden, about 5 minutes. Remove with a slotted spoon; reserve oil. 2. Turn pork loin fat-side down. Slit lengthwise, almost but not quite all the way through, to form a long pocket, leaving a 1/2-inch border of unslit meat at each end. Brush cavity with some of the reserved garlic cooking oil, and sprinkle generously with salt and pepper and 1 Tb. of the rosemary. Line cavity with sauteed garlic and apricots; sprinkle in cranberries. Tie loin together with kitchen twine or heavy-duty string at 1 1/2-inch intervals. 3. Brush with remaining oil, and sprinkle generously with salt and pepper. Set roast, fat-side up, diagonally or curved (so it fits) on a large, lipped cookie sheet or jellyroll pan. Warm 1/4 cup apple jelly along with the minced garlic and remaining rosemary. Brush mixture onto meat. 4. Roast until a meat thermometer stuck into the center registers 125 to 130 degrees. (Start checking at about 1 1/2 hours.) Remove from oven; raise oven temperature to 400 degrees. Brush loin with pan drippings, return to oven, and continue to roast until the loin is golden brown and a meat thermometer stuck into the center registers 145 degrees F (63 degrees C), about 20 minutes longer. For even more attractive coloring, broil until spotty brown, 3 to 5 minutes. 5. Let roast rest 15 to 20 minutes; transfer to a carving board. Stir juices around pan to loosen brown bits. Pour through a strainer into a small pan, and stir in port, chicken broth and remaining 2 Tbs. of jelly; bring to a simmer. Mix cornstarch with a couple of tablespoons of cold water; whisk into sauce. Simmer until lightly thickened. Slice pork and serve with a little sauce.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "366"
},
{
  "url": "https://www.allrecipes.com/recipe/266326/capirotada-mexican-dessert/",
  "name": "Capirotada (Mexican Dessert)",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "3 cups water; 16 ounces piloncillo (Mexican brown sugar cone), chopped; 3  cinnamon sticks; 2 tablespoons raw sugar; 2 tablespoons vanilla extract; ¼ teaspoon ground cloves; ¼ cup butter; 1 (18 ounce) loaf French bread, sliced; 1 ½ cups shredded Monterey Jack cheese; 1 ½ cups chopped walnuts; ½ cup raisins; ½ cup chopped dried apricots",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine water, piloncillo, cinnamon sticks, sugar, vanilla extract, and cloves in a pot. Bring to a boil. Reduce heat and cook until slightly thickened and reduced to a syrup, about 10 minutes. Remove cinnamon sticks. 3. Lightly butter each slice of bread. Place slices in a large, flat baking pan. 4. Bake in the preheated oven until toasted, 10 to 15 minutes. Let butter dry. 5. Grease a 9x13-inch cake pan and add 1/2 of the toasted bread. Sprinkle 1/2 of the Monterey Jack cheese, walnuts, raisins, and apricots over the bread. Drizzle 1/2 of the syrup on top to fully coat the bread. Top with the remaining bread, cheese, walnuts, raisins, apricots, and syrup. Cover with aluminum foil. 6. Bake in the preheated oven for 20 minutes. Remove foil and continue baking until lightly browned and heated through, about 15 minutes more. Serve warm.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "374"
},
{
  "url": "https://www.allrecipes.com/recipe/8861/apricot-glazed-chicken/",
  "name": "Apricot Glazed Chicken",
  "rating": "4.2",
  "ratingcount": "142",
  "ingredients": "6  skinless, boneless chicken breasts; 1 (10.75 ounce) can  low-sodium chicken broth; ¾ cup apricot preserves; 1 tablespoon light soy sauce; 1 tablespoon cornstarch; 1 tablespoon water",
  "directions": "1. Spray a large skillet with nonstick cooking spray. Brown chicken in heated skillet. 2. Add chicken broth, jam and soy sauce. Simmer for 20 minutes or until chicken is done (no longer pink in the center). 3. Remove chicken from skillet. Add 1 tablespoon cornstarch and 1 tablespoon water to sauce to thicken (equal amounts more of each if you like it thicker). Return chicken to skillet and turn to coat thoroughly with sauce.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "296"
},
{
  "url": "https://www.allrecipes.com/recipe/60280/cranberry-sauce-with-apricots-raisins-and-orange/",
  "name": "Cranberry Sauce with Apricots, Raisins, and Orange",
  "rating": "4.9",
  "ratingcount": "49",
  "ingredients": "1 cup orange juice; 1 cup water; 4 cups fresh cranberries; ¾ cup sugar; 1 cup chopped dried apricots; 1 cup golden raisins; 1 tablespoon grated orange zest",
  "directions": "1. In a large saucepan over medium heat, mix the orange juice, water, cranberries, sugar, apricots, raisins, and orange zest. Stir constantly until sugar has dissolved, about 5 minutes. Bring to a boil, and cook 10 minutes, or until cranberries have burst. Remove from heat, and chill at least 8 hours, or overnight, before serving cold.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "8 hrs 25 mins",
  "calories": "71"
},
{
  "url": "https://www.allrecipes.com/recipe/281452/apricot-jam-cake/",
  "name": "Apricot Jam Cake",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "2 cups all-purpose flour; ½ teaspoon baking powder; ½ teaspoon baking soda; ¼ teaspoon salt; 1 cup unsalted butter, softened; 2 cups white sugar; 3 large eggs; 1 cup sour cream; 1 (12 ounce) jar apricot preserves",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 12-cup fluted tube pan. 2. Combine flour, baking powder, baking soda, and salt in a medium bowl; set aside. 3. Cream butter in a mixing bowl with an electric mixer. Gradually add sugar and beat until light and fluffy, 5 to 7 minutes. Add eggs, one at a time, beating well after each addition. Add flour mixture in 3 batches, alternating with sour cream, beating batter briefly on low after each addition. 4. Pour 1/2 of the batter into the prepared pan and spoon 1/2 of the apricot preserves on top, spreading it to within 1/2 inch of the edges. Repeat with remaining batter and preserves. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 55 to 60 minutes. Cool in the pan for 15 minutes. Run a table knife around the edges to loosen. Invert carefully onto a serving platter.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "1 hr 30 mins",
  "calories": "401"
},
{
  "url": "https://www.allrecipes.com/recipe/15814/apricot-and-peach-fried-pies/",
  "name": "Apricot and Peach Fried Pies",
  "rating": "4.7",
  "ratingcount": "70",
  "ingredients": "4 cups all-purpose flour; 2 teaspoons salt; 1 cup shortening; 1 cup milk; 8 ounces dried apricots; 1 (6 ounce) package dried peaches; ¾ cup white sugar; water to cover; 2 cups vegetable oil for frying",
  "directions": "1. To Make Crust: In a large bowl, mix together flour and salt. Cut in shortening until mixture is crumbly. Mix in milk and stir until dough forms a ball. Roll out dough and cut into 18 6-inch circles. Set aside. 2. To Make Filling: In a large saucepan, combine apricots, peaches, and sugar. Add enough water to cover fruit. Cover pan and cook over low heat until fruit is falling apart. Remove lid and continue to cook until water is evaporated. 3. Place oil or shortening in small high-sided skillet. Place over medium heat. Spoon equal amounts of filling into each pastry circle and fold in half. Seal pastry with a fork dipped in cold water. 4. Fry a few pies at a time in hot oil, browning on both sides. Drain pies on paper towels.",
  "prep": "",
  "cook": "30 mins",
  "total": "30 mins",
  "calories": "280"
},
{
  "url": "https://www.allrecipes.com/recipe/86060/southern-apricot-chicken/",
  "name": "Southern Apricot Chicken",
  "rating": "4.1",
  "ratingcount": "33",
  "ingredients": "12  boneless, skinless chicken breast halves; 1 cup apricot preserves; 1 cup sour cream; 2 tablespoons Dijon mustard; salt and pepper to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Arrange the chicken pieces in a single layer in the bottom of a 9x13 inch baking dish. 2. Bake uncovered for 25 to 30 minutes, or until no longer pink in the center, and juices run clear. 3. While the chicken is cooking, stir together the apricot preserves, sour cream, mustard, salt and pepper in a small bowl. When the chicken is done, remove from the oven, and coat with the sauce. Return to the oven for 10 to 12 minutes, or until sauce is bubbly and hot.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "239"
},
{
  "url": "https://www.allrecipes.com/recipe/264865/boozy-apricot-jam/",
  "name": "Boozy Apricot Jam",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "3 ½ pounds firm-ripe apricots, halved and pitted; 1 (1.75 ounce) package fruit pectin (such as Sure-Jell Premium Fruit Pectin®); 7 cups white sugar; ⅓ cup apricot brandy",
  "directions": "1. Inspect 9 half-pint jars for cracks and rings for rust, discarding any defective ones. Immerse in simmering water until jam is ready. Wash new, unused lids and rings in warm soapy water. 2. Finely chop apricots and measure; you should have 5 cups prepared fruit. Transfer apricots to a large saucepan over medium heat. Stir in pectin and slowly bring mixture to a full rolling boil. Add sugar and stir to dissolve. Return to a full rolling boil over high heat and boil for exactly 1 minute, stirring constantly. Skim off any foam with a ladle or a large spoon. 3. Remove from heat and stir in the apricot brandy. 4. Pack apricot jam into the prepared jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe rims with a moist paper towel to remove any spills. Top with lids and tightly screw on rings. 5. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 10 minutes. 6. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart. Let rest for 24 hours without moving the jars. Gently press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area.",
  "prep": "30 mins",
  "cook": "5 mins",
  "total": "8 hrs 35 mins",
  "calories": "44"
},
{
  "url": "https://www.allrecipes.com/recipe/22962/swamp-water/",
  "name": "Swamp Water",
  "rating": "4.7",
  "ratingcount": "9",
  "ingredients": "1 cup ice; 2 cups prepared lemonade; 1 (1.5 fluid ounce) jigger apricot brandy; 1 (1.5 fluid ounce) jigger lime flavored vodka",
  "directions": "1. Fill a tall glass with ice. Stir in lemonade, apricot brandy, and lime vodka.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/21294/apricot-pork-chops/",
  "name": "Apricot Pork Chops",
  "rating": "4.3",
  "ratingcount": "225",
  "ingredients": "6  pork chops; 1 (1 ounce) package dry onion soup mix; 10 ounces Russian-style salad dressing; 1 cup apricot preserves",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Place the pork chops into a casserole dish. Mix onion soup mix, Russian dressing and apricot preserves together. 3. Pour mixture over chops and bake for 1 hour.",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 5 mins",
  "calories": "422"
},
{
  "url": "https://www.allrecipes.com/recipe/275587/apricot-glazed-pork-ribs/",
  "name": "Apricot-Glazed Pork Ribs",
  "rating": "5.0",
  "ratingcount": "5",
  "ingredients": "3 ½ pounds baby back pork ribs; 1 (16 ounce) jar apricot preserves; ⅓ cup soy sauce; ¼ cup packed light brown sugar; 2 teaspoons garlic powder; aluminum foil; salt and ground black pepper to taste",
  "directions": "1. Place ribs in a large roasting pan. Whisk together apricot preserves, soy sauce, brown sugar, and garlic powder until blended. Pour apricot marinade over ribs, cover, and place in the refrigerator, 8 hours to overnight. 2. Preheat the oven to 325 degrees F (165 degrees C). Line a baking pan with aluminum foil. 3. Remove ribs from the marinade and shake off excess. Place ribs in the prepared baking pan and season with salt and pepper. Pour marinade into a small saucepan and bring to a boil. Reduce heat and simmer marinade for 5 minutes; set aside. 4. Bake ribs in the preheated oven, basting frequently with the cooked marinade, until ribs are tender and meat pulls away easily from the bone, about 1 hour 30 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
  "prep": "10 mins",
  "cook": "1 hr 40 mins",
  "total": "9 hrs 50 mins",
  "calories": "327"
},
{
  "url": "https://www.allrecipes.com/recipe/39936/apricot-noodle-kugel/",
  "name": "Apricot Noodle Kugel",
  "rating": "4.4",
  "ratingcount": "25",
  "ingredients": "1 (8 ounce) package wide egg noodles; ¼ cup butter, softened; 1 (3 ounce) package cream cheese, softened; 3  eggs, beaten; ½ cup white sugar; 1 teaspoon vanilla extract; 1 cup apricot nectar; 1 cup milk; ½ cup golden raisins (Optional); 1 ½ cups cornflake crumbs; ½ cup butter, softened; ¼ cup white sugar; 1 teaspoon vanilla extract; 1 teaspoon ground cinnamon",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x9 inch baking pan. 2. Bring a large saucepan of lightly salted water to a boil. Stir in egg noodles, and cook for 8 to 10 minutes or until al dente; drain. 3. In a medium bowl, thoroughly mix egg noodles with 1/4 cup butter, cream cheese, eggs, 1/2 cup sugar, and vanilla. Stir in apricot nectar and milk. Mix in raisins. Transfer to the prepared baking pan. 4. In a separate medium bowl, mix cornflake crumbs, 1/2 cup butter, 1/4 cup sugar, remaining vanilla, and cinnamon. Spread over the egg noodle mixture. 5. Bake 45 minutes in the preheated oven, until bubbly and lightly browned.",
  "prep": "25 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "352"
},
{
  "url": "https://www.allrecipes.com/recipe/201010/apricot-pork-tenderloin/",
  "name": "Apricot Pork Tenderloin",
  "rating": "4.6",
  "ratingcount": "162",
  "ingredients": "2 pounds pork tenderloin; ¼ cup softened butter; salt and pepper to taste; 1 teaspoon ground thyme; 2 teaspoons garlic powder; 1 (18 ounce) jar apricot preserves; 2 tablespoons honey, or to taste; ¼ cup dry sherry",
  "directions": "1. Preheat an oven to 350 degrees F (175 degrees C). 2. Spread butter all over the pork tenderloin. Season with salt, pepper, and thyme. Combine garlic powder, apricot preserves, honey, and sherry in a separate bowl. 3. Roast the pork in the preheated oven for 30 to 40 minutes. Remove the pork from the oven and brush with the apricot sauce. Return the pork to the oven. Continue roasting, basting occasionally with the remaining sauce, until the pork is no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "55 mins",
  "calories": "440"
},
{
  "url": "https://www.allrecipes.com/recipe/8840/baked-apricot-chicken/",
  "name": "Baked Apricot Chicken",
  "rating": "4.5",
  "ratingcount": "748",
  "ingredients": "1 cup apricot preserves; 1 cup French dressing; 1 (1 ounce) package dry onion soup mix; 12  chicken thighs",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Stir apricot preserves, dressing, and soup mix together in a medium bowl until combined. 3. Place chicken thighs in a 9x13-inch baking dish. Pour apricot mixture over chicken and bake, uncovered, in the preheated oven until an instant-read thermometer inserted near the bone reads 165 degrees F (74 degrees C), 50 to 60 minutes.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "342"
},
{
  "url": "https://www.allrecipes.com/recipe/222949/apricot-jam/",
  "name": "Apricot Jam",
  "rating": "4.5",
  "ratingcount": "66",
  "ingredients": "8 cups fresh apricots - peeled, pitted, and crushed; ¼ cup lemon juice; 6 cups white sugar",
  "directions": "1. Mix apricots and lemon juice in a large pot over medium heat; add sugar and slowly bring to a boil, stirring until sugar dissolves. Continue to cook and stir until apricot mixture thickens, about 25 minutes. Remove from heat and skim foam off the top if necessary. 2. Meanwhile, prepare jars, lids, and rings by cleaning and sterilizing them in the dishwasher or a boiling water bath. Leave lids in simmering water until ready to seal jars. 3. Ladle hot jam into hot sterilized jars, leaving about 1/4 inch of space on top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. 4. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil, then carefully lower the jars into the pot using a holder, leaving a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 15 minutes. 5. Remove the jars from the stockpot and place them onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight and the lid does not move up or down at all. Store in a cool, dark area.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "2 hrs",
  "calories": "105"
},
{
  "url": "https://www.allrecipes.com/recipe/142127/streamline-hungarian-torte/",
  "name": "Streamline Hungarian Torte",
  "rating": "4.4",
  "ratingcount": "11",
  "ingredients": "2 cups chopped walnuts; 1 teaspoon ground cinnamon; ¾ cup white sugar; ¼ cup warm water (110 degrees F/45 degrees C); 1 (.25 ounce) envelope active dry yeast; 1 teaspoon white sugar; 4  egg yolks; ½ cup sour cream; 1 ⅓ cups butter or margarine, softened; 4 ½ cups all-purpose flour; 1 (16 ounce) jar apricot preserves; 4  egg whites; ⅔ cup white sugar",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease an 11x17 inch jelly roll pan. Mix together the walnuts, ground cinnamon, and 3/4 cup of sugar in a medium bowl and set aside. 2. In a small bowl, dissolve the yeast and 1 teaspoon sugar in warm water. Let stand until creamy, about 10 minutes. In a large bowl, stir together the yeast mixture, egg yolks, sour cream, and butter. Gradually stir in the flour until the dough becomes too stiff to use a spoon. Use your hand to knead the dough in the bowl until it becomes smooth, about 5 minutes. Divide the dough into three equal parts, form into balls, cover, and set aside to rest for about 15 minutes. 3. Roll one of the balls of dough between 2 sheets of waxed paper to fit the pan. Place the dough in the bottom of the prepared baking pan and spread with 3/4 of the nut mixture. Roll out another ball of dough in the same way, place this over the nut layer in the pan and spread the apricot preserves evenly over the dough. Roll the third ball in the same way and place on top of the layer of preserves. 4. Place the torte in the preheated oven and set the timer for 40 minutes. When the timer goes off, the top of the torte should be golden brown, if not then wait a few minutes. Place the egg whites into a clean glass or metal bowl. Whip the egg whites to soft peaks, then gradually add 2/3 cup sugar while beating the egg whites to stiff peaks. Spread the meringue evenly over the top of the torte and sprinkle with the remaining nut mixture. 5. Bake the meringue-covered torte for an additional 15 minutes. Cool the torte in the pan set on a wire rack. Trim the edges for a cleaner presentation. Serve at room temperature.",
  "prep": "20 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 30 mins",
  "calories": "267"
},
{
  "url": "https://www.allrecipes.com/recipe/102159/apricot-brown-sugar-ham/",
  "name": "Apricot Brown Sugar Ham",
  "rating": "4.7",
  "ratingcount": "300",
  "ingredients": "1 (10 pound) fully-cooked spiral cut ham; ⅔ cup brown sugar; ⅓ cup apricot jam; 1 teaspoon dry mustard powder",
  "directions": "1. Preheat the oven to 275 degrees F (135 degrees C). 2. Place the ham cut side down onto a sheet of aluminum foil. I like to put the shiny side up. Mix together the brown sugar, apricot jam, and mustard powder in a small bowl. Brush onto the ham using a pastry or barbeque brush. Reserve any leftover glaze. Enclose the foil around the ham and place on a rimmed baking sheet. 3. Roast for 2 hours in the preheated oven, or if your ham is a different size, figure 14 minutes per pound. Apply the remaining glaze 20 minutes before the ham is done.",
  "prep": "",
  "cook": "2 hrs",
  "total": "2 hrs",
  "calories": "801"
},
{
  "url": "https://www.allrecipes.com/recipe/233090/fresh-apricot-cobbler/",
  "name": "Fresh Apricot Cobbler",
  "rating": "4.7",
  "ratingcount": "42",
  "ingredients": "1 cup water; ¾ cup white sugar; 1 tablespoon cornstarch; ¼ teaspoon ground cinnamon; ⅛ teaspoon ground nutmeg; 6 cups halved fresh apricots; 1 tablespoon butter; 2 cups all-purpose flour; ¼ cup white sugar; 1 tablespoon baking powder; 1 teaspoon salt; 7 tablespoons butter; 2 tablespoons white sugar; 1 ½ cups milk",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). 2. Bring water, 3/4 cup sugar, cornstarch, cinnamon, and nutmeg to a boil; stir until thickened, about 1 minutes. Reduce heat to medium and add apricots and 1 tablespoon butter. Simmer until heated through, about 5 minutes. Transfer mixture to a 9x13-inch baking dish. 3. Combine flour, 1/4 cup sugar, baking powder, and salt in a large bowl. Cut 7 tablespoons butter into flour mixture until mixture resembles a coarse crumb. Stir milk into crumbles until topping is just moistened. Spoon topping over apricot mixture. Sprinkle remaining 2 tablespoons sugar over topping. 4. Bake in the preheated oven until golden brown, 30 to 35 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "272"
},
{
  "url": "https://www.allrecipes.com/recipe/141975/apricot-glazed-pork-chops/",
  "name": "Apricot-Glazed Pork Chops",
  "rating": "4.4",
  "ratingcount": "163",
  "ingredients": "⅓ cup apricot preserves; ⅓ cup fruity white wine, such as Gewurztraminer; ½ teaspoon ground ginger; salt and pepper to taste; 2 tablespoons olive oil; 4  boneless pork chops, 1/2 inch thick",
  "directions": "1. Mix the apricot preserves, wine, and ground ginger together in a small bowl; set aside. 2. Season the pork chops with salt and pepper. Heat the olive oil in a skillet over medium high heat. Add the pork chops and cook until brown on each side, and no longer pink in the center, about 4 minutes per side. Remove chops from the skillet. Reduce heat to medium low. Using the same skillet, pour in the apricot preserves mixture and simmer until thickened, about 4 minutes. Return pork chops to the skillet, turning to coat each side in the sauce; cook 1 minute.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "359"
},
{
  "url": "https://www.allrecipes.com/recipe/257106/slow-cooker-chicken-tagine/",
  "name": "Slow Cooker Chicken Tagine",
  "rating": "4.9",
  "ratingcount": "9",
  "ingredients": "8  skinless, boneless chicken thighs; 2 large onions, thinly sliced; 4 large carrots, thinly sliced; ½ cup raisins; ½ cup dried apricots, chopped; 2 cups chicken broth; 2 tablespoons tomato paste; 2 tablespoons lemon juice; 2 tablespoons all-purpose flour; 2 teaspoons garlic salt; 2 teaspoons ground cumin; 1 ½ teaspoons ground ginger; 1 teaspoon ground cinnamon; 1 teaspoon Hungarian paprika; 1 teaspoon ground black pepper; 3 cups water; 2 cups couscous; 1 tablespoon butter",
  "directions": "1. Layer chicken thighs, onions, carrots, raisins, and apricots in a slow cooker. 2. Whisk chicken broth, tomato paste, lemon juice, flour, garlic salt, cumin, ginger, cinnamon, paprika, and pepper together in a bowl. Pour over chicken and vegetables. 3. Cook on High 4 1/2 hours or on Low for 7 1/2 hours. Shred chicken slightly using 2 forks. Continue cooking 30 minutes. 4. Bring 3 cups water to a boil in a saucepan; remove from heat and stir in couscous and butter. Cover saucepan and let stand until water is absorbed completely, 5 to 10 minutes. Fluff couscous with a fork. Serve chicken tagine over couscous.",
  "prep": "15 mins",
  "cook": "5 hrs",
  "total": "5 hrs 15 mins",
  "calories": "419"
},
{
  "url": "https://www.allrecipes.com/recipe/214747/apricot-pie/",
  "name": "Apricot Pie",
  "rating": "4.6",
  "ratingcount": "41",
  "ingredients": "2 ½ cups all-purpose flour; 1 teaspoon salt; 1 cup butter-flavored shortening; 6 tablespoons water, or as needed; 1 cup white sugar; 1/4 cup all purpose flour; 1/4 teaspoon ground cinnamon; 5 cups fresh apricots, pitted and quartered; 1 teaspoon lemon juice; 1 teaspoon sugar for sprinkling, or as desired",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Make the dough: Mix flour and salt together in a bowl. Cut in shortening with a pastry cutter until mixture is crumbly. Using a fork, mix in water, 1 tablespoon at a time, until dough just holds together. Divide dough in half and form each half into a ball. 3. Roll each ball out on a floured surface into a crust big enough for a 9-inch pie dish with an inch or so to spare. Carefully lift one crust, fold it into quarters, position it into a 9-inch pie dish, and unfold to fit. Set second crust aside. 4. Make the filling: Mix 1 cup sugar, flour, and cinnamon together in a large bowl until thoroughly combined. Stir in apricots and lemon juice. Spoon filling over bottom crust, then top with remaining crust. Crimp crust edges together with a fork and cut away any excess. Cut slits into top crust to allow steam to escape. Cover the edges with strips of aluminum foil to prevent burning. 5. Bake on the center rack of the preheated oven until the pie is browned and the filling is bubbling and thickened, 35 to 45 minutes. Remove to a rack to cool and sprinkle top with remaining 1 teaspoon of sugar.",
  "prep": "45 mins",
  "cook": "35 mins",
  "total": "2 hrs 20 mins",
  "calories": "542"
},
{
  "url": "https://www.allrecipes.com/recipe/10201/apricot-cream-cheese-thumbprints/",
  "name": "Apricot Cream Cheese Thumbprints",
  "rating": "4.4",
  "ratingcount": "328",
  "ingredients": "1 ½ cups butter, softened; 1 ½ cups white sugar; 1 (8 ounce) package cream cheese, softened; 2  eggs; 2 tablespoons lemon juice; 1 ½ teaspoons lemon zest; 4 ½ cups all-purpose flour; 1 ½ teaspoons baking powder; 1 cup apricot preserves; ⅓ cup confectioners' sugar for decoration",
  "directions": "1. In a large bowl, cream together butter, sugar, and cream cheese until smooth. Beat in eggs, one at a time, then stir in lemon juice and zest. Combine flour and baking powder in a bowl; stir into cream cheese mixture until just combined. Cover and chill until firm, about 1 hour. 2. Preheat the oven to 350 degrees F (175 degrees C). Roll tablespoonfuls of dough into balls, and place them 2 inches apart on ungreased cookie sheets. Using your finger, make an indention in the center of each ball and fill with 1/2 teaspoon of apricot preserves. 3. Bake in the preheated oven until the edges are golden, switching racks halfway through, about 15 minutes. Allow cookies to cool on the baking sheets briefly before removing to wire racks to cool completely. Sprinkle with confectioner's sugar. Repeat to bake remaining cookies.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "2 hrs",
  "calories": "90"
},
{
  "url": "https://www.allrecipes.com/recipe/214692/apricot-chutney/",
  "name": "Apricot Chutney",
  "rating": "4.5",
  "ratingcount": "8",
  "ingredients": "½ whole head garlic; ¼ teaspoon olive oil; 1 large onion, chopped; 1 tablespoon olive oil; 3 cups apricot preserves; 1 cup white vinegar; 2 teaspoons ground ginger; ½ teaspoon cayenne pepper; ½ teaspoon salt",
  "directions": "1. Preheat oven to 450 degrees F (230 degrees C). 2. Slice the top off the half head of garlic with a sharp knife, exposing the cloves. Discard the top. Place the head of garlic on a piece of aluminum foil, drizzle with 1/4 teaspoon of olive oil, and wrap the foil around the garlic. Roast in the preheated oven until golden brown, 30 to 40 minutes. 3. While garlic is roasting, place the onion and 1 tablespoon of olive oil into a saucepan over medium heat and cook and stir until the onion is browned, 10 to 15 minutes. Remove from heat. Stir in the apricot preserves, vinegar, ginger, cayenne pepper, and salt until thoroughly combined. 4. Squeeze the roasted garlic cloves out of their skins, and mash them in a bowl with a spoon. Mix the garlic into the chutney; bring to a boil over medium heat. Reduce heat and simmer until thickened, about 25 minutes, stirring occasionally. Stir carefully because any splashes of chutney will be burning hot. 5. Pack the chutney into sterilized jars and process to seal.",
  "prep": "15 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 20 mins",
  "calories": "52"
},
{
  "url": "https://www.allrecipes.com/recipe/86338/fruity-couscous-salad/",
  "name": "Fruity Couscous Salad",
  "rating": "4.3",
  "ratingcount": "65",
  "ingredients": "1 ⅓ cups dry couscous; 2 cups boiling water; ⅔ cup sweetened dried cranberries; ⅔ cup slivered almonds; ½ cup packed dried apricots, chopped; 3 medium scallions, thinly sliced with greens; 1 teaspoon cumin; salt and ground black pepper to taste",
  "directions": "1. Place couscous in a bowl and pour boiling water over top. Gently stir, then cover and let sit for 5 minutes. 2. Meanwhile, place cranberries in a glass liquid measure and add water to cover. Microwave on high for 1 minute; drain. 3. Add cranberries to the couscous, along with almonds, apricots, scallions, cumin, salt, and pepper. Toss well to combine. Serve at room temperature or chilled.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "218"
},
{
  "url": "https://www.allrecipes.com/recipe/278891/moroccan-beef-and-lentil-stew/",
  "name": "Moroccan Beef and Lentil Stew",
  "rating": "5.0",
  "ratingcount": "8",
  "ingredients": "2 tablespoons vegetable oil; 2  carrots, chopped; 1  celery stalk, chopped; 1  onion, chopped; 4 cloves garlic, minced; 1 ½ pounds chuck roast, cut into 1-inch cubes; 1 teaspoon salt, or to taste; 1 teaspoon ground turmeric; 1 teaspoon onion powder; 1 teaspoon garlic powder; ½ teaspoon ground black pepper, or to taste; ½ teaspoon ground cinnamon; ½ teaspoon ground ginger; ½ teaspoon ground cumin; ½ teaspoon ground coriander; ¼ teaspoon ground allspice; 3 tablespoons tomato paste; 4 cups low-sodium beef broth; 1 tablespoon molasses; 2  bay leaves; 1 cup dried red lentils; ½ cup dried apricots, chopped; ½  lemon, juiced",
  "directions": "1. Heat oil in a Dutch oven over medium heat. Add carrots, celery, and onion; cook until slightly softened, about 3 minutes. Stir in garlic and cook for 1 minute. 2. Add beef. Sprinkle salt, turmeric, onion powder, garlic powder, pepper, cinnamon, ginger, cumin, coriander, and allspice over beef and vegetables. Stir to mix. Continue to cook, stirring occasionally, until beef is browned, about 5 minutes. 3. Stir in tomato paste until combined and cook for 1 minute. Add beef broth, molasses, and bay leaves. Bring stew to a simmer. Reduce heat to low, cover, and cook, stirring occasionally, until beef is tender, about 50 minutes. 4. Mix in lentils and dried apricots. Bring stew back to a simmer. Cover and cook on low, stirring occasionally, until lentils soften, about 15 minutes. Remove and discard bay leaves. Adjust salt and pepper; mix in fresh lemon juice just before serving.",
  "prep": "15 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 35 mins",
  "calories": "406"
},
{
  "url": "https://www.allrecipes.com/recipe/12524/dried-apricot-pie/",
  "name": "Dried Apricot Pie",
  "rating": "3.5",
  "ratingcount": "11",
  "ingredients": "18 ounces dried apricots; 1 ¾ cups water; 1 tablespoon cornstarch; 1 tablespoon orange liqueur; 1 ¾ cups white sugar; 1 recipe pastry for a 9 inch double crust pie",
  "directions": "1. Preheat oven to 400 degrees F (205 degrees C). 2. Slice the dried apricots in half. Rinse them with water. Place them in a sauce pan with the water, bring to a boil and cook for 5 minutes. 3. Combine the cornstarch with the orange liqueur and about 1 tablespoon of the apricots' cooking liquid. Mix until smooth then stir into the cooked apricots. Add the white sugar and combine. Pour mixture into the unbaked pie shell and seal with the top crust. Brush milk over top crust for color, if desired. 4. Bake at 400 degrees F (205 degrees C) for 1 hour.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "559"
},
{
  "url": "https://www.allrecipes.com/recipe/274397/instant-pot-chicken-tagine-with-apricots-and-chickpeas/",
  "name": "Instant Pot Chicken Tagine with Apricots and Chickpeas",
  "rating": "4.6",
  "ratingcount": "11",
  "ingredients": "1 tablespoon olive oil; 4  skin-on, bone-in chicken thighs; 1 large onion, sliced; 3 cloves garlic, minced; 1 teaspoon ground cinnamon; 1 teaspoon ground cumin; 1 teaspoon ground turmeric; 1 teaspoon red pepper flakes; 1 pinch saffron; 1 (15 ounce) can diced tomatoes; 1 cup chicken broth; ⅓ cup halved dried apricots; salt and ground black pepper to taste; 1 (15 ounce) can chickpeas, rinsed and drained; 2 tablespoons chopped fresh mint",
  "directions": "1. Turn on a multi-functional pressure cooker (such as Instant Pot) and select Saute function. Place olive oil in the hot cooker and fry chicken thighs until browned, 2 to 3 minutes per side. Remove chicken from the inner pot and set aside. 2. Add onion and garlic to the pot, followed by cinnamon, cumin, turmeric, red pepper flakes, and saffron. Cook and stir until onion is soft, about 5 minutes. Press Cancel to leave Saute mode. 3. Place chicken back into the pot on top of onion mixture. Pour in tomatoes and chicken broth. Sprinkle apricots over the top. Season with salt and pepper. Close and lock the lid. 4. Select high pressure according to the manufacturer's instructions; set timer for 15 minutes. Allow 10 to 15 minutes for pressure to build. 5. Release pressure using the natural-release method according to the manufacturer's instructions, 10 to 40 minutes. Unlock and remove the lid. Stir in chickpeas and mint leaves.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "254"
},
{
  "url": "https://www.allrecipes.com/recipe/281342/simple-apricot-glazed-meatloaf/",
  "name": "Simple Apricot-Glazed Meatloaf",
  "rating": "4.7",
  "ratingcount": "12",
  "ingredients": "1 ½ pounds ground beef; 1 cup bread crumbs; 1 small onion, minced; 1 large egg, beaten; 2 cloves garlic, minced; 1 ½ tablespoons apricot preserves; 1 tablespoon kosher salt; 1 ½ teaspoons freshly ground black pepper; 1 cup ketchup; ½ cup apricot preserves; ¼ cup brown sugar; 2 tablespoons hot sauce (such as Frank's Red Hot ®) (Optional); 1 tablespoon Worcestershire sauce; 1 tablespoon apple cider vinegar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Make the meatloaf: Combine ground beef, bread crumbs, onion, egg, garlic, apricot preserves, kosher salt, and pepper in a large mixing bowl; mix well until thoroughly combined. Transfer to a 9x5-inch loaf pan. 3. Bake in the preheated oven for 45 minutes. 4. Meanwhile, make the glaze: Mix ketchup, apricot preserves, brown sugar, hot sauce, Worcestershire sauce, and cider vinegar together in a medium bowl. 5. Remove meatloaf from the oven and pour glaze over top. Continue cooking until no longer pink in the center, about 15 minutes longer. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). 6. Let rest 5 minutes before serving.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "483"
},
{
  "url": "https://www.allrecipes.com/recipe/62392/apricot-leather/",
  "name": "Apricot Leather",
  "rating": "4.4",
  "ratingcount": "39",
  "ingredients": "1 teaspoon lemon juice; 2 cups pitted and diced fresh apricots; ½ cup white sugar",
  "directions": "1. Preheat the oven to 150 degrees F (165 degrees C), or the lowest setting you have. 2. Combine lemon juice, apricots, and sugar in a saucepan. Cook over medium heat until sugar has dissolved. Transfer to a blender and puree until smooth. 3. Cover an 11x17-inch pan or cookie sheet with a layer of plastic wrap. Pour pureed fruit onto the prepared pan and spread evenly to within 1 inch of the edge. 4. Bake for 4 to 6 hours in the preheated oven, using a spoon or a pair of tongs to keep the door slightly ajar, or until puree has dried and is no longer sticky. Once dry, you can cut it into strips; store in an airtight container.",
  "prep": "30 mins",
  "cook": "6 hrs",
  "total": "6 hrs 30 mins",
  "calories": "39"
},
{
  "url": "https://www.allrecipes.com/recipe/215112/fresh-apricot-crisp/",
  "name": "Fresh Apricot Crisp",
  "rating": "4.1",
  "ratingcount": "36",
  "ingredients": "4 cups apricot halves; ¼ cup white sugar; ¾ cup brown sugar; ½ cup all-purpose flour; ½ cup butter; ¾ cup rolled oats",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Arrange apricots in a 9x12-inch baking dish and sprinkle with white sugar. 3. Mix together brown sugar and flour in a bowl; cut in butter with a pastry cutter until mixture resembles coarse crumbs. Lightly stir in rolled oats and spoon mixture over apricots. 4. Bake in the preheated oven until fruit is soft and topping is browned and crisp, 35 to 40 minutes.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "363"
},
{
  "url": "https://www.allrecipes.com/recipe/12979/apricot-lentil-soup/",
  "name": "Apricot Lentil Soup",
  "rating": "4.6",
  "ratingcount": "305",
  "ingredients": "⅓ cup dried apricots; 1  onion, chopped; 2 cloves garlic, minced; 3 tablespoons olive oil; 5 cups chicken stock; 1 ½ cups red lentils; 3 Roma (plum) tomatoes - peeled, seeded, and chopped; ½ teaspoon ground cumin; ½ teaspoon dried thyme; salt and ground black pepper to taste; 2 tablespoons fresh lemon juice",
  "directions": "1. Sauté apricots, onion, and garlic in olive oil, about 5 minutes. Add chicken stock and lentils and bring to a boil. Reduce the heat and simmer for 30 minutes. 2. Stir in tomatoes and season with cumin, thyme, salt, and pepper to taste. Simmer for 10 minutes. 3. Stir in lemon juice. Purée 1/2 of the soup in a blender, then return to the pot. Serve.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "263"
},
{
  "url": "https://www.allrecipes.com/recipe/8559/apricot-chicken-i/",
  "name": "Easy Apricot Chicken",
  "rating": "4.4",
  "ratingcount": "482",
  "ingredients": "1 (10 fluid ounce) bottle Russian-style salad dressing; 1 cup apricot preserves; 1 ½ ounces dry onion soup mix; 6  skinless, boneless chicken breast halves",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Place chicken into a 4-quart casserole dish. 2. Mix salad dressing, jam, and soup mix together in a bowl until well combined; pour over chicken. 3. Cover the dish and bake in the preheated oven until no longer pink in the center and the juices run clear, about 1 hour. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 5 mins",
  "calories": "456"
},
{
  "url": "https://www.allrecipes.com/recipe/254370/oat-free-and-gluten-free-granola-bars-clean-eating/",
  "name": "Oat-Free and Gluten-Free Granola Bars (Clean Eating)",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "1 ¼ cups almonds, divided; 1 ¼ cups sunflower seeds, divided; 2 cups shredded unsweetened coconut; 1 cup diced dried apricots; 1 ½ cups coconut oil; ½ cup honey; ¼ cup ground cinnamon, or as needed; 1 teaspoon vanilla extract; ½ teaspoon salt",
  "directions": "1. Place 3/4 cups almonds and 3/4 cups sunflower seeds into a food processor; chop until nuts are in 1/4-inch pieces, 1 to 2 minutes. Remove from food processor and pour in a bowl. Place remaining almonds and sunflower seeds into the food processor; roughly chop into larger pieces, about 1 minute. Mix remaining nuts, seeds, shredded coconut, and dried apricot into the 1/4-inch nuts until fruit-and-nut mixture is combined. 2. Combine coconut oil, honey, ground cinnamon, vanilla extract, and salt in a saucepan over medium-low heat; cook until the coconut oil mixture bubbles and turns a lighter color, 3 to 5 minutes. 3. Pour coconut oil mixture over fruit and nut mixture; stir until granola mixture takes on the consistency of wet sand, about 1 minute. 4. Line a baking sheet with waxed paper. Pour granola mixture onto sheet; place a second sheet of waxed paper on top of granola mixture. Push down on the waxed paper with your hands until granola mixture has been evenly spread. Pack very tightly so bars will not fall apart. 5. Let cool until granola has hardened, 2 to 3 hours. Cut into bars.",
  "prep": "10 mins",
  "cook": "3 mins",
  "total": "2 hrs 13 mins",
  "calories": "352"
},
{
  "url": "https://www.allrecipes.com/recipe/223062/dried-apricot-jam/",
  "name": "Dried Apricot Jam",
  "rating": "4.6",
  "ratingcount": "10",
  "ingredients": "4 ½ cups dried apricots; 4 ½ cups boiling water; 1 teaspoon vanilla extract; 1 (1.75 ounce) package powdered fruit pectin; 7 cups white sugar; ¼ cup lemon juice",
  "directions": "1. Soak apricots in boiling water in a bowl until hydrated, about 30 minutes. Blend apricots, remaining water, and vanilla extract in a food processor, working in batches, until blended but still slightly chunky. 2. Combine apricot mixture with pectin in a large pot over medium heat; cook until just boiling. Add sugar and lemon juice; boil until sugar has dissolved, 1 to 2 minutes. 3. Sterilize jars and lids in boiling water for at least 5 minutes. Pack the apricot jam into the hot, sterilized jars, filling the jars to within 1/4-inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. 4. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes. 5. Remove jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool, about 1 hour. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
  "prep": "",
  "cook": "20 mins",
  "total": "1 hr 50 mins",
  "calories": "48"
},
{
  "url": "https://www.allrecipes.com/recipe/257104/moroccan-chicken-tagine/",
  "name": "Moroccan Chicken Tagine",
  "rating": "4.9",
  "ratingcount": "14",
  "ingredients": "¼ cup ground cinnamon; ¼ cup ground cumin; 2 tablespoons ground turmeric; 2 tablespoons ground coriander; 2 tablespoons ground ginger; 2 tablespoons crushed dried mint; 1 tablespoon salt; 2 teaspoons ground black pepper; ½ cup chopped dried apricots; ¼ cup raisins; 4  bone-in chicken thighs; ¼ cup olive oil, or as needed; ½ small onion, minced; 2 teaspoons chopped garlic; 1 cup chicken broth; ¼ cup honey; ½ bunch fresh cilantro, chopped; ¼ cup toasted sliced almonds",
  "directions": "1. Make the spice mix: Mix cinnamon, cumin, turmeric, coriander, ginger, mint, salt, and pepper together in a bowl. Measure out 1/2 cup spice mix and set remaining mix aside for another use. 2. Make the tagine: Bring a small pot of water to a boil. Add apricots and raisins and cook until soft, about 5 minutes. Drain, reserving 1/2 cup cooking water. 3. Place chicken and 1/2 cup reserved spice mix into a bowl; toss until thoroughly coated. 4. Pour enough olive oil into a large skillet or Dutch oven to coat the bottom; turn heat to medium. Cook chicken in the hot skillet until golden brown and it releases easily from the skillet, 3 to 4 minutes per side. Add onion and garlic; cook and stir until fragrant, 2 to 3 minutes. 5. Add apricots, raisins, and reserved 1/2 cup cooking water; stir in chicken broth and honey. Cover, reduce the heat to low, and cook until chicken is very tender, 1 1/2 to 2 hours. 6. Serve chicken garnished with cilantro and almonds.",
  "prep": "20 mins",
  "cook": "1 hr 50 mins",
  "total": "2 hrs 10 mins",
  "calories": "371"
},
{
  "url": "https://www.allrecipes.com/recipe/215207/apricot-chicken-curry/",
  "name": "Apricot Chicken Curry",
  "rating": "4.8",
  "ratingcount": "12",
  "ingredients": "8  chicken drumsticks; salt and pepper to taste; 2 tablespoons olive oil; 3 cloves garlic, minced; ½ teaspoon red pepper flakes, or to taste; 4 cups apricot nectar; 1 tablespoon water; 1 teaspoon cornstarch, or as needed; 3 tablespoons Madras curry powder; 1 cup dried apricots; 4 medium carrots, thinly sliced; 1 large onion, roughly chopped; 1 large green bell pepper, roughly chopped; 1  fresh green chile pepper, minced (Optional); ½ cup chopped water chestnuts (Optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Season chicken with salt and pepper. 2. Heat oil in a large cast iron skillet over medium heat. Add garlic and red pepper flakes; cook and stir until garlic is soft and fragrant, 1 to 2 minutes. Add chicken and brown for about 3 minutes per side. 3. Transfer the skillet to the preheated oven and bake until chicken is no longer pink at the bone and the juices run clear, 7 to 10 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 4. Bring apricot nectar to a boil in a large pot over medium-high heat, then reduce then heat to medium-low. Mix water and cornstarch together in a small bowl; stir into apricot nectar. Stir in curry powder, then apricots. Add baked chicken. 5. Place the cast iron skillet with chicken drippings over medium heat. Stir in carrots, onion, bell pepper, and chile pepper; cook and stir until onion is translucent, about 5 minutes. Pour chicken and apricot sauce into the skillet; cover and simmer until vegetables are tender, about 10 minutes. Season again with salt and pepper. Stir in water chestnuts just before serving.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "649"
},
{
  "url": "https://www.allrecipes.com/recipe/217136/honey-apricot-pork-chops/",
  "name": "Honey Apricot Pork Chops",
  "rating": "4.4",
  "ratingcount": "105",
  "ingredients": "4  boneless pork chops; kosher salt and freshly cracked pepper to taste; 1 tablespoon olive oil; 2 tablespoons honey; 4  fresh apricots, pitted and cut into wedges; 3 cloves garlic, minced, or to taste; 1 teaspoon chopped fresh parsley",
  "directions": "1. Pat pork chops dry with paper towels, then sprinkle both sides with salt and pepper. 2. Heat olive oil in a skillet over medium-high heat. Add chops and brown well, about 5 minutes per side. Stir in honey, apricots, and garlic; cover and simmer until pork is tender, about 8 minutes. An instant-read thermometer, inserted into the center, should read at least 145 degrees F (63 degrees C). 3. Serve chops topped with apricots and pan juices. Garnish with parsley.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "182"
}]