[{
  "url": "https://www.allrecipes.com/recipe/15750/hummingbird-cake/",
  "name": "Hummingbird Cake",
  "rating": "4.6",
  "ratingcount": "214",
  "ingredients": "3 cups all-purpose flour; 2 cups white sugar; 1 teaspoon baking soda; 1 teaspoon salt; 2 cups mashed bananas; 1 ½ cups canola oil; 1 cup chopped black walnuts; 1 (8 ounce) can crushed pineapple, drained; 3 large eggs; 1 pound confectioners' sugar; 1 (8 ounce) package cream cheese, softened; ¼ pound butter, softened; 1 teaspoon vanilla extract",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch cake pans. 2. Make cake: Sift together flour, sugar, baking soda, and salt in a large bowl. Combine bananas, oil, walnuts, pineapple, and eggs in another large bowl; mix well. Stir flour mixture into banana mixture until combined. Pour batter into the prepared pans. 3. Bake in the preheated oven until a toothpick inserted into the center of each pan comes out clean, about 1 hour. Allow cakes to cool on wire racks. 4. Meanwhile, make frosting: Beat together confectioners' sugar, cream cheese, butter, and vanilla in a medium bowl until smooth. 5. Evenly spread frosting on the middle, sides, and top of cooled cake.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "719"
},
{
  "url": "https://www.allrecipes.com/recipe/254832/clean-banana-oat-cookies/",
  "name": "Clean Banana Oat Cookies",
  "rating": "3.9",
  "ratingcount": "114",
  "ingredients": "2  bananas, mashed; ¼ cup milk; 1 large egg, beaten; 1 teaspoon honey; ½ teaspoon vanilla extract; 1 cup rolled oats, or as needed; 1 teaspoon ground cinnamon; ½ teaspoon baking powder; ⅛ teaspoon salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Mix together mashed bananas, milk, egg, honey, and vanilla in a bowl. Stir in oats, cinnamon, baking powder, and salt until well combined. Add more oats if the batter is too runny. 3. Spoon mounds of batter a few inches apart onto the prepared baking sheet. 4. Bake in the preheated oven until the tops look dry and edges are golden, about 15 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "55"
},
{
  "url": "https://www.allrecipes.com/recipe/231180/quick-banana-milkshake-ice-cream-free/",
  "name": "Quick Banana Milkshake (Ice Cream Free)",
  "rating": "4.6",
  "ratingcount": "90",
  "ingredients": "3  ice cubes; 1 cup milk; 1  banana; 1 tablespoon white sugar, or to taste; 1 pinch ground cinnamon",
  "directions": "1. Gather all ingredients. 2. Combine ice, milk, banana, sugar, and cinnamon in a blender; blend until smooth.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "139"
},
{
  "url": "https://www.allrecipes.com/recipe/233146/vegan-banana-muffins/",
  "name": "Vegan Banana Muffins",
  "rating": "4.8",
  "ratingcount": "348",
  "ingredients": "3 cups all-purpose flour; 1 cup white sugar; ½ cup brown sugar; 2 teaspoons ground cinnamon; 2 teaspoons baking powder; 1 teaspoon baking soda; 1 teaspoon ground nutmeg; 1 teaspoon salt; 2 cups mashed ripe bananas; 1 cup canola oil; 1 cup coconut milk",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or line with paper liners. 2. Mix flour, white sugar, brown sugar, cinnamon, baking powder, baking soda, nutmeg, and salt together in a large bowl. Stir bananas, canola oil, and coconut milk together in a separate bowl; stir banana mixture into flour mixture until just combined. Divide batter among the muffin cups, filling each about 3/4 full. 3. Bake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, 30 to 35 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "451"
},
{
  "url": "https://www.allrecipes.com/recipe/214581/brown-sugar-banana-bread/",
  "name": "Brown Sugar Banana Bread",
  "rating": "4.5",
  "ratingcount": "490",
  "ingredients": "4  ripe bananas, cut into chunks; 1 ¼ cups light brown sugar; ½ cup butter, softened; 1 jumbo egg; ¼ cup whole milk; 1 teaspoon cinnamon; 1 teaspoon vanilla extract; 2 cups all-purpose flour; 1 teaspoon baking powder; ½ teaspoon baking soda; ½ teaspoon kosher salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan. 2. Place bananas into a large resealable plastic bag; seal the bag and smoosh bananas with your fingers until well mashed. Set aside. 3. Mix together brown sugar and butter in a large bowl with an electric mixer on medium speed until light and fluffy, 1 to 2 minutes. Cut a corner from the plastic bag; squeeze mashed bananas into brown sugar mixture in the bowl. Add egg, milk, cinnamon, and vanilla; beat on medium speed until well combined. Mix in flour, baking powder, baking soda, and kosher salt on low speed just until smooth, about 1 minute. Spread into the prepared loaf pan. 4. Bake in the preheated oven until lightly browned on top and a toothpick inserted into the center comes out clean, about 40 minutes.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "415"
},
{
  "url": "https://www.allrecipes.com/recipe/138159/pineapple-and-banana-smoothie/",
  "name": "Pineapple and Banana Smoothie",
  "rating": "4.6",
  "ratingcount": "177",
  "ingredients": "4  ice cubes; ¼  fresh pineapple - peeled, cored and cubed; 1 large banana, cut into chunks; 1 cup pineapple or apple juice",
  "directions": "1. Gather all ingredients. 2. Place ice cubes, pineapple, banana, and pineapple juice into the container of a blender. 3. Purée on high until smooth. 4. Enjoy!",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "313"
},
{
  "url": "https://www.allrecipes.com/recipe/269764/chocolate-banana-muffins/",
  "name": "Chocolate Banana Muffins",
  "rating": "4.7",
  "ratingcount": "132",
  "ingredients": "1 ½ cups all-purpose flour; ¼ cup unsweetened cocoa powder; 1 ½ teaspoons baking powder; ½ teaspoon baking soda; ½ teaspoon salt; ½ cup white sugar; ½ cup canola oil; ¼ cup milk; 1  egg; 1 teaspoon vanilla extract; 2 large very ripe bananas, mashed; ¾  mini semisweet chocolate chips",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a12-cup muffin tin with paper liners. 2. Combine flour, cocoa, baking powder, baking soda, and salt together in a large bowl. 3. Whisk sugar, oil, milk, egg, and vanilla extract together in a separate bowl until smooth; stir into flour mixture until just moistened. Fold in bananas and chocolate chips. 4. Divide batter among the muffin cups, filling each about 3/4 full. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "205"
},
{
  "url": "https://www.allrecipes.com/recipe/16666/banana-bran-muffins/",
  "name": "Banana Bran Muffins",
  "rating": "4.7",
  "ratingcount": "386",
  "ingredients": "½ cup butter, softened; ½ cup brown sugar; 3  bananas, mashed; 2 large eggs; ¼ cup milk; 1 teaspoon vanilla extract; 1 ½ cups all-purpose flour; ½ cup wheat bran; 1 teaspoon baking powder; 1 teaspoon baking soda; ¼ teaspoon salt; ½ cup chopped walnuts",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease a muffin pan or line with paper liners. 2. Cream together butter and brown sugar in a large bowl with an electric mixer on medium speed until fluffy. Add mashed bananas, eggs, milk, and vanilla; mix well. Stir in flour, bran, baking powder, baking soda, and salt; blend just until moistened. Stir in walnuts. Pour batter into the prepared muffin cups. 3. Bake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, 20 to 25 minutes. Cool muffins in the pan for 5 minutes, then transfer to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "239"
},
{
  "url": "https://www.allrecipes.com/recipe/246624/best-yet-banana-mini-muffins/",
  "name": "Best Yet Banana Mini Muffins",
  "rating": "4.7",
  "ratingcount": "75",
  "ingredients": "cooking spray; 1 ½ cups all-purpose flour; 1 teaspoon baking powder; 1 teaspoon baking soda; 3  bananas, mashed; ¾ cup white sugar; ⅓ cup melted butter; 1  egg, beaten",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease 2 mini muffin tins with cooking spray. 2. Combine flour, baking powder, and baking soda in a bowl. 3. Blend bananas, sugar, butter, and egg together in a separate bowl. Add to flour mixture; stir batter well to combine. Scoop batter into prepared muffin cups, filling each 2/3 full. 4. Bake in the preheated oven until tops spring back when lightly pressed, about 15 minutes. Cool in the tins for 5 minutes. Transfer to a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "46"
},
{
  "url": "https://www.allrecipes.com/recipe/16706/banana-pumpkin-bread/",
  "name": "Banana Pumpkin Bread",
  "rating": "4.3",
  "ratingcount": "545",
  "ingredients": "2  ripe bananas, mashed; 1 ⅓ cups canned pumpkin puree; ½ cup honey; ½ cup white sugar; ⅓ cup vegetable oil; 2 large eggs; 2 ½ cups all-purpose flour; 2 teaspoons pumpkin pie spice; 1 teaspoon baking powder; 1 teaspoon baking soda; 1 teaspoon ground cinnamon; ½ teaspoon salt; ¾ cup raisins (Optional); ½ cup walnut pieces (Optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan. 2. Stir together bananas, pumpkin, honey, sugar, vegetable oil, and eggs in a large bowl. Combine flour, pie spice, baking powder, baking soda, cinnamon, and salt in a separate bowl. Stir flour mixture into banana mixture until just combined. Fold in raisins and walnuts. Pour batter into the prepared pan. 3. Bake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, about 45 minutes. Cool loaf in the pan for 10 minutes before transferring to a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "328"
},
{
  "url": "https://www.allrecipes.com/recipe/272347/air-fryer-roasted-bananas/",
  "name": "Air Fryer Roasted Bananas",
  "rating": "4.5",
  "ratingcount": "10",
  "ingredients": "1  banana, sliced into 1/8-inch thick diagonals; avocado oil cooking spray",
  "directions": "1. Gather all ingredients. 2. Preheat an air fryer to 375 degrees F (190 degrees C) according to manufacturer's instructions. Line the air fryer basket, if desired. 3. Place banana slices into the basket, making sure that they are not touching; cook in batches if necessary. Mist banana slices with avocado oil. 4. Cook in the air fryer for 5 minutes. Remove the basket and flip banana slices carefully (they will be soft). Cook until banana slices are browned and caramelized, an additional 2 to 3 minutes. Carefully remove from basket.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "107"
},
{
  "url": "https://www.allrecipes.com/recipe/15439/southern-style-banana-split-cake/",
  "name": "Southern Style Banana Split Cake",
  "rating": "4.8",
  "ratingcount": "146",
  "ingredients": "2 cups graham cracker crumbs; ¾ cup white sugar; ¼ pound butter, melted; 2 (8 ounce) packages cream cheese; 1 ½ cups confectioners' sugar; 4  bananas, sliced; 1 (15 ounce) can crushed pineapple, drained; 1 (16 ounce) container frozen whipped topping, thawed; 1 (16 ounce) jar maraschino cherries, drained; 12 ounces crushed peanuts",
  "directions": "1. Combine graham cracker crumbs, white sugar, and melted butter in a large bowl; mix well. Press into a 9x13-inch cake pan; refrigerate until chilled, about 30 minutes. 2. Beat together cream cheese and confectioners' sugar in the large bowl until smooth; spread over chilled graham cracker crust. 3. Layer sliced bananas and crushed pineapple over cream cheese mixture; cover with whipped topping. 4. Top with cherries and chopped nuts. Refrigerate for at least 1 hour and serve chilled.",
  "prep": "30 mins",
  "cook": "",
  "total": "2 hrs",
  "calories": "748"
},
{
  "url": "https://www.allrecipes.com/recipe/23426/almost-no-fat-banana-bread/",
  "name": "Almost No Fat Banana Bread",
  "rating": "4.4",
  "ratingcount": "936",
  "ingredients": "cooking spray; 1 ½ cups all-purpose flour; ¾ cup white sugar; 1 ¼ teaspoons baking powder; ½ teaspoon baking soda; ½ teaspoon ground cinnamon; 1 cup banana, mashed; ¼ cup applesauce; 2  egg whites",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease an 8x4-inch loaf pan. 2. Stir flour, sugar, baking powder, baking soda, and cinnamon together in a large bowl. Add banana, applesauce, and egg whites; stir just until combined. Pour batter into the prepared pan. 3. Bake in preheated oven until a toothpick inserted into the center comes out clean, 50 to 55 minutes. Turn out onto a wire rack and allow to cool before slicing.",
  "prep": "10 mins",
  "cook": "55 mins",
  "total": "1 hr 5 mins",
  "calories": "127"
},
{
  "url": "https://www.allrecipes.com/recipe/256919/creamy-banana-ice-cream/",
  "name": "Banana Ice Cream",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "4  bananas, sliced; ½ cup milk; ½ cup heavy whipping cream",
  "directions": "1. Line a baking sheet with parchment paper. Arrange banana slices on paper and freeze until solid, 3 to 5 hours. 2. Peel bananas from the parchment paper and place in the blender. Add milk and cream and blend until smooth; transfer to a sealable container and freeze until set, about 2 hours.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 hrs 5 mins",
  "calories": "149"
},
{
  "url": "https://www.allrecipes.com/recipe/229021/blueberry-banana-bread/",
  "name": "Blueberry Banana Bread",
  "rating": "4.8",
  "ratingcount": "408",
  "ingredients": "2 cups all-purpose flour; 1 teaspoon baking soda; ½ teaspoon salt; 1 cup white sugar; ½ cup butter, softened; 2 large eggs; 2 teaspoons vanilla extract; 2  ripe bananas, mashed; 1 cup fresh blueberries",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease 3 mini loaf pans. 2. Mix flour, baking soda, and salt together in a medium bowl. 3. Beat sugar and butter with an electric mixer in a large bowl until light in color and fluffy. Add eggs, one at a time, mixing well after each addition. Stir in vanilla extract; beat in mashed bananas. Add flour mixture a little at a time, beating until just combined into a thick batter. Fold in blueberries until evenly distributed. Pour batter into the prepared loaf pans. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 35 minutes. Cool in the pans for 10 minutes, then transfer loaves to cool completely on a wire rack.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "55 mins",
  "calories": "197"
},
{
  "url": "https://www.allrecipes.com/recipe/8302/banana-chocolate-chip-cake/",
  "name": "Banana Chocolate Chip Cake",
  "rating": "4.5",
  "ratingcount": "469",
  "ingredients": "1 ½ cups all-purpose flour; ⅔ cup white sugar; 1 ½ teaspoons baking powder; ¼ teaspoon salt; 1 cup mashed bananas; ½ cup unsalted butter, melted; ¼ cup milk; 1 large egg; ¾ cup semisweet chocolate chips",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking dish. 2. Mix flour, sugar, baking powder, and salt in a large bowl. Whisk together bananas, melted butter, milk, and egg in a medium bowl. Stir banana mixture into flour mixture until just blended. Stir in chocolate chips. Pour batter into the prepared baking dish. 3. Bake in the preheated oven until a toothpick inserted into the center of cake comes out clean with no crumbs (melted chocolate on the toothpick is fine), 30 to 35 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "122"
},
{
  "url": "https://www.allrecipes.com/recipe/231643/hearty-breakfast-muffins/",
  "name": "Hearty Breakfast Muffins",
  "rating": "4.7",
  "ratingcount": "298",
  "ingredients": "2  carrots, shredded; 2  bananas, mashed; 1  zucchini, shredded; ¼ cup vegetable oil; ¼ cup yogurt; 2  eggs; 1 cup whole wheat flour; 1 ½ teaspoons baking soda; ½ cup packed brown sugar; ½ cup rolled oats; ½ cup shredded coconut; ½ cup chopped pecans; ½ cup dried cherries; 1 teaspoon ground cinnamon; 1 teaspoon salt; ½ teaspoon ground ginger",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease 12 muffin cups or line with paper liners. 2. Mix carrots, banana, zucchini, vegetable oil, yogurt, and eggs together in a large bowl until well combined. 3. Whisk flour and baking soda together in a separate bowl. Mix brown sugar, oats, coconut, pecans, cherries, cinnamon, salt, and ginger into flour mixture until all ingredients are coated in flour. Stir banana mixture into flour mixture until just combined. Spoon batter into the prepared muffin cups, filling each 2/3 full. 4. Bake in the preheated oven until tops spring back when lightly pressed, about 18 to 22 minutes. Cool in the tin for 10 minutes. Transfer to a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "227"
},
{
  "url": "https://www.allrecipes.com/recipe/11201/banana-chocolate-chip-cookies/",
  "name": "Banana Chocolate Chip Cookies",
  "rating": "4.2",
  "ratingcount": "648",
  "ingredients": "2 ½ cups all-purpose flour; 2 teaspoons baking powder; ½ teaspoon salt; ¼ teaspoon baking soda; 1 cup white sugar; ⅔ cup butter, softened; 1 cup mashed bananas; 2  eggs; 1 teaspoon vanilla extract; 2 cups semisweet chocolate chips",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Grease cookie sheets. 2. Sift flour, baking powder, salt, and baking soda together in a large bowl. 3. Beat sugar and butter together in a separate large bowl with an electric mixer until light and fluffy. Add bananas, eggs, and vanilla; beat to combine. Gradually blend in flour mixture until just combined; stir in chocolate chips. Drop dough by teaspoonfuls onto prepared cookie sheets. 4. Bake in the preheated oven for 12 to 15 minutes. Transfer cookies to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "1 hr 15 mins",
  "calories": "276"
},
{
  "url": "https://www.allrecipes.com/recipe/7116/banana-bread-quick-bread-for-machines/",
  "name": "Banana Bread - Quick Bread for Machines",
  "rating": "4.2",
  "ratingcount": "452",
  "ingredients": "2  bananas, peeled and halved lengthwise; 2 cups all-purpose flour; ¾ cup white sugar; 2 large eggs; 3 tablespoons vegetable oil; 1 teaspoon baking powder; ½ teaspoon baking soda",
  "directions": "1. Place bananas, flour, sugar, eggs, oil, baking powder, and baking soda in the pan of the bread machine. 2. Select Dough setting; press Start. Mix dough until well combined and bananas are mashed, 3 to 5 minutes. Use a rubber spatula to push dough from the sides of the bread pan if necessary. Press Stop, then smooth out the top of the loaf with a rubber spatula. 3. Select Bake setting; press Start. Bake in the bread machine until a toothpick inserted into the center comes out clean, about 50 minutes. If there is batter on the toothpick, reset the machine on Bake and continue baking for 10 to 15 minutes. 4. Remove the pan from the machine. Allow bread to remain in the pan for 10 minutes before transferring it to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 15 mins",
  "calories": "221"
},
{
  "url": "https://www.allrecipes.com/recipe/12625/banoffee/",
  "name": "Banoffee Pie",
  "rating": "4.5",
  "ratingcount": "163",
  "ingredients": "1 (13.4 ounce) can dulce de leche; 1 1/2 cups graham cracker crumbs; 1/3 cup white sugar; 2 teaspoons ground ginger (Optional); 6 tablespoons butter, melted; 3 bananas, sliced; 1 1/2 cups heavy cream; 3 tablespoons powdered sugar; chocolate shavings (Optional); espresso powder (Optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix graham cracker crumbs, white sugar, ginger (if using), and melted butter together in a medium bowl. Press mixture into an ungreased 9-inch fluted tart pan with a removable bottom or 9-inch pie pie plate. 3. Bake crust in preheated oven until set, about 12 to 15 minutes. Cool crust on a wire rack for 15 minutes. 4. Spread dulce de leche in the cooled crust; arrange bananas evenly on top. 5. Beat heavy cream and powdered sugar in a large bowl until stiff peaks form, about 3 minutes. Spread whipped cream over bananas. 6. Refrigerate pie for at least 2 hours to overnight. Sprinkle with chocolate shavings, cocoa powder, and/or espresso powder, if desired, before serving.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "2 hrs 45 mins",
  "calories": "510"
},
{
  "url": "https://www.allrecipes.com/recipe/23074/bobs-stuffed-banana-peppers/",
  "name": "Bob's Stuffed Banana Peppers",
  "rating": "4.6",
  "ratingcount": "307",
  "ingredients": "8  banana peppers; 2 tablespoons butter; ½ cup chopped onion; ½ cup chopped celery; 1 (28 ounce) can crushed tomatoes; 1 (8 ounce) can tomato sauce; 2 cloves garlic, minced; 2 ½ teaspoons salt, divided; 1 teaspoon dried basil; 1 teaspoon dried oregano; ½ teaspoon ground black pepper, divided; ½ cup grated Parmesan cheese; 1 large egg; 1 teaspoon Worcestershire sauce; 1 pound hot Italian sausage; 1 pound mild Italian sausage; 1 ½ cups bread crumbs",
  "directions": "1. Cut off the tops of peppers. Remove ribs and seeds; rinse peppers. Chop edible portion of the tops; set aside. 2. Bring a large pot of salted water to a boil. Add peppers, reduce heat, and simmer until tender but still firm, about 5 minutes. Drain and set aside. 3. Heat butter in a medium skillet over medium heat. Sauté reserved chopped pepper, onion, and celery in hot butter until tender, 3 to 5 minutes. Stir in crushed tomatoes, tomato sauce, and garlic. Season with 1 1/2 teaspoons salt, basil, oregano, and 1/4 teaspoon black pepper. Simmer uncovered for 10 minutes. 4. Preheat the oven to 350 degrees F (175 degrees C). 5. Meanwhile, combine Parmesan cheese, egg, Worcestershire sauce, 1 remaining teaspoon salt, and remaining 1/4 teaspoon black pepper in a large bowl. Mix in hot sausage, mild sausage, bread crumbs, and 1 cup tomato sauce mixture until well combined. 6. Fill each pepper with sausage mixture using a piping bag or sausage stuffer. Place in a 3-quart casserole dish; pour remaining tomato sauce mixture over peppers. 7. Bake uncovered in the preheated oven until sauce is bubbly and sausage is cooked through, about 1 hour. An instant-read thermometer inserted into the filling should read at least 160 degrees F (72 degrees C).",
  "prep": "30 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs",
  "calories": "593"
},
{
  "url": "https://www.allrecipes.com/recipe/258838/easy-kids-recipe-for-fluffy-banana-cookies/",
  "name": "Easy Kids' Recipe for Fluffy Banana Cookies",
  "rating": "4.8",
  "ratingcount": "64",
  "ingredients": "1 ½ cups all-purpose flour; 2 medium ripe bananas, mashed, or more to taste; ½ cup white sugar; ¼ cup butter, melted; ¼ cup chopped walnuts (Optional); 1 large egg; 1 teaspoon baking soda; ¼ teaspoon salt; 1 tablespoon white sugar",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Line a baking sheet with parchment paper. 2. Mix flour, bananas, 1/2 cup sugar, butter, walnuts, egg, baking soda, and salt together in a bowl until well combined. Drop 3-tablespoon portions dough onto the prepared baking sheet, about 2 to 3 inches apart. Sprinkle remaining 1 tablespoon sugar over cookies. 3. Bake in the preheated oven until golden brown and edges are set, 15 to 20 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "166"
},
{
  "url": "https://www.allrecipes.com/recipe/23553/basic-fruit-smoothie/",
  "name": "Basic Fruit Smoothie",
  "rating": "4.4",
  "ratingcount": "81",
  "ingredients": "1 quart strawberries, hulled; 2  fresh peaches - peeled, pitted, and sliced; 1  banana, broken into chunks; 2 cups ice; 1 cup orange-peach-mango juice",
  "directions": "1. Gather all ingredients. 2. Combine strawberries, peaches, and banana in a blender; blend until smooth. 3. Add ice and pour in juice; blend again to desired consistency. 4. Enjoy!",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "118"
},
{
  "url": "https://www.allrecipes.com/recipe/160708/strawberry-banana-protein-smoothie/",
  "name": "Strawberry Banana Protein Smoothie",
  "rating": "4.7",
  "ratingcount": "62",
  "ingredients": "1 ¼ cups sliced fresh strawberries; 1  banana; 10  whole almonds; 2 tablespoons water; 1 cup ice cubes; 3 tablespoons chocolate flavored protein powder",
  "directions": "1. Place strawberries, banana, almonds, and water into a blender; blend to combine. Add ice cubes and puree until smooth. Add protein powder and mix until evenly incorporated, about 30 seconds.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "349"
},
{
  "url": "https://www.allrecipes.com/recipe/73155/porridge/",
  "name": "Porridge",
  "rating": "3.6",
  "ratingcount": "27",
  "ingredients": "2 ½ cups water; 1 cup rolled oats; 1 tablespoon white sugar; 1 teaspoon salt; 2  bananas, sliced; 1 pinch ground cinnamon; ½ cup cold milk (Optional)",
  "directions": "1. Combine water, oats, sugar, and salt in a saucepan. Add bananas and cinnamon. Bring to a boil, then reduce heat to low, and simmer until the liquid has been absorbed, stirring frequently. 2. Pour into bowls, and top each with a splash of cold milk.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "157"
},
{
  "url": "https://www.allrecipes.com/recipe/20334/banana-pancakes-i/",
  "name": "Banana Pancakes",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "1 cup all-purpose flour; 1 tablespoon white sugar; 2 teaspoons baking powder; ¼ teaspoon salt; 1  egg, beaten; 1 cup milk; 2 tablespoons vegetable oil; 2  ripe bananas, mashed",
  "directions": "1. Gather all ingredients. 2. Combine flour, white sugar, baking powder, and salt in a bowl. Mix together egg, milk, vegetable oil, and bananas in a second bowl. 3. Stir flour mixture into banana mixture; batter will be slightly lumpy. 4. Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. 5. Cook until pancakes are golden brown, 3 to 5 minutes per side. Serve hot. 6. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "193"
},
{
  "url": "https://www.allrecipes.com/recipe/6990/sarahs-banana-bread-muffins/",
  "name": "Sarah's Banana Bread Muffins",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 cup white sugar; ½ cup vegetable oil; 1 large egg; 3  ripe bananas, mashed; ¼ cup chopped walnuts; 2 cups all-purpose flour; 1 teaspoon baking soda; ½ teaspoon salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 12-cup muffin tin or line cups with paper liners. 2. Mix sugar, oil, and egg in a large bowl until light and creamy. Stir in bananas and walnuts. Add flour, baking soda, and salt; stir until completely smooth. Spoon batter into the prepared muffin cups, filling each 3/4 full. 3. Bake in the preheated oven until tops spring back when lightly pressed, about 30 to 40 minutes.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "270"
},
{
  "url": "https://www.allrecipes.com/recipe/8517415/banana-fosters-cake/",
  "name": "Bananas Foster Cake",
  "rating": "4.0",
  "ratingcount": "2",
  "ingredients": "cooking spray; 2 ½ cups all-purpose flour; 2 teaspoons baking soda; 1 teaspoon table salt; 2 cups granulated sugar; 2 cups mashed banana (from 5 (6 oz.) bananas); 1 cup canola oil; ¾ cup plain whole Greek yogurt; ¼ cup whole buttermilk; 2 teaspoons vanilla extract; 2 large eggs; 1 cup dark brown sugar; ½ cup heavy cream; ⅓ cup unsalted butter; ¾ teaspoon ground cinnamon; ¼ teaspoon sea salt; 1 ½  very ripe bananas, mashed; ¾ teaspoon vanilla bean paste or 1 1/2 vanilla beans; 4 tablespoons dark rum (such as Meyer’s dark rum), divided; 3  ripe bananas, sliced; 2 cups unsalted butter, softened; 4 cups powdered sugar; 1 cup salted banana caramel sauce",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Spray 3 (8-inch) round cake pans with cooking spray, and line bottoms with parchment. 2. Whisk together flour, baking soda, and salt in a large bowl. Whisk together sugar, 2 cups mashed banana, oil, yogurt, buttermilk, vanilla, and eggs in a second bowl until well blended; add to flour mixture and stir just until combined. Divide batter evenly between prepared pans. 3. Bake in the preheated oven until a toothpick is inserted and comes out clean, 25 to 30 minutes. Cool in pans on a wire rack for 10 minutes. Remove cakes from pans to a wire rack cool completely, about 1 to1 1/2 hours. 4. Meanwhile for the caramel sauce, combine sugar, cream, butter, cinnamon and salt in a small saucepan. Cook over medium heat, whisking constantly, until butter is melted and sugar is dissolved, about 2 minutes. Whisk in 1 1/2 mashed banana, vanilla bean paste, and 3 tablespoons of the rum and remove from heat. 5. Place sliced bananas in a small bowl and drizzle with 4 tablespoons of the caramel sauce and remaining 1 tablespoon rum; toss gently to coat. Cool remaining caramel sauce to room temperature, about 20 minutes. 6. For the caramel frosting, beat butter in the bowl of a stand mixer fitted with the paddle attachment on medium speed until light in color, about 3 minutes. Gradually add powdered sugar, and beat on medium speed for about 3 minutes until light and fluffy. Add 1 cup of the salted banana caramel sauce, and beat on low speed until combined, about 1 minute. Transfer 1 cup frosting to a piping bag fitted with a #12 tip. 7. To assemble the cake, place 1 cake layer on a serving plate; spread with 2/3 cup Caramel Frosting. Using the piping bag to pipe a ring of Caramel Frosting around outer edge of cake layer on top of frosting. 8. Spoon half of sliced banana mixture inside frosting ring and spread evenly. Top with second cake layer. 9. Spread another 2/3 cup caramel frosting over second layer. Repeat with piping bag to pipe a ring of caramel frosting around outer edge of cake layer on top of frosting. 10. Spoon remaining sliced banana mixture inside frosting ring and spread evenly. Top with remaining cake layer. 11. Spread remaining frosting on top and sides of cake and smooth. 12. Use piping bag to decorate as desired. 13. Slice and serve with remaining 3/4 cup caramel sauce.",
  "prep": "30 mins",
  "cook": "",
  "total": "2 hrs 20 mins",
  "calories": "1160"
},
{
  "url": "https://www.allrecipes.com/recipe/231851/easy-mango-banana-smoothie/",
  "name": "Easy Mango Banana Smoothie",
  "rating": "4.5",
  "ratingcount": "42",
  "ingredients": "2  mangos - peeled, seeded, and sliced; 2  bananas; 2 cups vanilla yogurt; 2 cups milk",
  "directions": "1. Combine mangos, banana, vanilla yogurt, and milk in a blender; blend until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "133"
},
{
  "url": "https://www.allrecipes.com/recipe/18990/banana-pudding-i/",
  "name": "Homemade Banana Pudding",
  "rating": "4.4",
  "ratingcount": "366",
  "ingredients": "⅔ cup white sugar; ⅓ cup all-purpose flour; ¼ teaspoon salt; 3  eggs, beaten; 2 cups milk; 2 tablespoons butter, softened; ½ teaspoon vanilla extract; 2  bananas, peeled and sliced; ½ (12 ounce) package vanilla wafer cookies",
  "directions": "1. Combine sugar, flour, and salt together in a medium saucepan. Add eggs and stir well. Stir in milk, and cook over low heat, stirring constantly. 2. When the mixture has thickened enough to coat the back of a metal spoon, remove from heat and continue to stir, cooling slightly. Stir in butter and vanilla until smooth. 3. Layer pudding with bananas and vanilla wafers in a serving dish. Chill at least 1 hour in the refrigerator before serving.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr 30 mins",
  "calories": "666"
},
{
  "url": "https://www.allrecipes.com/recipe/230482/banana-chocolate-chip-bread/",
  "name": "Banana Chocolate Chip Bread",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "2 cups all-purpose flour; 1 teaspoon baking powder; 1 teaspoon baking soda; 1 teaspoon salt; 3  ripe bananas, mashed; 1 tablespoon milk; 1 teaspoon ground cinnamon, or to taste; 1 cup white sugar; ½ cup butter, softened; 2 large eggs; 1 cup semisweet chocolate chips",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan, preferably glass. 2. Mix flour, baking powder, baking soda, and salt in a bowl. Stir bananas, milk, and cinnamon in another bowl. Beat sugar and butter together in a third bowl with an electric mixer until light and fluffy; add eggs one at a time, beating well after each addition. Stir banana mixture into butter mixture; mix in flour mixture until just blended. Fold in chocolate chips; pour batter into the prepared loaf pan. 3. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 70 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack before slicing.",
  "prep": "15 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 35 mins",
  "calories": "378"
},
{
  "url": "https://www.allrecipes.com/recipe/241707/joys-easy-banana-bread/",
  "name": "Joy's Easy Banana Bread",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "3  ripe bananas, mashed; 1 cup white sugar; 1  egg; ¼ cup melted butter; 1 ½ cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon salt",
  "directions": "1. Gather all ingredients. Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan. 2. Combine bananas, sugar, egg, and butter together in a bowl. Mix flour and baking soda together in a separate bowl; stir into banana mixture until batter is just mixed. 3. Stir in salt; pour batter into the prepared loaf pan. 4. Bake in the preheated oven until a toothpick inserted in the center of the bread comes out clean, about 1 hour. 5. Enjoy!",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "225"
},
{
  "url": "https://www.allrecipes.com/recipe/42719/banana-muffins-ii/",
  "name": "Banana Muffins",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "1 ½ cups all-purpose flour; 1 teaspoon baking powder; 1 teaspoon baking soda; ½ teaspoon salt; 3 large bananas, mashed; ¾ cup white sugar; 1  egg; ⅓ cup butter, melted",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 12-cup muffin tin or line cups with paper liners. Sift flour, baking powder, baking soda, and salt together in a bowl; set aside. 2. Mix bananas, sugar, egg, and melted butter in a separate large bowl until well combined; fold in flour mixture until smooth. Spoon batter into the prepared muffin cups, filling each 2/3 full. 3. Bake in the preheated oven until tops spring back when lightly pressed, about 25 to 30 minutes. Cool briefly in the tin, then transfer to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "187"
},
{
  "url": "https://www.allrecipes.com/recipe/22749/the-best-banana-pudding/",
  "name": "The Best Banana Pudding",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "2 cups cold milk; 1 (5 ounce) package instant vanilla pudding mix; 1 (14 ounce) can sweetened condensed milk; 1 tablespoon vanilla extract; 1 (12 ounce) container frozen whipped topping, thawed; 1 (16 ounce) package vanilla wafers; 14 small bananas, sliced or to taste",
  "directions": "1. Gather all ingredients. 2. Place milk and pudding mix in a large bowl; beat with a whisk for 2 minutes. Blend in condensed milk until smooth. 3. Stir in vanilla, then fold in whipped topping. 4. Layer wafers, banana slices, and pudding mixture in a glass serving bowl. 5. Chill. When ready to serve top with extra crushed wafers. 6. Enjoy!",
  "prep": "25 mins",
  "cook": "",
  "total": "25 mins",
  "calories": "329"
},
{
  "url": "https://www.allrecipes.com/recipe/17066/janets-rich-banana-bread/",
  "name": "Janet's Rich Banana Bread",
  "rating": "4.8",
  "ratingcount": "10",
  "ingredients": "1 cup white sugar; ½ cup butter, melted; 2  eggs; 1 teaspoon vanilla extract; 1 ½ cups all-purpose flour; 1 teaspoon baking soda; ½ teaspoon salt; ½ cup sour cream; ½ cup chopped walnuts; 2  medium bananas, sliced",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan. 2. Stir sugar and melted butter together in a large bowl. Add eggs and vanilla; mix well. Combine flour, baking soda, and salt; stir into butter mixture until smooth. Fold in banana slices, sour cream, and walnuts; transfer into the prepared pan. 3. Bake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, about 1 hour. Cool loaf in the pan for 10 minutes before inverting onto a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "291"
},
{
  "url": "https://www.allrecipes.com/recipe/221261/peanut-butter-banana-smoothie/",
  "name": "Peanut Butter Banana Smoothie",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "2  bananas, broken into chunks; 2 cups milk; ½ cup peanut butter; 2 tablespoons honey, or to taste; 2 cups ice cubes",
  "directions": "1. Gather all ingredients. 2. Place bananas, milk, peanut butter, honey, and ice cubes in a blender. 3. Blend until smooth, about 30 seconds. 4. Enjoy!",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "335"
},
{
  "url": "https://www.allrecipes.com/recipe/20490/banana-fritters/",
  "name": "Banana Fritters",
  "rating": "4.0",
  "ratingcount": "86",
  "ingredients": "2  bananas, mashed; ½ cup milk; 2 cups all-purpose flour; 3 teaspoons baking powder; ½ teaspoon salt; 2  eggs, beaten; 1 tablespoon margarine, melted; 1 quart vegetable oil for frying; ½ cup confectioners' sugar, or as needed",
  "directions": "1. Combine bananas and milk in a large mixing bowl; sift in flour, baking powder, and salt. Add eggs and margarine; mix well to combine. 2. Heat oil in a large, deep skillet to 365 degrees F (180 degrees C). 3. Carefully place spoonfuls of the fritter mixture into the hot oil; cook, flipping once, until golden brown, about 5 minutes. Remove, and drain on a paper towel-lined plate. 4. Dust fritters with confectioners' sugar and serve warm.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "408"
},
{
  "url": "https://www.allrecipes.com/recipe/24705/bananas-foster-ii/",
  "name": "Bananas Foster",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "¼ cup butter; ⅔ cup dark brown sugar; 3 ½ tablespoons rum; 1 ½ teaspoons vanilla extract; ½ teaspoon ground cinnamon; 3  bananas, peeled and sliced lengthwise and crosswise; ¼ cup coarsely chopped walnuts; 1 pint vanilla ice cream",
  "directions": "1. Melt butter in a large, deep skillet over medium heat. Stir in brown sugar, rum, vanilla, and cinnamon; bring to a low boil. 2. Place bananas and walnuts in the pan. Cook until bananas have softened, 1 to 2 minutes. Serve at once over vanilla ice cream.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "534"
},
{
  "url": "https://www.allrecipes.com/recipe/6714/banana-oat-muffins/",
  "name": "Banana Oat Muffins",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "1 ½ cups unbleached all-purpose flour; 1 cup rolled oats; ½ cup white sugar; 2 teaspoons baking powder; 1 teaspoon baking soda; ½ teaspoon salt; 1  egg; ¾ cup milk; ⅓ cup vegetable oil; ½ teaspoon vanilla extract; 1 cup mashed bananas",
  "directions": "1. Preheat the oven to 400 degrees F (205 degrees C). Line a 12-cup muffin tin with paper liners. 2. Combine flour, oats, sugar, baking powder, soda, and salt in a medium bowl; set aside. 3. Beat egg lightly in a large bowl. Whisk in milk, oil, and vanilla. Stir in mashed bananas. Add the flour mixture and stir until just combined. Spoon batter into the prepared muffin cups, filling each 3/4 full. 4. Bake in the preheated oven until tops spring back when lightly pressed, 18 to 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "200"
},
{
  "url": "https://www.allrecipes.com/recipe/261342/baked-banana-chips/",
  "name": "Baked Banana Chips",
  "rating": "2.6",
  "ratingcount": "10",
  "ingredients": "2  just-ripe bananas, sliced in 1/10-inch-thick rounds, or more as needed; 1 teaspoon lemon juice, or to taste",
  "directions": "1. Preheat the oven to 225 degrees F (110 degrees C). Line a baking sheet with parchment paper. 2. Spread banana slices out onto the prepared baking sheet, making sure slices are not touching. Brush with lemon juice. 3. Bake in the preheated oven for 90 minutes. Check bananas, lifting slices up to separate from the paper once or twice. Continue baking until bananas are dried out, 30 to 90 minutes more. 4. Let bananas cool until crispy, at least 5 minutes.",
  "prep": "10 mins",
  "cook": "2 hrs",
  "total": "2 hrs 15 mins",
  "calories": "106"
},
{
  "url": "https://www.allrecipes.com/recipe/67937/extreme-banana-nut-bread-ebnb/",
  "name": "Extreme Banana Nut Bread 'EBNB'",
  "rating": "4.7",
  "ratingcount": "2",
  "ingredients": "2 cups all-purpose flour; 2 teaspoons baking soda; 1 teaspoon salt; 2 cups white sugar; 1 cup butter, softened; 2 cups mashed overripe bananas; 4 large eggs, beaten; 1 cup chopped walnuts",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9x5-inch loaf pans. 2. Sift flour, baking soda, and salt into a large bowl. 3. Cream sugar and butter together in a separate bowl. Stir in bananas, eggs, and walnuts until well blended. 4. Pour wet ingredients into flour mixture and stir just until blended. Divide the batter evenly between the two prepared pans. 5. Bake in the preheated oven until a paring knife inserted into the crown of each loaf comes out clean, 60 to 70 minutes. 6. Remove from the oven and let loaves cool in the pans for at least 5 minutes. Turn out onto a cooling rack, and let cool completely, about 30 minutes. 7. Slice and serve. For more intense flavor, wrap each loaf in aluminum foil to keep in the moisture, then refrigerate for at least 2 hours before serving.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 50 mins",
  "calories": "232"
},
{
  "url": "https://www.allrecipes.com/recipe/20144/banana-banana-bread/",
  "name": "Banana Banana Bread",
  "rating": "4.6",
  "ratingcount": "16",
  "ingredients": "2 cups all-purpose flour; 1 teaspoon baking soda; ¼ teaspoon salt; ¾ cup brown sugar; ½ cup butter; 2  eggs, beaten; 2 ⅓ cups mashed overripe bananas",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan. 2. Combine flour, baking soda, and salt in a large bowl. Beat brown sugar and butter with an electric mixer in a separate large bowl until smooth. Stir in eggs and mashed bananas until well blended. Stir banana mixture into flour mixture until just combined. Pour batter into the prepared loaf pan. 3. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 60 minutes. Let bread cool in pan for 10 minutes, then turn out onto a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/20258/bananas-in-caramel-sauce/",
  "name": "Bananas in Caramel Sauce",
  "rating": "4.5",
  "ratingcount": "104",
  "ingredients": "½ cup butter; 1 cup superfine sugar; 1 ¼ cups heavy cream; 4  bananas, peeled and halved lengthwise",
  "directions": "1. Melt butter in a large, heavy skillet over medium heat. Stir in sugar and cook, stirring, until sugar is melted and light brown. Slowly stir in the cream (mixture will bubble up). 2. Let mixture boil for 1 minute, then reduce heat to low. Carefully add bananas to the pan and cook until just heated through, about 2 minutes. Serve hot.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "759"
},
{
  "url": "https://www.allrecipes.com/recipe/12151/banana-cream-pie-i/",
  "name": "Banana Cream Pie",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "¾ cup white sugar; ⅓ cup all-purpose flour; ¼ teaspoon salt; 2 cups milk; 3  egg yolks, beaten; 2 tablespoons butter; 1 ¼ teaspoons vanilla extract; 1 (9 inch) baked pastry shell, cooled; 4  bananas, sliced",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine sugar, flour, and salt in a saucepan. Gradually stir in milk. Cook, stirring constantly, over medium heat until mixture boils and thickens. Continue to cook and stir for 2 more minutes, then remove from the heat. 3. Place egg yolks in a medium bowl; whisk in a small amount of the hot milk mixture until smooth, then gradually whisk egg yolk mixture into the saucepan. Cook over medium-low heat, stirring constantly until mixture coats the back of a spoon, about 2 more minutes. Remove from heat and stir in butter and vanilla. 4. Fill pastry shell with sliced bananas; pour pudding mixture on top to cover. 5. Bake in the preheated oven until filling sets, 12 to 15 minutes. Let pie cool completely on a wire rack, then chill pie in the refrigerator for at least 1 hour before serving.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "3 hrs 40 mins",
  "calories": "303"
},
{
  "url": "https://www.allrecipes.com/recipe/21398/banana-pudding-iv/",
  "name": "Banana Pudding",
  "rating": "4.8",
  "ratingcount": "3",
  "ingredients": "1 (8 ounce) package cream cheese, at room temperature; 1 (14 ounce) can sweetened condensed milk; 1 (5 ounce) package instant vanilla pudding mix; 3 cups cold skim milk; 1 teaspoon vanilla extract; 1 (8 ounce) container frozen whipped topping, thawed; ½ (12 ounce) package vanilla wafers; 4  bananas, sliced",
  "directions": "1. Beat cream cheese in a large bowl until fluffy. Beat in condensed milk, then pudding mix. Gradually mix in cold milk until smooth, followed by vanilla. Fold in 1/2 of the whipped topping. 2. Line the bottom of a 9x13-inch dish with vanilla wafers. Arrange sliced bananas evenly on top. Cover with pudding mixture. Top with remaining whipped topping. 3. Cover and chill in the refrigerator for at least 3 hours before serving.",
  "prep": "30 mins",
  "cook": "",
  "total": "3 hrs 30 mins",
  "calories": "388"
},
{
  "url": "https://www.allrecipes.com/recipe/8333/banana-cake-vi/",
  "name": "Banana Cake",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "1 ½ cups mashed bananas; 2 teaspoons lemon juice; 3 cups all-purpose flour; 1 ½ teaspoons baking soda; ¼ teaspoon salt; 2 ⅛ cups white sugar; ¾ cup butter; 3  eggs; 2 teaspoons vanilla extract; 1 ½ cups buttermilk; ½ cup butter, softened; 1 (8 ounce) package cream cheese, softened; 1 teaspoon vanilla extract; 3 ½ cups confectioners' sugar",
  "directions": "1. Preheat the oven to 275 degrees F (135 degrees C). Grease and flour a 9x13-inch pan. 2. Make cake: Mix mashed bananas with lemon juice in a small bowl. Mix flour, baking soda, and salt in a medium bowl. 3. Cream sugar and butter in a large bowl until light and fluffy, 3 to 4 minutes. Beat in eggs one at a time, then stir in vanilla. Beat in flour mixture alternately with buttermilk. Stir in banana mixture. Pour batter into the prepared pan. 4. Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, about 1 hour. Remove cake from the oven and place it directly into the freezer for 45 minutes. This will make the cake very moist. 5. Meanwhile, make frosting: Cream butter and cream cheese until smooth. Beat in vanilla. Add confectioners sugar and beat on low speed until combined, then on high until frosting is smooth. 6. Spread frosting on cooled cake.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "2 hrs 15 mins",
  "calories": "453"
},
{
  "url": "https://www.allrecipes.com/recipe/23539/strawberry-oatmeal-breakfast-smoothie/",
  "name": "Strawberry Oatmeal Breakfast Smoothie",
  "rating": "4.4",
  "ratingcount": "1",
  "ingredients": "1 cup soy milk; ½ cup rolled oats; 14  frozen strawberries; 1  banana, broken into chunks; 1 ½ teaspoons white sugar (Optional); ½ teaspoon vanilla extract (Optional)",
  "directions": "1. Gather ingredients. 2. Blend soy milk, oats, strawberries, and banana in a blender until smooth. Add sugar and vanilla and blend again until smooth. 3. Pour into glasses and serve.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "142"
},
{
  "url": "https://www.allrecipes.com/recipe/7754/a-number-1-banana-cake/",
  "name": "A-Number-1 Banana Cake",
  "rating": "4.7",
  "ratingcount": "939",
  "ingredients": "2 ½ cups all-purpose flour; 1 tablespoon baking soda; 1 pinch salt; 1 cup white sugar; ¾ cup light brown sugar; ½ cup unsalted butter, softened; 2  eggs; 4  ripe bananas, mashed; ⅔ cup buttermilk; ½ cup chopped walnuts",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 8-inch round pans. 2. Whisk together flour, baking soda, and salt in a small bowl; set aside. 3. Cream white sugar, brown sugar, and butter in a large bowl until light and fluffy. Beat in eggs, one at a time. Mix in mashed bananas. Add flour mixture alternately with buttermilk, mixing well after each addition. Stir in chopped walnuts. Pour batter into the prepared pans. 4. Bake in the preheated oven until cake springs back when gently pressed, about 30 minutes. 5. Remove cake layers from the oven and place them on a damp tea towel to cool.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "346"
},
{
  "url": "https://www.allrecipes.com/recipe/257206/ultimate-banana-muffins/",
  "name": "Ultimate Banana Muffins",
  "rating": "4.9",
  "ratingcount": "442",
  "ingredients": "1 ½ cups all-purpose flour; 1 teaspoon baking powder; 1 teaspoon baking soda; 1 teaspoon ground cinnamon; ½ teaspoon salt; 1 pinch ground nutmeg; 3  bananas (ripe or very ripe work best); ½ cup white sugar; ⅓ cup butter, melted; ¼ cup lightly packed brown sugar; 1 large egg; 1 teaspoon vanilla extract; ¼ cup chopped walnuts (Optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a muffin tin. 2. Sift flour, baking powder, baking soda, cinnamon, salt, and nutmeg together in a small bowl. 3. Mash bananas in a large bowl. Mix in white sugar, melted butter, brown sugar, egg, and vanilla extract. Fold in flour mixture until just combined. Fold walnuts into the batter. 4. Divide batter evenly among the prepared muffin cups. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "196"
},
{
  "url": "https://www.allrecipes.com/recipe/241019/spinach-and-banana-power-smoothie/",
  "name": "Spinach and Banana Power Smoothie",
  "rating": "4.8",
  "ratingcount": "80",
  "ingredients": "1 cup plain soy milk; ¾ cup packed fresh spinach leaves; 1 large banana, sliced",
  "directions": "1. Blend soy milk and spinach together in a blender until smooth. Add banana and pulse until thoroughly blended.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "257"
},
{
  "url": "https://www.allrecipes.com/recipe/215189/fruit-and-yogurt-smoothie/",
  "name": "Fruit and Yogurt Smoothie",
  "rating": "4.7",
  "ratingcount": "98",
  "ingredients": "1 cup strawberries; 1  banana; ½ cup yogurt; ¼ cup pineapple juice; 1 ½ teaspoons white sugar; 1 teaspoon orange juice; 1 teaspoon milk",
  "directions": "1. Combine strawberries, banana, yogurt, pineapple juice, sugar, orange juice, and milk in a blender; blend until smooth.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "146"
},
{
  "url": "https://www.allrecipes.com/recipe/17652/banana-crumb-muffins/",
  "name": "Banana Crumb Muffins",
  "rating": "4.8",
  "ratingcount": "14",
  "ingredients": "1 ½ cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon baking powder; ½ teaspoon salt; 3  bananas, mashed; ¾ cup white sugar; ⅓ cup butter, melted; 1  egg, lightly beaten; ⅓ cup packed brown sugar; 2 tablespoons all-purpose flour; ⅛ teaspoon ground cinnamon; 1 tablespoon butter",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Lightly grease or line 10 muffin cups with paper liners. 2. Prepare muffins: Mix flour, baking soda, baking powder, and salt together in a large bowl. 3. Beat bananas, white sugar, melted butter, and egg together in a separate bowl; stir the banana mixture into the flour mixture just until combined. Spoon batter into prepared muffin cups, filling each about 3/4 full. 4. Prepare crumb topping: Mix brown sugar, flour, and cinnamon together in a small bowl. Use a fork to mix in 1 tablespoon butter until mixture is crumbly; sprinkle topping over muffins. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 18 to 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "263"
},
{
  "url": "https://www.allrecipes.com/recipe/244959/chocolate-banana-peanut-butter-protein-shake/",
  "name": "Chocolate Banana Peanut Butter Protein Shake",
  "rating": "4.8",
  "ratingcount": "91",
  "ingredients": "6  ice cubes; 1 cup milk; 1  banana; 1 scoop chocolate-flavored protein powder; 2 tablespoons peanut butter; 1 tablespoon honey; 1 teaspoon unsweetened cocoa powder, or more to taste",
  "directions": "1. Blend ice cubes, milk, banana, protein powder, peanut butter, honey, and cocoa powder together in a blender until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "561"
},
{
  "url": "https://www.allrecipes.com/recipe/6984/banana-sour-cream-bread/",
  "name": "Banana Sour Cream Bread",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "3 ¼ cups white sugar, divided; 3 teaspoons ground cinnamon, divided; ¾ cup butter; 6  very ripe bananas, mashed; 1 (16 ounce) container sour cream; 3  eggs; 2 teaspoons vanilla extract; 4 ½ cups all-purpose flour; 3 teaspoons baking soda; ½ teaspoon salt; 1 cup chopped walnuts (Optional)",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). Grease four 7x3-inch loaf pans. 2. Mix 1/4 cup sugar and 1 teaspoon cinnamon together in a small bowl until well combined; dust the greased pans lightly with sugar mixture. 3. Beat remaining 3 cups sugar and butter together in a large bowl with an electric mixer until smooth. Add mashed bananas, sour cream, eggs, vanilla, and remaining 2 teaspoons cinnamon; continue to beat until well-blended. Add flour, baking soda, and salt; mix until just combined. Stir in walnuts and divide batter evenly into the prepared pans. 4. Bake in the preheated oven until a toothpick inserted in center comes out clean, about 1 hour.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "263"
},
{
  "url": "https://www.allrecipes.com/recipe/16952/the-best-banana-bread/",
  "name": "The Best Banana Bread",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 cup white sugar; ½ cup margarine, softened; 2  eggs; 1 ½ cups mashed banana; 2 cups all-purpose flour; 1 teaspoon baking soda",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x5-inch loaf pan. 2. Beat sugar and margarine in a bowl until smooth. Beat in eggs, then bananas. Add flour and baking soda, stirring just until combined. Pour into the prepared pan. 3. Bake in the preheated oven until a toothpick in the center comes out clean, about 1 hour. Remove from the pan and let cool. 4. Store in the refrigerator or freeze.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "196"
}]