[{
  "url": "https://www.allrecipes.com/recipe/89650/fried-beef-ribs/",
  "name": "Fried Beef Ribs",
  "rating": "4.0",
  "ratingcount": "6",
  "ingredients": "3 quarts peanut oil for frying; 3 tablespoons coarse ground black pepper; 2 tablespoons salt; 2 tablespoons cayenne pepper; 2 tablespoons garlic salt; 2 tablespoons onion salt; 6 pounds beef ribs, cut into single rib pieces; 6 large eggs, beaten; 2 cups all-purpose flour",
  "directions": "1. Heat oil in an outdoor deep-fryer to 375 degrees F (190 degrees C). 2. Meanwhile, mix black pepper, salt, cayenne pepper, garlic salt, and onion salt together in a medium bowl. Rub spice mixture onto each rib. 3. Whisk eggs together in a large bowl. Place flour into a separate bowl or onto a plate. 4. Dip a rib into beaten egg, then lift up so excess egg drips back into the bowl. Press rib into flour to coat both sides. Repeat dipping once more, into egg and then into flour. Repeat to bread a total of 4 to 5 ribs. 5. Place breaded ribs into the fryer basket, making sure they are not crowded. Deep-fry for about 8 minutes. 6. While ribs are frying, repeat Step 4 to bread 4 to 5 more ribs. 7. Remove fried ribs with tongs and place on paper towels to drain. Repeat as necessary to bread and fry remaining ribs.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "1377"
},
{
  "url": "https://www.allrecipes.com/recipe/216819/brazilian-style-beef-ribs/",
  "name": "Brazilian-Style Beef Ribs",
  "rating": "4.4",
  "ratingcount": "25",
  "ingredients": "1 (3 pound) rack of whole beef ribs (not short ribs); 2 tablespoons sea salt, or more if needed",
  "directions": "1. Preheat the oven to 275 degrees F (135 degrees C). 2. Place rib rack onto a work surface with the white membrane facing up. Use a sharp knife to slice under the membrane and remove from meat in a single piece if possible; discard the membrane. Rub ribs thoroughly with salt on both sides. Place ribs onto a cooking rack in a roasting pan. 3. Bake in the preheated oven for 1 1/2 hours. Baste ribs with a small amount of water, being very careful not to dislodge any salt. Continue to bake, basting every 45 minutes to 1 hour, until meat is very tender; total cooking time will be about 6 hours. 4. Remove from the oven and let rest for 10 to 15 minutes before cutting into three portions.",
  "prep": "10 mins",
  "cook": "6 hrs",
  "total": "6 hrs 20 mins",
  "calories": "698"
},
{
  "url": "https://www.allrecipes.com/recipe/229449/beef-short-ribs-sauerbraten/",
  "name": "Beef Short Ribs Sauerbraten",
  "rating": "4.8",
  "ratingcount": "28",
  "ingredients": "3 pounds beef short ribs; salt and ground black pepper to taste; 1 tablespoon vegetable oil; 1 ½ cups water; ⅔ cup cider vinegar; ⅔ cup red wine vinegar; 12  juniper berries; 9  whole cloves; 2  bay leaves; 1 tablespoon salt; ½ teaspoon freshly ground black pepper; 1 cup cold water; 2 tablespoons butter; 1 large onion, chopped; 2 stalks celery, chopped; 1  carrot, chopped; 3 cloves garlic, minced; 1 cup water; 1 cup chicken broth; 2 tablespoons white sugar, or to taste; ½ cup crushed gingersnaps; 1 tablespoon balsamic vinegar; salt and pepper to taste",
  "directions": "1. Season short ribs on both sides with salt and black pepper. Heat oil in a heavy-bottomed skillet over medium-high heat. Cook short ribs in batches, turning a few times, until browned on all sides, about 10 minutes per batch. Remove short ribs to a large lidded plastic tub while you make the marinade. 2. Pour 1 1/2 cups water, cider vinegar, and red wine vinegar into the warm skillet and bring to a simmer. Cook and stir, scraping any browned bits off the bottom on the pan. Add juniper berries, cloves, and bay leaves, season with salt and black pepper. Remove from heat and pour in 1 cup cold water. Pour mixture over the ribs and place in an ice bath until chilled, 30 to 40 minutes. Cover and marinate in the refrigerator for 24 hours. 3. Melt butter in a large,heavy pot or Dutch oven over medium heat. Cook and stir onion, celery, and carrot in the melted butter until the vegetables are softened, about 10 minutes. Add garlic and cook for 1 minute. Place marinated short ribs over the top of the onion mixture. Pour in remaining marinade from the plastic tub and stir in 1 cup water, chicken broth, and sugar. 4. Bring to a simmer over medium-high heat. Reduce heat and simmer on low, covered, until meat is fork-tender, 3 to 4 hours. Remove meat to a platter. Discard juniper berries, cloves, and bay leaves. Sprinkle cooked onion mixture over the top of the meat, reserving excess cooking liquid in the pan. 5. Place pot with remaining cooking liquid over medium-high heat. Grind gingersnaps in a food processor until fine and to the liquid in the pan. Stir in balsamic vinegar and boil until reduced and thickened, skimming fat, about 20 minutes. Season with salt to taste. Strain gravy through a fine mesh sieve, spoon over the beef, and serve.",
  "prep": "30 mins",
  "cook": "3 hrs 35 mins",
  "total": "1 day 4 hrs 5 mins",
  "calories": "626"
},
{
  "url": "https://www.allrecipes.com/recipe/284773/korean-barbecue-short-ribs-teriyaki/",
  "name": "Korean Barbecue Short Ribs Teriyaki",
  "rating": "4.0",
  "ratingcount": "2",
  "ingredients": "½ cup soy sauce; ½ cup sake; ⅓ cup mirin (Japanese sweet wine); ¼ cup packed brown sugar; 2 teaspoons finely grated ginger; 2 tablespoons finely minced green onions; 1 teaspoon ground turmeric; 2 pounds beef short ribs, cut flanken-style",
  "directions": "1. Combine soy sauce, sake, mirin, brown sugar, ginger, green onions, and turmeric in a large mixing bowl and whisk until combined. Add the short ribs and toss until thoroughly and evenly coated. 2. Cover with plastic wrap and marinate in the refrigerator for 4 to 12 hours, tossing occasionally. 3. Preheat a charcoal grill for high heat. 4. Remove meat from the refrigerator. Grill over very hot charcoal until slightly caramelized and just cooked through, 2 to 3 minutes per side. Any excess marinade can be used to baste the meat while it's grilling. Flip meat after basting to allow to caramelize, about 1 minute more per side. 5. Serve immediately, spooning or brushing on any accumulated juices from the plate.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "4 hrs 15 mins",
  "calories": "624"
},
{
  "url": "https://www.allrecipes.com/recipe/246645/kalbi-korean-bbq-short-ribs-authentic-recipe/",
  "name": "Kalbi (Korean BBQ Short Ribs): Authentic Recipe",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "¾ cup cola-flavored carbonated beverage (such as Coca-Cola®); ¼ cup white sugar; ¼ cup soy sauce; ¼ cup water; 2  green onions, chopped; 3 tablespoons sesame oil; 1 tablespoon minced garlic; 1 ½ teaspoons sesame seeds; 1 teaspoon ground black pepper; 2 pounds short ribs",
  "directions": "1. Combine cola beverage, white sugar, soy sauce, water, green onions, sesame oil, garlic, sesame seeds, and black pepper in a bowl until marinade is well-mixed. 2. Place short ribs in a resealable plastic bag and pour in marinade. Squeeze out excess air and seal the bag. Marinate in the refrigerator for at least 2 hours. 3. Preheat an outdoor grill for medium-high heat and lightly oil the grate. Remove short ribs from marinade, discarding marinade. 4. Cook short ribs until browned and cooked to desired doneness, 3 to 4 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
  "prep": "15 mins",
  "cook": "6 mins",
  "total": "2 hrs 21 mins",
  "calories": "647"
},
{
  "url": "https://www.allrecipes.com/recipe/281008/massaman-curry-short-ribs/",
  "name": "Massaman Curry Short Ribs",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 tablespoon vegetable oil; 2 pounds beef short ribs; 4 ounces massaman curry paste; 1 (1 inch) piece fresh ginger, minced; 1 tablespoon minced garlic; 1 ½ (14 ounce) cans coconut milk; 1 tablespoon ground turmeric; 1 tablespoon curry powder; 1 tablespoon ground cumin; 1 tablespoon red chile powder; 1 tablespoon garlic salt",
  "directions": "1. Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Heat for 2 minutes; add vegetable oil. Sear 3 to 4 ribs at a time in the hot oil until nicely browned, about 2 minutes per side. Repeat with remaining ribs. Remove ribs and set aside. 2. Stir curry paste, ginger, and garlic into the hot pot, scraping up the beef fat and browned bits with a wooden spoon at the bottom of the pot, for about 2 minutes. Pour in coconut milk. Stir in turmeric, curry powder, cumin, chile powder, and garlic salt. 3. Carefully place your short ribs back into the pot and stir in a folding motion so that the ribs are covered in the curry sauce. 4. Close and lock the lid. Select Meat/Stew function according to manufacturer's instructions; set timer for 25 minutes. Allow 10 to 15 minutes for pressure to build. 5. Release pressure using the natural-release method according to manufacturer's instructions, 10 to 40 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "417"
},
{
  "url": "https://www.allrecipes.com/recipe/52272/argentinean-style-ribs/",
  "name": "Argentinian-Style Ribs",
  "rating": "4.2",
  "ratingcount": "20",
  "ingredients": "6 pounds beef short ribs; 1 cup coarse salt, or as needed; 6 medium limes, cut in wedges",
  "directions": "1. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 2. Coat ribs heavily with salt. 3. Cook on the preheated grill until meat pulls away easily from the bone, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). 4. Transfer ribs to a large glass serving dish and squeeze lime wedges over top. Serve immediately.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/254808/grilled-flanken-short-ribs/",
  "name": "Grilled Flanken Short Ribs",
  "rating": "2.8",
  "ratingcount": "4",
  "ingredients": "2 pounds beef short ribs, cut flanken-style; 2 tablespoons white sugar; 2 tablespoons steak seasoning; ⅓ cup soy sauce; 2 tablespoons white vinegar; 2 tablespoons maple syrup; 1 teaspoon cayenne pepper, or to taste; 1 teaspoon sesame oil; ½ teaspoon ground ginger; ½ teaspoon red pepper flakes",
  "directions": "1. Season short ribs with sugar and steak seasoning; rub over both sides. 2. Whisk soy sauce, vinegar, maple syrup, 2 teaspoons cayenne pepper, sesame oil, ginger, and red pepper flakes together in a small bowl to make marinade. 3. Pour marinade into a large resealable plastic bag. Add short ribs. Seal and let marinate in the refrigerator, 1 to 4 hours. 4. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 5. Remove short ribs from marinade; discard marinade. Grill short ribs until well-browned, about 3 minutes per side.",
  "prep": "10 mins",
  "cook": "6 mins",
  "total": "1 hr 16 mins",
  "calories": "373"
},
{
  "url": "https://www.allrecipes.com/recipe/172476/easy-and-simple-korean-bbq-ribs/",
  "name": "Easy and Simple Korean BBQ Ribs",
  "rating": "4.8",
  "ratingcount": "33",
  "ingredients": "1 cup soy sauce; 1 cup white sugar; 1 teaspoon ground black pepper; 5 cloves garlic, chopped; 3  green onions, chopped; 2 tablespoons Asian (toasted) sesame oil; 1 teaspoon sesame seeds; 2 pounds Korean-style short ribs (beef chuck flanken, cut 1/3 to 1/2 inch thick across bones)",
  "directions": "1. Whisk together the soy sauce and sugar in a bowl until the sugar has dissolved, and stir in the black pepper, garlic, green onions, sesame oil, and sesame seeds. 2. Place the ribs in a large bowl, and pour the marinade over the ribs. Stir to coat the ribs with the marinade, and refrigerate for 1 hour. Stir the ribs and marinade again, and refrigerate for 1 more hour. 3. Preheat an outdoor grill for medium-high heat, and lightly oil the grate. 4. Remove the ribs from the marinade, discard the marinade, and grill the ribs until brown and no longer pink in the center, about 5 minutes per side. Have a spray bottle of water handy in case the ribs flare up.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "2 hrs 30 mins",
  "calories": "771"
},
{
  "url": "https://www.allrecipes.com/recipe/262014/kalbi-korean-marinated-short-ribs/",
  "name": "Kalbi (Korean Marinated Short Ribs)",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "3 pounds beef short ribs; ½ cup soy sauce; 1  Asian pear, cored and diced; ½ small onion; 2 tablespoons finely chopped garlic; 1 tablespoon chopped ginger; 2  green onions, thinly sliced; 2 tablespoons sesame oil; 2 tablespoons brown sugar; 2 tablespoons toasted sesame seeds; 1 tablespoon honey; ¼ teaspoon ground black pepper",
  "directions": "1. Place ribs in a bowl and cover with water; soak until water turns pink, about 1 hour. Drain and rinse in cold water. 2. Combine soy sauce, Asian pear, onion, garlic, and ginger in a food processor. Pulse until smooth. 3. Combine green onions, sesame oil, brown sugar, sesame seeds, honey, and black pepper in a large bowl; mix well. Add ribs and coat thoroughly with the marinade. Cover with plastic wrap and refrigerate 8 hours to overnight. 4. Preheat an outdoor grill for high heat and lightly oil the grate. 5. Cook ribs on the grill until slightly charred and tender, about 4 minutes per side.",
  "prep": "20 mins",
  "cook": "8 mins",
  "total": "9 hrs 28 mins",
  "calories": "347"
},
{
  "url": "https://www.allrecipes.com/recipe/269949/slow-cooker-asian-short-ribs/",
  "name": "Slow Cooker Asian Short Ribs",
  "rating": "4.7",
  "ratingcount": "15",
  "ingredients": "6  beef short ribs, or more to taste; salt and pepper to taste; ½ cup soy sauce; ½ cup vegetable broth; 2 tablespoons rice vinegar; ¼ cup brown sugar; 5 cloves garlic, minced; 1 tablespoon finely grated ginger; 1 teaspoon crushed red pepper flakes; 1 tablespoon olive oil; 1 teaspoon sesame oil; 1 tablespoon potato starch; 2 tablespoons cold water; 2  green onion tops, thinly sliced",
  "directions": "1. Season short ribs with salt and pepper on both sides. 2. Heat olive oil and sesame oil in a pot over medium-high heat and cook short ribs in batches until browned on all sides, 5 to 8 minutes. Place short ribs in a slow cooker. 3. Stir together soy sauce, vegetable broth, rice vinegar, brown sugar, garlic, ginger, and crushed red pepper flakes in a bowl. Pour sauce over short ribs. Cover slow cooker. 4. Cook on High until ribs are cooked through, about 4 hours. Remove ribs from sauce and keep warm. 5. Pour sauce into a pot and cook on medium-low heat until reduced, about 5 minutes. Remove as much grease as possible. Mix cornstarch and water together in a small bowl until smooth. Pour into sauce and cook until thickened, 1 to 3 minutes. 6. Pour sauce over short ribs and sprinkle sliced green onions on top.",
  "prep": "10 mins",
  "cook": "4 hrs 10 mins",
  "total": "4 hrs 20 mins",
  "calories": "670"
},
{
  "url": "https://www.allrecipes.com/recipe/246646/kalbi-ribs/",
  "name": "Kalbi Ribs",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "¾ cup water; ¾ cup white sugar; ¾ cup soy sauce; 1 tablespoon sesame oil; 1 clove garlic, minced; 2 pinches ground ginger; 2 pounds beef short ribs, or more to taste",
  "directions": "1. Whisk water, sugar, soy sauce, sesame oil, garlic, and ginger together in a large glass or ceramic bowl. Add beef short ribs and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator, 8 hours to overnight. 2. Preheat an outdoor grill for medium-high heat and lightly oil the grate. Remove short ribs from the marinade and discard marinade. 3. Cook short ribs on the grill until evenly browned, 3 to 4 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
  "prep": "15 mins",
  "cook": "6 mins",
  "total": "8 hrs 21 mins",
  "calories": "447"
},
{
  "url": "https://www.allrecipes.com/recipe/221226/grilled-korean-style-beef-short-ribs/",
  "name": "Grilled Korean-Style Beef Short Ribs",
  "rating": "4.9",
  "ratingcount": "23",
  "ingredients": "1 large Asian pear, peeled, cored and sliced; ⅓ cup sherry wine; ⅓ cup soy sauce; ¼ cup rice vinegar; ⅛ cup brown sugar; 3 cloves garlic, peeled; 5 slices fresh ginger, peeled and thinly sliced; 1 tablespoon hoisin sauce; 1 tablespoon hot chile paste (such as sambal oelek); 1 teaspoon sesame oil; 4 pounds beef short ribs, trimmed; 1  chopped green onion for garnish",
  "directions": "1. Mix pear slices, sherry wine, soy sauce, rice vinegar, brown sugar, garlic, ginger, hoisin sauce, hot chili paste, and sesame oil in a blender until smooth, about 4 minutes. 2. Arrange short ribs in a 9x13-inch baking dish and coat completely with marinade. Cover baking dish with plastic wrap and transfer to the refrigerator to marinate for 8 to 12 hours. 3. Remove short ribs to a plate and blot dry with paper towel to remove excess marinade. 4. Preheat an outdoor grill for medium-high heat, and lightly oil the grate. 5. Grill short ribs until firm, hot, and slightly pink in the center, about 4 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "10 hrs 20 mins",
  "calories": "1054"
},
{
  "url": "https://www.allrecipes.com/recipe/245045/borscht-braised-beef-short-ribs/",
  "name": "Borscht-Braised Beef Short Ribs",
  "rating": "4.7",
  "ratingcount": "19",
  "ingredients": "3 pounds beef short ribs, cut into 3-inch pieces; kosher salt and freshly ground black pepper to taste; 1 tablespoon vegetable oil; 1  yellow onion, chopped; 2 tablespoons all-purpose flour; 3 cups chicken broth; 1  bay leaf; 1 pound beets, peeled and cut into large pieces; 1 cup cubed carrots; ½ cup chopped celery; 2 teaspoons kosher salt, or to taste; ¼ cup sour cream; 1 tablespoon chopped fresh chives",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Generously season short ribs with kosher salt and freshly ground black pepper. Heat vegetable oil over high heat in a heavy pot. Brown short ribs on all sides until they are dark brown, about 6 minutes; transfer to a bowl. Add onions and continue cooking over high heat until onions go from golden to dark brown, about 8 minutes; this will make a richer, darker sauce. Stir flour into the onion mixture; cook for about 1 minute. Pour in broth; add bay leaf, beets, carrots, and celery. Bring pot to a simmer. Place browned short ribs in pot, evenly distributing them among the vegetables. 3. Bake in preheated oven until meat is tender, about 2 hours. Transfer meat and vegetables to a serving platter. 4. Bring sauce to a fast simmer over high heat until it is reduced by half and slightly thickened, 5 to 10 minutes. Taste for seasoning and add more salt, if needed. 5. Serve in bowls topped with a dollop of sour cream and chopped fresh chives.",
  "prep": "",
  "cook": "2 hrs 20 mins",
  "total": "2 hrs 20 mins",
  "calories": "1471"
},
{
  "url": "https://www.allrecipes.com/recipe/246643/gluten-free-kalbi-beef/",
  "name": "Gluten-Free Kalbi Beef",
  "rating": "4.0",
  "ratingcount": "2",
  "ingredients": "2 tablespoons sesame seeds; 1 ½ cups gluten-free soy sauce (tamari); ⅔ cup white sugar; ½ cup chopped green onions; ¼ cup sesame oil; 2 tablespoons minced garlic; ½ teaspoon red pepper flakes; 5 pounds Korean short ribs (cut flanken-style into 1/2-inch slices across the bones)",
  "directions": "1. Toast sesame seeds in a small skillet over medium heat until lightly browned, 3 to 5 minutes. 2. Combine sesame seeds, soy sauce, sugar, green onions, sesame oil, garlic, and red pepper flakes in a saucepan. Simmer over medium-low heat, stirring constantly, until flavors combine, about 10 minutes. Remove from heat and let marinade cool completely, about 15 minutes. 3. Place short ribs in large resealable plastic bags and cover with cooled marinade. Seal and let marinate in the refrigerator, at least 1 hour or overnight for maximum flavor. 4. Preheat grill for medium heat and lightly oil the grate. 5. Drain short ribs, discarding marinade, and cook on the preheated grill until browned, about 5 minutes per side.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr 45 mins",
  "calories": "608"
},
{
  "url": "https://www.allrecipes.com/recipe/237168/not-barbecued-short-ribs/",
  "name": "Not-Barbecued Short Ribs",
  "rating": "3.8",
  "ratingcount": "13",
  "ingredients": "3 large onions, chopped; 7 pounds beef short ribs, or more to taste; salt and ground black pepper to taste; 3 cups water; 2 (20 ounce) cans pineapple chunks in juice, undrained; 1 ½ cups brown sugar; 7 tablespoons Worcestershire sauce; 5 tablespoons ketchup; 4 cloves garlic, minced, or more to taste; 1 tablespoon dried sage; 1 tablespoon dried thyme; 1 ½ teaspoons dry mustard",
  "directions": "1. Spread onion into the bottom of the crock of your slow cooker. Season short ribs with salt and pepper; place atop the onion. 2. Mix water, pineapple chunks with juice, brown sugar, Worcestershire sauce, ketchup, garlic, sage, thyme, and mustard together in a bowl; pour over the ribs. 3. Cook on High for 4 hours (on on Low for 6 to 8 hours).",
  "prep": "10 mins",
  "cook": "4 hrs",
  "total": "4 hrs 10 mins",
  "calories": "740"
},
{
  "url": "https://www.allrecipes.com/recipe/212697/stewed-korean-short-ribs-kalbi-jim/",
  "name": "Stewed Korean Short Ribs (Kalbi Jim)",
  "rating": "4.0",
  "ratingcount": "9",
  "ingredients": "2 pounds beef short ribs, trimmed; 1  green onion, chopped; 2  carrots, peeled and chopped; 4 cloves garlic, minced; 1 (1 inch) piece fresh ginger root, chopped; ½ cup reduced-sodium soy sauce; ¼ cup brown sugar; 2 cups water to cover",
  "directions": "1. Score the surface of each beef short rib in a diamond pattern. Combine beef, green onion, carrots, garlic, ginger, soy sauce, and brown sugar in a large skillet. Pour enough water to cover the beef. Bring to a boil over medium-high heat, then reduce heat to medium-low. Simmer until beef is tender, about 1 hour. Skim off excess oil before serving.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "647"
},
{
  "url": "https://www.allrecipes.com/recipe/242286/korean-bbq-inspired-short-ribs/",
  "name": "Korean BBQ-Inspired Short Ribs",
  "rating": "3.5",
  "ratingcount": "2",
  "ingredients": "¼ cup rice wine vinegar; ¼ cup soy sauce; ¼ cup sriracha hot sauce, or to taste; 2 tablespoons olive oil; ¼ cup brown sugar; 2  green onions, chopped (Optional); 3 cloves garlic, minced, or more to taste; 1 tablespoon ground black pepper; 1 tablespoon toasted sesame seeds; 1 tablespoon minced fresh ginger; 1 pinch Chinese five-spice powder; 2 pounds beef short ribs, cut 1/3-inch-thick across the bones",
  "directions": "1. Whisk vinegar, soy sauce, sriracha hot sauce, and olive oil together in a large bowl; add brown sugar and stir until dissolved. Mix green onions, garlic, black pepper, sesame seeds, ginger, and five-spice powder into vinegar mixture until marinade is evenly combined. 2. Place short ribs in a large reseable bag and pour marinade over ribs; coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 3 hours. 3. Preheat grill for medium heat and lightly oil the grate. 4. Remove ribs from marinade and place on the grill; cook for 6 to 7 minutes. Flip ribs and spoon marinade over second side; cook until meat is no longer pink, 6 to 7 minutes more. Turn grill heat to high and cook ribs for 1 minute more per side. Remove ribs from heat and place on a plate; let rest for 5 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "3 hrs 30 mins",
  "calories": "619"
},
{
  "url": "https://www.allrecipes.com/recipe/262012/las-vegas-galbi-korean-style-beef-ribs/",
  "name": "Las Vegas Galbi (Korean-Style Beef Ribs)",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 ½ pounds beef short ribs, cut flanken-style; ½ large Asian pear, cored and cubed; 1  white onion; 1  kiwi, peeled and diced; 5 cloves garlic; 1 cup soy sauce; 1 cup brown sugar; ¼ cup honey; ¼ cup sesame oil; ¼ teaspoon ground black pepper",
  "directions": "1. Place ribs in a large bowl of water; soak for 1 hour. Drain ribs and return to the bowl. 2. Combine Asian pear, onion, kiwi, and garlic in a food processor and puree. Transfer to a bowl and stir in soy sauce, brown sugar, honey, sesame, oil, and black pepper. Pour marinade over ribs in the bowl. Cover with plastic wrap and marinate in the refrigerator, turning once, at least 8 hours or overnight. 3. Strain marinade and discard. 4. Preheat grill for medium heat and lightly oil the grate. Grill ribs until crispy outside and meat is no longer pink, about 8 minutes per side.",
  "prep": "20 mins",
  "cook": "16 mins",
  "total": "8 hrs 36 mins",
  "calories": "383"
},
{
  "url": "https://www.allrecipes.com/recipe/231448/beef-fajitas/",
  "name": "Beef Fajitas",
  "rating": "4.7",
  "ratingcount": "90",
  "ingredients": "¼ cup olive oil; 1 medium lime, juiced; 3 tablespoons chopped fresh cilantro; 2 tablespoons finely chopped onion; 3 cloves garlic, finely chopped; 1 ½ teaspoons ground cumin; 1 teaspoon salt; 1 teaspoon ground black pepper; 2 (8 ounce) boneless New York strip steaks, cut into thin strips; 8 (6 inch) white corn tortillas, or more as needed; 1 (8 ounce) jar salsa; 1 (8 ounce) package shredded Mexican cheese blend",
  "directions": "1. Whisk oil, lime juice, cilantro, onion, garlic, cumin, salt, and pepper together in a bowl; pour into a resealable plastic bag. Add steak strips, coat with marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 4 to 8 hours. 2. When ready to cook, heat a large skillet over medium heat. Add steak and marinade; cook and stir until steak is browned and cooked through and all liquid is absorbed, 15 to 20 minutes. 3. Serve on tortillas with salsa and Mexican cheese.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "4 hrs 35 mins",
  "calories": "699"
},
{
  "url": "https://www.allrecipes.com/recipe/245849/72-hour-sous-vide-short-ribs/",
  "name": "72-Hour Sous Vide Short Ribs",
  "rating": "3.5",
  "ratingcount": "2",
  "ingredients": "6 pounds beef short ribs; 8 cloves garlic, crushed; 2 tablespoons smoked salt",
  "directions": "1. Heat water in a sous vide water bath to 133 degrees F (56 degrees C). 2. Trim any areas of fat left on short ribs; coat thoroughly with garlic and salt. Place ribs into a large, resealable plastic bag. (Use two bags if necessary to leave plenty of room between ribs.) Seal, on low pressure if using a vacuum sealer, removing as much air as possible. 3. Submerge the bag fully into the water bath and cook, rotating every 12 to 18 hours, for 60 hours. Increase the heat to 144.5 degrees F (62.5 degrees C) and cook an additional 12 hours. 4. Remove ribs from the water bath; let rest in the bag on a cooling rack placed over a baking sheet until cool enough to handle. 5. Remove ribs from the bag and drain. Place ribs onto a work surface, turn so bones are facing up, and slice meat between the bones to separate. Cut membrane running along the length of each rib; slide the bone loose from the meat. Trim any excess fat and cut into serving portions. Pat ribs dry with paper towels; return to the cooling rack. 6. Heat a skillet until smoking hot. Add ribs and brown quickly, 30 to 60 seconds per side.",
  "prep": "20 mins",
  "cook": "3 days 5 mins",
  "total": "3 days 25 mins",
  "calories": "940"
},
{
  "url": "https://www.allrecipes.com/recipe/30834/ribs-fantastic/",
  "name": "Ribs Fantastic",
  "rating": "4.2",
  "ratingcount": "61",
  "ingredients": "4 pounds beef short ribs; ½ cup brown sugar; 1 cup ketchup; 2 tablespoons water; 2 tablespoons apple cider vinegar; ½ cup lemon juice; ½ cup grated celery; ½ cup grated onion; salt and pepper to taste",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Place ribs in a baking pan. In a medium bowl, combine brown sugar, ketchup, water, vinegar, lemon juice, celery, onion, salt and pepper. Mix well, then pour over ribs in pan. 3. Bake in preheated oven for 3 hours, or until tender.",
  "prep": "30 mins",
  "cook": "3 hrs",
  "total": "3 hrs 30 mins",
  "calories": "1943"
},
{
  "url": "https://www.allrecipes.com/recipe/261115/spicy-pressure-cooker-short-ribs/",
  "name": "Spicy Pressure Cooker Short Ribs",
  "rating": "4.4",
  "ratingcount": "5",
  "ingredients": "1  habanero pepper, minced; 1 ½ teaspoons ground black pepper; 1 teaspoon monosodium glutamate (MSG); 1 teaspoon paprika; ½ teaspoon ground cumin; 2 pounds beef short ribs; 1 (12 fluid ounce) can or bottle cola; 2 tablespoons apple cider; 1 tablespoon raspberry jam; 1 tablespoon Worcestershire sauce; 1 tablespoon brown sugar; 2 teaspoons canola oil; ½  onion, diced; 4 cloves garlic, minced; 2 tablespoons water; 2 tablespoons cornstarch",
  "directions": "1. Combine habanero pepper, black pepper, MSG, paprika, and cumin in a bowl. Rub mixture evenly over ribs; refrigerate for at least 30 minutes. 2. Combine cola, apple cider, jam, Worcestershire sauce, and brown sugar together in another bowl; stir well. 3. Heat oil in a pressure cooker over medium-high heat. Add ribs in batches; cook until browned all all sides, about 8 minutes. Remove from pot and set aside. Add onions and garlic to the pot. Cook and stir until onions are translucent, about 5 minutes. Return ribs to the pot; pour in cola mixture. 4. Close pot securely and place pressure regulator over vent according to manufacturer's instructions. Bring to high pressure, with rapid steam escaping the cooker, about 5 minutes. Reduce heat to medium and cook for 30 minutes. Let pressure release naturally according to manufacturer's instructions, about 15 minutes. 5. Combine water and cornstarch together in a small bowl; mix until cornstarch is dissolved. 6. Open pot carefully; transfer ribs to a plate. Skim any extra fat off the top of the liquid; drain to remove any solid bits. Return liquid to the pot. Mix in the cornstarch slurry. Cook, stirring constantly, over medium-high heat, until boiling. Remove from heat. Add ribs back in and coat in the liquid.",
  "prep": "20 mins",
  "cook": "1 hr 3 mins",
  "total": "2 hrs 8 mins",
  "calories": "591"
},
{
  "url": "https://www.allrecipes.com/recipe/269314/electric-pressure-cooker-short-ribs/",
  "name": "Electric Pressure Cooker Short Ribs",
  "rating": "3.0",
  "ratingcount": "2",
  "ingredients": "2 ½ pounds beef short ribs; 1 tablespoon garlic powder; 2 teaspoons kosher salt; 1 ½ teaspoons ground black pepper; 2 ½ tablespoons olive oil; 1 cup beef stock; 1 (6 ounce) can tomato paste; 2  carrots, coarsely chopped; 1  onion, coarsely chopped; ¼ cup balsamic vinegar; 1 large portobello mushroom cap, chopped; 2 tablespoons water, or as needed; 1 tablespoon cornstarch, or as needed; salt and ground black pepper to taste",
  "directions": "1. Season short ribs on all sides with garlic powder, kosher salt, and pepper. 2. Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function according to manufacturer's instructions. Set temperature to 375 degrees F (191 degrees C) if your unit has a temperature setting. 3. Heat olive oil in the pot. Add short ribs; sear all over until golden brown, about 2 minutes per side. Remove from pot and set aside. 4. Combine beef stock, tomato paste, carrots, onion, vinegar, and mushroom in the pot. Stir until tomato paste is dissolved. Return short ribs to the pot. Close and lock the lid. Select Meat function according to manufacturer's instructions; set timer for 30 to 40 minutes. Allow 10 to 15 minutes for pressure to build. 5. Release pressure using the natural-release method according to manufacturer's instructions, about 15 minutes. Unlock and remove the lid. Remove short ribs and skim any fat from the top of the liquid in the pot. 6. Stir water and cornstarch together to make a slurry. Set pressure cooker to Saute and bring the liquid to a boil. Stir in the slurry until mixture is thickened to your liking. Season with salt and pepper and return the short ribs. Cook on low until flavors come together, about 5 minutes more.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 25 mins",
  "calories": "384"
},
{
  "url": "https://www.allrecipes.com/recipe/237165/sweet-asian-short-ribs/",
  "name": "Sweet Asian Short Ribs",
  "rating": "4.5",
  "ratingcount": "13",
  "ingredients": "4 pounds beef short ribs; salt and ground black pepper to taste; 1 cup water; ½ cup loquat preserves; ½ cup sweet chili sauce; ¼ cup low-sodium soy sauce; ¼ cup low-sodium Worcestershire sauce; ¼ cup seasoned rice wine vinegar; ¼ cup honey; 1 envelope onion soup mix; ¼ teaspoon red pepper flakes; ¼ teaspoon onion powder; ¼ teaspoon garlic powder; ⅛ teaspoon ground cinnamon; ⅛ teaspoon ground ginger",
  "directions": "1. Place short ribs in the crock of a slow cooker; season with salt and pepper. 2. Combine water, preserves, chili sauce, soy sauce, Worcestershire sauce, rice wine vinegar, honey, onion soup mix, red pepper flakes, onion powder, garlic powder, cinnamon, and ginger in a jar with a tight-fitting lid. Seal jar and shake until ingredients are well mixed; pour over the ribs, assuring all ribs are covered in sauce. 3. Cook on Low until the meat is fork-tender, 6 to 9 hours (or on High for 3 to 6 hours).",
  "prep": "5 mins",
  "cook": "6 hrs",
  "total": "6 hrs 5 mins",
  "calories": "1180"
},
{
  "url": "https://www.allrecipes.com/recipe/237138/manhattan-filet-with-pan-sauce-bordelaise/",
  "name": "Manhattan Filet with Pan Sauce Bordelaise",
  "rating": "4.7",
  "ratingcount": "48",
  "ingredients": "2 large New York strip steaks; salt and ground black pepper to taste; 1 tablespoon vegetable oil; ¼ cup sliced shallots; ½ cup red wine; 2 (10.75 ounce) cans  low-sodium chicken broth; 1 tablespoon cold butter",
  "directions": "1. Cut all visible pieces of fat from the steak so that only the center \"eye\" portion of the steak remains. Set steaks aside. Cut all meat from the trimmed fat scraps, discard the fat, and finely chop the meat scraps until they resemble ground beef. Transfer chopped meat to a container and refrigerate. 2. Season steaks with black pepper and place on a wire rack set over a tray; refrigerate uncovered, 8 hours to overnight. 3. Bring steaks to room temperature and season with salt. 4. Heat vegetable oil in a large skillet over high heat. Cook steaks in hot oil until browned on one side, 4 to 5 minutes. Reduce heat to medium-high and turn steaks. Continue cooking until steaks start to firm and are reddish-pink and juicy in the center, 4 to 6 minutes more. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C) for medium-rare. Transfer meat to a plate to rest, 5 to 10 minutes. Set the skillet aside. 5. Place chopped beef scraps in a cold skillet and heat over medium-high heat. Cook and stir until meat is browned and caramelized. Add shallots and a pinch of salt; saute until shallots are golden brown and are softened, about 5 minutes more. 6. Pour red wine into the skillet and bring to a boil; cook and stir until wine is almost completely evaporated, 2 to 4 minutes. Add chicken broth and bring to a simmer. Reduce heat to low and cook until reduced by about half, 60 to 90 minutes. Strain sauce into a bowl and skim any fat that rises to the top. 7. Heat the empty steak skillet over medium-high heat. Pour strained sauce into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Season sauce with salt and pepper. Continue cooking until reduced and thickened, 3 to 5 minutes. 8. Remove the skillet from the heat. Whisk butter into sauce until melted and smooth. 9. Place each steak on a plate and spoon sauce over the top.",
  "prep": "25 mins",
  "cook": "1 hr 20 mins",
  "total": "9 hrs 45 mins",
  "calories": "732"
},
{
  "url": "https://www.allrecipes.com/recipe/203128/korean-braised-short-ribs-galbi-jjim/",
  "name": "Korean Braised Short Ribs (Galbi Jjim)",
  "rating": "4.0",
  "ratingcount": "16",
  "ingredients": "1 ½ cups soy sauce; 3 tablespoons sesame oil; 2 tablespoons minced garlic; 1 tablespoon minced fresh ginger root; 1 teaspoon ground ginger; ¼ cup brown sugar; 2 ½ cups water; ½ cup rice wine; ½ cup pear, peeled and grated; 1  kiwi, peeled and mashed; 2 teaspoons salt; 1 pinch ground black pepper; 4 pounds beef short ribs; 1  carrot, cut into large dice; 2  potatoes, peeled, cut into large chunks; ½ cup chopped green onions; 1  yellow onion, cut into large dice; 1 cup chestnuts (Optional); ½ cup shiitake mushrooms, sliced (Optional)",
  "directions": "1. To make the sauce, combine the soy sauce, sesame oil, garlic, fresh ginger, ground ginger, brown sugar, water, rice wine, pear, kiwi, salt, and pepper in a large bowl. Whisk to combine. 2. Fill a large stockpot with cold water. Soak the short ribs in the water for 30 minutes to 1 hour to pull out impurities. Drain. Score ribs by slicing shallow criss cross cuts across the meat. 3. Fill the stockpot with clean water and bring to a boil. Simmer the short ribs in the water for 30 minutes. Drain. Return the simmered ribs to the pot; pour in the sauce, bring to a low boil. Simmer the ribs in the sauce for 60 minutes. Stir in the carrot, potatoes, green onions, yellow onion, chestnuts, and shiitake mushrooms. Simmer until vegetables are tender, at least 30 additional minutes.",
  "prep": "30 mins",
  "cook": "2 hrs 20 mins",
  "total": "3 hrs 20 mins",
  "calories": "690"
},
{
  "url": "https://www.allrecipes.com/recipe/230388/janes-barbecued-short-ribs/",
  "name": "Jane's Barbecued Short Ribs",
  "rating": "5.0",
  "ratingcount": "12",
  "ingredients": "3 pounds bone-in beef short ribs; 2  onions, finely chopped; 1 cup tomato sauce; 1 cup water; ¼ cup cider vinegar; 3 tablespoons white sugar, or more to taste; 2 tablespoons chopped fresh parsley; 1 tablespoon prepared horseradish; 1 tablespoon prepared mustard; 1 teaspoon salt; ¼ teaspoon ground black pepper",
  "directions": "1. Place beef ribs in a large resealable plastic bag. Add onions, tomato sauce, water, vinegar, sugar, parsley, horseradish, mustard, salt, and black pepper. Squeeze excess air out of bag and seal. Marinate in refrigerator overnight or up to 24 hours, turning bag several times. 2. Transfer beef and marinade to a large pot and bring to a boil. Reduce heat to medium-low, cover, and simmer until beef is tender and falling off the bones, about 2 hours. Remove beef from liquid with a slotted spoon. 3. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 4. Arrange beef on preheated grill and cook until browned on all sides, about 10 minutes.",
  "prep": "10 mins",
  "cook": "2 hrs 10 mins",
  "total": "10 hrs 20 mins",
  "calories": "782"
},
{
  "url": "https://www.allrecipes.com/recipe/158229/the-real-deal-korean-beef-ribs/",
  "name": "The Real Deal Korean Beef Ribs",
  "rating": "4.4",
  "ratingcount": "21",
  "ingredients": "4 pounds Korean-style short ribs (beef chuck flanken, cut 1/3 to 1/2 inch thick across bones); ½ cup reduced-sodium soy sauce; ½ cup white sugar; 2 tablespoons honey; 2 tablespoons minced garlic; 2 tablespoons ground black pepper; 3 tablespoons water; 1 tablespoon Asian (toasted) sesame oil; 1 ½ tablespoons Asian plum wine",
  "directions": "1. Wash the ribs, removing any stray bits of bone, and allow to drain for 30 minutes. 2. Whisk together the soy sauce, sugar, honey, garlic, pepper, water, sesame oil, and plum wine until the sugar has dissolved; pour the mixture into a 1 gallon plastic zipper bag. Place the ribs into the marinade, squeeze all the air out of the bag, zip it up, and refrigerate at least 24 hours. 3. The next day, remove the ribs from the refrigerator and allow to come to room temperature before grilling. Remove the ribs from the marinade and discard the marinade. 4. Preheat an outdoor grill for medium-high heat, and lightly oil the grate. Grill the ribs until browned and no longer pink inside, 4 to 6 minutes per side.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "1 day 1 hr 30 mins",
  "calories": "692"
},
{
  "url": "https://www.allrecipes.com/recipe/141716/korean-bbq-short-ribs-gal-bi/",
  "name": "Korean BBQ Short Ribs (Galbi)",
  "rating": "4.7",
  "ratingcount": "252",
  "ingredients": "¾ cup soy sauce; ¾ cup water; 3 tablespoons white vinegar; 2 tablespoons sesame oil; ½ large onion, minced; ¼ cup minced garlic; ¼ cup dark brown sugar; 2 tablespoons white sugar; 1 tablespoon black pepper; 3 pounds Korean-style short ribs (beef chuck flanken, cut 1/3- to 1/2-inch-thick across bones)",
  "directions": "1. Pour soy sauce, water, vinegar, and sesame oil into a large, non-metallic bowl. Whisk in onion, garlic, brown sugar, white sugar, and pepper, whisking until sugars dissolve. Submerge ribs in the marinade. Cover the bowl and refrigerate 7 to 12 hours; the longer, the better. 2. Preheat an outdoor grill for medium-high heat. 3. Remove ribs from marinade and shake off excess; discard marinade. 4. Cook on the preheated grill until the meat is no longer pink, 5 to 7 minutes per side.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "7 hrs 25 mins",
  "calories": "710"
},
{
  "url": "https://www.allrecipes.com/recipe/96698/kalbi-korean-bbq-short-ribs/",
  "name": "Kalbi (Korean BBQ Short Ribs)",
  "rating": "4.8",
  "ratingcount": "245",
  "ingredients": "¾ cup soy sauce; ¾ cup brown sugar; ¾ cup water; 2  green onions, chopped; 1  garlic clove, minced; 1 tablespoon Asian (toasted) sesame oil; 2 pounds Korean-style short ribs (beef chuck flanken, cut 1/3 to 1/2 inch thick across bones)",
  "directions": "1. Stir together soy sauce, brown sugar, water, green onions, garlic, and sesame oil in a bowl until sugar has dissolved. 2. Place ribs in a large resealable plastic bag. Pour marinade over ribs. Seal the bag and refrigerate for 3 hours to overnight. 3. Preheat an outdoor grill for medium-high heat; lightly oil the grate. 4. Remove ribs from the bag; shake off excess marinade and discard marinade. Grill ribs on the preheated grill until meat is still pink but not bloody nearest the bone, 5 to 7 minutes per side.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "3 hrs 30 mins",
  "calories": "1096"
},
{
  "url": "https://www.allrecipes.com/recipe/228796/slow-cooker-barbequed-beef-ribs/",
  "name": "Slow Cooker Barbequed Beef Ribs",
  "rating": "4.4",
  "ratingcount": "285",
  "ingredients": "1 cup water; 1 cup ketchup; 1 (6 ounce) can tomato paste; ¾ cup brown sugar; ½ cup vinegar; 2 tablespoons prepared mustard; 1 tablespoon salt; 2 pounds beef back ribs",
  "directions": "1. Combine water, ketchup, tomato paste, brown sugar, vinegar, mustard, and salt in a slow cooker; stir well to dissolve brown sugar and salt. 2. Place short ribs into the sauce and stir to coat. Cover and cook until ribs are tender, about 8 hours on Low or 4 hours on High.",
  "prep": "10 mins",
  "cook": "4 hrs",
  "total": "4 hrs 10 mins",
  "calories": "1035"
},
{
  "url": "https://www.allrecipes.com/recipe/237166/slow-cooker-short-ribs/",
  "name": "Slow Cooker Short Ribs",
  "rating": "4.7",
  "ratingcount": "18",
  "ingredients": "cooking spray; 3 ribs celery, sliced; 2  carrots, sliced; 1  onion, chopped; 3 cloves garlic, smashed; 5 pounds beef short ribs; salt and ground black pepper to taste; 1 (10.5 ounce) can condensed beef consomme (such as Campbell's ®); ½ (10.5 ounce) can  water",
  "directions": "1. Prepare a slow cooker crock with cooking spray. 2. Spread celery, carrots, onion, and garlic in the bottom of the crock. Season short ribs with salt and pepper; place atop the vegetables. Pour beef consomme and water into the crock. 3. Cook on High until the ribs are fork-tender, 5 to 7 hours. 4. Remove the ribs from the slow cooker to a platter. Strain the broth and discard the vegetables. 5. Strip meat from the bones of the ribs. Discard bones and transfer meat to a bowl. Shred meat with 2 forks and serve with strained broth.",
  "prep": "15 mins",
  "cook": "5 hrs",
  "total": "5 hrs 15 mins",
  "calories": "618"
},
{
  "url": "https://www.allrecipes.com/recipe/25472/korean-beef-ribs/",
  "name": "Korean Beef Ribs",
  "rating": "3.8",
  "ratingcount": "16",
  "ingredients": "3 pounds rib roast; ½ cup vegetable oil; ½ cup soy sauce; ¼ cup packed brown sugar; 4 cloves garlic, peeled and crushed; 2 tablespoons curry powder",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Trim excess fat from rib roast, place on a medium baking sheet and cover with foil. Bake approximately 30 minutes in the preheated oven. 3. In a medium bowl, whisk together vegetable oil, soy sauce, brown sugar, garlic and curry powder. 4. Preheat an outdoor grill for high heat and lightly oil grate. 5. Drain juices from ribs and cut into 4 separate pieces. Place on the prepared grill. Basting frequently with the vegetable oil mixture and turning often, cook ribs 15 to 20 minutes, or until richly glazed.",
  "prep": "20 mins",
  "cook": "50 mins",
  "total": "1 hr 10 mins",
  "calories": "1390"
},
{
  "url": "https://www.allrecipes.com/recipe/16256/braised-beef-short-ribs/",
  "name": "Braised Beef Short Ribs",
  "rating": "4.2",
  "ratingcount": "136",
  "ingredients": "½ cup all-purpose flour for coating; 2 teaspoons salt; 1 pinch ground black pepper; 4 pounds beef short ribs; 2 tablespoons vegetable oil; 1 cup water; 1 cup stewed tomatoes; 1 clove garlic, minced; 6  potatoes, peeled and cubed; 3  onions, chopped; 6  carrots, chopped; 1 ½ tablespoons all-purpose flour; 4 tablespoons water",
  "directions": "1. In a bowl, combine the 1/2 cup flour, salt and ground black pepper. Roll the ribs in the seasoned flour. 2. In a large pot or Dutch oven, heat the oil and brown the ribs well on all sides. Pour in 1 cup boiling water, tomatoes, and garlic. Reduce heat to low, cover, and simmer for 1 1/2 hours, adding more water if necessary. 3. Place the potatoes, onions, and carrots in the pot. Continue to simmer for another 30 minutes to 1 hour, or until all vegetables are tender. Remove the meat and vegetables to a serving platter. 4. In a separate small bowl, dissolve 1 1/2 tablespoons flour and 2 tablespoons water for every one cup liquid remaining in the pot. Add this to the pot and stir well until thickened. Pour over meat and vegetables.",
  "prep": "15 mins",
  "cook": "2 hrs 40 mins",
  "total": "2 hrs 55 mins",
  "calories": "889"
},
{
  "url": "https://www.allrecipes.com/recipe/86801/bbq-ny-strip/",
  "name": "BBQ NY Strip",
  "rating": "4.7",
  "ratingcount": "283",
  "ingredients": "4 (6 ounce) New York strip steaks; ½ cup extra virgin olive oil; ½ cup Worcestershire sauce; ¼ cup steak seasoning; 4 tablespoons minced garlic; 1 tablespoon red wine vinegar; ½ teaspoon dried basil; ½ teaspoon Italian seasoning",
  "directions": "1. Pierce steaks on all sides with a fork . 2. Whisk olive oil, Worcestershire sauce, steak seasoning, garlic, vinegar, basil, and Italian seasoning together in a bowl and pour into a resealable plastic bag. Add steaks, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 2 hours. 3. When ready to cook, preheat an outdoor grill for high heat and lightly oil the grate. 4. Remove steaks from the marinade and shake off excess. Discard the remaining marinade. 5. Cook steaks on the preheated grill for 7 minutes on each side, or to desired doneness.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "2 hrs 30 mins",
  "calories": "586"
},
{
  "url": "https://www.allrecipes.com/recipe/261791/peposa-dellimpruneta-tuscan-black-pepper-beef/",
  "name": "Peposa Dell'Impruneta (Tuscan Black Pepper Beef)",
  "rating": "4.8",
  "ratingcount": "58",
  "ingredients": "6  beef short ribs (8 to 10 oz. each); 1 tablespoon kosher salt; 8 cloves garlic, peeled and crushed; 1 tablespoon tomato paste; 2 tablespoons whole black peppercorns, freshly crushed; 1 tablespoon freshly ground black pepper; 3  sage leaves; 3 small sprigs fresh rosemary; 2  bay leaves; 2 cups red wine, preferably Chianti; salt to taste, to adjust sauce",
  "directions": "1. Place meat in a large mixing bowl. Sprinkle all sides generously with 1 tablespoon kosher salt. 2. Place chopped garlic and a pinch of salt in a mortar and mash with pestle until pastelike. Add tomato paste; mash until blended. Transfer mixture into bowl with beef and rub onto all sides of meat. Add crushed peppercorns and ground pepper. Distribute evenly over all sides of beef. Transfer to a deep skillet or Dutch oven bone side down. Tuck sage leaves, rosemary, and dry bay leaves between pieces of meat. Carefully add wine along the side of the pan to avoid washing over the top of the meat. 3. Place pan over high heat and bring to a simmer; reduce heat to low. Cover tightly. Cook until meat is fork tender, turning pieces every 30 minutes or so, about 3 1/2 hours. Transfer pieces of meat to a warm bowl. 4. Increase heat to high and bring braising liquid to a boil. Simmer until liquid is reduced by about half or until slightly thickened, 8 to 10 minutes. Remove bones from meat. 5. When sauce is thickened, transfer meat back to skillet. Reduce heat to medium-low and spoon sauce over meat. Cook until until heated through, about 5 minutes.",
  "prep": "10 mins",
  "cook": "3 hrs 30 mins",
  "total": "3 hrs 40 mins",
  "calories": "655"
},
{
  "url": "https://www.allrecipes.com/recipe/86707/insane-oven-beef-ribs/",
  "name": "Insane Oven Beef Ribs",
  "rating": "4.0",
  "ratingcount": "146",
  "ingredients": "2 pounds beef short ribs; ¾ cup red wine; ½ cup olive oil; ⅓ cup soy sauce; ¼ cup brown sugar; 2 tablespoons all-purpose flour; 4 cloves garlic, minced; 1 pinch curry powder",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Place ribs in a large pot and fill with enough water to cover. Bring to a boil and cook until meat is no longer pink, about 20 minutes. Drain. 3. Stir together red wine, olive oil, soy sauce, brown sugar, flour, garlic, and curry powder in a medium bowl. 4. Coat ribs generously with sauce and arrange on a baking sheet. 5. Roast in the preheated oven until fork-tender, about 30 minutes. Pour remaining sauce over ribs about halfway through cooking.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "1077"
},
{
  "url": "https://www.allrecipes.com/recipe/26613/italian-style-short-ribs/",
  "name": "Italian Style Short Ribs",
  "rating": "4.2",
  "ratingcount": "17",
  "ingredients": "1 tablespoon butter; 3 slices bacon, chopped; 2 pounds beef short ribs, cut into 2 inch pieces; 1 ½ teaspoons salt; ⅛ teaspoon ground black pepper; 1 cup beef broth; 2 tablespoons fresh lemon juice; ¼ cup red wine; ⅛ teaspoon dried oregano, crushed",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. In a large heavy saucepan over medium heat, melt the butter and brown the bacon and beef short ribs, stirring constantly for about 10 minutes. 3. Transfer ribs and bacon to a 2 quart baking dish. Season with salt and pepper. Pour in the beef broth, lemon juice and red wine. Sprinkle in oregano. Mix well and cover the dish. 4. Bake in the preheated oven 1 1/2 to 2 hours, until the meat may be easily separated from the bone. Spoon off excess fat before serving.",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs",
  "calories": "607"
},
{
  "url": "https://www.allrecipes.com/recipe/20474/new-york-strip-chicago-style/",
  "name": "New York Strip Chicago Style",
  "rating": "3.9",
  "ratingcount": "63",
  "ingredients": "1 tablespoon extra virgin olive oil; 1 clove garlic, minced; ½ teaspoon ground cinnamon; ½ teaspoon white sugar; 2 tablespoons apricot preserves; 2 (1/2 pound) New York strip steaks, 1 inch thick; salt and pepper to taste",
  "directions": "1. In a shallow glass dish, mix the olive oil, garlic, cinnamon, sugar, and apricot preserves. Mix well, as the preserves tend to stick until warm. 2. With a knife, make several shallow slashes in both sides of the steaks. Sprinkle with salt and pepper. Place steaks in the dish with the sauce, and turn to coat. Cover with plastic wrap, and refrigerate for at least 1 hour. 3. Preheat grill for high heat. 4. Lightly oil the grill grate. Place steaks on the grill, and discard any remaining sauce. Grill steaks 10 minutes, turning occasionally, or to desired doneness.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "1 hr 25 mins",
  "calories": "439"
},
{
  "url": "https://www.allrecipes.com/recipe/259456/instant-pot-short-ribs/",
  "name": "Instant Pot® Short Ribs",
  "rating": "4.3",
  "ratingcount": "31",
  "ingredients": "1 (750 milliliter) bottle full-bodied red wine; 4 pounds beef short ribs; salt and ground black pepper to taste; 1 cup all-purpose flour; ¼ cup olive oil; 3 tablespoons unsalted butter; 1 ½ cups chopped white onion; 1 cup peeled and minced carrots; 2 cloves garlic, sliced; 2 sprigs fresh rosemary; 1 quart chicken stock, or as needed; ¼ cup water; 2 tablespoons cornstarch",
  "directions": "1. Pour red wine over short ribs in a large bowl. Marinate in the refrigerator, 8 hours to overnight. 2. Remove ribs from marinade, saving marinade for later use. Season short ribs with salt and pepper. Coat 1 side of each short rib with flour. 3. Select the \"Saute\" setting on an electric pressure cooker (such as Instant Pot®); add olive oil and butter. Cook and stir until butter melts, about 2 minutes. Add 3 short ribs to hot butter-oil mixture. Cook until bottom is browned, about 8 minutes. Transfer browned short ribs to a plate. Repeat cooking with remaining short ribs, reserving butter-oil mixture in the pot. 4. Cook and stir onion, carrots, garlic, and rosemary in the hot butter-oil mixture, scraping browned bits off the sides of pot, until onion is softened and starting to brown, about 5 minutes. Add reserved wine marinade; stir well. Simmer until wine is reduced by 1/2, about 10 minutes. 5. Return ribs to the pot; add chicken stock. Ensure the total volume does not go above the maximum fill line and that the bulk of the ribs are submerged. Seal the pressure cooker. Turn the venting knob on top to \"Sealed\", causing the floating valve to pop up. 6. Press the \"Manual\" button; set timer for 35 minutes. Tap the venting knob with a wooden spoon or spatula. Stand back; turn knob to point at \"Vent.\" Remove lid when pressure is released, about 5 minutes. 7. Transfer the ribs to a plate and cover with aluminum foil, reserving sauce in the pot. 8. Turn the Instant Pot to \"Saute\". Simmer sauce until slightly reduced, about 5 minutes. Stir water and cornstarch together in a bowl until smooth; add to sauce in the pot. Cook for 3 minutes. Strain sauce and serve over ribs.",
  "prep": "20 mins",
  "cook": "1 hr 39 mins",
  "total": "10 hrs 4 mins",
  "calories": "485"
},
{
  "url": "https://www.allrecipes.com/recipe/162690/simple-beef-short-ribs/",
  "name": "Simple Beef Short Ribs",
  "rating": "4.5",
  "ratingcount": "320",
  "ingredients": "1 pound beef short ribs; 1 teaspoon salt; ½ teaspoon ground black pepper; 2 tablespoons all-purpose flour; 1 tablespoon olive oil; 1 tablespoon butter; 1  onion, sliced; 1 clove garlic; 1 (12 fluid ounce) can or bottle stout beer; 1 cup beef stock",
  "directions": "1. Season ribs with salt and pepper. Dredge in flour until coated; shake off excess. 2. Heat olive oil and butter in a large skillet or Dutch oven over medium-high heat. Cook ribs until browned, about 5 minutes per side. Remove ribs and set aside. 3. Add onion and garlic to the skillet; cook and stir until onion is tender, about 5 minutes. Return ribs to the skillet. Pour in beer while scraping the browned bits of food off the bottom of the pan. Pour in beef stock. 4. Cover and simmer over low heat until ribs are very tender, about 2 hours.",
  "prep": "15 mins",
  "cook": "2 hrs 15 mins",
  "total": "2 hrs 30 mins",
  "calories": "364"
},
{
  "url": "https://www.allrecipes.com/recipe/67001/kalbi-marinated-beef-short-ribs/",
  "name": "Kalbi (Marinated Beef Short Ribs)",
  "rating": "4.5",
  "ratingcount": "45",
  "ingredients": "¾ cup white sugar; ¾ cup soy sauce; ¼ cup sesame oil; 4 cloves garlic, minced; 3  green onions, chopped; 2 tablespoons sesame seeds; 5 pounds beef short ribs",
  "directions": "1. Stir the sugar into the soy sauce in a bowl until the sugar dissolves completely. Whisk the sesame oil, garlic, green onions, and sesame seeds into the soy sauce. Place the short ribs in a large, sealable bag and pour the marinade over the meat. Marinate in refrigerator for 8 hours or overnight. 2. Preheat an outdoor grill for medium heat, and lightly oil the grate. Remove the ribs from the bag; discard the marinade. 3. Cook the short ribs on the preheated grill until they are very firm, hot, and grey in the center, about 15 minutes per side. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "8 hrs 40 mins",
  "calories": "995"
},
{
  "url": "https://www.allrecipes.com/recipe/261106/fast-pressure-cooker-ribs/",
  "name": "Fast Pressure Cooker Ribs",
  "rating": "4.1",
  "ratingcount": "10",
  "ingredients": "2 pounds boneless country-style ribs, or more as desired; ¼ teaspoon garlic powder, or to taste; salt and ground black pepper to taste; 1  red onion, sliced; 2 cups barbeque sauce (such as Famous Dave's®); 1 cup beef broth",
  "directions": "1. Season ribs with garlic powder, salt, and pepper. 2. Place a layer of onion in the bottom of a pressure cooker. Add a layer of ribs. Repeat with remaining onion and ribs. 3. Combine barbeque sauce and broth together in a bowl; pour over ribs in the pressure cooker. 4. Close cooker securely and place pressure regulator over vent according to manufacturer's instructions. Heat until steam escapes in a steady flow and makes a whistling sound, about 5 minutes. Adjust heat until regulator is gently rocking. Cook for 25 minutes. Transfer the pressure cooker to the sink; cool the pot with cold water for about 30 seconds to release pressure quickly.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "41 mins",
  "calories": "334"
},
{
  "url": "https://www.allrecipes.com/recipe/218722/barbeque-style-braised-short-ribs/",
  "name": "Barbeque Style Braised Short Ribs",
  "rating": "4.7",
  "ratingcount": "145",
  "ingredients": "2 tablespoons vegetable oil; 5 pounds lean beef short ribs, cut into 3-inch pieces; 1 teaspoon salt; ½ teaspoon fresh ground black pepper; 1 large onion, cut into thick slices and separated into rings; 5  carrots, peeled and cut into chunks; 4 cloves garlic, coarsely chopped; 1 (16 ounce) can tomato sauce; 1 cup barbeque sauce; 1 cup beef broth",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Heat oil over medium heat in a large, heavy, oven-safe pot or Dutch oven, and brown the ribs on all sides, about 5 minutes, working in batches if necessary. Sprinkle ribs with salt and black pepper as they brown. Transfer cooked ribs to paper towels to blot up extra oil. 3. Stir the onion rings and carrots into the same pot, and cook and stir until the onions turn translucent and start to brown, about 8 minutes. Stir in the garlic, and cook until fragrant, about 1 more minute. Mix in tomato sauce, barbeque sauce, and beef broth; bring the sauce to a boil, and simmer for 1 minute to blend flavors. Stir in the browned ribs. 4. Cover the pot, and bake in the preheated oven until the rib meat is very tender, about 2 1/2 hours. Turn the ribs occasionally while cooking. Season to taste with salt and black pepper before serving hot.",
  "prep": "15 mins",
  "cook": "3 hrs",
  "total": "3 hrs 15 mins",
  "calories": "649"
},
{
  "url": "https://www.allrecipes.com/recipe/16218/smothered-beef-short-ribs/",
  "name": "Smothered Beef Short Ribs",
  "rating": "4.6",
  "ratingcount": "331",
  "ingredients": "4 pounds beef short ribs; salt and pepper to taste; 1 cup all-purpose flour; ½ cup olive oil; 2 cups chopped onions; 1 cup chopped celery; 1 cup chopped carrots; 2 tablespoons minced garlic; 1 tablespoon dried thyme; 3 large bay leaves; 1 cup red wine; 8 cups beef stock; ¼ cup chopped fresh parsley",
  "directions": "1. Season ribs with salt and pepper, then dredge in flour. 2. Heat oil in a large pot over medium-high heat. Sear ribs in hot oil in small batches, adding oil as needed, 2 to 3 minutes per batch. Transfer to a plate. 3. Add onions to the pot and sauté for 2 minutes. Add celery and carrots; sauté for 1 minute. Season with salt and pepper, then stir in garlic, thyme, and bay leaves. Cook until fragrant, about 1 minute. 4. Pour wine into the pot and bring to a boil while scraping the browned bits of food off the bottom of the pan with a wooden spoon. Add stock and bring to a boil. Reduce the heat to low; add ribs and simmer until meat pulls away easily from the bone and sauce has thickened, about 2 hours. 5. Discard bay leaves. Stir in parsley and serve.",
  "prep": "20 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 50 mins",
  "calories": "1505"
},
{
  "url": "https://www.allrecipes.com/recipe/265861/bourbon-pepper-pan-sauce/",
  "name": "Bourbon Pepper Pan Sauce",
  "rating": "4.9",
  "ratingcount": "31",
  "ingredients": "2 (6 ounce) New York strip steaks; kosher salt to taste; freshly ground black pepper to taste; 2 teaspoons duck fat, or as needed; 1 clove garlic, minced; 3 teaspoons butter, divided; 1 fluid ounce bourbon; ½ cup chicken broth; ⅓ cup heavy cream; salt to taste; 1 pinch cayenne pepper",
  "directions": "1. Season both sides of the steaks generously with salt and pepper. Be especially generous with the pepper. 2. Melt duck fat in a steel pan over medium-high heat. Add steaks; cook until firm and reddish-pink in the center for medium-rare, about 5 minutes per side. Sear the edges until browned, about 30 seconds each. Transfer steaks to a plate; let rest while you make the sauce. Turn off the heat. 3. Stir garlic into the same pan using a spoon. Add 1 teaspoon butter; let melt. Pour in bourbon. Heat until reduced to a sticky glaze, about 15 seconds. Add chicken stock. Bring to a boil over high heat while scraping up the browned bits at the bottom to deglaze. Cook until reduced by half, about 2 minutes. Add heavy cream; season with salt and cayenne pepper. Boil until thickened, 2 to 3 minutes. 4. Turn off heat and add remaining 2 teaspoons butter; swirl until melted, about 30 seconds more. Spoon sauce warm onto serving plates. Place steaks on top.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "537"
},
{
  "url": "https://www.allrecipes.com/recipe/270527/instant-pot-galbi-korean-style-short-ribs/",
  "name": "Instant Pot Galbi (Korean-Style Short Ribs)",
  "rating": "4.4",
  "ratingcount": "9",
  "ingredients": "3 pounds beef short ribs; 1  Asian pear - peeled, cored, and coarsely chopped; 1 small onion, chopped; 4 cloves garlic, chopped; ½ tablespoon peeled and coarsely chopped fresh ginger; 1 cup low-sodium soy sauce, divided; ¼ cup rice wine; ¼ cup water; ¼ cup brown sugar; 2 tablespoons sesame oil, divided; ½ teaspoon ground black pepper; 2  carrots, peeled and cut in chunks; 5  radishes, peeled and cut into chunks; ¼ cup white sugar; ½ bunch green onions, chopped, or to taste; 1 tablespoon sesame seeds, or to taste",
  "directions": "1. Soak ribs in a large bowl of water for 1 hour. 2. Meanwhile, combine Asian pear, onion, garlic, and ginger in a blender or food processor; purée until smooth. Transfer mixture to a mixing bowl. Mix in 3/4 cup soy sauce, rice wine, water, brown sugar, 1 tablespoon sesame oil, and pepper to create a sauce. Set aside. 3. Drain ribs and dry them well. Trim off excess fat. Place ribs in a multi-functional pressure cooker (such as Instant Pot), then add carrots and radishes. Pour Asian pear sauce on top. Close and lock the lid. Select Meat function according to manufacturer's instructions; set the timer for 35 minutes. Allow 10 to 15 minutes for pressure to build. 4. Release pressure using the natural-release method according to manufacturer's instructions, 10 to 40 minutes. Unlock and remove the lid. Transfer meat and vegetables to a plate and set aside. 5. Select the Sauté function on your Instant Pot. Stir in white sugar, remaining 1/4 cup soy sauce, and remaining 1 tablespoon sesame oil. Cook, stirring occasionally, until sugar has melted and sauce has thickened, about 10 minutes. Return ribs and vegetables to the pot; stir to coat with sauce. 6. Garnish ribs and vegetables with green onions and sesame seeds.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "2 hrs 25 mins",
  "calories": "657"
},
{
  "url": "https://www.allrecipes.com/recipe/237049/fast-and-easy-slow-cooked-short-ribs/",
  "name": "Fast and Easy Slow-Cooked Short Ribs",
  "rating": "4.6",
  "ratingcount": "43",
  "ingredients": "3 pounds beef short ribs, or more to taste; 1 (10.5 ounce) can condensed French onion soup; salt and ground black pepper to taste; 1 (12 ounce) bottle chili sauce; 2 tablespoons chopped fresh rosemary, or more to taste",
  "directions": "1. Place short ribs into a slow cooker. Top with condensed soup; season with salt and pepper. Pour chili sauce over exposed parts of ribs; sprinkle with rosemary. 2. Cook on Low for 8 to 10 hours.",
  "prep": "10 mins",
  "cook": "8 hrs",
  "total": "8 hrs 10 mins",
  "calories": "501"
},
{
  "url": "https://www.allrecipes.com/recipe/85349/tanyas-boneless-short-ribs/",
  "name": "Tanya's Boneless Short Ribs",
  "rating": "3.9",
  "ratingcount": "33",
  "ingredients": "4 pounds boneless beef short ribs, trimmed and cut into 2-inch pieces; 1 (8 ounce) can tomato sauce; 1 cup tomato juice; 1 small onion, finely chopped; 3 tablespoons cider vinegar; 2 tablespoons Worcestershire sauce; 1 tablespoon hot sauce; ¼ teaspoon ground cinnamon; 1 pinch ground cloves; 1 pinch ground black pepper",
  "directions": "1. Preheat the oven broiler. 2. Place ribs on a rack in a broiler pan, and broil on top oven rack 15 minutes, or until well browned. Remove from heat, and transfer to a baking dish. Reduce oven temperature to 350 degrees F (175 degrees C). 3. In a saucepan over medium heat, mix the tomato sauce, tomato juice, onion, vinegar, Worcestershire sauce, and hot sauce. Season with cinnamon, cloves, and pepper. Bring to a boil. Pour over the ribs in the baking dish. 4. Bake ribs in the 350 degrees F (175 degrees C) oven 45 minutes, or until meat pulls apart easily with a fork and reaches a minimum internal temperature of 160 degrees F (70 degrees C).",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "651"
},
{
  "url": "https://www.allrecipes.com/recipe/22686/broiled-short-ribs/",
  "name": "Broiled Short Ribs",
  "rating": "4.6",
  "ratingcount": "115",
  "ingredients": "4 pounds boneless beef short ribs; salt and pepper to taste; ⅓ cup molasses; ⅔ cup ketchup; ¼ cup fresh lemon juice; 1 tablespoon dry mustard; ½ teaspoon chili powder; ½ teaspoon garlic powder",
  "directions": "1. Trim fat from rib meat. Sprinkle with salt and pepper to taste. Place in a Dutch oven and cover with water. Simmer for 2 hours. Drain. 2. In a small bowl, combine the molasses, ketchup, lemon juice, dry mustard, chili powder and garlic powder. Mix thoroughly. 3. Place the drained meat on a broiler rack. Brush molasses mixture over ribs. Broil on medium for 10 to 15 minutes, turning and basting with sauce often.",
  "prep": "10 mins",
  "cook": "2 hrs 15 mins",
  "total": "2 hrs 25 mins",
  "calories": "361"
},
{
  "url": "https://www.allrecipes.com/recipe/238139/grilled-bbq-short-ribs-with-dry-rub/",
  "name": "Grilled BBQ Short Ribs with Dry Rub",
  "rating": "4.7",
  "ratingcount": "63",
  "ingredients": "1 tablespoon packed brown sugar; 1 tablespoon paprika; 1 tablespoon chili powder; 1 teaspoon salt; 1 teaspoon garlic powder; 4 pounds beef short ribs (bone-in), trimmed of fat; Reynolds Wrap® Heavy Duty Aluminum Foil; ½ cup barbecue sauce, plus additional for serving",
  "directions": "1. Mix brown sugar, paprika, chili powder, salt, and garlic powder in a medium bowl. 2. Cut ribs into equal portions. Generously rub spice mixture onto all surfaces of ribs; place ribs in a single layer in a glass baking dish. Cover and refrigerator for 30 minutes to 1 hour. 3. Preheat grill to medium indirect heat, 375 to 400 degrees F (190 to 200 degrees C). 4. Center one portion ribs on a 12x18-inch sheet of heavy-duty aluminum foil; add 2 ice cubes. Bring up the foil sides, then double-fold the top and ends to seal the packet, leaving room for heat circulation inside. Repeat to make 3 more packets. 5. Arrange packets over indirect heat on the preheated grill. Cover and cook until tender, 1 1/2 to 2 hours. 6. Uncover the grill. Keeping the foil packets on the grill, open them carefully by cutting along the top folds with a sharp knife, allowing steam to escape; then proceed to open packets fully. 7. Brush ribs with about 1/2 cup barbecue sauce. 8. Move packets over direct heat, cover, and continue grilling, turning once, until ribs are browned and crisp, about 5 minutes more. 9. Serve with additional barbecue sauce as desired.",
  "prep": "15 mins",
  "cook": "1 hr 35 mins",
  "total": "2 hrs 20 mins",
  "calories": "1007"
},
{
  "url": "https://www.allrecipes.com/recipe/141268/korean-bbq-galbi/",
  "name": "Korean BBQ Galbi",
  "rating": "4.8",
  "ratingcount": "46",
  "ingredients": "5 pounds beef short ribs, cut flanken style; 1  Asian pear, cored and cubed; 1  onion, coarsely chopped; 5 cloves garlic; 1 cup soy sauce (such as Kikkoman®); 1 cup brown sugar; ¼ cup honey; ¼ cup sesame oil; black pepper to taste",
  "directions": "1. Place ribs in a large pot and cover with cold water. Soak ribs in the refrigerator for 1 hour to pull out any blood. Drain. 2. Combine Asian pear, onion, and garlic in a blender; blend until smooth. Pour into a large bowl and stir in soy sauce, brown sugar, honey, sesame oil, and black pepper. Add ribs to soy mixture; turn to coat evenly. Cover the bowl and marinate in the refrigerator, 8 hours to overnight. 3. Preheat an outdoor grill for high heat and lightly oil the grate. 4. Remove ribs from marinade and cook on the preheated grill until meat is tender and the outside is crusty, 5 to 10 minutes per side. Discard marinade.",
  "prep": "30 mins",
  "cook": "10 mins",
  "total": "9 hrs 40 mins",
  "calories": "1092"
},
{
  "url": "https://www.allrecipes.com/recipe/76705/wonderful-short-ribs/",
  "name": "Wonderful Short Ribs",
  "rating": "4.5",
  "ratingcount": "355",
  "ingredients": "1 (28 ounce) can tomato sauce; 3 tablespoons lemon juice; 4 teaspoons Worcestershire sauce; 2 tablespoons dried parsley; 1 teaspoon dried thyme; 2  bay leaves; 2 tablespoons brown sugar; 2 teaspoons salt; 1 teaspoon crushed red pepper flakes; 1 medium onion, cut into rings; 3 pounds beef short ribs",
  "directions": "1. In a large pan over medium-high heat, stir in tomato sauce, lemon juice, and Worcestershire sauce. Stir in parsley, thyme, bay leaves, brown sugar, salt, and red pepper flakes. Add onions and short ribs, and stir together until the mixture comes to a boil. 2. Cover, reduce heat to medium low, and simmer; stirring occasionally and skimming fat from surface, until meat is tender, about 2 1/2 hours. Remove bay leaves before serving.",
  "prep": "10 mins",
  "cook": "2 hrs",
  "total": "2 hrs 10 mins",
  "calories": "532"
},
{
  "url": "https://www.allrecipes.com/recipe/270954/mississippi-beef-short-ribs/",
  "name": "Mississippi Beef Short Ribs",
  "rating": "4.8",
  "ratingcount": "45",
  "ingredients": "1 teaspoon kosher salt; 1 teaspoon garlic powder; 1 teaspoon onion powder; 1 teaspoon freshly ground black pepper; 1 teaspoon dried dill weed; ½ teaspoon dried rosemary; ½ teaspoon dried thyme; 2 tablespoons finely grated Parmigiano-Reggiano cheese; 2 ½ pounds boneless beef short ribs; salt and freshly ground black pepper to taste; 1 pinch cayenne pepper; 1 tablespoon olive oil; 1 large onion, sliced; ⅓ cup sliced fresh mushrooms; 1 tablespoon all-purpose flour; ⅔ cup chicken broth; 1 tablespoon soy sauce; ½ teaspoon Worcestershire sauce; 6  whole pepperoncini peppers; ¼ cup unsalted butter",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix together kosher salt, garlic powder, onion powder, pepper, dill, rosemary, thyme, and Parmesan cheese in a small bowl. Set aside. 3. Season short ribs with salt, pepper, and cayenne. Heat oil in a pan over high heat. Add short ribs and sear until well browned, 3 to 5 minutes per side. Transfer beef to a baking dish and sprinkle seasoning mixture evenly over beef. 4. Reduce heat to medium-high and add onion and mushrooms to the pan. Season with salt. Sauté until mushrooms are golden brown, about 5 minutes. 5. Sprinkle flour over onion and mushrooms. Stir to coat and cook for 2 minutes. Pour in chicken broth, soy sauce, and Worcestershire sauce. Stir and bring to a boil; remove from heat. Pour mixture over beef and cover with pepperoncini. Place butter on top. Cover baking dish with foil. 6. Bake in the preheated oven until meat is fork-tender and falls apart easily, about 2 1/2 hours. 7. Spoon sauce from the bottom of the pan onto beef to serve. Skim off excess fat as desired.",
  "prep": "10 mins",
  "cook": "2 hrs 55 mins",
  "total": "3 hrs 5 mins",
  "calories": "386"
},
{
  "url": "https://www.allrecipes.com/recipe/267242/instant-pot-ribs/",
  "name": "Instant Pot® Ribs",
  "rating": "4.4",
  "ratingcount": "18",
  "ingredients": "2 cups apple juice; ¼ cup apple cider vinegar; 2 tablespoons liquid smoke; 2  bay leaves, or more to taste; 2 racks baby back pork ribs",
  "directions": "1. Combine juice, vinegar, and liquid smoke in a multi-functional pressure cooker (such as Instant Pot®). Add bay leaves. 2. Add a trivet to the pot and place ribs on top, trimming as needed to fit. Close and lock the lid; set valve to sealing. Choose high pressure and set timer for 15 minutes. Allow 10 to 15 minutes for pressure to build. 3. Release pressure using the natural-release method according to manufacturer's instructions, about 15 minutes. Unlock and remove the lid.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "336"
},
{
  "url": "https://www.allrecipes.com/recipe/237320/sherry-braised-beef-short-ribs/",
  "name": "Sherry Braised Beef Short Ribs",
  "rating": "4.8",
  "ratingcount": "472",
  "ingredients": "4 slices bacon, cut into 1/2-inch pieces; 3 ½ pounds beef short ribs; salt and ground black pepper to taste; 6 sprigs fresh thyme, leaves stripped; 1  bay leaf; 1  onion, diced; 3 cloves garlic, minced; 2 tablespoons all-purpose flour; 1 cup dry sherry; 1 quart beef broth",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer crisped bacon with a slotted spoon to a Dutch oven. Retain bacon drippings in the skillet. 3. Generously season short ribs with salt and pepper. 4. Heat bacon drippings in the same skillet over high heat. Cook short ribs in hot bacon fat until browned and caramelized on all sides, 3 to 5 minutes per side. Transfer ribs to the Dutch oven, reserving drippings in the skillet. Add thyme and bay leaf to the ribs mixture. 5. Reduce heat under the same skillet to medium. Cook and stir onion in the skillet until soft and golden, 5 to 10 minutes. Add garlic; cook and stir until fragrant, about 30 seconds. 6. Whisk flour into onion mixture and stir until the mixture becomes paste-like and light golden brown, 1 to 3 minutes. 7. Pour sherry into onion mixture; cook until thick and hot, about 2 minutes. Pour onion-sherry mixture into Dutch oven; add beef broth and salt to taste. Bring ribs mixture to a simmer and cover the Dutch oven with a lid. 8. Transfer Dutch oven to the preheated oven and cook until short ribs are fork tender, about 2 hours. Remove ribs to a serving dish, reserving sauce in the pot. 9. Set Dutch oven high heat and boil sauce until reduced and slightly thickened, about 10 minutes. Spoon reduced sauce over ribs.",
  "prep": "20 mins",
  "cook": "2 hrs 35 mins",
  "total": "2 hrs 55 mins",
  "calories": "490"
},
{
  "url": "https://www.allrecipes.com/recipe/23564/slow-cooked-german-short-ribs/",
  "name": "Slow-Cooked German Short Ribs",
  "rating": "4.5",
  "ratingcount": "456",
  "ingredients": "2 tablespoons all-purpose flour; 1 teaspoon salt; ⅛ teaspoon ground black pepper; 3 pounds beef short ribs; 2 tablespoons olive oil; 1 large onion, sliced; ½ cup dry red wine; ½ cup chile sauce; 3 tablespoons packed brown sugar; 3 tablespoons vinegar; 1 tablespoon Worcestershire sauce; ½ teaspoon dry mustard; ½ teaspoon chili powder; 2 tablespoons all-purpose flour; ¼ cup water",
  "directions": "1. In a small bowl, combine 2 tablespoons flour, salt, and pepper. Coat the short ribs with the flour mixture. 2. In a large skillet, heat the olive oil over medium-high heat. Brown short ribs in olive oil. 3. In a slow cooker, combine onions, wine, chili sauce, brown sugar, vinegar, Worcestershire sauce, mustard, and chili powder. Mix thoroughly. Transfer the short ribs from the skillet to the slow cooker. 4. Cover, and cook on Low for 6 to 8 hours. 5. Remove ribs, and turn the slow cooker control to High. Mix the remaining 2 tablespoons of flour with 1/4 cup water, and stir into the sauce. Cook for 10 minutes, or until slightly thickened.",
  "prep": "25 mins",
  "cook": "8 hrs 20 mins",
  "total": "8 hrs 45 mins",
  "calories": "589"
}]