[{
  "url": "https://www.allrecipes.com/recipe/19636/filet-with-a-merlot-sauce/",
  "name": "Filet with a Merlot Sauce",
  "rating": "4.5",
  "ratingcount": "89",
  "ingredients": "1 (750 milliliter) bottle Merlot wine; 2 (14.5 ounce) cans low-sodium chicken broth; 1 (14.5 ounce) can beef broth; 2 tablespoons unsalted butter, softened; 1 tablespoon all-purpose flour; 1 tablespoon olive oil; 6 (6 ounce) fillets beef tenderloin; freshly ground black pepper to taste; ¼ cup chopped shallots; 1 tablespoon chopped garlic; 1 teaspoon fresh thyme",
  "directions": "1. In a heavy saucepan over high heat, combine wine, chicken broth, and beef broth. Bring to a boil; reduce heat and simmer until mixture is reduced to 2 cups, about an hour. (This can be prepared a day ahead — cover and refrigerate). 2. In a small bowl, mix butter and flour. Heat 1 tablespoon olive oil in a large skillet over medium heat. Sprinkle steaks with salt and pepper; cook in hot oil until medium-rare, about 4 minutes per side. Transfer steaks to a plate. 3. Stir shallots, garlic, and thyme into the skillet. Add 2 cups reduced wine mixture; bring to a boil, scraping up any browned bits. Whisk in butter mixture until smooth. Boil sauce until thick enough to coat a spoon, about 2 to 3 minutes.",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "398"
},
{
  "url": "https://www.allrecipes.com/recipe/256877/steak-au-poivre/",
  "name": "Steak au Poivre",
  "rating": "5.0",
  "ratingcount": "8",
  "ingredients": "1 tablespoon whole black peppercorns, or more to taste; 2 (6 ounce) (1 1/4-inch-thick) tenderloin steaks; 2 tablespoons butter; 1 tablespoon minced shallot; 2 tablespoons cognac; 2 tablespoons red wine; ¼ cup beef broth; 2 tablespoons heavy whipping cream",
  "directions": "1. Crack peppercorns in a mortar or pestle or with a rolling pin. Press cracked peppercorns into steaks. 2. Heat butter in a heavy skillet over medium-high heat. Add steaks; cook, turning with tongs, until browned, about 2 minutes per side. Reduce heat to medium and cook steaks, turning often, until they begin to firm up and are hot and slightly pink in the center, about 5 minutes per side. Transfer steaks to a plate and cover to keep warm. 3. Stir shallot into the skillet. Pour in cognac and red wine; simmer, stirring constantly, until reduced, about 2 minutes. Pour in beef broth and simmer, scraping browned bits off the bottom of the skillet, until sauce is smooth, about 2 minutes. Stir in cream; cook until heated through, 1 to 2 minutes. 4. Pour cream sauce over steaks.",
  "prep": "10 mins",
  "cook": "19 mins",
  "total": "29 mins",
  "calories": "561"
},
{
  "url": "https://www.allrecipes.com/recipe/256165/boeuf-bourguignon/",
  "name": "Boeuf Bourguignon",
  "rating": "4.3",
  "ratingcount": "24",
  "ingredients": "¼ cup vegetable oil; 5  onions, sliced; 2 pounds lean beef, cut into 1-inch cubes; 1 ½ tablespoons all-purpose flour; ¼ teaspoon dried marjoram; ¼ teaspoon dried thyme; freshly ground black pepper to taste; 1 cup dry red wine, or more as needed; ½ cup beef broth, or more as needed; 1 (8 ounce) package sliced fresh mushrooms",
  "directions": "1. Heat oil in a large, heavy skillet over medium heat. Cook and stir onions in hot oil until tender, about 10 minutes. Transfer to a bowl. 2. Cook and stir beef in the same skillet until browned, 1 to 2 minutes per side. Sprinkle flour, marjoram, thyme, and pepper over beef. Pour red wine and beef broth into the skillet; stir well. Reduce heat to low and simmer until beef is tender, 1 1/2 to 2 hours. Add more wine and broth as needed, in a 2:1 ratio, to keep beef barely submerged throughout the cooking time. 3. Stir onions and mushrooms into the skillet. Cook, stirring occasionally, until mushrooms are tender and sauce is thick and dark brown, about 30 minutes.",
  "prep": "20 mins",
  "cook": "2 hrs 15 mins",
  "total": "2 hrs 35 mins",
  "calories": "350"
},
{
  "url": "https://www.allrecipes.com/recipe/213510/filet-mignon-with-mushroom-cabernet-gravy/",
  "name": "Filet Mignon with Mushroom-Cabernet Gravy",
  "rating": "4.7",
  "ratingcount": "116",
  "ingredients": "1 tablespoon olive oil; 2 (8 ounce) (1 inch thick) filet mignon steaks; ½ teaspoon sea salt; ¼ teaspoon ground black pepper; 1 tablespoon butter; 1 large shallot, chopped; 12 ounces sliced fresh white mushrooms; 1 cup Cabernet Sauvignon or other dry red wine; ½ cup beef broth; 1 ½ teaspoons chopped fresh thyme; 1 teaspoon cornstarch; 2 tablespoons water",
  "directions": "1. Heat olive oil in a large nonstick skillet over medium-high heat. Sprinkle the filets with salt and pepper, gently place them into the hot skillet, and sear until well-browned on each side, about 2 minutes per side. Remove the steaks to a platter, tent with aluminum foil, and keep warm. 2. Turn the heat down to medium, and melt the butter. Cook and stir the shallot and mushrooms in the butter until the mushrooms begin to give off their liquid and the shallots are translucent, about 5 minutes. Stir in the wine, beef broth, and thyme, and simmer the sauce until it begins to reduce, 6 to 10 minutes. Return the steaks to the sauce, and simmer briefly until they start to become firm and are reddish-pink and juicy in the center, about 2 to 4 minutes per side (for medium-rare.) An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove the steaks to serving dishes. 3. In a small bowl, stir the cornstarch and water until it forms a smooth paste. Stir the cornstarch mixture into the pan sauce, and cook and stir until thickened, about 30 seconds. Top each serving with mushroom-wine sauce to serve.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "332"
},
{
  "url": "https://www.allrecipes.com/recipe/246241/the-best-no-mushroom-beef-tips/",
  "name": "The Best No-Mushroom Beef Tips",
  "rating": "4.4",
  "ratingcount": "44",
  "ingredients": "1 tablespoon olive oil; 2 pounds beef tenderloin, trimmed and cut into chunks; 1  green bell pepper, thinly sliced; 1 small onion, thinly sliced; 1 teaspoon steak seasoning; salt and ground black pepper to taste; 8 fluid ounces beef broth; 2 cloves garlic, minced, or more to taste; 5 dashes Worcestershire sauce; 1  bay leaf; 1 (.75 ounce) packet dry brown gravy mix",
  "directions": "1. Heat oil in a Dutch oven over high heat. Add beef, green bell pepper, onion, steak seasoning, salt, and black pepper; cook and stir until beef is browned and almost cooked through, 15 to 20 minutes. Do not drain beef. 2. Reduce heat to medium. Add beef broth, garlic, Worcestershire sauce, and bay leaf to beef mixture; continue cooking until liquid thickens and beef is cooked through, about 15 minutes. 3. Reduce heat to low. Stir in gravy mix. Cook, covered, until gravy is thick and beef is tender, about 10 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "353"
},
{
  "url": "https://www.allrecipes.com/recipe/213505/filet-mignons-with-pepper-cream-sauce/",
  "name": "Filet Mignons With Pepper Cream Sauce",
  "rating": "4.6",
  "ratingcount": "148",
  "ingredients": "¼ cup coarsely crushed black peppercorns; 4 (6 ounce) 1 1/2 inch thick filet mignon steaks; salt to taste; 1 tablespoon butter; 1 teaspoon olive oil; ⅓ cup beef broth; 1 cup heavy cream",
  "directions": "1. Place the peppercorns into a shallow bowl. Sprinkle the beef tenderloin filets with salt on both sides, and coat both sides with crushed peppercorns. 2. Melt the butter with the olive oil over high heat in a heavy skillet (not nonstick) until the foam disappears from the butter. Gently place the steaks in the pan, and cook until they start to become firm and are reddish-pink and juicy in the center, about 3 1/2 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove the steaks to platter, and cover tightly with foil. 3. Pour the beef broth into the skillet, and use a whisk to stir the broth and scrape up any dissolved brown flavor bits from the skillet. Whisk in the cream, and simmer the sauce until it's reduced and thickened, 6 to 7 minutes. Place the steaks back in the skillet, turn to coat with sauce, and serve with the remaining sauce.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "549"
},
{
  "url": "https://www.allrecipes.com/recipe/213506/filet-mignon-with-garlic-shrimp-cream-sauce/",
  "name": "Filet Mignon with Garlic Shrimp Cream Sauce",
  "rating": "4.7",
  "ratingcount": "71",
  "ingredients": "2 (4 ounce) 1 1/2 inch thick filet mignon steaks; 1 tablespoon olive oil; salt to taste; 2 tablespoons butter; 2 tablespoons olive oil; 1 large shallot, minced; 2 tablespoons minced garlic; ¼ cup Chardonnay wine; ½ pound uncooked shrimp - peeled, deveined, and cut into 3 pieces; ¼ cup heavy cream; 1 tablespoon butter; salt and pepper to taste",
  "directions": "1. Heat a heavy steel or cast-iron skillet over medium-high heat. Brush both sides of each filet with 1 tablespoon olive oil, and sprinkle with salt. Gently place the filets into the hot skillet, and cook until they start to become firm and are reddish-pink and juicy in the center, about 3 to 4 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Set the filets aside to rest, covered loosely with foil. 2. Melt 2 tablespoons butter with 2 tablespoons of olive oil in the skillet over medium heat until the foam subsides from the butter. Cook and stir the shallot and garlic until tender, about 2 minutes. Pour in the wine, and cook and stir until the wine reduces by half, about 3 minutes. 3. Stir in the shrimp, cream, 1 tablespoon of butter, and a pinch of salt and pepper to taste. Cook and stir until the sauce is thickened and velvety and the shrimp are pink, about 2 minutes. 4. To serve, place filets on serving plates, and top each with half the shrimp sauce. Sauce will thicken slightly as it cools.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "777"
},
{
  "url": "https://www.allrecipes.com/recipe/100072/lobster-colorado/",
  "name": "Lobster Colorado",
  "rating": "4.8",
  "ratingcount": "147",
  "ingredients": "4 (8 ounce) filet mignon (beef tenderloin); salt and pepper to taste; ½ teaspoon garlic powder; 4 slices bacon; ½ cup butter, divided; 1 teaspoon OLD BAY® Seasoning; 8 ounces lobster tail, cleaned and chopped",
  "directions": "1. Set oven to Broil at 500 degrees F (260 degrees C). 2. Sprinkle tenderloins all over with salt, pepper, and garlic powder. Wrap each filet with bacon, and secure with a toothpick. Place on a broiling pan, and broil to desired doneness, about 8 to 10 minutes per side for medium rare. 3. While tenderloins are cooking, melt 1/4 cup of butter over medium heat with 1/2 teaspoon Old Bay® seasoning. Stir in chopped lobster meat, and cook until done. Spoon lobster meat over cooked tenderloins, and return them to the broiler until the lobster meat begins to brown. 4. While the lobster is in the oven, heat the remaining 1/4 cup of butter in a small saucepan over medium-high heat, cook until it browns, turning the color of a hazelnut. To serve, spoon the browned butter over the steaks, and sprinkle with the remaining Old Bay® seasoning.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "585"
},
{
  "url": "https://www.allrecipes.com/recipe/213468/mouthwatering-crabmeat-pan-seared-filets/",
  "name": "Mouthwatering Crabmeat Pan Seared Filets",
  "rating": "4.3",
  "ratingcount": "8",
  "ingredients": "1 pound fresh lump crabmeat; 3 tablespoons butter, melted and cooled; 2 tablespoons olive oil; 2 (8 ounce) filet mignon steaks; coarse sea salt and coarsely ground black pepper to taste",
  "directions": "1. Preheat an oven to 425 degrees F (220 degrees C). Toss the crabmeat in the melted and cooled butter. Set aside until ready to serve. 2. Pat filets mignons dry and season with salt and pepper. Heat olive oil in large heavy skillet over medium-high heat until hot, but not smoking. Brown filets on both sides, about 3 minutes per side. Transfer filets to an oiled baking pan and roast in the middle of the preheated oven until they start to firm, and are reddish-pink and juicy in the center, about 10 minutes. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Top each filet with the crabmeat and butter mixture.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "761"
},
{
  "url": "https://www.allrecipes.com/recipe/200340/grilled-filet-mignon-with-gorgonzola-cream-sauce/",
  "name": "Grilled Filet Mignon with Gorgonzola Cream Sauce",
  "rating": "4.8",
  "ratingcount": "232",
  "ingredients": "4 cups heavy cream; 3 ounces crumbled Gorgonzola cheese; 3 tablespoons grated Parmesan cheese; ¾ teaspoon salt; ¾ teaspoon ground black pepper; ⅛ teaspoon ground nutmeg; 4 (8 ounce) fillets beef tenderloin; ¼ teaspoon lemon pepper, or to taste; ¼ teaspoon garlic powder, or to taste; ¼ teaspoon onion powder, or to taste; salt and ground black pepper to taste; cooking spray; 12 slices thick sliced bacon, chopped; 4  green onions, chopped",
  "directions": "1. Make sauce: Pour heavy cream into a saucepan and bring to a boil over medium heat. Reduce heat and simmer until cream is reduced by half, stirring occasionally, about 1 hour. Remove from heat; whisk in Gorgonzola cheese, Parmesan cheese, salt, pepper, and nutmeg until cheeses have melted. Cover to keep warm and set aside. 2. Prepare steaks: Season beef with lemon pepper, garlic powder, onion powder, salt, and pepper; set aside to marinate. 3. Meanwhile, place bacon in a large, deep skillet over medium-high heat. Cook, stirring occasionally, until evenly browned, about 10 minutes. Drain bacon on a paper towel-lined plate. 4. Preheat an outdoor grill for medium-high heat. Lightly grease the grate with cooking spray. 5. Cook steaks on the preheated grill until they begin to firm up and are reddish-pink and juicy in the center, 3 to 5 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C) for medium-rare. Transfer steaks to a plate; tent with foil to rest for 5 to 10 minutes. 6. Serve steaks with Gorgonzola sauce and top with bacon and green onion.",
  "prep": "5 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 20 mins",
  "calories": "1456"
},
{
  "url": "https://www.allrecipes.com/recipe/15901/lovers-beef-burgundy-filet/",
  "name": "Lover's Beef Burgundy Filet",
  "rating": "4.6",
  "ratingcount": "178",
  "ingredients": "4 cups Burgundy wine; 2 cups oyster sauce; 1 ½ cups canola oil; 1 ½ cups soy sauce; 1 tablespoon garlic, minced; 1 ½ teaspoons dried oregano; 8 (6 ounce) filet mignon; ½ cup butter, softened; 1 teaspoon Burgundy wine; 1 tablespoon minced shallots; 1 tablespoon minced green onions; 1 teaspoon ground white pepper",
  "directions": "1. Make the marinade: Mix wine, oyster sauce, oil, soy sauce, garlic, and oregano in a medium saucepan. Bring to a boil, then remove from the heat. Place in the refrigerator until chilled, about 1 hour. 2. Marinate the steaks: Place steaks into a 9x13-inch baking dish and pour chilled marinade over top. Cover tightly with foil and marinate in the refrigerator for at least 3 hours, or overnight if possible. 3. Make the butter: Cream butter and wine in a bowl with an electric mixer. Mix in shallots, green onions, and white pepper by hand. Cover tightly and refrigerate until needed. 4. When ready to cook, preheat an outdoor grill for high heat and lightly oil the grate. Preheat the oven to 200 degrees F (95 degrees C). 5. Remove steaks from marinade and shake off excess. Discard remaining marinade. 6. Grill steaks on the preheated grill until they are beginning to firm and are hot and slightly pink in the center, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C) for medium. 7. Remove from the grill and place into a clean 9x13-inch baking dish. Dollop some butter mixture over each steak. 8. Cook in the preheated oven until butter melts, 1 to 2 minutes.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "4 hrs 50 mins",
  "calories": "883"
},
{
  "url": "https://www.allrecipes.com/recipe/213512/boeuf-en-croute/",
  "name": "Boeuf en Croûte",
  "rating": "4.7",
  "ratingcount": "19",
  "ingredients": "1 teaspoon olive oil; 2 (6 ounce) beef tenderloin filets; 1 tablespoon butter; 8 ounces fresh white mushrooms, minced; ⅓ cup minced shallot; 2 cloves garlic, minced; 2 tablespoons red wine; 4  6-inch squares of frozen puff pastry, thawed but still cold; 1 ½ cups red wine; salt and pepper to taste; 1  egg (Optional); 2 tablespoons milk (Optional)",
  "directions": "1. Heat olive oil in a heavy skillet over high heat until very hot. Sear filets until well browned on both sides, 1 to 2 minutes per side. Remove filets from the skillet, and chill in the refrigerator for at least 1 hour. Filets must be cold. 2. In the same skillet over medium heat, melt butter. Cook and stir mushrooms, shallots, and garlic until shallots are tender and translucent and mushrooms have given off their juice, 6 to 8 minutes. Stir in 2 tablespoons of red wine, scraping and dissolving any browned flavor bits from the pan. Transfer mushroom mix into a bowl, and chill in the refrigerator for about 45 minutes. 3. Place 2 pieces of puff pastry on a work surface, and top each with a chilled filet. Spread half mushroom mixture in a neat layer on top of each filet, and top each with a piece of puff pastry. Fold and pinch edges of the pastry together, sealing in the contents, and trim to make a tidy package. Cut a small slit into top of each package. 4. Pour 1 1/2 cups of red wine into a saucepan over medium heat, and simmer until wine is reduced by half, about 15 minutes. Season wine sauce to taste with salt and pepper. Meanwhile, whisk egg into milk in a bowl, and brush pastry packages with egg mixture for a browner crust, if desired. Return bundles to the refrigerator to keep cold. 5. Preheat the oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper. 6. Place puff pastry bundles onto the prepared baking sheet, and bake in the preheated oven until pastry is golden brown and crisp and filets are desired degree of doneness (for medium-rare, about 15 minutes; an instant-read thermometer inserted into center should read 130 degrees F (54 degrees C). Serve each filet in pastry shell with spoonfuls of wine sauce on top.",
  "prep": "35 mins",
  "cook": "20 mins",
  "total": "1 hr 55 mins",
  "calories": "3274"
},
{
  "url": "https://www.allrecipes.com/recipe/30575/blue-cheese-beef-tenderloin/",
  "name": "Blue Cheese Beef Tenderloin",
  "rating": "4.7",
  "ratingcount": "313",
  "ingredients": "1 (3 pound) whole beef tenderloin; ½ cup teriyaki sauce; ½ cup red wine; 2 cloves garlic, chopped; 4 ounces blue cheese, crumbled; ⅔ cup sour cream; ⅓ cup mayonnaise; 1 ½ teaspoons Worcestershire sauce",
  "directions": "1. Place beef tenderloin in a shallow dish. Combine teriyaki sauce, wine, and garlic in a small bowl; pour over tenderloin. Let marinate in the refrigerator for 30 minutes. 2. Preheat the oven to 450 degrees F (230 degrees C). 3. Remove tenderloin from marinade and place on a broiler pan. Discard marinade. 4. Cook in the preheated oven for 15 minutes. Reduce heat to 375 degrees F (190 degrees C) and continue cooking to desired doneness, 30 to 40 more minutes. An instant-read thermometer inserted into the center of tenderloin should read at least 145 degrees F (63 degrees C) for medium doneness. Let tenderloin rest while you make sauce. 5. Make sauce: Combine blue cheese, sour cream, mayonnaise, and Worcestershire sauce in a saucepan over low heat; stir until smooth. 6. Serve sauce over sliced tenderloin.",
  "prep": "30 mins",
  "cook": "55 mins",
  "total": "1 hr 55 mins",
  "calories": "669"
},
{
  "url": "https://www.allrecipes.com/recipe/46815/crab-stuffed-filet-mignon-with-whiskey-peppercorn-sauce/",
  "name": "Crab-Stuffed Filet Mignon with Whiskey Peppercorn Sauce",
  "rating": "4.7",
  "ratingcount": "317",
  "ingredients": "2 tablespoons olive oil; 1 teaspoon minced onion; 1 teaspoon minced green onion; 1 teaspoon minced garlic; 1 teaspoon minced celery; 1 teaspoon minced green bell pepper; 2 tablespoons shrimp stock or water; 1 (6 ounce) can crab meat, drained; 2 tablespoons bread crumbs; 1 teaspoon Cajun seasoning; 1 ¼ cups beef broth; 1 teaspoon cracked black pepper; 1 fluid ounce whiskey; 1 cup heavy cream; 4 (6 ounce) filet mignon steaks; 4 slices bacon, cooked lightly; salt and cracked black pepper to taste; 1 tablespoon olive oil; 1 clove garlic, minced; 1 teaspoon minced shallot; 1 cup crimini mushrooms, sliced; 1 fluid ounce whiskey; 1 teaspoon Dijon mustard",
  "directions": "1. Make Crab Stuffing: Heat 2 tablespoons olive oil in a large skillet. Saute onion, green onion, garlic, celery, and green pepper until tender. Stir in shrimp stock, crab meat, bread crumbs, and Cajun seasoning. Remove from heat, and set aside. 2. Prepare Peppercorn Sauce: In a small saucepan over medium heat, combine beef broth and cracked black pepper. Simmer until reduced to 1 cup, stirring frequently. Add 1 ounce whiskey and cream. Continue simmering until reduced to 1 cup. Remove from heat, and set aside. 3. Prepare Steaks: Slice a pocket into the side of each steak, and stuff generously with crab stuffing. Wrap bacon around the side, and secure with toothpicks. Season to taste with salt and pepper; set aside. Heat olive oil in a large cast iron skillet over medium heat. Saute garlic and shallot for 1 minute. Stir in mushrooms, and saute until tender. Remove mushroom mixture, and set aside. 4. Place steaks in skillet, and cook to desired doneness. Remove from skillet, and keep warm. Deglaze skillet with 1 ounce whiskey. Reduce heat, and stir in peppercorn sauce and Dijon mustard. Add mushroom mixture, and reduce sauce until thickened. Remove toothpicks and bacon from steaks, and arrange steaks on a plate. Top with sauce.",
  "prep": "1 hr",
  "cook": "30 mins",
  "total": "1 hr 30 mins",
  "calories": "748"
},
{
  "url": "https://www.allrecipes.com/recipe/216800/jessicas-steak-oscar/",
  "name": "Jessica's Steak Oscar",
  "rating": "4.6",
  "ratingcount": "25",
  "ingredients": "2 (7 ounce) beef tenderloin steaks; salt and ground black pepper to taste; ¼ cup butter; 1 (6 ounce) can crab, drained; 1 pound asparagus, tough ends snapped; 1 packet dry Bearnaise sauce mix (such as Knorr®); 1 cup whole milk; ½ cup butter",
  "directions": "1. Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Sprinkle the filets with salt and pepper. 2. In a small saucepan over low heat, melt 1/4 cup of butter; gently stir in the crab meat, and simmer while you broil the filets. 3. Broil the filets until they reach the desired stage of doneness; for medium (slightly pink in the center), broil 10 to 12 minutes on the first side and 6 minutes on the second side. Set the filets aside to rest. 4. Place a steamer insert into a skillet, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the asparagus, recover, and steam until just tender, 2 to 6 minutes depending on thickness. 5. Whisk Bearnaise sauce mix with milk in a saucepan. Add 1/2 cup of butter, and bring the sauce to a boil over medium heat, whisking constantly; reduce heat to a simmer, and whisk until sauce has thickened, about 1 minute. 6. To assemble, top each broiled filet with crab meat, then half the asparagus; spoon Bearnaise sauce to taste over the asparagus.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "1289"
},
{
  "url": "https://www.allrecipes.com/recipe/270065/beef-tenderloin-filets/",
  "name": "Beef Tenderloin Filets",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "8  1-inch-thick beef tenderloin steaks; salt and ground black pepper to taste; 3 tablespoons butter; ½ cup dry red wine; ½ cup beef stock; 1 cup heavy whipping cream; 1 cup chopped tomatoes; ½ cup chopped fresh basil",
  "directions": "1. Pat meat dry and season with salt and black pepper to taste. 2. Melt butter in a heavy skillet over medium heat. Add fillets and cook to desired doneness, 4 to 5 minutes for medium. Transfer filets to a serving plate and pour off fat from the skillet. Add wine and bring to a boil to deglaze pan. Stir in stock and cream and boil sauce until thickened, 3 to 5 minutes. Remove from heat. Add tomatoes and basil and blend well. 3. Pour sauce over beef on the serving plate.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "379"
},
{
  "url": "https://www.allrecipes.com/recipe/67432/smothered-filet-mignon/",
  "name": "Smothered Filet Mignon",
  "rating": "4.7",
  "ratingcount": "382",
  "ingredients": "4 (6 ounce) filet mignon steaks; seasoned salt to taste; cracked black pepper to taste; ¼ cup extra virgin olive oil; ¼ cup balsamic vinegar; 1 tablespoon Dijon mustard; 2 teaspoons dried rosemary; 1 tablespoon butter; 2 cups onion slices; 1 teaspoon white sugar; 4 ounces blue cheese, crumbled",
  "directions": "1. Season steaks with seasoned salt and black pepper, and arrange in a single layer in a large baking dish. In a bowl, whisk together olive oil, balsamic vinegar, mustard, and rosemary. Pour mixture over filets, and turn to coat. Marinate for up to 30 minutes. 2. While you are marinating the meat, melt the butter in a skillet over medium heat. Cook onion slices in butter until soft, then stir in sugar. Continue cooking until onions are caramelized. Set aside. 3. Preheat grill for high heat on one side, and medium heat on the other side. 4. Lightly oil the grill grate. Place steaks on the hot side of the grill, and cook for 10 minutes, turning once. When the steaks are almost done, move to the cooler side of the grill. Top each filet with a quarter of the caramelized onions and blue cheese. Close the lid, and continue cooking until the cheese is melted.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "1 hr",
  "calories": "590"
},
{
  "url": "https://www.allrecipes.com/recipe/278230/filet-mignon-for-two/",
  "name": "Filet Mignon for Two",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "2 (6 ounce) filet mignon steaks; 1 teaspoon olive oil; salt and ground black pepper to taste; 1 tablespoon butter; 1  shallot, minced; 1 teaspoon minced garlic; 1 cup heavy cream; 4 ounces crumbled Gorgonzola cheese; salt and ground black pepper to taste",
  "directions": "1. Preheat the oven to 500 degrees F (260 degrees C). Place a large, oven-proof skillet in the oven as it preheats. 2. Bring steaks to room temperature. Rub with olive oil and season generously with salt and pepper. 3. Remove the hot skillet from the oven carefully and place it on a burner set to high heat. Leave the oven on. 4. Place steaks into the dry pan immediately and sear, turning with tongs, 1 to 2 minutes on both sides. 5. Transfer the pan back into the preheated oven and cook until desired doneness is reached, 3 to 5 minutes. For medium doneness, an instant-read thermometer inserted into the centers should read 140 degrees F (60 degrees C). Transfer steaks to a warm platter and tent loosely with foil. Let rest for 5 to 10 minutes; the steaks will continue to cook during this process and the internal temperature will rise 5 to 10 degrees. 6. Meanwhile, heat butter in a medium saucepan over medium heat. Add shallot and garlic and saute until shallot is tender, 5 to 7 minutes. Pour in cream; let cook until reduced by half, about 10 minutes. Turn heat to low and add Gorgonzola cheese. Let cheese melt; season with salt and pepper. Serve sauce with steaks.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "1031"
},
{
  "url": "https://www.allrecipes.com/recipe/213511/filet-mignon-with-bacon-cream-sauce/",
  "name": "Filet Mignon with Bacon Cream Sauce",
  "rating": "4.5",
  "ratingcount": "105",
  "ingredients": "4 (4 ounce) filet mignon (beef tenderloin); 1 teaspoon olive oil; 3 slices bacon, chopped; 1 tablespoon butter; 4  shallots, diced; ¼ cup half-and-half cream; salt and pepper to taste",
  "directions": "1. Preheat an outdoor grill to medium-high heat and lightly oil the grate. 2. Brush filets with olive oil, and cook on the preheated grill to desired doneness (about 4 minutes per side for medium rare). An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Set steaks aside on a platter tented with aluminum foil to rest. 3. While steaks are resting, prepare sauce. Cook and stir the chopped bacon in a small saucepan over medium heat until bacon pieces are crisp, 3 to 5 minutes. Stir in butter and shallots, and cook and stir until shallots are soft and translucent, about 5 minutes more. 4. Stir in half-and-half, bring mixture to a simmer over medium-low heat, and cook, occasionally stirring, until sauce is slightly thickened, about 8 minutes. Season to taste with salt and pepper, and serve over steaks.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "383"
},
{
  "url": "https://www.allrecipes.com/recipe/14515/persian-shish-kabob/",
  "name": "Persian Shish Kabob",
  "rating": "4.6",
  "ratingcount": "38",
  "ingredients": "2 pounds beef tenderloin; 1  onion, chopped; ⅛ cup fresh lime juice; 1 tablespoon salt; 1 pinch ground black pepper",
  "directions": "1. Cut beef into 1x1/2-inch cubes and place in a large bowl. Add onion, lime juice, salt, and black pepper; mix well. Cover the bowl and refrigerate for 8 hours to overnight. 2. Preheat an outdoor grill for high heat and lightly oil the grate. 3. Thread beef on skewers, 6 to 8 pieces per skewer. Discard any excess marinade. 4. Cook beef skewers on the preheated grill for 3 to 4 minutes per side, 12 to 16 minutes in total. An instant-read thermometer inserted into the center of beef should read at least 145 degrees F (63 degrees C).",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "8 hrs 35 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/79437/mini-beef-wellingtons-with-red-wine-sauce/",
  "name": "Mini Beef Wellingtons with Red Wine Sauce",
  "rating": "4.5",
  "ratingcount": "23",
  "ingredients": "2 tablespoons vegetable oil; salt and pepper to taste; 6 (6 ounce) beef tenderloin filets; 1 cup chopped fresh mushrooms; ¼ cup red wine; 1 cup beef consomme; 1 (3 ounce) jar foie gras pate; 1 (17.25 ounce) package frozen puff pastry, thawed; 1  egg, beaten; 3 tablespoons butter; 3 tablespoons all-purpose flour; 2 tablespoons chopped green onion; 1 cup beef consomme; ½ cup red wine; 2 tablespoons butter; 2 tablespoons chopped fresh parsley",
  "directions": "1. Heat the oil in a large skillet over medium-high heat. Season the filets with salt and pepper, then fry on each side until browned to lock in the juices. Remove from the skillet and set aside to cool slightly. 2. Add the mushrooms, wine and beef consomme to the skillet; cook and stir over medium heat until mushrooms are tender. Use a slotted spoon to transfer the mushrooms to a small bowl, reserving the consomme. Mix the pate with the mushrooms, adding a little consomme if needed to achieve a spreadable texture. Divide the mushrooms among the filets and spread on the top. Refrigerate about 30 minutes. 3. Preheat the oven to 400 degrees F (200 degrees C). Lay the puff pastry out on a clean surface and cut out two 5 to 6 inch rounds for each steak. You can roll it out a little thinner if you need more area. Place a steak onto a round, and bring the edges up around the sides. Cover the top with a second piece of dough, overlapping the edges and pressing to seal into a package. Repeat with remaining steaks. Place the Wellingtons onto a baking sheet, and brush the tops with beaten egg. 4. Bake for about 12 minutes, for rare, 16 minutes for medium, or 20 minutes for well done. For best results use a meat thermometer to determine the temperature of the steaks, with 140 degrees F (60 degrees C) being medium doneness. Remove from the oven and allow to rest for about 5 minutes. 5. While the steaks are cooking, make the sauce. Melt the butter in a saucepan over medium heat. Stir in the flour and cook, stirring constantly, until browned. Stir in the green onions, and cook until tender, about 1 minute. Gradually stir in the reserved consomme and the remaining 1 cup of consomme; continue to cook and stir until the sauce thickens. Reduce heat to low and stir in the wine. Continue to simmer until thickened, about 15 minutes. Remove from the heat and stir in butter and parsley. Season with salt and pepper to taste. 6. To serve, cut each Wellington in half and spoon some sauce onto the plate.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "1 hr 15 mins",
  "calories": "1027"
},
{
  "url": "https://www.allrecipes.com/recipe/262073/the-best-classic-beef-stroganoff/",
  "name": "The Best Classic Beef Stroganoff",
  "rating": "4.0",
  "ratingcount": "2",
  "ingredients": "3 tablespoons all-purpose flour; 1 ½ teaspoons salt; ¼ teaspoon ground black pepper; 1 pound beef tenderloin; ¼ cup butter; ½ cup water; ½ cup chopped onion; 1 clove garlic, cut in half; 1 pound mushrooms; 1 (10.75 ounce) can  condensed cream of chicken soup; 1 cup sour cream",
  "directions": "1. Mix flour, salt, and pepper together in a bowl. Pound mixture into the beef. Cut beef into 1/2-inch strips. 2. Melt butter in a saucepan over medium heat. Add beef; cook until browned, about 10 minutes. Remove meat with a slotted spoon, transfer to a covered container, and refrigerate while you make the gravy; do not wash the pan. 3. Stir water, onion, and garlic into the pan. Cook and stir over medium heat until all of the brown bits have been scraped from the bottom of the pan, about 5 minutes. Add mushrooms and cream of mushroom soup. Cook until mushrooms are tender, about 20 minutes. 4. Mix beef and gravy in a pot over medium heat until hot but not boiling, about 5 minutes. Add sour cream and serve.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "447"
},
{
  "url": "https://www.allrecipes.com/recipe/277460/steak-and-mushroom-tortellini-alfredo/",
  "name": "Steak and Mushroom Tortellini Alfredo",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "2 tablespoons olive oil; 1 tablespoon soy sauce; 1 tablespoon Montreal steak seasoning (such as McCormick®); 2 (8 ounce) filet mignon steaks, cut into strips; 1 tablespoon butter; ½ cup quartered fresh cremini mushrooms; 1 (20 ounce) package refrigerated cheese tortellini; 2 tablespoons unsalted butter; 5 fluid ounces heavy cream; 2 cups freshly grated Parmesan cheese; 1 pinch freshly grated nutmeg, or to taste",
  "directions": "1. Whisk together olive oil, soy sauce, and steak seasoning in a small, shallow dish. Add steak strips and marinate for 30 minutes. 2. Heat a heavy cast iron skillet over medium-high heat. Add butter. Cook steak strips in the melted butter, until browned, about 2 minutes per side. Add mushrooms and cook until softened, about 5 minutes. 3. Meanwhile, fill a large pot with lightly salted water and bring to a rolling boil; stir in tortellini and return to a boil. Cook uncovered, stirring occasionally, until the tortellini float to the top and the filling is hot, about 3 minutes. 4. Melt butter for Alfredo sauce in a saucepan over medium heat. Stir with a wooden spoon and add heavy cream. Stir until combined. Add Parmesan cheese to the cream mixture in the saucepan and stir until blended. Season with nutmeg. 5. Drain tortellini, return to the pot, and toss with Alfredo sauce to coat. Serve tortellini topped with steak and mushrooms.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "1 hr 10 mins",
  "calories": "431"
},
{
  "url": "https://www.allrecipes.com/recipe/278229/broiled-filet-mignon/",
  "name": "Broiled Filet Mignon",
  "rating": "3.5",
  "ratingcount": "2",
  "ingredients": "cooking spray; 2 tablespoons packed light brown sugar; 2 tablespoons prepared horseradish; 1 teaspoon grated shallot; ½ teaspoon ground black pepper; 4 (4 ounce) filet mignon steaks",
  "directions": "1. Set an oven rack about 3 inches from the heat source and preheat the oven's broiler. Lightly spray a broiler pan with cooking spray. 2. Combine brown sugar, horseradish, shallot, and pepper in a small bowl. 3. Place steaks on the prepared broiler pan and spread 1/2 of the brown sugar mixture over top. 4. Broil in the preheated oven for 5 minutes. Turn steaks, spread remaining brown sugar mixture over top, and broil to desired degree of doneness, 5 to 9 minutes longer.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "250"
},
{
  "url": "https://www.allrecipes.com/recipe/213507/filet-mignon-and-balsamic-strawberries/",
  "name": "Filet Mignon and Balsamic Strawberries",
  "rating": "4.4",
  "ratingcount": "35",
  "ingredients": "2 cups strawberries, sliced; ¼ cup brown sugar; ¼ cup balsamic vinegar; 1 tablespoon olive oil; 4 (6 ounce) filet mignon (beef tenderloin); salt and pepper to taste; 1 tablespoon chilled butter; freshly ground black pepper to taste",
  "directions": "1. Mix together the strawberries, brown sugar, and balsamic vinegar in a bowl, and allow to sit for 1 to 3 hours, stirring occasionally. 2. Preheat an oven to 400 degrees F (200 degrees C). 3. Heat olive oil in an oven-safe, heavy steel or cast-iron skillet over high heat. Sprinkle the filets with salt and pepper on both sides, gently place in the hot skillet, and sear each side until well-browned, 1 to 2 minutes per side. Slide the skillet into the preheated oven, and cook until they start to become firm and are reddish-pink and juicy in the center, about 10 minutes. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Transfer the steaks to a platter, and tent with foil to rest. 4. Pour steak juices from the skillet into a small saucepan. Strain the strawberries and discard the liquid. Add the strawberries to the steak juices, bring the sauce to a simmer over medium-low heat, and melt the butter into the sauce, tilting the pan several times to gently incorporate the butter into the sauce. Serve each fillet topped with about 1/2 cup of strawberries and a sprinkle of freshly ground black pepper.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "1 hr 25 mins",
  "calories": "438"
},
{
  "url": "https://www.allrecipes.com/recipe/229390/herb-and-garlic-roast-tenderloin-with-creamy-horseradish-sauce/",
  "name": "Herb and Garlic Roast Tenderloin with Creamy Horseradish Sauce",
  "rating": "4.8",
  "ratingcount": "54",
  "ingredients": "4 tablespoons Carapelli Premium 100% Italian Extra Virgin Olive Oil, divided; 4 cloves garlic, minced; 2 tablespoons chopped fresh thyme; 2 tablespoons chopped fresh rosemary; 1 ½ teaspoons coarse sea salt or kosher salt, divided; ½ teaspoon freshly ground black pepper; 1 (2 pound) center-cut beef tenderloin roast; ½ cup sour cream; 3 tablespoons prepared horseradish",
  "directions": "1. Heat oven to 350 degrees F. Combine 2 tablespoons of Carapelli, garlic, thyme, rosemary, 1 teaspoon of the salt and pepper; set aside. 2. Heat 1 tablespoon of oil in a large ovenproof skillet over medium-high heat. Add roast; cook 2 to 3 minutes or until well browned. Turn roast over; turn off heat. Spread garlic and herb mixture evenly over top and sides of roast. 3. For that matter, you could spread this mixture on just about anything. Meat. Bread. Veggies. Bacon. Mmmbacon. 4. Transfer skillet to oven; bake 25 to 30 minutes or until internal temperature reaches 125 degrees F. Transfer roast to a carving board; tent with foil and let stand 10 minutes. (Internal temperature will rise to 130 degrees F for medium-rare). 5. Meanwhile, combine remaining 1 tablespoon oil, sour cream, horseradish and remaining 1/2 teaspoon salt; chill until serving time. 6. Carve roast crosswise into 1/2-inch thick slices; place on warmed serving plates. Serve with sauce. Watch your hard work vanish in minutes as family and friends devour. Then bask in the glow of their approval.",
  "prep": "15 mins",
  "cook": "",
  "total": "55 mins",
  "calories": "321"
},
{
  "url": "https://www.allrecipes.com/recipe/53796/herbed-and-spiced-roasted-beef-tenderloin/",
  "name": "Herbed and Spiced Roasted Beef Tenderloin",
  "rating": "4.6",
  "ratingcount": "67",
  "ingredients": "2 tablespoons fresh rosemary; 2 tablespoons fresh thyme leaves; 2  bay leaves; 4 cloves garlic; 1  large shallot, peeled and quartered; 1 tablespoon grated orange zest; 1 tablespoon coarse salt; 1 teaspoon freshly ground black pepper; ½ teaspoon ground nutmeg; ¼ teaspoon ground cloves; 2 tablespoons olive oil; 2 (2 pound) beef tenderloin roasts, trimmed",
  "directions": "1. In a food processor, combine rosemary, thyme, bay leaves, garlic, shallot, orange zest, salt, pepper, nutmeg, and cloves. Run machine while adding oil; process until smooth. Spread mixture evenly over all sides of tenderloins. Place beef in a large glass baking dish. Cover with foil, and refrigerate for at least 6 hours. 2. Preheat oven to 400 degrees F (200 degrees C). Place tenderloins on a rack in a large roasting pan. 3. Roast beef in preheated oven until meat thermometer registers 140 degrees when inserted into center of beef, about 35 minutes. Remove from oven, and cover loosely with foil; let stand for 10 minutes. Slice beef, and serve.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "6 hrs 55 mins",
  "calories": "683"
},
{
  "url": "https://www.allrecipes.com/recipe/245886/jab-chae-korean-noodles/",
  "name": "Jab Chae (Korean Noodles)",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "3 cups water; ½ pound sweet potato vermicelli noodles; 1 tablespoon vegetable oil, divided, or as needed; 3 ½ ounces beef tenderloin, cut into strips; 1 clove garlic, crushed; salt and ground black pepper to taste; 1  onion, thinly sliced; 1  carrot, cut into matchstick-size pieces; 2  spring onions, cut into 2-inch pieces; 2 tablespoons soy sauce; 2 teaspoons white sugar; ½ teaspoon sesame seeds; ½ teaspoon sesame oil",
  "directions": "1. Bring water to a boil in a pot; add vermicelli noodles. Cook noodles until clear and soft, 10 to 12 minutes. Drain noodles in a colander; let sit for 10 minutes. Rinse noodles with cold water. Cut the noodles 2 to 3 times. 2. Heat 1 teaspoon oil in a skillet over medium-high heat; saute beef, garlic, salt, and pepper until beef is cooked through, 3 to 4 minutes. Transfer beef to a large bowl. 3. Heat 1 teaspoon oil in the same skillet; saute onion, salt, and pepper until slightly tender, 2 to 3 minutes. Add onion to beef. Heat 1 teaspoon oil in the same skillet; saute carrot, salt, and pepper until slightly tender, 2 to 3 minutes. Add carrot to beef mixture. Heat 1 teaspoon oil in the same skillet; saute spring onions, salt, and pepper until slightly tender, about 1 minute. Add spring onions to beef mixture. 4. Mix noodles with beef mixture. 5. Whisk soy sauce, sugar, sesame seeds, and sesame oil together in a bowl; pour over noodle mixture and mix well.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "320"
},
{
  "url": "https://www.allrecipes.com/recipe/14669/beef-pot-pie-i/",
  "name": "Beef Pot Pie I",
  "rating": "4.3",
  "ratingcount": "37",
  "ingredients": "1 (17.5 ounce) package frozen puff pastry, thawed; 4 tablespoons olive oil; 1 cup chopped onion; 1 teaspoon minced garlic; 1 cup raw porcini mushrooms; 1 cup chopped carrots; ½ cup chopped celery; 1  potato, diced; 1 pound beef tenderloin, cubed; 1  bay leaf; 1 teaspoon dried oregano; 1 cup dry Marsala wine; 2 tablespoons chopped fresh parsley; 1  egg white",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. In a large skillet, cook bay leaf, oregano, onions and mushrooms in olive oil until soft. Stir in garlic, carrots, celery, potatoes, and meat. 3. Cook and stir for 10 minutes, or until meat starts to brown. Pour in wine. Bring to a boil, and reduce heat to simmer. Simmer for 35 to 45 minutes. 4. Place in pie dish, sprinkle with parsley, and cover with pastry. Brush with egg whites. 5. Bake at 350 degrees F (175 degrees C) for 45 minutes to 1 hour.",
  "prep": "1 hr",
  "cook": "1 hr",
  "total": "2 hrs",
  "calories": "861"
},
{
  "url": "https://www.allrecipes.com/recipe/183577/sesame-beef-bites/",
  "name": "Sesame Beef Bites",
  "rating": "4.5",
  "ratingcount": "78",
  "ingredients": "2 tablespoons sesame oil; 1 tablespoon rice vinegar; 1  green onion, minced; 1 clove garlic, minced; 2 teaspoons hoisin sauce; ¼ teaspoon chili garlic sauce; 1 pound beef tenderloin, cut into 3/4 inch cubes; ¼ cup teriyaki sauce; ½ teaspoon sesame seeds",
  "directions": "1. Whisk together the sesame oil, vinegar, green onion, garlic, hoisin sauce, and chile garlic sauce in a large glass or ceramic bowl. Add the beef tenderloin cubes and toss to evenly coat. Cover the bowl with plastic wrap and marinate at room temperature for 10 minutes, or in the refrigerator up to 8 hours. 2. Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Line a baking sheet with aluminum foil. 3. Spread the beef cubes onto the prepared baking sheet. Bake in the preheated oven until cooked to your desired degree of doneness, about 8 minutes for medium-well. Transfer to a bowl and toss with teriyaki sauce. Skewer each piece of beef with a toothpick and place onto a serving platter. Sprinkle with sesame seeds to serve.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "35 mins",
  "calories": "167"
},
{
  "url": "https://www.allrecipes.com/recipe/221127/spicy-orange-zest-beef/",
  "name": "Spicy Orange Zest Beef",
  "rating": "4.2",
  "ratingcount": "126",
  "ingredients": "1 pound beef tenderloin, cut into 1/2 inch strips; ¼ cup orange juice; ¼ cup seasoned rice vinegar; 2 tablespoons soy sauce; 1 tablespoon hot chile paste (such as sambal oelek); 1 tablespoon brown sugar, or to taste; 2 cloves garlic, minced; ¼ cup water; 1 teaspoon cornstarch; cooking spray; 2 tablespoons grated orange zest; 1 bunch green onions, sliced - white parts and tops separated; salt and freshly ground black pepper to taste",
  "directions": "1. Combine beef, orange juice, rice vinegar, soy sauce, hot chili paste, brown sugar, and garlic in a large bowl. Cover and refrigerate for 1 to 2 hours. 2. Strain beef in a colander set over a large bowl, allowing beef to drain thoroughly, about 5 minutes. Reserve marinade. 3. Stir water and cornstarch into the bowl of marinade. Whisk until cornstarch is dissolved, set aside. 4. Spray skillet with cooking spray and place over high heat. Cook beef for 1 minute without stirring; cook and stir for an additional minute. 5. Stir in light parts of green onion and orange zest; cook for 30 seconds. 6. Stir in marinade and green onion tops; cook and stir until beef is no longer pink inside and sauce is reduced and thick, about 2 to 3 minutes. 7. Season with salt and black pepper to taste.",
  "prep": "20 mins",
  "cook": "5 mins",
  "total": "2 hrs",
  "calories": "267"
},
{
  "url": "https://www.allrecipes.com/recipe/23954/korean-sushi/",
  "name": "Korean Sushi",
  "rating": "4.2",
  "ratingcount": "19",
  "ingredients": "2 cups uncooked short-grain white rice; 2 cups water; 2 tablespoons cider vinegar; 2 leaves chard; 2  eggs, well beaten; 2 tablespoons soy sauce, divided; 3 tablespoons water; 1  onion, diced; 1 tablespoon vegetable oil; ¾ pound beef tenderloin, minced; 1 (5 ounce) can tuna, drained; 1  carrot, julienned; 1  cucumber, julienned; 6 sheets nori (dry seaweed)",
  "directions": "1. In a medium saucepan bring 2 cups water and cider vinegar to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes, until rice grains are sticky and soft. 2. In a medium saucepan, place chard in enough water to cover. Bring to a boil, and cook until tender. Cut into thin strips. 3. Whisk the eggs with soy sauce and 3 tablespoons water. Pour into a medium skillet over medium heat. Cook until thickened. Remove from heat and cut into strips. 4. Heat the vegetable oil in a medium saucepan over medium high heat. Slowly cook and stir the onion until tender. Mix in the beef and 1 tablespoon soy sauce, and cook until evenly brown. Drain and set aside. 5. Preheat oven to 350 degrees F (175 degrees C). Place the nori sheets on a medium baking sheet, and heat in the preheated oven 1 to 2 minutes, until slightly crisp. 6. Place the nori sheets, one at a time , on a bamboo rolling mat. Line the nori sheets evenly with approximately 3/4 inch (2 cm) depth of rice, taking care not to let the rice cover the edges of the nori. Beginning at one end of the nori sheet, top the rice with a stick of carrot, a line of tuna, chard, egg, a cucumber slice, and a line of beef. Repeat until the food reaches approximately the middle of the nori sheet. Roll the sheets carefully and tightly. Seal with a grain or two of the sticky rice. Slice each roll into approximately 4 pieces and serve.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "492"
},
{
  "url": "https://www.allrecipes.com/recipe/230328/louises-herbed-beef-tenderloin/",
  "name": "Louise's Herbed Beef Tenderloin",
  "rating": "4.8",
  "ratingcount": "10",
  "ingredients": "1 (3 pound) beef tenderloin; 2 teaspoons olive oil; 2 cloves garlic, minced; 2 teaspoons dried basil; 1 ½ teaspoons dried rosemary, crushed; 1 teaspoon sea salt; fresh ground black pepper to taste",
  "directions": "1. Preheat oven to 425 degrees F (220 degrees C). 2. Tie tenderloin at 2-inch intervals with kitchen string. 3. Combine oil and garlic in a bowl; brush over meat. Mix basil, rosemary, sea salt, and black pepper together in a bowl; sprinkle evenly over the meat. 4. Roast beef tenderloin in preheated oven until beginning to firm and is hot and slightly pink in the center, 40 to 50 minutes. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "205"
},
{
  "url": "https://www.allrecipes.com/recipe/214770/chicken-fried-steak-with-cream-pork-sausage-gravy/",
  "name": "Chicken Fried Steak with Cream Pork Sausage Gravy",
  "rating": "4.4",
  "ratingcount": "23",
  "ingredients": "4 cups vegetable oil for frying; 1 cup all-purpose flour; 1 teaspoon salt; 1 teaspoon white pepper; 1 teaspoon garlic powder; 3  eggs; 1 clove garlic, minced; 1 tablespoon chopped fresh parsley; 4 (4 ounce) beef tenderloin fillets, pounded thin; 2 links pork sausage; 3 tablespoons butter; 3 tablespoons all-purpose flour; 2 ½ cups heavy cream; salt and black pepper to taste",
  "directions": "1. Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). 2. In a bowl, stir together 1 cup flour, 1 teaspoon salt, white pepper, and garlic powder. In a separate bowl, beat eggs with garlic and parsley. Dredge each tenderloin fillet in seasoned flour, dip in egg mixture, and dip back into flour mixture. Shake off any excess flour. 3. Gently place the steaks into the hot oil, 2 at a time, and cook until golden brown on both sides, about 3 minutes per side. Drain on paper towels. 4. Place the sausages in a small skillet over medium heat, and fry them until very dark brown on all sides, about 10 minutes. Finely chop the sausages, and set aside. In the same skillet, melt butter, and stir in 3 tablespoons of flour. Cook the butter-flour mixture until it turns a pale beige color, about 1 minute, then stir in the sausage, cream, salt, and black pepper. Bring the mixture to a simmer, and cook until thickened, about 5 minutes. Serve sauce over the fried steaks.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "1202"
},
{
  "url": "https://www.allrecipes.com/recipe/107086/grilled-beef-tenderloin-with-herb-garlic-pepper-coating/",
  "name": "Grilled Beef Tenderloin with Herb-Garlic-Pepper Coating",
  "rating": "4.9",
  "ratingcount": "195",
  "ingredients": "1 (5 pound) whole beef tenderloin; 8 large garlic cloves, minced; 6 tablespoons olive oil; 2 tablespoons minced fresh rosemary; 2 tablespoons coarsely ground black pepper; 1 tablespoon dried thyme leaves; 1 tablespoon salt",
  "directions": "1. Use a sharp knife or scissors to remove silverskin and trim excess fat from tenderloin. Fold the thinner end under to approximate the thickness of the rest of the roast and tie with butcher's twine to secure. Tie tenderloin in 1 1/2- to 2-inch intervals to help it keep its shape during cooking. 2. Mix together garlic, oil, rosemary, pepper, thyme, and salt in a small bowl; rub over tenderloin to coat. Let sit while you preheat the grill. 3. Light a charcoal fire in one half of a charcoal grill or preheat a gas grill to high for 10 minutes and lightly oil the grate. 4. Place tenderloin on the hot grill and close the lid. Grill until well-seared, about 5 minutes. Flip and repeat on the other side. 5. Move tenderloin to the cool side of the charcoal grill, or if using a gas grill, turn off the burner directly underneath the tenderloin and turn the remaining one or two burners (depending on grill style) to medium. Cook until rosy pink and a meat thermometer inserted in the thickest section registers 130 degrees F (54 degrees C), 45 to 60 minutes. Cook time will depend on tenderloin size and grill. 6. Let tenderloin rest 15 minutes before carving.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 25 mins",
  "calories": "509"
},
{
  "url": "https://www.allrecipes.com/recipe/233259/surf-and-turf-for-two/",
  "name": "Surf and Turf for Two",
  "rating": "4.9",
  "ratingcount": "38",
  "ingredients": "1 tablespoon olive oil; 1 tablespoon butter, melted; 1 tablespoon finely minced onion; 1 tablespoon white wine; 1 teaspoon Worcestershire sauce; 1 teaspoon lemon juice; 1 teaspoon dried parsley; 1 teaspoon seafood seasoning (such as Old Bay®); 1 clove garlic, minced; ⅛ teaspoon freshly ground black pepper; 12  medium shrimp, peeled and deveined; 2 (4 ounce) filet mignon steaks; 2 teaspoons olive oil; 1 teaspoon steak seasoning",
  "directions": "1. Whisk 1 tablespoon olive oil, butter, onion, wine, Worcestershire sauce, lemon juice, parsley, seafood seasoning, garlic, and pepper together in a bowl; add shrimp. Toss to coat evenly. Cover the bowl with plastic wrap and refrigerate for flavors to blend, at least 15 minutes. 2. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 3. Coat steaks with 2 teaspoons olive oil; sprinkle with steak seasoning. 4. Cook steaks on the preheated grill until they are beginning to firm and are hot and slightly pink in the center for medium doneness, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Transfer steaks to a platter and loosely tent with a piece of aluminum foil. 5. Remove shrimp from marinade and grill until they are bright pink on the outside and the meat is opaque, 2 to 3 minutes per side.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "444"
},
{
  "url": "https://www.allrecipes.com/recipe/16119/beef-pepper-steak/",
  "name": "Beef Pepper Steak",
  "rating": "4.6",
  "ratingcount": "50",
  "ingredients": "12  black peppercorns, coarsely ground; 2 tablespoons tamari; 1 clove garlic, minced; 1 pinch white sugar; 1 pinch salt; 10 ounces beef filet; 2 tablespoons butter",
  "directions": "1. In a small, nonporous bowl, combine the peppercorns, tamari, garlic, sugar and salt. Add the beef filet and coat well on all sides. Cover and marinate in the refrigerator for 1 hour. 2. Melt butter in a medium saucepan over medium high heat. Place the beef filet in the pan and saute for 6 to 8 minutes per side, or until internal temperature reaches at least 145 degrees F (65 degrees C).",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr 30 mins",
  "calories": "533"
},
{
  "url": "https://www.allrecipes.com/recipe/132351/fabulous-beef-tenderloin/",
  "name": "Fabulous Beef Tenderloin",
  "rating": "4.7",
  "ratingcount": "758",
  "ingredients": "1 (3 pound) beef tenderloin roast; ¾ cup soy sauce; ½ cup melted butter",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Place roast into a shallow, glass baking dish. Pour soy sauce and melted butter over the tenderloin. 3. Bake in preheated oven for 10 minutes, then turn roast over and continue cooking, basting occasionally until the internal temperature of the roast reaches 140 degrees F (60 degrees C) for medium, 35 to 40 minutes (or cook to desired degree of doneness). 4. Let meat rest for 10 to 15 minutes before slicing.",
  "prep": "5 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "591"
},
{
  "url": "https://www.allrecipes.com/recipe/184197/new-mexico-green-chile-stew/",
  "name": "New Mexico Green Chile Stew",
  "rating": "4.5",
  "ratingcount": "35",
  "ingredients": "1 pound beef tenderloin, cubed; 1 pound boneless pork loin, cubed; ¼ cup masa harina; 1 tablespoon olive oil; 1  red onion, chopped; 3 cups chopped fresh tomatoes; 2 cups diced green chile peppers; 2 cups low-sodium beef broth; 1 tablespoon ground cumin; 1 large potato, cubed; 3 cloves garlic, minced; 2 teaspoons chopped fresh oregano; 2 teaspoons chopped fresh cilantro; 1 dash cayenne pepper (Optional); salt to taste; ground white pepper to taste",
  "directions": "1. Place the beef tenderloin cubes, pork loin cubes, and masa harina in a plastic bag, and shake to coat the meat. Heat the olive oil in a large skillet over medium-high heat, and cook and stir the meat cubes until evenly browned, about 10 minutes. 2. Place the meat, red onion, tomatoes, green chile peppers, beef broth, cumin, potato, garlic, oregano, cilantro, cayenne pepper, salt and white pepper in a slow cooker. Cook on Low until the meat is tender, about 8 hours.",
  "prep": "30 mins",
  "cook": "8 hrs 15 mins",
  "total": "8 hrs 45 mins",
  "calories": "295"
},
{
  "url": "https://www.allrecipes.com/recipe/221962/roast-beef-tenderloin/",
  "name": "Roast Beef Tenderloin",
  "rating": "4.9",
  "ratingcount": "161",
  "ingredients": "⅓ cup dried porcini mushrooms; 1 cup warm water; 2 ½ pounds trimmed beef tenderloin roast, tied; salt and ground black pepper to taste; 1 tablespoon vegetable oil; 1 tablespoon unsalted butter; ½ cup sliced shallots; 1 pinch salt; ¼ cup tarragon vinegar; 1 cup veal stock; ¼ cup heavy cream; 1 tablespoon unsalted butter; 1 tablespoon chopped fresh tarragon; salt and ground black pepper to taste",
  "directions": "1. Combine porcini mushrooms and water in a bowl; soak until soft, 1 hour. Drain and reserve liquid. Dice and set mushrooms and reserved liquid aside. 2. Preheat oven to 325 degrees F (165 degrees C). 3. Season beef generously with salt and pepper. Heat vegetable oil in a large ovenproof skillet over high heat. Place beef in the skillet; cook until brown on all sides, 5 to 8 minutes per side. 4. Reduce heat to medium and stir in 1 tablespoon butter, shallots, and a pinch of salt; cook until shallots are soft and translucent, 5 to 7 minutes. 5. Pour tarragon vinegar into the skillet and bring to a boil while scraping any browned bits off of the bottom. Stir until liquid is reduced by half, 2 to 4 minutes. 6. Pour in veal stock, cream, 1/2 cup reserved mushroom liquid, mushrooms, salt, and pepper; stir to combine. Return beef to the skillet. 7. Roast in the preheated oven until meat is medium rare, about 45 minutes. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Transfer meat to a plate and loosely tent with foil. Set skillet over high heat and bring pan juices to a boil. 8. Stir in 1 tablespoon butter and tarragon; season with salt and pepper to taste. Return tenderloin and any accumulated juices to skillet and serve.",
  "prep": "15 mins",
  "cook": "1 hr 5 mins",
  "total": "2 hrs 20 mins",
  "calories": "489"
},
{
  "url": "https://www.allrecipes.com/recipe/16899/beef-wellington/",
  "name": "Beef Wellington",
  "rating": "4.5",
  "ratingcount": "381",
  "ingredients": "2 ½ pounds beef tenderloin; 4 tablespoons butter, softened, divided; 2 tablespoons butter; 1  onion, chopped; ½ cup sliced fresh mushrooms; 2 ounces liver pate; salt and pepper to taste; 1 (17.5 ounce) package frozen puff pastry, thawed; 1 large egg yolk, beaten; 1 (10.5 ounce) can beef broth; 2 tablespoons red wine",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Place beef tenderloin in a small baking dish. Spread 2 tablespoons softened butter over beef. 3. Bake in the preheated oven until browned, 10 to 15 minutes. Remove beef from the pan and reserve pan juices; allow beef to cool completely. 4. Increase oven temperature to 450 degrees F (230 degrees C). 5. Melt 2 tablespoons butter in a skillet over medium heat. Sauté onion and mushrooms in butter for 5 minutes. Remove from heat and let cool. 6. Mix together paté and remaining 2 tablespoons softened butter in a bowl; season with salt and pepper. Spread paté mixture over beef. Top with onion and mushroom mixture. 7. Roll out puff pastry dough to about 1/4-inch thickness and place beef in the center. 8. Fold up and seal all the edges, making sure the seams are not too thick. Place beef in a 9x13-inch baking dish, cut a few slits in the top of dough, and brush with egg yolk. 9. Bake in the preheated oven for 10 minutes. Reduce heat to 425 degrees F (220 degrees C) and continue baking until pastry is a rich, golden brown, 10 to 15 minutes. Set aside to rest. 10. Meanwhile, place reserved pan juices in a small saucepan over high heat. Stir in beef broth and red wine; boil until slightly reduced, about 5 minutes. Strain and serve with beef. 11. Serve hot and enjoy!",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "744"
},
{
  "url": "https://www.allrecipes.com/recipe/30578/filet-mignon-with-rich-balsamic-glaze/",
  "name": "Filet Mignon with Rich Balsamic Glaze",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "2 (4 ounce) filet mignon steaks; ½ teaspoon ground black pepper, or to taste; salt to taste; ¼ cup balsamic vinegar; ¼ cup dry red wine",
  "directions": "1. Gather ingredients. 2. Sprinkle both sides of steaks with pepper and salt. 3. Heat a nonstick skillet over medium-high heat. Sear steaks in the hot pan until browned, about 1 minute per side. 4. Reduce heat to medium-low, and pour in balsamic vinegar and red wine. Cover and cook for 4 minutes. Flip steaks and baste with sauce; cover and cook for 4 minutes longer. 5. Remove steaks to two warmed plates. Spoon a tablespoon of glaze over each steak and serve immediately.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "367"
},
{
  "url": "https://www.allrecipes.com/recipe/15336/individual-beef-wellingtons/",
  "name": "Individual Beef Wellingtons",
  "rating": "4.6",
  "ratingcount": "196",
  "ingredients": "1 pound fresh mushrooms, sliced; ½ cup dry sherry; ½ cup chopped onion; ¼ cup butter; ¼ cup chopped parsley; 6 (8 ounce) fillets beef tenderloin; 1 (17.5 ounce) package frozen puff pastry, partially thawed",
  "directions": "1. Combine mushrooms, sherry, onion, butter, and parsley in a large skillet over medium heat; cook and stir until all the liquid is absorbed and mushrooms are well browned, about 15 to 20 minutes. Allow to cool, then cover the top of each piece of tenderloin with mushroom mixture. 2. Cut each partially thawed puff pastry sheet into 3 rectangles, for a total of 6 pieces of puff pastry. Roll out each puff pastry rectangle to about 1/4-inch thickness and place beef in the center; fold up and seal all the edges, making sure the seams are not too thick. Place on a baking sheet, cover with plastic wrap, and store in the refrigerator until 35 minutes before serving time. 3. Preheat the oven to 425 degrees F (220 degrees C). 4. Bake beef Wellingtons in the preheated oven for 25 minutes. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C) for medium rare. Let rest for 5 minutes before serving.",
  "prep": "20 mins",
  "cook": "50 mins",
  "total": "1 hr 15 mins",
  "calories": "946"
},
{
  "url": "https://www.allrecipes.com/recipe/229447/chef-johns-steak-pizzaiola/",
  "name": "Chef John's Steak Pizzaiola",
  "rating": "4.9",
  "ratingcount": "36",
  "ingredients": "1 pound beef tenderloin steaks, cut into 4 medallions; salt and pepper to taste; 1 tablespoon olive oil; 1 cup sliced fresh mushrooms; 2 teaspoons butter; 1 pinch salt; 1 cup sliced sweet and hot peppers; 4 cloves garlic, crushed; ½ cup white wine; ¼ teaspoon dried oregano; 1 cup tomato concasse (see footnote for recipe link); 2 tablespoons chopped fresh oregano; 1 teaspoon balsamic vinegar; 1 pinch red pepper flakes; 1 pinch salt and ground black pepper to taste",
  "directions": "1. Season steak medallions with salt and black pepper on both sides. 2. Heat olive oil in a large skillet over high heat. Add steaks and cook until browned, about 2 minutes per side. Transfer to a plate. Reserve oil in skillet. 3. Place mushrooms and butter into the skillet and season with salt; cook and stir until mushrooms are softened and beginning to brown, 5 to 6 minutes. Reduce heat to medium; add peppers and cook and stir until softened, about 2 minutes. Stir in garlic and cook for 1 minute. Pour in wine and sprinkle in dried oregano. Increase heat to medium-high and cook until the wine is nearly evaporated, about 3 minutes. 4. Stir tomato concassé into the mushroom mixture and simmer until tomato is softened, 3 to 4 minutes. Add fresh oregano, balsamic vinegar, and red pepper flakes; stir to combine. Adjust salt and black pepper to taste. 5. Place steaks back into the skillet with the mushroom mixture and cook until warmed through and cooked to desired doneness, 4 to 10 minutes.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "319"
},
{
  "url": "https://www.allrecipes.com/recipe/60315/original-steak-tartare/",
  "name": "Original Steak Tartare",
  "rating": "4.6",
  "ratingcount": "15",
  "ingredients": "1 pound finely ground beef tenderloin; 1 teaspoon brown mustard; ½ teaspoon hot pepper sauce (e.g. Tabasco™), or to taste; 1 teaspoon Worcestershire sauce; 1 teaspoon brandy; 1 pinch salt, or to taste; ground white pepper to taste; 1  egg",
  "directions": "1. In a medium bowl, mix together the beef, mustard, hot pepper sauce, Worcestershire sauce, brandy, salt, pepper and egg until well blended. Arrange the meat in a neat pile on a glass dish, and cover with aluminum foil. Refrigerate for 30 minutes to allow the flavors to blend. Serve as a spread on crackers or toast.",
  "prep": "10 mins",
  "cook": "",
  "total": "40 mins",
  "calories": "231"
},
{
  "url": "https://www.allrecipes.com/recipe/221898/beef-medallions-with-caramelized-pan-sauce/",
  "name": "Beef Medallions with Caramelized Pan Sauce",
  "rating": "4.7",
  "ratingcount": "69",
  "ingredients": "2 pounds beef tenderloin, trimmed, cut into 8 (4-ounce) medallions; salt and freshly ground black pepper to taste; 1 tablespoon vegetable oil; 8  sliced fresh mushrooms; 1 tablespoon unsalted butter; 1 tablespoon olive oil; 1 pinch salt; ½ cup tomato sauce; ⅓ cup Marsala wine; 1 cup chicken broth; 2 teaspoons chopped fresh oregano; 1 ½ tablespoons chilled unsalted butter, cut into cubes",
  "directions": "1. Season beef medallions with salt and pepper to taste and set aside. 2. Heat vegetable oil in a skillet over high heat. Cook beef until browned, about 2 minutes per side. Remove beef to a warm plate. 3. Reduce heat to medium; cook and stir mushrooms, 1 tablespoon unsalted butter, olive oil, and a pinch of salt in the skillet until mushrooms are very well browned, about 10 minutes. 4. Mix in tomato sauce; cook and stir until tomato sauce thickens, about 5 minutes. 5. Pour in Marsala wine and increase heat to high. Cook, scraping browned bits from bottom of skillet. Once most of the wine has evaporated, stir in broth and bring to a boil; cook and stir until broth mixture has reduced by half, about 5 minutes. 6. Reduce heat to low and return beef to broth mixture; simmer until beef is cooked to medium-rare, about 2 to 3 minutes. Transfer beef to serving plates. 7. Remove skillet from heat. Cook and stir 1 1/2 tablespoons butter and oregano into the sauce until butter melts. Taste for seasoning and adjust if necessary. 8. Spoon sauce over beef and serve immediately.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "35 mins",
  "calories": "567"
},
{
  "url": "https://www.allrecipes.com/recipe/72267/blue-cheese-crusted-filet-mignon-with-port-wine-sauce/",
  "name": "Blue Cheese Crusted Filet Mignon with Port Wine Sauce",
  "rating": "4.7",
  "ratingcount": "506",
  "ingredients": "1 tablespoon butter; ½ cup minced white onion; 3 cloves garlic, minced; 1 tablespoon chopped fresh thyme; ¾ cup low-sodium beef broth; ½ cup port wine; 1 tablespoon vegetable oil; 4  filet mignon steaks (1 1/2 inch thick); ¾ cup crumbled blue cheese; ¼ cup panko bread crumbs",
  "directions": "1. Melt butter in a skillet over medium heat. Add the onion, garlic and thyme. Cook, stirring constantly, until onion is tender. Stir in the beef broth, scraping any onion bits from the bottom of the pan, then stir in the port wine. Bring to a boil, and cook until the mixture has reduced to about 1/2 cup. Set aside. This may also be made ahead of time, and reheated. 2. Preheat the oven to 350 degrees F (175 degrees C). Heat oil in a cast-iron or other oven-safe skillet over high heat. Sear steaks quickly on both sides until brown, then place the whole pan into the oven. 3. Roast steaks in the oven for about 15 minutes for medium rare - with an internal temperature of 145 degrees F (63 degrees C). You may adjust this time to allow the steaks to finish just below your desired degree of doneness if medium is not what you prefer. Remove from the oven, and place on a baking sheet. Stir together the panko crumbs and blue cheese. Top each steak with a layer of this mixture. 4. Preheat the oven's broiler. Place steaks under the preheated broiler until the cheese topping is browned and bubbly. 3 to 4 minutes. Remove from the oven, and let stand for at least 15 minutes before serving. Serve with warm port wine sauce.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "402"
},
{
  "url": "https://www.allrecipes.com/recipe/230335/5-hour-beef-stew/",
  "name": "5 Hour Beef Stew",
  "rating": "4.8",
  "ratingcount": "12",
  "ingredients": "2 pounds beef tenderloin steaks, diced; 8  potatoes, peeled and diced; 4 (12 ounce) cans tomato-vegetable juice cocktail (such as V8®); 3 cups diced carrots; 1 cup diced celery; 1  onion, diced; 3 tablespoons tapioca; 1 tablespoon white sugar; salt and ground black pepper to taste",
  "directions": "1. Preheat oven to 250 degrees F (120 degrees C). 2. Stir beef, potatoes, tomato-vegetable juice cocktail, carrots, celery, onion, tapioca, sugar, salt, and pepper together in a roasting pan; cover. 3. Bake in preheated oven until beef and potatoes are tender, about 5 hours.",
  "prep": "20 mins",
  "cook": "5 hrs",
  "total": "5 hrs 20 mins",
  "calories": "399"
},
{
  "url": "https://www.allrecipes.com/recipe/40286/beefs-portuguese-style/",
  "name": "Beefs Portuguese Style",
  "rating": "4.2",
  "ratingcount": "48",
  "ingredients": "¾ cup red wine; ¼ cup water; 10 cloves garlic, chopped; 1 tablespoon chile paste; ½ teaspoon white pepper; ½ teaspoon salt; 6 (4 ounce) beef tenderloin steaks; ⅓ cup vegetable oil",
  "directions": "1. In a medium bowl, combine red wine, water, garlic, chile paste, white pepper and salt. Add beef, and turn to coat evenly. 2. In a large heavy skillet over medium heat, fry 3 steaks for 2 minutes on each side; Set steaks aside, and drain liquids into the red wine mixture. Repeat with remaining beef. 3. Pour oil into skillet, and reduce heat to medium-low. Fry steaks for a second time, 2 minutes on each side. Drain oil, and return all steaks and marinade to the pan. Allow to boil for 2 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "467"
},
{
  "url": "https://www.allrecipes.com/recipe/14568/easy-barbeque-beef-tenderloin-steak/",
  "name": "Easy Barbeque Beef Tenderloin Steak",
  "rating": "4.6",
  "ratingcount": "15",
  "ingredients": "2 (2 inch thick) steaks beef tenderloin; 1 tablespoon olive oil; 2 cloves crushed garlic; 1 teaspoon meat tenderizer",
  "directions": "1. Rub meat with olive oil and crushed garlic. Sprinkle with tenderizer. Cover, and refrigerate for 30 minutes. 2. Preheat grill for medium high heat. 3. Brush grate with oil, and place steaks on the grill. Cook for 5 to 7 minutes per side, or until done.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "771"
},
{
  "url": "https://www.allrecipes.com/recipe/280268/air-fryer-beef-tenderloin/",
  "name": "Air Fryer Beef Tenderloin",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "2 pounds beef tenderloin, at room temperature; 1 tablespoon vegetable oil; 1 teaspoon dried oregano; 1 teaspoon salt; ½ teaspoon cracked black pepper",
  "directions": "1. Preheat the air fryer to 400 degrees F (200 degrees C). 2. Pat dry tenderloin with paper towels and place on a plate. Drizzle oil all over meat, then sprinkle with oregano, salt, and pepper. Rub spices and oil into meat. Place into the preheated air fryer basket, folding as needed to make it fit. Close the lid. 3. Reduce heat to 390 degrees F (198 degrees C) and cook for 22 minutes. Reduce heat to 360 degrees F (182 degrees C) and cook for 10 more minutes. An instant-read thermometer inserted into the center of tenderloin should read 135 degrees F (57 degrees C) for medium doneness. 4. Remove tenderloin to a platter. Allow to rest, uncovered, for at least 10 minutes before serving.",
  "prep": "5 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "235"
},
{
  "url": "https://www.allrecipes.com/recipe/247365/chef-johns-steak-diane/",
  "name": "Chef John's Steak Diane",
  "rating": "4.7",
  "ratingcount": "90",
  "ingredients": "½ cup demi-glace; 1 tablespoon Dijon mustard; 2 teaspoons Worcestershire sauce; 1 teaspoon tomato paste; 1 pinch cayenne pepper; 2 teaspoons vegetable oil; 2 (8 ounce) beef tenderloin steaks, fully trimmed, pounded to 1/2 inch thick; Kosher salt and freshly ground black pepper, to taste; 1 tablespoon unsalted butter, cut into small chunks; 3 tablespoons shallot, minced; ¼ cup Cognac or brandy; ¼ cup heavy cream; 2 teaspoons sliced fresh chives",
  "directions": "1. Season steaks generously on both sides with salt. Allow steaks to come to room temperature while you make the sauce. 2. Stir together demi-glace (see Cook's Note), mustard, Worcestershire sauce, tomato paste, and cayenne pepper in a bowl. 3. Heat oil in a skillet over very high heat, swirling carefully to evenly cover surface. When oil reaches a smoking point, transfer steaks to oil; add a few chunks of butter. Sear meat on high heat until brown on each side, 2 to 3 minutes per side; keep them on the rare side. An instant-read thermometer inserted into the center should read 125 degrees F (52 degrees C). Transfer steaks to a warm plate. 4. Stir shallots into skillet; cook until softened, 2 to 3 minutes. Remove skillet from heat; pour in Cognac. Carefully ignite with a fireplace lighter. When alcohol burns off and flames go out, return skillet to high heat and bring to a boil; cook, stirring, a few minutes to reduce slightly. Add demi-glace mixture, cream, and any accumulated juices from the steak. Cook on high heat just until sauce starts to thicken, 3 to 5 minutes. Transfer steaks back to pan and reduce heat to low. Gently simmer until meat is heated through and cooked to your desired level of doneness. 5. Transfer to hot plates and serve with a generous spoonful or two of sauce. Sprinkle with chives.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "1050"
},
{
  "url": "https://www.allrecipes.com/recipe/282602/chef-johns-individual-beef-wellingtons/",
  "name": "Chef John's Individual Beef Wellingtons",
  "rating": "4.8",
  "ratingcount": "33",
  "ingredients": "3 tablespoons unsalted butter; 10 large brown mushrooms, finely chopped; ¼ teaspoon salt; 2 tablespoons minced shallots; freshly ground black pepper to taste; 1 pinch cayenne pepper, or to taste; 3 tablespoons white wine; 2 ounces pate; 4 (8 ounce) filet mignon steaks; salt and freshly ground black pepper to taste; 2 tablespoons salted butter; 1 (17.25 ounce) package frozen puff pastry; 2 tablespoons Dijon mustard; 1 large egg, beaten; 1 teaspoon water",
  "directions": "1. Melt butter over medium-high heat. Add mushrooms and salt; cook and stir until well browned and caramelized, about 5 minutes. They will be wet and soggy at first but will dry out. 2. Add shallots and cook until they soften up and turn translucent, about 3 minutes. Add black pepper, cayenne, and white wine. Stir until wine evaporates, about 1 minute. Turn off the heat and transfer to a bowl to cool to room temperature. 3. Add pate to cooled mushroom mixture; toss and mash with a spoon until thoroughly combined. Set aside. 4. Generously season filets with salt and pepper. Melt butter for Wellingtons in the same pan over high heat. Sear, one at a time, in the hot pan until the sides and edges are nicely browned, about 5 minutes per filet. Transfer to a plate and place in the refrigerator until needed. 5. Cut each sheet of pastry into 4 squares. Place one square frozen puff pastry onto a lightly floured surface. Spoon about 3 tablespoons pate mixture into the center and press out to roughly the same size as a filet. Spread 1/2 tablespoon mustard on top of one filet and place mustard-side down on the pate. 6. Gently stretch and fold the shorter sides of the pastry around the filet, then bring the longer sides up and over to seal. You can stretch the dough that will be on the bottom of the filet, but try not to stretch it on the sides and top. It's okay to have a couple of small holes at the bottom. Flip Wellington over and place seam-side down on a plate. Repeat to form remaining 3 Wellingtons, then transfer all to the refrigerator. 7. Preheat the oven to 425 degrees F (220 degrees C). Line a sheet pan with parchment paper. 8. Cut remaining 4 squares of puff pastry into circles that are roughly the size of the Wellingtons. Place on the prepared sheet pan and poke all over each circle with a fork. 9. Bake in the center of the preheated oven for 15 minutes. Remove from the oven, flip, and press circles down with a spatula to flatten. Return to the oven and bake until cooked through and crispy, 5 to 10 minutes longer. Remove from the oven and lift off the sheet pan to cool. Increase the oven temperature to 450 degrees F (230 degrees C). 10. Transfer Wellingtons to the freezer for exactly 15 minutes. Line the same sheet pan with aluminum foil, then top with parchment paper. Beat egg with water in a small bowl. 11. When Wellingtons have been in the freezer for 15 minutes, transfer to the prepared pan and generously brush with egg wash. 12. Bake pastry in the center of the preheated oven until pastry is golden brown and puffed and filets are cooked through, 23 to 25 minutes. An instant-read thermometer inserted into the center should read 122 degrees F (50 degrees C). 13. Immediately remove from the hot pan and transfer onto a plate or cutting board for at least 5 minutes. Cut Wellingtons in half, then trim each end to create a flat surface. 14. Place each rounded pastry base on a plate and stand 2 filet halves on top with center cut facing up.",
  "prep": "45 mins",
  "cook": "1 hr 15 mins",
  "total": "2 hrs 20 mins",
  "calories": "1330"
},
{
  "url": "https://www.allrecipes.com/recipe/236174/japchae/",
  "name": "Japchae",
  "rating": "4.6",
  "ratingcount": "25",
  "ingredients": "3 tablespoons soy sauce; 2 ½ tablespoons white sugar; 2 tablespoons sesame oil; 2 teaspoons minced garlic; 8 ounces sweet potato noodles; 4 ounces lean beef, cut into 2-inch long strips; 6 ounces fresh spinach; salt and ground black pepper to taste; 1 tablespoon vegetable oil, divided; 1 small sweet onion, thinly sliced; 4  mushrooms, stemmed and sliced; 1 small carrot, cut into matchsticks",
  "directions": "1. Whisk soy sauce, sugar, sesame oil, and garlic in a bowl until sugar is dissolved into sauce. 2. Bring a large pot of lightly salted water to a boil. Cook sweet potato noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, 6 to 7 minutes. Rinse noodles under cold water and drain. Transfer noodles to a bowl, add 2 tablespoons sauce, and toss to coat. 3. Squeeze beef under running water until juices run clear. Mix beef and 1 tablespoon sauce together in a bowl. 4. Bring a pot of water to a boil. Cook spinach in the boiling water until just wilted, about 1 minute. Drain quickly and transfer spinach to a bowl of cold water to stop the cooking process. Squeeze excess water from spinach, place spinach in a large bowl, and season with salt and pepper. 5. Heat 1 teaspoon oil in a large skillet over medium-high heat; cook onion until fragrant but crisp, 1 to 2 minutes. Transfer onion to the bowl with spinach. Heat another 1 teaspoon oil in the same skillet. Cook mushrooms in the hot oil until lightly browned but still firm, 1 to 2 minutes; add to onion mixture. Heat remaining 1 teaspoon oil in the same skillet. Cook carrot in the hot oil until lightly browned but still crisp, 1 to 2 minutes; add to onion mixture. 6. Cook and stir beef in the same skillet until browned, 1 to 2 minutes; add to onion mixture. Cook and stir noodles in the same skillet until heated through, 1 to 2 minutes; add to beef-onion mixture. Add remaining sauce to beef-noodles mixture and toss to coat using your hands.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "201"
},
{
  "url": "https://www.allrecipes.com/recipe/26595/chateaubriand/",
  "name": "Chateaubriand",
  "rating": "4.3",
  "ratingcount": "59",
  "ingredients": "2 (8 ounce) fillets beef tenderloin filet, 1 1/2 inch thick; 2 tablespoons vegetable oil; freshly ground black pepper to taste; 2 tablespoons butter",
  "directions": "1. Rub the beef with the vegetable oil and season with freshly ground black pepper. Let the beef rest at room temperature for 1 hour. 2. Heat a large, heavy skillet over medium-high heat. Quickly sear the meat about 5 seconds on each side, then remove from skillet. Melt and brown the butter in the skillet. Return the meat to the skillet, and fry 4 to 5 minutes on each side. The outside of the meat should be browned and crisp. Remove from the skillet and let stand for about 5 minutes for the juices to settle.",
  "prep": "1 hr",
  "cook": "10 mins",
  "total": "1 hr 10 mins",
  "calories": "711"
},
{
  "url": "https://www.allrecipes.com/recipe/16254/beef-with-vegetables/",
  "name": "Beef with Vegetables",
  "rating": "4.4",
  "ratingcount": "91",
  "ingredients": "8 ounces beef filet, cut into 1/2 inch strips; 2 tablespoons vegetable oil; 1  onion, chopped; 1 clove garlic, minced; 1 teaspoon chopped fresh ginger root; 1  green bell pepper, chopped; 1  carrot, chopped; 1 (10.5 ounce) can beef broth; 1 tablespoon cornstarch; 1 teaspoon white sugar; 1 tablespoon soy sauce; 1 tablespoon oyster sauce; salt and pepper to taste",
  "directions": "1. In a large skillet over medium high heat, saute the beef slices in the oil for 5 minutes, or until well browned. Add the onion, garlic and ginger and saute for 5 more minutes. Then add the green bell pepper, carrot and beef broth. Reduce heat to low and let simmer. 2. Meanwhile, in a separate small bowl, combine the corn flour, sugar, soy sauce and oyster sauce, if desired. Stir thoroughly, forming a smooth paste. Slowly add this to the simmering beef and vegetables, stirring well, and let simmer to desired thickness. Season with salt and pepper to taste.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "267"
},
{
  "url": "https://www.allrecipes.com/recipe/14606/beef-tenderloin-with-roasted-shallots/",
  "name": "Beef Tenderloin With Roasted Shallots",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "¾ pound shallots, halved lengthwise and peeled; 1 ½ tablespoons olive oil; salt and pepper to taste; 3 cups beef broth; ¾ cup port wine; 1 ½ teaspoons tomato paste; 2 pounds beef tenderloin roast, trimmed; 1 teaspoon dried thyme; 3 slices bacon, diced; 3 tablespoons butter; 1 tablespoon all-purpose flour; 4 sprigs watercress, for garnish",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). In 9 inch pie pan, toss shallots with oil to coat. Season with salt and pepper. Roast until shallots are deep brown and very tender, stirring occasionally, about 30 minutes. 2. In a large saucepan, combine beef broth and port. Bring to a boil. Cook over high heat until the volume is reduced by half, about 30 minutes. Whisk in tomato paste. Set aside. 3. Pat beef dry; sprinkle with thyme, salt and pepper. In a large roasting pan, set over medium heat on the stove top, saute bacon until golden. Using a slotted spoon, transfer bacon to paper towels. Add beef to pan; brown on all sides over medium high heat, about 7 minutes. 4. Transfer pan to oven. Roast beef until meat thermometer inserted into center registers 125 degrees F (50 degrees C) for medium rare, about 25 minutes. Transfer beef to platter. Tent loosely with foil. 5. Spoon fat off top of pan drippings in roasting pan. Place pan over high heat on stove top. Add broth mixture, and bring to boil; stir to scrape up any browned bits. Transfer to a medium saucepan, and bring to simmer. Mix 1 1/2 tablespoon butter and flour in small bowl to form smooth paste; whisk into broth mixture, and simmer until sauce thickens. Whisk in remaining butter. Stir in roasted shallots and reserved bacon. Season with salt and pepper. 6. Cut beef into 1/2 inch thick slices. Spoon some sauce over, and garnish with watercress.",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "653"
},
{
  "url": "https://www.allrecipes.com/recipe/244962/asian-garlic-beef-cubes-vietnamese-bo-luc-lac-or-shaking-beef/",
  "name": "Asian Garlic Beef Cubes (Vietnamese Bo Luc Lac or Shaking Beef)",
  "rating": "4.0",
  "ratingcount": "9",
  "ingredients": "1 ½ pounds beef tenderloin, cut into cubes; 2 tablespoons olive oil; 2 tablespoons oyster sauce (such as Maekrua®); 4 large cloves garlic, minced, or more to taste; 1 tablespoon Cabernet Sauvignon wine; 1 teaspoon fish sauce (Optional); 1 teaspoon ground black pepper, or more to taste (Optional); 1 teaspoon soy sauce (Optional); 1 teaspoon dark soy sauce (Optional); 2 drops sesame oil, or more to taste; 1 tablespoon fish sauce (Optional); 1 tablespoon lemon juice (Optional); 1 tablespoon ground black pepper (Optional); 2 tablespoons olive oil; 2 tablespoons oyster sauce (such as Maekrua®); 4 cloves garlic, minced, or more to taste",
  "directions": "1. Put beef cubes in a container with a lid. Whisk 2 tablespoons olive oil, 2 tablespoons oyster sauce, 4 minced garlic cloves, wine, 1 teaspoon fish sauce, 1 teaspoon black pepper, soy sauce, dark soy sauce, and sesame oil together in a bowl until marinade is well mixed; pour over beef. Allow beef to marinate, 10 to 30 minutes. 2. Whisk 1 tablespoon fish sauce, lemon juice, and 1 tablespoon black pepper together in a bowl until dipping sauce is well mixed. 3. Heat 2 tablespoons olive oil in a wok or large skillet over high heat; add beef and marinade. Cook and stir beef mixture, 2 tablespoons oyster sauce, and 4 cloves minced garlic together in hot oil until beef is cooked through and sauce begins to thicken, 5 to 10 minutes. Adding garlic over several times during cooking will produce a better mix of flavors. 4. Serve beef alongside dipping sauce.",
  "prep": "30 mins",
  "cook": "5 mins",
  "total": "45 mins",
  "calories": "329"
},
{
  "url": "https://www.allrecipes.com/recipe/132814/easy-yet-romantic-filet-mignon/",
  "name": "Easy Yet Romantic Filet Mignon",
  "rating": "4.6",
  "ratingcount": "261",
  "ingredients": "2 (8 ounce) (1 inch thick) filet mignon steaks; 2 teaspoons olive oil; ¼ teaspoon onion powder; Salt and pepper to taste; 2 tablespoons minced shallot; 2 slices bacon",
  "directions": "1. Place oven rack in its highest position. Set oven to Broil. 2. Rub steaks all over with olive oil. Sprinkle with onion powder, then with salt and pepper. Wrap one slice of bacon around each steak, and secure with a toothpick. 3. Place steaks onto a broiler pan, and broil for 5 to 7 minutes. Turn the steaks over, and sprinkle the tops with shallots. Broil for an additional 5 to 7 minutes, or until the steaks are cooked to your liking.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "611"
}]