[{
  "url": "https://www.allrecipes.com/recipe/14646/barbecued-beef/",
  "name": "Barbecued Beef",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 ½ cups ketchup; ¼ cup packed brown sugar; ¼ cup red wine vinegar; 2 tablespoons prepared Dijon-style mustard; 2 tablespoons Worcestershire sauce; 1 teaspoon liquid smoke flavoring; ½ teaspoon salt; ¼ teaspoon ground black pepper; ¼ teaspoon garlic powder; 1 (4 pound) boneless chuck roast",
  "directions": "1. Combine ketchup, brown sugar, red wine vinegar, Dijon-style mustard, Worcestershire sauce, and liquid smoke. Stir in salt, pepper, and garlic powder. 2. Place chuck roast in a slow cooker. Pour ketchup mixture over chuck roast. Cover and cook on Low for 8 to 10 hours. 3. Remove chuck roast from slow cooker, shred with a fork, and return to the slow cooker. Stir meat to evenly coat with sauce. Continue cooking for approximately 1 hour more.",
  "prep": "20 mins",
  "cook": "9 hrs",
  "total": "9 hrs 20 mins",
  "calories": "276"
},
{
  "url": "https://www.allrecipes.com/recipe/259061/true-dominican-sancocho-latin-7-meat-stew/",
  "name": "True Dominican Sancocho (Meat and Vegetable Stew)",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "¼ cup dried oregano; 5 cloves garlic, minced; 2 teaspoons salt, divided; 1 pound bone-in beef chuck; 1 pound bone-in pork loin roast; 5  chicken drumsticks, or more to taste; 2 large lemons, juiced; 2 large onions, quartered; 2 tablespoons vegetable oil; 1 tablespoon vinegar; ½ cup vegetable oil; 1 ¼ gallons water, or as needed; 1 (14 ounce) can chicken broth; 1 (10.5 ounce) can beef consomme; 4  beef bouillon cubes, divided; 1 ½ pounds Spanish pumpkin, peeled and cut into 1 1/2-inch chunks; 1 pound sweet potatoes, peeled and cut into 1 1/2-inch chunks; 1 pound eddeos, peeled and cut into 1 1/2-inch chunks; ½ pound yuca (cassava) roots, peeled and cut into 1 1/2-inch chunks; ½ pound potatoes, peeled and cut into 1 1/2-inch chunks; 2  green plantains, peeled and cut into 1 1/2-inch chunks; 2 ears corn on the cob, cut into quarters; 3 stalks celery, diced; 2 large carrots, chopped, or more to taste; 1 large green bell pepper, diced; 1 bunch cilantro, chopped; 1 pinch adobo seasoning (Optional)",
  "directions": "1. Mash oregano, garlic, and 1 teaspoon salt in a bowl until well combined. 2. Mix beef, pork, chicken, and lemon juice together in a large bowl; drain 1/2 of the liquid. Mix in onions, mashed garlic mixture, 2 tablespoons oil, and vinegar. 3. Heat 1/2 cup vegetable oil in a large skillet over medium-high heat. Add meat mixture in three batches and cook until browned on all sides, 10 to 15 minutes per batch. 4. Transfer browned meats to an 8-quart Dutch oven. Pour in 1/2 of the water, then add chicken broth, beef consommé, 2 bouillon cubes, and remaining 1 teaspoon salt. Bring to a boil, then reduce the heat to low, cover, and simmer until meats are more than halfway cooked through, about 40 minutes. 5. Add pumpkin, sweet potatoes, eddeos, yuca, potatoes, plantains, corn, celery, carrots, bell pepper, cilantro, remaining bouillon cubes, and adobo seasoning to the Dutch oven. Increase the heat to medium and return to a boil. Reduce the heat to low and simmer, stirring in remaining water as needed in gradual increments to replace evaporated liquid, until root vegetables are soft and liquid has thickened, 1 to 2 hours. 6. During the last 30 minutes of cooking, transfer beef, pork, and chicken to a cutting board. Let cool slightly, then remove bones and chop or shred meat. Return meat to the stew and finish cooking.",
  "prep": "10 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 40 mins",
  "calories": "497"
},
{
  "url": "https://www.allrecipes.com/recipe/91597/original-homemade-italian-beef/",
  "name": "Original Homemade Italian Beef",
  "rating": "4.7",
  "ratingcount": "667",
  "ingredients": "3 pounds beef chuck roast; 3 (1 ounce) packages dry Italian salad dressing mix; 1 cup water; 1 (16 ounce) jar pepperoncini peppers; 8  hamburger buns, split",
  "directions": "1. Place roast into a slow cooker and rub dressing mix over top. Pour water around roast. Cover and cook on High until meat is tender and can be easily pulled apart with a fork, 5 to 6 hours. 2. Remove meat and shred with two forks. Return meat to the slow cooker; add pepperoncini and as much pepperoncini juice as you like for additional flavor. Cover and cook for 1 more hour. 3. Serve on buns.",
  "prep": "15 mins",
  "cook": "6 hrs",
  "total": "6 hrs 15 mins",
  "calories": "557"
},
{
  "url": "https://www.allrecipes.com/recipe/284870/marinated-boneless-chuck-steak/",
  "name": "Marinated Boneless Chuck Steak",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "1 medium onion, sliced; 1 medium green bell pepper, sliced; ½ cup balsamic vinegar; ½ cup olive oil; ¼ cup Worcestershire sauce; ¼ cup soy sauce; 3 cloves garlic, minced; 1 teaspoon crushed dried rosemary; 1 teaspoon ground black pepper; 12 ounces boneless chuck steak",
  "directions": "1. Place onion and bell pepper slices in a large resealable plastic bag. Add vinegar, olive oil, Worcestershire, soy sauce, garlic, rosemary, and pepper. Add steak, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 3 hours, or overnight. 2. Remove steak from the marinade and shake off excess. Discard 1/2 of the liquid marinade. 3. Pour the remaining liquid plus the onion and pepper slices into a large frying pan. Cook over high heat for 2 minutes. Move vegetables to the side of the pan and add steak. Reduce heat to medium-high and cook for 4 minutes. Remove vegetables to a plate and flip steak; cook until steak is beginning to firm and is hot and slightly pink in the center, about 3 to 5 more minutes. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C) for medium doneness. 4. Drain liquid from the pan. Serve steak with onion and bell pepper.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "3 hrs 25 mins",
  "calories": "574"
},
{
  "url": "https://www.allrecipes.com/recipe/165843/beef-and-lentil-soup/",
  "name": "Beef and Lentil Soup",
  "rating": "4.7",
  "ratingcount": "105",
  "ingredients": "2 tablespoons olive oil; 1 pound beef chuck, cut into 1-inch cubes; salt and pepper to taste; 1 large onion, chopped; 2 large carrots, chopped; 2 large stalks  celery, chopped; 6 cloves garlic, chopped; 1 ½ teaspoons dried cilantro; 1 teaspoon dried oregano; 2 (32 ounce) cartons chicken broth; 1 (28 ounce) can diced tomatoes; 2 cups dry lentils; ¼ cup chopped fresh parsley; ½ cup grated Parmesan cheese, or to taste",
  "directions": "1. Heat oil in a large pot over medium-high heat until it begins to smoke. Season beef with salt and pepper, then gently add to the pot and brown on all sides, about 8 minutes. Transfer beef to a plate and reserve remaining oil in the pot. 2. Add onion, carrots, celery, garlic, cilantro, and oregano to the pot; cook and stir until onion has softened and turned translucent, about 8 minutes. 3. Pour in chicken broth and tomatoes, then return beef to the pot and bring to a boil over high heat. Reduce the heat to medium-low, cover, and simmer until beef is beginning to turn tender, about 1 hour. 4. Add lentils, then cover and simmer until lentils are tender, about 40 minutes. Season again with salt and pepper, then stir in parsley. Sprinkle with Parmesan cheese to serve.",
  "prep": "20 mins",
  "cook": "2 hrs 5 mins",
  "total": "2 hrs 25 mins",
  "calories": "343"
},
{
  "url": "https://www.allrecipes.com/recipe/237005/simple-slow-cooked-korean-beef-soft-tacos/",
  "name": "Simple Slow-Cooked Korean Beef Soft Tacos",
  "rating": "4.8",
  "ratingcount": "309",
  "ingredients": "1 (3 pound) beef chuck roast, trimmed; ½ medium onion, diced; ½ cup dark brown sugar; ⅓ cup soy sauce; 10 cloves garlic; 1 medium jalapeno pepper, diced (Optional); 1 (1 inch) piece fresh ginger root, peeled and grated; 2 tablespoons seasoned rice vinegar; 1 tablespoon sesame oil; salt and ground black pepper to taste; 16 (6 inch) corn tortillas (Optional)",
  "directions": "1. Place chuck roast into a slow cooker with onion, brown sugar, soy sauce, garlic, jalapeño pepper, ginger, rice vinegar, sesame oil, salt, and pepper. Cover and cook until meat is tender and can easily be pulled apart with a fork, on Low for 10 hours or High for 8 hours. 2. Transfer roast to a cutting board and shred meat with two forks. Return to the slow cooker and mix with the juices. 3. Serve with corn tortillas.",
  "prep": "20 mins",
  "cook": "8 hrs",
  "total": "8 hrs 20 mins",
  "calories": "456"
},
{
  "url": "https://www.allrecipes.com/recipe/14608/slow-cooker-barbeque/",
  "name": "Slow Cooker Barbeque",
  "rating": "4.6",
  "ratingcount": "747",
  "ingredients": "1 (3 pound) boneless chuck roast; 1 teaspoon garlic powder; 1 teaspoon onion powder; salt and pepper to taste; 1 (18 ounce) bottle barbeque sauce",
  "directions": "1. Place roast into slow cooker. Sprinkle with garlic powder and onion powder. Season with salt and pepper. Pour barbeque sauce over meat. Cook on Low for 6 to 8 hours. 2. Remove meat from slow cooker, shred, and return to slow cooker. Cook for 1 more hour. Serve hot.",
  "prep": "10 mins",
  "cook": "7 hrs",
  "total": "7 hrs 10 mins",
  "calories": "344"
},
{
  "url": "https://www.allrecipes.com/recipe/162091/awesome-red-wine-pot-roast/",
  "name": "Awesome Red Wine Pot Roast",
  "rating": "4.6",
  "ratingcount": "246",
  "ingredients": "3 pounds boneless beef chuck roast; 2 tablespoons all-purpose flour; 2 tablespoons canola oil; ½ cup water; ½ cup red wine; 1 teaspoon dried basil; ½ teaspoon dried marjoram; ½ teaspoon dried thyme; 1 teaspoon salt; ¼ teaspoon ground black pepper; 1  onion, sliced; 6  red potatoes, washed and halved; 6  carrot, peeled and cut into 2-inch lengths; 8  pearl onions, peeled and halved",
  "directions": "1. Preheat an oven to 350 degrees F (175 degrees C). 2. Sprinkle the roast evenly with the flour and set aside. Heat the canola oil in an oven-proof Dutch oven with lid over medium-high heat. Brown the roast on all sides, about 10 minutes total; remove from the heat. Pour in the water and wine. Sprinkle with the basil, marjoram, thyme, salt, and pepper. Arrange the onion slices on the roast. 3. Replace the cover and bake in the preheated oven for 3 hours. Add the potatoes, carrots, and pearl onions. Pour in additional water if the roast looks dry. Continue baking covered until the roast pulls apart easily with a fork, about 1 hour longer.",
  "prep": "15 mins",
  "cook": "4 hrs 15 mins",
  "total": "4 hrs 30 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/246836/chipotle-barbacoa/",
  "name": "Chipotle Barbacoa",
  "rating": "4.4",
  "ratingcount": "56",
  "ingredients": "2 tablespoons vegetable oil; 1 (2 pound) beef chuck roast, trimmed and cut into 4 to 6 pieces; 4  chipotle peppers in adobo sauce; ⅓ cup apple cider; 3 tablespoons lime juice; 4 cloves garlic, peeled, or more to taste; 4 teaspoons cumin; 1  serrano chile pepper, chopped (Optional); 1 tablespoon ground cayenne pepper, or more to taste (Optional); 2 ½ teaspoons dried oregano; 1 teaspoon ground black pepper; 1 teaspoon garlic powder; ½ teaspoon salt; ½ teaspoon ground cloves; 1 cup chicken broth; 1 small onion, finely chopped; 3  bay leaves",
  "directions": "1. Heat oil in a large skillet over low heat, gradually increasing heat to medium-high. Cook beef in hot oil until browned, about 10 seconds per side. Transfer beef to a slow cooker. 2. Combine chipotle peppers, apple cider, lime juice, garlic, cumin, serrano pepper, cayenne pepper, oregano, black pepper, garlic powder, salt, and cloves in a blender or food processor; blend until smooth. Pour over beef in the slow cooker. 3. Stir broth, onion, and bay leaves into the slow cooker. 4. Cook on Low until beef is fork-tender, 6 to 8 hours. Shred beef using 2 forks to serve.",
  "prep": "25 mins",
  "cook": "6 hrs 5 mins",
  "total": "6 hrs 30 mins",
  "calories": "244"
},
{
  "url": "https://www.allrecipes.com/recipe/282066/beef-birria/",
  "name": "Beef Birria",
  "rating": "4.9",
  "ratingcount": "30",
  "ingredients": "1 (2 1/2 pound) beef chuck; 3 (8 ounce) beef short ribs; 4 teaspoons kosher salt; 2 teaspoons dried Mexican oregano; 1 teaspoon freshly ground black pepper; 1 teaspoon ground cumin; ¼ teaspoon ground cinnamon; ¼ teaspoon ground cloves; 7  dried guajillo chilies; 2 tablespoons olive oil; 1 large onion, roughly chopped; 6 cloves garlic, peeled; 1 (1 inch) piece fresh ginger, thinly sliced; 3 large tomatoes, cored and chopped; 2 cups water; 4 cups chicken broth; ¼ cup white vinegar; 3 bay leaves; 1 tablespoon honey; 2 tablespoons finely diced white onion; 1 tablespoon chopped fresh cilantro; 1 medium lime, sliced",
  "directions": "1. Cut beef chuck in half; cut each half into 3- to 4-inch pieces. Cut each beef short rib through the middle, all the way down to the bone. 2. Place beef chuck and short ribs into a soup pot; season with kosher salt, oregano, black pepper, cumin, cinnamon, and cloves. Toss thoroughly until meat is evenly coated with spices, 2 to 3 minutes. Cover and keep in the refrigerator for at least 6 hours to overnight. 3. Prep guajillo chiles by snipping off stems with scissors; slice open and scrape or shake out seeds onto a plate to discard. 4. Heat olive oil in a saucepan over medium heat. Add guajillo chiles and toss in hot oil, about 30 seconds. Add onion, garlic, and ginger; toss to combine. Add tomatoes and water; bring to a boil. Reduce heat to medium-low and let simmer for 30 minutes. 5. Turn off heat and use an immersion blender to purée mixture as smooth as possible, or use a countertop blender, working in batches as needed. 6. Remove the soup pot with meat from the refrigerator. Strain puréed chili mixture into the pot using a large mesh strainer. Add chicken broth, vinegar, bay leaves, and honey to the pot. 7. Bring to a boil, then reduce heat to medium-low. Simmer gently, stirring occasionally, until meat is fall-apart tender, 3 to 4 hours. Skim fat off of the top and reserve for future birria queso tacos. 8. To serve, place a few chunks of beef into a soup bowl and spoon some cooking liquid on the top. Sprinkle with some white onion and cilantro; squeeze lime juice over the top.",
  "prep": "30 mins",
  "cook": "3 hrs 40 mins",
  "total": "10 hrs 10 mins",
  "calories": "375"
},
{
  "url": "https://www.allrecipes.com/recipe/231771/true-cheeseburger-pizza/",
  "name": "True Cheeseburger Pizza",
  "rating": "4.6",
  "ratingcount": "45",
  "ingredients": "¾ pound ground beef chuck; ¼ teaspoon salt; ¼ teaspoon ground black pepper; ⅔ cup ketchup; 2 tablespoons prepared yellow mustard; 1 (14 ounce) pre-baked pizza crust; 1 ½ cups shredded mozzarella cheese; 1 cup shredded sharp Cheddar cheese; ½ cup chopped onions; ½ cup dill pickle slices; 1 cup shredded lettuce (Optional); 1 cup diced tomatoes (Optional)",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Heat a large skillet over medium-high heat. Cook and stir beef, salt, and pepper in the hot skillet until meat is browned and crumbly, 5 to 7 minutes; drain and discard grease. Set aside. 3. Mix together ketchup and mustard in a small bowl; spread mixture over pizza crust. Sprinkle mozzarella and Cheddar cheese on top and cover with cooked beef and onions. Transfer pizza to a large baking sheet. 4. Bake in the preheated oven until cheese is melted, about 20 minutes. Top with pickle slices and allow pizza to cool for 5 minutes. Top with lettuce and tomatoes before slicing and serving.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "740"
},
{
  "url": "https://www.allrecipes.com/recipe/16995/charleys-slow-cooker-mexican-style-meat/",
  "name": "Charley's Slow Cooker Mexican Style Meat",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 (4 pound) chuck roast; 1 teaspoon salt; 1 teaspoon ground black pepper; 2 tablespoons olive oil; 1 large onion, chopped; 1 ¼ cups diced green chile pepper; 1 teaspoon chili powder; 1 teaspoon ground cayenne pepper; 1 (5 ounce) bottle hot pepper sauce; 1 teaspoon garlic powder",
  "directions": "1. Trim the roast of any excess fat, and season with salt and pepper. Heat olive oil in a large skillet over medium-high heat. Place the beef in the hot skillet, and brown it quickly on all sides. 2. Transfer the roast to a slow cooker and top it with the chopped onion. Season with chile peppers, chili powder, cayenne pepper, hot pepper sauce, and garlic powder. Add enough water to cover 1/3 of the roast. 3. Cover, and cook on High for 6 hours, checking to make sure there is always at least a small amount of liquid in the bottom of the cooker. Reduce heat to Low, and continue cooking for 2 to 4 hours, or until meat is totally tender and falls apart. 4. Transfer the roast to a bowl and shred it using two forks (reserve 2 cups of cooking liquid, if desired). Serve in tacos or burritos (see Cook's Note).",
  "prep": "30 mins",
  "cook": "8 hrs",
  "total": "8 hrs 50 mins",
  "calories": "261"
},
{
  "url": "https://www.allrecipes.com/recipe/30490/bbq-chuck-roast/",
  "name": "BBQ Chuck Roast",
  "rating": "4.5",
  "ratingcount": "131",
  "ingredients": "1 (5 pound) chuck roast; 1 cup barbeque sauce; 1 cup teriyaki sauce; 1 (12 fluid ounce) can or bottle beer; 3 teaspoons minced garlic; 3 teaspoons thinly sliced fresh ginger root; 1  onion, finely chopped; 3 teaspoons coarsely ground black pepper; 2 teaspoons salt",
  "directions": "1. In a large bowl, mix barbeque sauce, teriyaki sauce, beer, garlic, ginger, onion, black pepper, and salt. Place the roast into the marinade, cover and refrigerate for six hours, turning often. 2. Preheat an outdoor grill for indirect heat. Remove the roast from the marinade, and pour the marinade into a saucepan. Bring to a boil, and cook for 5 minutes. Set aside for use as a basting sauce. 3. Thread the roast onto a rotating barbecue spit above indirect heat. Cook the roast for two hours, or until the internal temperature of the roast is at least 145 degrees F (63 degrees C). Baste often during the last hour with reserved marinade.",
  "prep": "15 mins",
  "cook": "2 hrs",
  "total": "8 hrs 15 mins",
  "calories": "714"
},
{
  "url": "https://www.allrecipes.com/recipe/246866/rigatoni-alla-genovese/",
  "name": "Rigatoni alla Genovese",
  "rating": "4.6",
  "ratingcount": "105",
  "ingredients": "1 tablespoon olive oil; 6 ounces pancetta or salt pork, diced; 2 ½ pounds beef chuck; 3 teaspoons kosher salt, divided; ½ cup diced celery; ½ cup diced carrots; 1 teaspoon freshly ground black pepper; ⅔ cup white wine; 1 heaping tablespoon tomato paste; 1  bay leaf; 4 pounds yellow onions, sliced; 2 pounds red onions, sliced; 2 (16 ounce) boxes uncooked rigatoni; 2 tablespoons freshly grated Parmigiano-Reggiano cheese; 1 tablespoon chopped fresh marjoram leaves; 1 pinch cayenne pepper",
  "directions": "1. Heat oil in a large pot over medium heat. Add pancetta and cook until most of the fat is rendered, about 6 minutes. Transfer to a plate with a slotted spoon. 2. Add beef chuck and 2 teaspoons salt to the pot. Increase the heat to high; cook and stir until browned and any liquid released begins to evaporate, 10 to 15 minutes. 3. Reduce the heat to medium-high. Add cooked pancetta, celery, carrots, remaining 1 teaspoon salt, and pepper; cook and stir for 5 minutes. Add white wine, tomato paste, and bay leaf; cook and stir for 2 to 3 minutes, scraping up the drippings from the bottom of the pan. 4. Add yellow and red onions. Reduce the heat to medium, cover, and cook for 30 minutes without stirring. After 30 minutes, stir onions and meat until well mixed. Cover again and cook for 30 more minutes. 5. Stir, then reduce the heat to low. Keep uncovered and cook, occasionally stirring and skimming off any fat, until beef and onions seem to melt into each other, 8 to 10 hours. If the sauce is reducing too much, add water or broth as needed to maintain a sauce-like consistency. 6. When the sauce is almost finished, bring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally until just barely al dente, 10 to 12 minutes. Drain. 7. Add rigatoni to the sauce and cook until heated through. Garnish with Parmigiano-Reggiano cheese, marjoram, and cayenne.",
  "prep": "30 mins",
  "cook": "9 hrs 25 mins",
  "total": "9 hrs 55 mins",
  "calories": "891"
},
{
  "url": "https://www.allrecipes.com/recipe/229957/slow-cooker-au-jus-pot-roast/",
  "name": "Slow Cooker Au Jus Pot Roast",
  "rating": "4.7",
  "ratingcount": "126",
  "ingredients": "1 (4 pound) boneless beef chuck roast; 1 tablespoon Worcestershire sauce, or to taste; 1 tablespoon Montreal-style steak seasoning; 2 tablespoons olive oil; 1 cube beef bouillon; 1 cup hot strong black coffee; 1 (8 ounce) can tomato sauce; 1 teaspoon dried oregano, or to taste; 2 teaspoons Worcestershire sauce, or to taste",
  "directions": "1. Rub chuck roast with 1 tablespoon Worcestershire sauce and sprinkle on all sides with steak seasoning. 2. Heat olive oil in a large skillet over medium-high heat. Sear the roast in the hot oil until browned, about 5 minutes per side. Transfer roast to a slow cooker. 3. Dissolve beef bouillon cube in the coffee and pour the mixture over the roast. Pour tomato sauce over meat and season with oregano; drizzle meat with 2 teaspoons Worcestershire sauce. 4. Set cooker to Low and cook until meat is tender, 8 to 10 hours.",
  "prep": "15 mins",
  "cook": "8 hrs 20 mins",
  "total": "8 hrs 35 mins",
  "calories": "386"
},
{
  "url": "https://www.allrecipes.com/recipe/231009/chef-johns-beef-goulash/",
  "name": "Chef John's Beef Goulash",
  "rating": "4.7",
  "ratingcount": "498",
  "ingredients": "2 ½ pounds boneless beef chuck roast, cut into 2-inch cubes; salt and ground black pepper to taste; 2 tablespoons vegetable oil; 2  onions, chopped; 2 teaspoons olive oil; ½ teaspoon salt; 2 tablespoons Hungarian paprika; 2 teaspoons caraway seeds, crushed; 1 teaspoon freshly ground black pepper; 1 teaspoon dried marjoram; ½ teaspoon ground thyme; ½ teaspoon cayenne pepper; 4 cups chicken broth, divided; ¼ cup tomato paste; 3 cloves garlic, crushed; 2 tablespoons balsamic vinegar; 1 teaspoon white sugar; ½ teaspoon salt, or to taste; 1  bay leaf",
  "directions": "1. Gather all ingredients. 2. Season beef with salt and black pepper. 3. Heat vegetable oil in a large skillet over high heat; cook and stir beef in hot oil in batches until browned on all sides, about 5 minutes per batch. 4. Transfer to a large stockpot and reserve drippings in the skillet. 5. Return skillet to medium heat; stir onions into the reserved drippings, drizzle olive oil over onions, season with 1/2 teaspoon salt and cook until onion has softened, about 5 minutes. Transfer to the stockpot with beef. 6. Combine paprika, caraway seeds, black pepper, marjoram, thyme, and cayenne pepper in the skillet and toast over medium heat until fragrant, about 3 minutes. 7. Add 1 cup chicken broth and stir; transfer to the beef and onion mixture. 8. Stir 3 cups chicken broth into beef mixture. Add tomato paste, garlic, vinegar, sugar, 1/2 teaspoon salt, and bay leaf; place stockpot over high heat and bring to a boil. 9. Reduce heat to low and simmer until a fork inserts easily into the meat, 1 1/2 to 2 hours.",
  "prep": "30 mins",
  "cook": "2 hrs",
  "total": "2 hrs 30 mins",
  "calories": "573"
},
{
  "url": "https://www.allrecipes.com/recipe/217410/barbacoa/",
  "name": "Barbacoa",
  "rating": "4.4",
  "ratingcount": "23",
  "ingredients": "4  dried guajillo chilies; 2 teaspoons cumin seeds; ⅛  whole cloves; 1 cup boiling water; ½ teaspoon ground ancho chile powder; 1 large onion, quartered; 6 cloves garlic; 2 teaspoons dried oregano; 1 teaspoon ground thyme; ⅓ cup apple cider vinegar; 2 teaspoons lime juice; 1 (6 pound) boneless beef chuck roast; 2  bay leaves",
  "directions": "1. Heat a heavy skillet over medium heat. Place the dried guajillo chiles into the skillet and cook, turning occasionally, until the color changes and the chiles have puffed, about 5 minutes. Set the chiles aside to cool for a moment. Meanwhile, toast the cumin and cloves in the hot skillet until the cumin seeds begin to pop; remove from the pan and set aside. Remove and discard the stems, seeds, and veins of the chiles, and place into a small bowl. Pour the boiling water over top, and cover. Let the chiles soak for 1 hour. 2. Grind the toasted cumin and cloves into a powder, and place into a blender. Add the ancho chile powder, onion, garlic, oregano, thyme, vinegar, and lime juice. Remove the chiles from the soaking water, and place into the blender along with 1/3 cup of the soaking liquid. Cover, and blend until a smooth paste forms. 3. Place the beef roast into a mixing bowl, and pour the guajillo chile past over top. Coat the roast on all sides with the paste, then cover the bowl with plastic wrap. Marinate in the refrigerator overnight. 4. Preheat an oven to 325 degrees F (165 degrees C). 5. Transfer the roast and marinade to a roasting pan, and arrange the bay leaves over top. Cover tightly with aluminum foil. Bake in the preheated oven until the meat is very tender and is easily pulled apart with a fork, about 6 hours. Let stand, covered, at room temperature for 1 hour before discarding the bay leaves and shredding with two forks.",
  "prep": "30 mins",
  "cook": "6 hrs 10 mins",
  "total": "16 hrs 40 mins",
  "calories": "175"
},
{
  "url": "https://www.allrecipes.com/recipe/266892/poutine-gravy/",
  "name": "Poutine Gravy",
  "rating": "4.5",
  "ratingcount": "15",
  "ingredients": "1 tablespoon vegetable oil; 1 pound boneless beef chuck, chopped, or more to taste; 4 tablespoons butter; 1 cup diced onions; salt to taste; freshly ground black pepper to taste; 1 pinch cayenne pepper, or to taste; ⅓ cup all-purpose flour; 4 cups homemade beef broth; 1 (16 ounce) package crinkle-cut French fries, or to taste; 1 cup fresh cheese curds, or to taste; 1 teaspoon chopped fresh chives, or to taste",
  "directions": "1. Drizzle oil into a pan over high heat. Add beef chuck. Cook and stir until juices evaporate and the beef starts to brown and stick to the bottom of the pan, 5 to 7 minutes. Add butter and reduce heat to medium; stir until butter is melted. 2. Add onions, salt, pepper, and cayenne to the beef. Cook until onions are softened and golden, 2 to 3 minutes. Stir in flour. Cook and stir until flour smells like cooked pie crust, 2 to 3 minutes. Pour in broth and bring to a simmer over high heat. Bring heat back down to medium. Let simmer, uncovered, until gravy reaches your desired thickness, 15 to 20 minutes, scraping down the sides occasionally. Season with salt. 3. Preheat the oven to 450 degrees F (230 degrees C). Lay fries out on a baking sheet. 4. Bake in the preheated oven, turning halfway, until crispy and golden brown, 13 to 18 minutes. 5. Fill a serving platter with fries. Scatter cheese curds on top. Ladle a portion of the beef gravy on top and garnish with chives.",
  "prep": "25 mins",
  "cook": "30 mins",
  "total": "55 mins",
  "calories": "327"
},
{
  "url": "https://www.allrecipes.com/recipe/8369933/greek-style-beef-stew-stifado/",
  "name": "Greek-Style Beef Stew (Stifado)",
  "rating": "4.9",
  "ratingcount": "16",
  "ingredients": "3 pounds boneless beef chuck roast, cut into 2-inch cubes; 2 teaspoons freshly ground black pepper; 1 tablespoon kosher salt; 4 tablespoons olive oil, divided; 1 pound small shallots; ½ cup diced onion; 4 cloves garlic, minced; 1 pinch kosher salt; 3 tablespoons tomato paste; ¼ cup red wine vinegar; 1 cup white wine; 2 teaspoons white sugar; ¼ teaspoon ground cinnamon; ⅛ teaspoon ground allspice; 1 pinch ground cloves; 1 teaspoon dried oregano; 2 large bay leaves; 2 sprigs fresh rosemary; 2 cups beef broth, or more as needed",
  "directions": "1. Gather all ingredients. 2. Place beef in a bowl and season generously with pepper and kosher salt. Cover and transfer to the refrigerator until ready to use; up to 1 day is fine. 3. Leaving the root ends in place, cut off the shallot tops. Remove and discard skins. 4. Heat 2 tablespoons oil in a heavy skillet over high heat. Add ½ of the beef and cook until nicely seared, 4 to 6 minutes per side. Remove to a plate and repeat to sear remaining beef. 5. Turn off the heat and add 1 tablespoon oil to the empty skillet. Add shallots and let the skillet cool for 2 to 3 minutes. Turn the heat back on to medium and toss shallots until browned, 2 to 4 minutes. Remove shallots to a plate. 6. Add the remaining 1 tablespoon oil to the skillet with onion, garlic, and a pinch of salt; cook and stir for about 1 minute. Stir in tomato paste and cook until toasted, about 2 minutes. 7. Add red wine vinegar and white wine and bring to a boil while scraping the browned bits of food off the bottom of the pan with a wooden spoon. Increase heat to medium-high and add sugar, cinnamon, allspice, cloves, oregano, bay leaves, and rosemary sprigs. Stir to combine and cook until reduced by about half, 2 to 3 minutes. 8. Add browned beef and shallots to the skillet and toss carefully until coated. Pour in 2 cups beef broth and bring to a simmer. 9. Reduce heat to low or medium-low. Cover and cook at a gentle simmer for 1 hour, then uncover and cook for at least 1 more hour, stirring occasionally to move the beef and shallots around. Add more broth if needed during the cooking time and skim off some fat if preferred. 10. The meat is done when a fork slides in easily, but the meat isn't falling apart on its own; it may take longer than 2 hours. 11. Taste and adjust seasonings before serving. 12. Serve and enjoy!",
  "prep": "25 mins",
  "cook": "2 hrs 35 mins",
  "total": "3 hrs 5 mins",
  "calories": "777"
},
{
  "url": "https://www.allrecipes.com/recipe/85905/restaurant-style-taco-meat-seasoning/",
  "name": "Restaurant-Style Taco Meat Seasoning",
  "rating": "4.6",
  "ratingcount": "299",
  "ingredients": "1 ½ tablespoons corn flour; 4 ½ teaspoons chili powder; ½ teaspoon onion powder; ½ teaspoon garlic powder; ½ teaspoon seasoned salt; ½ teaspoon paprika; ¼ teaspoon cumin; ½ teaspoon garlic salt; ¼ teaspoon sugar; 1 teaspoon dried minced onion; ½ teaspoon beef bouillon granules; ¼ teaspoon ground red pepper; 1 ⅓ pounds lean ground chuck; 1 cup water",
  "directions": "1. In a medium bowl, combine the corn flour, chili powder, onion powder, garlic powder, and seasoned salt. Stir in the paprika, cumin, garlic salt, and sugar. Blend in the onion, bouillon, and ground red pepper, stirring until all spices are well blended. 2. Crumble the ground chuck into a large skillet over medium heat. Cook, stirring, until browned. Remove from heat, rinse meat with hot water, and drain water and grease from beef. 3. Return meat to skillet, and pour in seasoning. Stir in water. Reduce heat to medium-low, and simmer until most of the liquid has cooked away, about 20 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "164"
},
{
  "url": "https://www.allrecipes.com/recipe/246418/traditional-irish-stew/",
  "name": "Slow Cooker Irish Stew",
  "rating": "3.8",
  "ratingcount": "5",
  "ingredients": "3  russet potatoes, diced; 1 pound baby carrots; 1 large onion, chopped; 4 cloves garlic, minced; 1 tablespoon olive oil, or to taste; 2 pounds beef chuck roast, cubed; 1 (16 ounce) bottle stout beer, divided; 1 (6 ounce) can tomato paste; 1 cup beef broth; 1 tablespoon garlic powder; 1 tablespoon onion powder; 1 tablespoon smoked paprika; salt and ground black pepper to taste",
  "directions": "1. Place potatoes, carrots, onion, and garlic into a slow cooker. 2. Heat olive oil in a skillet over medium heat. Add beef; cook and stir until evenly browned, about 10 minutes. Transfer beef to the slow cooker with vegetables. 3. Pour 1/4 cup beer into the same skillet and bring to a boil while scraping the browned bits of beef off of the bottom of the skillet with a wooden spoon. Stir in tomato paste; cook until thickened, about 5 minutes. Pour mixture into the slow cooker. 4. Pour remaining beer, beef broth, garlic powder, onion powder, paprika, salt, and pepper into the slow cooker. 5. Cook on Low until potatoes and carrots are easily pierced with a fork, about 8 hours, or on High for 3 to 4 hours.",
  "prep": "15 mins",
  "cook": "3 hrs 15 mins",
  "total": "3 hrs 30 mins",
  "calories": "334"
},
{
  "url": "https://www.allrecipes.com/recipe/217329/beef-vindaloo/",
  "name": "Beef Vindaloo",
  "rating": "4.0",
  "ratingcount": "47",
  "ingredients": "¼ cup distilled white vinegar; ¼ cup garlic paste; 3 tablespoons ginger paste; 2 tablespoons plain yogurt; 2 tablespoons salt; 1 tablespoon ground black pepper; 1 tablespoon ground red pepper; 2 pounds boneless beef chuck, cut into 1-inch cubes; ¼ cup vegetable oil; 2  onion, chopped; 4  roma (plum) tomatoes, chopped; 1 cup water; 2 tablespoons chopped fresh cilantro (Optional)",
  "directions": "1. Whisk the vinegar, garlic paste, ginger paste, yogurt, salt, black pepper, and red pepper together in a mixing bowl. Mix in the beef cubes until evenly coated. Cover the bowl with plastic wrap, and marinate in the refrigerator overnight (or at least 30 minutes). 2. Heat the vegetable oil in a large pot over medium heat. Cook and stir the onions in the hot oil until they soften, turn translucent, and begin turning golden brown, about 10 minutes. Add the beef cubes, and cook, stirring frequently until the meat is no longer pink on the outside, about 10 minutes more. Stir in the tomatoes and cook for 5 minutes. 3. Pour in the water, and bring to a simmer. Cover and reduce heat to medium-low; cook until the beef is tender, about 40 minutes. Sprinkle with cilantro to serve.",
  "prep": "20 mins",
  "cook": "1 hr 10 mins",
  "total": "9 hrs 30 mins",
  "calories": "546"
},
{
  "url": "https://www.allrecipes.com/recipe/86347/tacos-de-matamoros/",
  "name": "Tacos De Matamoros",
  "rating": "4.3",
  "ratingcount": "111",
  "ingredients": "2 pounds ground chuck; 2 tablespoons chili powder; 2 tablespoons paprika; 1 ½ teaspoons cumin; 1 teaspoon salt; ½ teaspoon garlic powder; 2 cloves garlic, chopped; ½ medium green bell pepper, chopped; ½ medium onion, chopped; 12 (6 inch) corn tortillas; 12 ounces queso asadero (white Mexican cheese); 1 (8 ounce) container sour cream; 1 large tomato, diced; 2 cups shredded lettuce",
  "directions": "1. Place the ground chuck in a large skillet, and season with chili powder, paprika, cumin, salt, garlic powder, and garlic. Pour in enough water to cover. Bring to a boil. Reduce heat to low, and simmer 1 hour. Add more water as necessary during cook time, and break the meat into small pieces. 2. Mix the bell pepper and onion into the skillet, and continue to simmer 30 minutes. Drain and reserve juices. Skim the fat off the juices(or, if not preparing the tacos right away, place juices in the freezer until fat may be easily removed from the top). Mix 5 tablespoons of the remaining juices back into the skillet with the beef, and cook until heated through. 3. Serve the beef on the tortillas. Garnish with queso asadero, sour cream, tomato, and lettuce.",
  "prep": "30 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs",
  "calories": "629"
},
{
  "url": "https://www.allrecipes.com/recipe/229006/best-ever-slow-cooker-italian-beef-roast/",
  "name": "Best Ever Slow Cooker Italian Beef Roast",
  "rating": "4.8",
  "ratingcount": "260",
  "ingredients": "1 (3 pound) beef chuck roast; 1  onion, quartered; 1 (10.5 ounce) can beef broth; 1 (1 ounce) packet dry au jus mix; 1 (.7 ounce) package dry Italian salad dressing mix (such as Good Seasons®); ½ teaspoon salt; ½ teaspoon ground black pepper",
  "directions": "1. Place beef chuck roast into a slow cooker and scatter onion quarters around the meat. Pour the beef broth over the meat and sprinkle the au jus mix, Italian salad dressing mix, salt, and black pepper over the roast. 2. Cover cooker, set on Low, and cook until meat is very tender, 6 to 8 hours.",
  "prep": "10 mins",
  "cook": "6 hrs",
  "total": "6 hrs 10 mins",
  "calories": "285"
},
{
  "url": "https://www.allrecipes.com/recipe/14670/easiest-pot-roast-ever/",
  "name": "Easiest Pot Roast Ever",
  "rating": "4.4",
  "ratingcount": "536",
  "ingredients": "6 medium potatoes; 1 medium yellow onion; 2 stalks celery; 1 ½ cups baby carrots; 1 (3 pound) beef roast; 3 cubes beef bouillon; ½ cup water",
  "directions": "1. Gather ingredients. 2. Cut potatoes, onions, and celery into fairly large chunks; place in the bottom of a slow cooker along with baby carrots. Place roast on top of vegetables. Place 3 bouillon cubes randomly on top of the roast and pour in 1/2 cup water. 3. Cover and cook on Low for 6 to 8 hours or on High for 4 to 5 hours. An instant-read thermometer inserted in the thickest part of the roast should read 145 degrees F (65 degrees C). 4. Transfer roast to a platter. Remove vegetables using a slotted spoon and arrange them around the roast.",
  "prep": "10 mins",
  "cook": "4 hrs",
  "total": "4 hrs 10 mins",
  "calories": "526"
},
{
  "url": "https://www.allrecipes.com/recipe/260697/mississippi-pot-roast/",
  "name": "Mississippi Pot Roast",
  "rating": "4.7",
  "ratingcount": "422",
  "ingredients": "1 (3 pound) chuck roast; ½ (12 ounce) jar pepperoncini; ½ (12 ounce) jar pepperoncini juice; ½ cup unsalted butter; 1 (1 ounce) packet au jus gravy mix; 1 (0.4 oz) package buttermilk ranch dressing mix; salt and ground black pepper to taste",
  "directions": "1. Combine chuck roast, pepperoncini, pepperoncini juice, butter, au jus mix, ranch dressing mix, salt, and pepper in a slow cooker. Cover and cook on Low until roast is fork-tender, about 8 hours. 2. Remove chuck from slow cooker; shred with 2 forks and serve with gravy.",
  "prep": "5 mins",
  "cook": "8 hrs",
  "total": "8 hrs 5 mins",
  "calories": "553"
},
{
  "url": "https://www.allrecipes.com/recipe/66404/perfect-pressure-cooker-pot-roast/",
  "name": "Perfect Pressure Cooker Pot Roast",
  "rating": "4.7",
  "ratingcount": "337",
  "ingredients": "2 tablespoons vegetable oil; 1 (3 pound) beef chuck roast; 1 large onion, diced; 1 (1 ounce) package dry Italian salad dressing mix; 1 (1 ounce) package dry Ranch-style dressing mix; 1 (1.2 ounce) package brown gravy mix; 1 (14.5 ounce) can beef broth",
  "directions": "1. Heat oil in the pressure cooker over medium-high heat with the lid open. Brown the roast on all sides in the hot oil. 2. In a small cup or bowl, mix together the Italian salad dressing mix, Ranch dressing mix, and gravy mix. Sprinkle them evenly over the roast. Pour in the beef broth and add the chopped onion. 3. Seal and lock pressure cooker, and cook over high heat to build pressure until the indicator sounds (mine whistles). Turn heat down to medium, and cook for 45 minutes. Remove from heat and let stand for 5 minutes. Run under cold water to help release the pressure before unsealing the lid. You can use the juices as an au jus, or thicken with flour or cornstarch to make a yummy gravy.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "443"
},
{
  "url": "https://www.allrecipes.com/recipe/214413/three-packet-slow-cooker-roast/",
  "name": "Three Packet Slow Cooker Roast",
  "rating": "4.7",
  "ratingcount": "792",
  "ingredients": "1 cup water; 1 (1 ounce) package ranch dressing mix; 1 (.7 ounce) package dry Italian-style salad dressing mix; 1 (.75 ounce) packet dry brown gravy mix; 1 (3 pound) boneless beef chuck roast",
  "directions": "1. Whisk water, ranch dressing mix, Italian dressing mix, and brown gravy mix together in a bowl until smooth. Place the beef roast into a slow cooker; pour the dressing mix on top. 2. Cook on Low until the roast is easily pierced by a fork, 6 to 8 hours.",
  "prep": "10 mins",
  "cook": "6 hrs",
  "total": "6 hrs 10 mins",
  "calories": "610"
},
{
  "url": "https://www.allrecipes.com/recipe/8513083/braised-beef/",
  "name": "Braised Beef",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "3 ½ pounds boneless beef chuck roast; 5 teaspoons kosher salt, divided; 2 ½ teaspoons freshly ground black pepper, divided; 2 teaspoons garlic powder; 4 teaspoons olive oil; 2 tablespoons butter; 1 medium onion, chopped; 1 pound cremini mushrooms, halved; 3 medium carrots, cut into 2 inch pieces; 1 head garlic, cut in half lengthwise; 1 cup red wine; 3 sprigs thyme; 2  bay leaves; 2 teaspoons Worcestershire; 2 cups beef broth, or more as needed; 2 tablespoons chopped fresh parsley",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Season beef pieces evenly on all sides with 3 1/2 teaspoons salt, 2 teaspoons pepper, and garlic powder. 2. Heat oil in a large skillet over high heat. Add beef, reduce heat to medium high and cook, undisturbed until it releases easily from the skillet and a golden brown crust has formed, about 4 minutes. Flip pieces and continue to cook until browned on all sides. Remove meat from the pan and set aside. 3. Return skillet to medium-high heat and add 2 tablespoons butter to the drippings in the pan. When butter has melted add onion, mushrooms and carrots and cook 5 minutes, stirring often, scraping to release any browned bits from the bottom. Add garlic and cook for 1 minute. Stir in wine and scrape to release any more bits from the pan. Return the meat to the pan, along with any accumulated juices and add thyme, bay leaves and Worcestershire. 4. Pour in beef broth just enough that it comes up 2/3 of the way up on the beef (do not fully submerge the meat in liquid). Bring the mixture to a simmer. 5. Cover and place in preheated oven until meat is very tender, 2 to 2 1/2 hours.",
  "prep": "10 mins",
  "cook": "2 hrs 25 mins",
  "total": "2 hrs 35 mins",
  "calories": "640"
},
{
  "url": "https://www.allrecipes.com/recipe/193585/authentic-bangladeshi-beef-curry/",
  "name": "Authentic Bangladeshi Beef Curry",
  "rating": "4.2",
  "ratingcount": "90",
  "ingredients": "3 tablespoons olive oil; 1  onion, chopped; 6 cloves garlic, minced; 5  green chile peppers, finely sliced; 1 teaspoon ginger paste; 3  whole cardamom seeds; 2  whole cloves; 1 ½ (2 inch) cinnamon sticks; 1 teaspoon ground cumin; 1 teaspoon ground coriander; 1 teaspoon ground turmeric; 1 teaspoon garlic powder; 1 teaspoon cayenne pepper; 1 cup water; 2 pounds boneless beef chuck, cut into 1-1/2-inch pieces",
  "directions": "1. Heat olive oil in a skillet over medium heat. Add onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more. 2. Stir in the garlic, green chiles, ginger paste, cardamom seeds, cloves, and cinnamon sticks. Cook and stir until the garlic begins to brown, 3 to 5 more minutes. 3. Mix cumin, coriander, turmeric, garlic powder, cayenne pepper, and water into the onion mixture. Simmer until most of the water has evaporated and the mixture has thickened. 4. Stir in beef chuck pieces until coated with spice mixture; simmer over medium-low heat, stirring occasionally, until the beef is cooked through and tender, about 1 to 1 1/2 hours.",
  "prep": "30 mins",
  "cook": "1 hr 45 mins",
  "total": "2 hrs 15 mins",
  "calories": "320"
},
{
  "url": "https://www.allrecipes.com/recipe/131931/stove-top-pot-roast/",
  "name": "Stove Top Pot Roast",
  "rating": "4.2",
  "ratingcount": "116",
  "ingredients": "2 tablespoons vegetable oil; 1 (3 pound) beef chuck roast; 4 cups water, or as needed; 4 stalks celery, chopped; 4 cloves garlic, crushed; 1  red onion, chopped; 1 tablespoon dried basil; salt and pepper to taste; 6  turnips, peeled and cut into chunks; 6 medium red potatoes, quartered; 6  carrots, peeled and cut into chunks",
  "directions": "1. Heat oil in a large pot or Dutch oven over medium-high heat; add roast and quickly brown on all sides. 2. Add enough water to the pot to cover roast; add celery, garlic, onion, basil, salt, and pepper. Bring to a boil; reduce heat to low and simmer for 2 hours and 15 minutes, adding additional water if needed to keep the roast covered. 3. Add turnips and potatoes; simmer for an additional 15 minutes. 4. Add carrots; simmer for 30 minutes, or until roast can be pulled apart with a fork. 5. Season to taste with salt and pepper if needed before serving.",
  "prep": "15 mins",
  "cook": "3 hrs 15 mins",
  "total": "3 hrs 30 mins",
  "calories": "608"
},
{
  "url": "https://www.allrecipes.com/recipe/219173/simple-beef-pot-roast/",
  "name": "Simple Beef Pot Roast",
  "rating": "4.8",
  "ratingcount": "684",
  "ingredients": "1 tablespoon vegetable oil; 3 ½ pounds beef chuck pot roast; 2 teaspoons salt; 1 teaspoon ground black pepper; 1 cup diced carrots; 1 cup diced celery; 1 cup diced onion; ¼ cup butter; 1 teaspoon dried rosemary",
  "directions": "1. Preheat the oven to 275 degrees F (135 degrees C). 2. Heat vegetable oil into a large oven-safe pot over medium-high heat. Season chuck roast with salt and black pepper, then cook in hot oil until brown on both sides; transfer to a plate. 3. Add carrots, celery, and onion into the pot. Cook and stir until vegetables start to release their juices, scraping any brown flavor bits off the bottom of the pot, about 3 minutes. Add butter, and cook until onions are translucent, about 5 minutes. Sprinkle in rosemary; return roast to the pot and cover. 4. Roast in the preheated oven until the chuck roast is tender, about 2 1/2 to 3 hours. Season vegetables with additional salt and black pepper, if desired.",
  "prep": "15 mins",
  "cook": "3 hrs 15 mins",
  "total": "3 hrs 30 mins",
  "calories": "507"
},
{
  "url": "https://www.allrecipes.com/recipe/232756/pot-roast/",
  "name": "Pot Roast",
  "rating": "4.4",
  "ratingcount": "144",
  "ingredients": "2 pounds beef pot roast, fat trimmed and discarded; 3  potatoes, peeled and cut into 6 pieces; 1 large onion, cut into 8 pieces; 2  carrots, cut into 1-inch pieces; 2 stalks celery, cut into 1-inch pieces; 3 ½ cups water, divided; salt and ground black pepper to taste; 1 pinch garlic salt, or to taste; ½ cup water; 3 tablespoons cornstarch; ½ teaspoon browning sauce (such as Gravy Master®) (Optional)",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Place roast in a large baking pan; arrange potatoes, onion, carrots, and celery around roast. 3. Pour 3 cups water into the baking pan. Season roast with salt, pepper, and garlic salt. Cover pan with aluminum foil. 4. Bake in the preheated oven until roast is browned and cooked through, about 3 hours. 5. Transfer roast to an oven-safe platter. Remove vegetables using a slotted spoon and arrange them around roast. 6. Reduce oven temperature to 200 degrees F (95 degrees C). Place the platter with roast and vegetables in the oven to keep warm. 7. Pour remaining pan juices into a saucepan; bring to a boil. Stir together remaining 1/2 cup water and cornstarch in a bowl until smooth; pour into boiling pan juices. Reduce heat to medium; cook, stirring constantly, until gravy is thick, about 5 minutes; season with salt and pepper. Stir in browning sauce.",
  "prep": "20 mins",
  "cook": "3 hrs 5 mins",
  "total": "3 hrs 25 mins",
  "calories": "508"
},
{
  "url": "https://www.allrecipes.com/recipe/220125/slow-cooker-beef-pot-roast/",
  "name": "Slow Cooker Beef Pot Roast",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 (5 pound) bone-in beef pot roast; salt and pepper to taste; 2 ½ tablespoons all-purpose flour, divided, or more as needed; 2 tablespoons vegetable oil; 1 tablespoon butter; 8 ounces sliced mushrooms; 1 medium onion, chopped; 2 cloves garlic, minced; 1 tablespoon tomato paste; 2 ½ cups chicken broth; 3 medium carrots, cut into chunks; 2 stalks celery, cut into chunks; 2 sprigs fresh thyme; 1 sprig fresh rosemary",
  "directions": "1. Generously season both sides of roast with salt and pepper. Sprinkle top of roast with 1 tablespoon flour and pat onto meat. Shake off excess. 2. Heat vegetable oil in a large skillet over medium-high heat. Sear roast until well-browned, 5 to 6 minutes per side. Remove roast from the skillet and set aside. 3. Reduce heat to medium. Melt butter in the skillet; cook and stir mushrooms in butter until tender, 3 to 4 minutes. Stir in onion; cook until onions are translucent and brown, about 5 minutes. Add garlic; stir until fragrant, about 1 minute. 4. Stir in remaining 1 1/2 tablespoons flour; cook and stir for about 1 minute. Add tomato paste and cook for another minute. Slowly add chicken broth while stirring; return to a simmer. Remove the skillet from heat. 5. Place carrots and celery in the slow cooker. Place roast over vegetables and pour in any accumulated juices. Add thyme and rosemary. Pour onion and mushroom mixture over the top of roast. 6. Cover and cook on High for 5 to 6 hours. 7. Skim off any fat from surface and remove bones. Season with salt and pepper. 8. Serve hot and enjoy!",
  "prep": "20 mins",
  "cook": "5 hrs 30 mins",
  "total": "5 hrs 50 mins",
  "calories": "778"
},
{
  "url": "https://www.allrecipes.com/recipe/220869/easy-pressure-cooker-pot-roast/",
  "name": "Easy Pressure Cooker Pot Roast",
  "rating": "4.4",
  "ratingcount": "240",
  "ingredients": "2 tablespoons vegetable oil; 1 (3 pound) boneless beef chuck roast, trimmed; 1 pinch seasoned salt, or to taste; 1 pinch onion powder, or to taste; ground black pepper to taste; 1 (14.5 ounce) can beef broth; 1 ½ tablespoons Worcestershire sauce; 1 large onion, cut into 4 wedges; 4 large potatoes, peeled and cut into bite-size pieces; 4  carrots, peeled and cut into bite-size pieces",
  "directions": "1. Heat oil in a pressure cooker over medium-high heat. Sear roast on all sides in hot oil until browned; season with salt, onion powder, and pepper. 2. Pour in beef broth and Worcestershire sauce; add onion and seal the lid. Bring the cooker up to full pressure. Reduce heat to low, maintaining full pressure, and cook for 30 minutes. 3. Use the quick-release method to lower the pressure. Stir in potatoes and carrots and seal the lid; bring the cooker up to full pressure and cook for an additional 15 minutes. 4. Use the quick-release method again and transfer roast and vegetables to a serving dish.",
  "prep": "15 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 25 mins",
  "calories": "450"
},
{
  "url": "https://www.allrecipes.com/recipe/218547/slow-cooker-pot-roast/",
  "name": "Slow Cooker Pot Roast",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "cooking spray; 1  onion, sliced; 1 (2 1/2 pound) boneless beef chuck roast; salt and ground black pepper to taste; ¼ cup all-purpose flour; 1 (1.2 ounce) package dry beef gravy mix; 1 (1 ounce) package ranch dressing mix; 1 (.7 ounce) package dry Italian-style salad dressing mix; ½ cup water, or as needed; 5  whole peeled carrots (Optional)",
  "directions": "1. Spray the inside of a slow cooker with cooking spray. Spread onion slices in the bottom of the cooker. 2. Pat roast dry and sprinkle all over with salt and pepper. Spread flour onto a work surface and roll roast in flour to coat all sides, using your hands or a small sturdy plate to pound flour into the meat. Place floured roast into the slow cooker on top of onions. 3. Whisk together beef gravy mix, ranch dressing mix, and Italian dressing mix in a bowl, then add water and whisk until smooth. Pour over roast. Distribute carrots around the meat. 4. Cover the slow cooker, set to Low, and cook until roast is tender and gravy has thickened, about 8 hours.",
  "prep": "15 mins",
  "cook": "8 hrs",
  "total": "8 hrs 15 mins",
  "calories": "385"
},
{
  "url": "https://www.allrecipes.com/recipe/246721/mississippi-roast-slow-cooker-pepperoncini-pot-roast/",
  "name": "Mississippi Roast (Slow Cooker Pepperoncini Pot Roast)",
  "rating": "4.7",
  "ratingcount": "397",
  "ingredients": "1 (4 pound) beef chuck roast; ¼ cup butter; 5  pepperoncini peppers; 1 (1 ounce) packet ranch dressing mix; 1 (1 ounce) packet dry au jus mix",
  "directions": "1. Place roast in a slow cooker. Form a pocket in the top of the roast and place butter, pepperoncini peppers, ranch dressing mix, and au jus mix in the pocket. 2. Cook on Low for 8 hours.",
  "prep": "10 mins",
  "cook": "8 hrs",
  "total": "8 hrs 10 mins",
  "calories": "537"
},
{
  "url": "https://www.allrecipes.com/recipe/219640/cross-rib-roast/",
  "name": "Cross Rib Roast",
  "rating": "4.4",
  "ratingcount": "66",
  "ingredients": "1 (5 pound) beef cross rib roast; 13 large cloves garlic, crushed, divided; ⅓ cup Dijon mustard; 2 tablespoons light olive oil; 1 tablespoon garlic powder; 1 tablespoon dry mustard powder; 1 tablespoon paprika, plus more for sprinkling; ½ teaspoon salt, or to taste; ½ teaspoon freshly ground black pepper; 1 ¼ cups water; ½ cup red wine; 1 (1 ounce) package dry onion soup mix; 2  beef bouillon cubes; 1 (10.75 ounce) can  condensed golden mushroom soup",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Place roast into a roasting pan. Blend 10 garlic cloves, Dijon mustard, olive oil, garlic powder, dry mustard powder, 1 tablespoon paprika, salt, and black pepper into a paste in a bowl. Spread the paste over the top and sides of the roast. 3. Pour water and red wine into the roasting pan, and sprinkle in dry onion soup mix. Drop in beef bouillon cubes. Generously sprinkle the top of the roast with more paprika and remaining 3 garlic cloves. Cover roast with aluminum foil. 4. Roast in the preheated oven for 1 hour. 5. Reduce temperature to 350 degrees F (175 degrees C). Roast until meat is tender, about 2 more hours, basting occasionally with pan liquid. Remove the foil during last 30 minutes of roasting to help brown the meat. Transfer roast to a platter. 6. Place the roasting pan over medium heat, and bring the liquid to a simmer. Scrape up and dissolve any brown flavor bits from the bottom of the pan into the liquid. Stir condensed soup into the pan drippings until the gravy is smooth and thickened. 7. To serve, slice the roast, pour hot gravy over the slices, and serve with remaining gravy.",
  "prep": "15 mins",
  "cook": "3 hrs 10 mins",
  "total": "3 hrs 25 mins",
  "calories": "523"
},
{
  "url": "https://www.allrecipes.com/recipe/234534/beef-and-guinness-stew/",
  "name": "Beef and Guinness Stew",
  "rating": "4.9",
  "ratingcount": "1",
  "ingredients": "4 slices bacon, cut into small pieces; 2 ½ pounds boneless beef chuck, cut into 2-inch pieces; 1 ½ teaspoons salt, divided, or more to taste; freshly ground black pepper to taste; 2  onions, coarsely chopped; 4 cloves garlic, minced; 1 (14.9 ounce) can dark beer (such as Guinness®); ¼ cup tomato paste; 3  carrots, cut into 1-inch pieces; 2 stalks celery, cut into 1-inch pieces; 4 sprigs fresh thyme; 1 teaspoon white sugar; ½ teaspoon freshly ground black pepper, or to taste; 2 ½ cups chicken stock, or as needed to cover; 4 cups mashed potatoes (Optional)",
  "directions": "1. Cook and stir bacon in a heavy skillet over medium-high heat until bacon is browned and crisp, 3 to 4 minutes. Turn off the heat and transfer bacon into a large stew pot, reserving bacon fat in the skillet. 2. Season beef chuck cubes generously with 1 teaspoon salt and black pepper to taste. Turn heat to high under the skillet and sear beef pieces in the hot fat on both sides until browned, about 5 minutes. Place beef in the stew pot with bacon, leaving fat in the skillet. Turn heat down to medium; cook and stir onions in the retained fat in the skillet until lightly browned, 5 to 8 minutes; season with a large pinch of salt. 3. Cook garlic with onions until soft, about 1 minute. Pour beer into the skillet and stir with a wooden spoon, scraping up and dissolving any browned bits of food into the liquid. Pour cooking liquid from the skillet into the stew pot. Stir in tomato paste, carrots, celery, thyme sprigs, sugar, 1/2 teaspoon black pepper, and enough chicken broth to cover. 4. Bring stew to a gentle simmer, stirring to combine; reduce heat to low and cover pot. Simmer stew until beef is fork-tender, about 2 hours. Stir stew occasionally and skim fat or foam if desired. 5. Remove cover and raise heat to medium-high. Bring stew to a low boil and cook until stew has slightly thickened, 15 to 20 minutes. Remove and discard thyme sprigs and adjust salt and pepper to taste. 6. Arrange mashed potatoes in a ring in a serving bowl; ladle stew into the center of the potatoes.",
  "prep": "30 mins",
  "cook": "2 hrs 30 mins",
  "total": "3 hrs",
  "calories": "528"
},
{
  "url": "https://www.allrecipes.com/recipe/257499/ghormeh-sabzi-persian-herb-stew/",
  "name": "Ghormeh Sabzi (Persian Herb Stew)",
  "rating": "4.9",
  "ratingcount": "17",
  "ingredients": "¼ cup canola oil, divided; 1 large yellow onion, finely chopped; 1 teaspoon ground turmeric; 1 ½ pounds boneless chuck roast, cut into 1 1/2-inch cubes; 1 ½ cups finely chopped spinach; 1 cup finely chopped green onions (green part only); ½ cup finely chopped Italian flat-leaf parsley; ¼ cup finely chopped cilantro; ¼ cup finely chopped chives; ¼ cup finely chopped fenugreek leaves; 1 ½ cups water, or more as needed; salt and ground black pepper to taste; 1  lemon, juiced; 4  dried Persian limes (limoo amani), or more to taste; 1 (15 ounce) can red kidney beans, drained and rinsed",
  "directions": "1. Heat 2 tablespoons oil in a large pot over medium-high heat. Add onion; cook and stir until deep golden brown, 10 to 15 minutes. Stir in turmeric for 1 to 2 minutes. Add chuck cubes; cook until coated in turmeric and browned on all sides, 8 to 10 minutes. 2. Heat remaining 2 tablespoons oil in a separate pot over medium heat. Add spinach, green onions, parsley, cilantro, chives, and fenugreek leaves; cook and stir until deep dark green in color, 5 to 10 minutes. 3. Stir spinach mixture into onion and chuck mixture. Pour in enough water to create a slurry consistency. Season with salt and pepper. Stir in lemon juice. Reduce heat, cover, and simmer stew until greens soften, about 1 hour. 4. Pierce dried limes with a fork; add to stew. Continue simmering until chuck is tender, 30 minutes to 1 hour. Stir in red kidney beans. Cook until flavors combine, about 30 more minutes. Discard dried limes before serving.",
  "prep": "45 mins",
  "cook": "2 hrs 25 mins",
  "total": "3 hrs 10 mins",
  "calories": "344"
},
{
  "url": "https://www.allrecipes.com/recipe/268516/instant-pot-pot-roast/",
  "name": "Instant Pot Pot Roast",
  "rating": "4.5",
  "ratingcount": "71",
  "ingredients": "1 teaspoon salt; 1 teaspoon dried marjoram; 1 teaspoon dried rosemary; 1 teaspoon garlic powder (Optional); 1 teaspoon onion powder; ½ teaspoon ground black pepper; ½ teaspoon paprika (Optional); 1 (3 pound) beef chuck roast, or more to taste; 1 tablespoon vegetable oil; 1 pound baby red potatoes; 4 large carrots, chopped into large chunks; 1 large yellow onion, sliced; 4 cups beef broth; 2 tablespoons Worcestershire sauce",
  "directions": "1. Turn on a multi-functional pressure cooker (such as Instant Pot) and select Sauté function. 2. Combine salt, marjoram, rosemary, garlic powder, onion powder, black pepper, and paprika in a small bowl. Rub mixture all over roast to coat all sides. 3. Drizzle oil into the preheated pot. Wait 30 seconds, then place roast into the pot; do not move the meat, allowing it to sear for 3 or 4 minutes. Turn the roast and sear again, 3 to 4 minutes. Repeat until all sides are browned, about 15 minutes total. 4. Add potatoes, carrots, and onion to the pot. 5. Pour in broth and Worcestershire sauce. 6. Close and lock the lid; set vent to sealing. Select high pressure according to manufacturer's instructions; set timer for 60 minutes for a 3-pound roast or 80 minutes for a 5-pound roast. Allow 10 to 15 minutes for pressure to build. 7. Release pressure using the natural-release method according to manufacturer's instructions for 10 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. 8. Transfer roast, potatoes, carrots, and onions to a platter for serving.",
  "prep": "20 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs 5 mins",
  "calories": "233"
},
{
  "url": "https://www.allrecipes.com/recipe/263037/instant-pot-best-beef-stew/",
  "name": "Instant Pot Best Beef Stew",
  "rating": "4.6",
  "ratingcount": "200",
  "ingredients": "1 tablespoon butter; 1 pound beef chuck, cut into 1-inch cubes; 4  Yukon Gold potatoes, cubed; 1 ½ cups mushrooms, halved; 1  onion, cut into 6 wedges; 2  carrots, cut into 1/2-inch thick slices; 2 cloves garlic, minced; 3 cups beef broth; 1 tablespoon Worcestershire sauce; 1 tablespoon tomato paste; 1 teaspoon salt; ½ teaspoon ground black pepper; ½ teaspoon dried rosemary",
  "directions": "1. Gather all ingredients. 2. Turn on a multi-functional pressure cooker (such as Instant Pot) and select the Sauté function. Melt butter in the pot. Cook beef chuck cubes in batches until browned on all sides, about 5 minutes per batch. 3. Return all beef chuck cubes to the pot. Add potatoes, mushrooms, onion, carrots, and garlic; cover with beef broth. Stir in Worcestershire sauce, tomato paste, salt, pepper, and rosemary. 4. Close and lock the lid. Select Meat/Stew function, according to the manufacturer's instructions; set the timer for 35 minutes. Allow 10 to 15 minutes for pressure to build. 5. Release pressure using the natural-release method, according to the manufacturer's instructions, 10 to 40 minutes. Unlock and remove the lid.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "1 hr 25 mins",
  "calories": "352"
},
{
  "url": "https://www.allrecipes.com/recipe/220059/chef-johns-classic-beef-stroganoff/",
  "name": "Chef John's Classic Beef Stroganoff",
  "rating": "4.8",
  "ratingcount": "712",
  "ingredients": "2 pounds beef chuck roast, cut into 1/2-inch thick strips; salt and pepper to taste; 1 tablespoon vegetable oil; 8 ounces sliced mushrooms; ½ medium onion, sliced or diced; 1 tablespoon butter; 2 cloves garlic, minced; 1 ½ tablespoons all-purpose flour; ½ cup white wine; 2 cups beef broth, divided; ¾ cup creme fraiche; 1 tablespoon fresh chopped chives; salt and pepper to taste",
  "directions": "1. Season beef generously with salt and pepper. 2. Heat oil in a large skillet over high heat until nearly smoking. Stir in beef; cook, stirring constantly, for 6 to 7 minutes, until liquid evaporates and meat browns. 3. Remove meat from the pan and set aside. Stir mushrooms, onions, and butter into the pan; cook and stir over medium heat until vegetables are lightly browned. 4. Add garlic and stir for 30 seconds. Stir in flour; cook for 1 to 2 minutes until incorporated. Stir in wine and 1 cup of broth, scraping the bottom of the pan to release any browned bits. Bring to a simmer and cook until the sauce thickens, about 3 to 4 minutes. 5. Return beef to the pan. Stir in remaining cup of broth; bring to a simmer and cook on low heat for about 1 hour, covered, until beef is tender and sauce is thick. Stir every 20 minutes. 6. Stir in crème fraîche. Stir in chives. Season with salt and pepper to taste. 7. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "307"
},
{
  "url": "https://www.allrecipes.com/recipe/34759/beef-tamales/",
  "name": "Beef Tamales",
  "rating": "4.5",
  "ratingcount": "197",
  "ingredients": "4 pounds boneless chuck roast; 4 cloves garlic; 3 (8 ounce) packages dried corn husks; 4  dried ancho chiles; 2 tablespoons vegetable oil; 2 tablespoons all-purpose flour; 1 cup beef broth; 2 cloves garlic, minced; 2 teaspoons chopped fresh oregano; 1 teaspoon cumin seeds; 1 teaspoon ground cumin; 1 teaspoon red pepper flakes; 1 teaspoon white vinegar; salt to taste; 3 cups lard; 1 tablespoon salt; 9 cups masa harina",
  "directions": "1. Place beef and garlic in a large pot. Cover with cold water and bring to a boil over high heat; reduce heat, cover, and simmer until beef is tender and shreds easily, about 3 1/2 hours. Remove beef from pot, reserving 5 cups cooking liquid and discarding garlic. Allow meat to cool slightly; shred finely with forks. 2. Meanwhile, place corn husks in a large container and cover with warm water; soak, weighed down with an inverted plate and a heavy can, until soft and pliable, about 3 hours. 3. Toast ancho chiles in a cast iron skillet; cool, then remove stems and seeds. Crumble and grind in a clean coffee grinder or with a mortar and pestle. 4. Heat oil in a large skillet; stir in flour and allow to brown slightly. Pour in 1 cup beef broth and stir until smooth. Mix in ground chiles, garlic, oregano, cumin seeds, ground cumin, red pepper flakes, vinegar, and salt. Stir shredded beef into skillet and cover. Let simmer for 45 minutes. 5. Place lard and salt in a large mixing bowl; beat with an electric mixer on high speed until fluffy. Add masa harina and beat at low speed until well mixed. Pour in reserved cooking liquid, a little at a time, until mixture is the consistency of soft cookie dough. 6. Drain water from corn husks. One at a time, flatten out each husk, with the narrow end facing you, and spread approximately 2 tablespoons masa mixture onto the top 2/3 of the husk. Spread about 1 tablespoon of meat mixture down the middle of the masa. Roll up the corn husk starting at one of the long sides. Fold the narrow end of the husk onto the rolled tamale and tie with a piece of butchers' twine. 7. Place tamales in a steamer basket. Steam over boiling water for approximately one hour, until masa is firm and holds its shape, adding more water if needed so the steamer does not boil dry. Serve immediately, allowing each person to unwrap their own tamales.",
  "prep": "30 mins",
  "cook": "4 hrs 30 mins",
  "total": "5 hrs",
  "calories": "347"
},
{
  "url": "https://www.allrecipes.com/recipe/50235/best-beef-dip-ever/",
  "name": "Best Beef Dip Ever",
  "rating": "4.5",
  "ratingcount": "663",
  "ingredients": "4 pounds beef chuck roast; 1 tablespoon minced garlic; 1 tablespoon dried rosemary; 3  bay leaves; 6 cups water; 1 cup soy sauce",
  "directions": "1. Place beef in a slow cooker; season with garlic and rosemary. 2. Add bay leaves; pour in water and soy sauce. Cook on Low for 6 to 10 hours.",
  "prep": "10 mins",
  "cook": "6 hrs",
  "total": "6 hrs 10 mins",
  "calories": "290"
},
{
  "url": "https://www.allrecipes.com/recipe/219046/rich-and-creamy-beef-stroganoff/",
  "name": "Rich and Creamy Beef Stroganoff",
  "rating": "4.7",
  "ratingcount": "961",
  "ingredients": "2 (2 pound) beef chuck roast, cut into 1/2-inch thick strips; ½ cup red wine; 1 teaspoon salt, or more to taste; ½ teaspoon ground black pepper, or more to taste; 1 tablespoon extra-virgin olive oil; ½ cup butter, divided; 1 large onion, diced; 3 cloves garlic, minced; 1 cup sliced mushrooms; ¼ cup all-purpose flour; 1 ⅓ cups beef stock; 1 tablespoon Worcestershire sauce; 2 teaspoons crushed red pepper flakes; 1 teaspoon prepared yellow mustard; 1 (3 ounce) package cream cheese, softened; ⅓ cup sour cream",
  "directions": "1. Place beef into a large bowl. Stir in red wine, salt, and black pepper. Marinate for 10 minutes, then remove beef and pat dry with a paper towel. Reserve remaining marinade. 2. Heat olive oil in a large skillet over medium heat. Stir in beef; cook and stir until browned, 5 to 7 minutes. Transfer beef to a plate, then drain any remaining grease from the skillet. 3. Melt 2 tablespoons butter in the skillet over medium heat. Stir in onion, garlic, and a pinch of salt. Cook and stir until onion is soft and translucent, 3 to 4 minutes. Transfer onion mixture to the plate with beef; set aside. 4. Melt 2 tablespoons butter in the skillet over medium heat. Add mushrooms; cook and stir until tender, about 10 minutes. Transfer mushrooms to a bowl; set aside. 5. Melt 1/4 cup butter in the skillet over medium heat. Whisk in flour; cook and stir until flour no longer tastes raw, about 4 minutes. Slowly whisk in beef stock. Bring to a boil, stirring constantly, then reduce heat to medium-low. 6. Pour in reserved marinade, Worcestershire sauce, red pepper flakes, and mustard, then add beef and onion mixture. Cover and simmer until meat is tender, about 1 hour. Season with salt and black pepper. 7. Stir in mushrooms, cream cheese, and sour cream about 5 minutes before serving.",
  "prep": "15 mins",
  "cook": "1 hr 25 mins",
  "total": "1 hr 50 mins",
  "calories": "567"
},
{
  "url": "https://www.allrecipes.com/recipe/246835/barbacoa-style-shredded-beef/",
  "name": "Barbacoa-Style Shredded Beef",
  "rating": "4.7",
  "ratingcount": "220",
  "ingredients": "1 (3 pound) beef chuck roast, cut into 6 to 8 chunks; salt and ground black pepper to taste; 2 tablespoons vegetable oil; ½ cup beef broth; ¼ cup apple cider vinegar; ¼ cup fresh lime juice; 4  chipotle peppers in adobo sauce, chopped; 5 cloves garlic, chopped; 1 tablespoon ground cumin; 1 tablespoon dried oregano; ¼ teaspoon ground cloves; 3 large bay leaves",
  "directions": "1. Season beef chunks with salt and pepper on all sides. 2. Heat oil in a large skillet over medium-high heat. Working in batches, cook and stir beef until browned, 4 to 5 minutes per batch. Transfer browned beef to a slow cooker. 3. Mix broth, vinegar, lime juice, chipotle peppers, garlic, cumin, oregano, and cloves together in a bowl until well combined. Season mixture with salt and pepper and pour over beef in the slow cooker. Stir in bay leaves. 4. Cook on Low until beef is fork-tender, 8 to 10 hours. Discard bay leaves. Remove beef from the cooker and shred using two forks. 5. Return beef to the slow cooker and stir to coat with sauce. Let marinate for at least 10 minutes before serving.",
  "prep": "35 mins",
  "cook": "8 hrs 10 mins",
  "total": "8 hrs 55 mins",
  "calories": "303"
},
{
  "url": "https://www.allrecipes.com/recipe/238532/weeknight-slow-cooker-chuck-roast/",
  "name": "Weeknight Slow Cooker Chuck Roast",
  "rating": "4.4",
  "ratingcount": "21",
  "ingredients": "1 (4 pound) beef chuck roast; 1 ½ teaspoons sea salt; 1 teaspoon ground black pepper; 2  yellow onions, quartered; 3 cloves garlic, or more to taste; 2 cups beef broth; 1 cup vegetable broth; 3  bay leaves; 3 sprigs thyme, chopped",
  "directions": "1. Season beef chuck roast with sea salt and black pepper; put into the crock of a slow cooker with onion quarters and garlic cloves. Pour beef broth and vegetable broth over the roast. Lay bay leaves and thyme atop the roast. 2. Cook on Low for 7 to 8 hours.",
  "prep": "15 mins",
  "cook": "7 hrs",
  "total": "7 hrs 15 mins",
  "calories": "372"
},
{
  "url": "https://www.allrecipes.com/recipe/45386/chile-colorado/",
  "name": "Chile Colorado",
  "rating": "4.6",
  "ratingcount": "147",
  "ingredients": "9  New Mexico dry chiles - washed, with stems and seeds removed; 3 cups water; 5 pounds boneless beef chuck roast, trimmed of fat; ½ cup all-purpose flour; 1 tablespoon kosher salt; 1 tablespoon black pepper; 3 tablespoons olive oil; 1 large yellow onion, chopped; 2 cups beef stock, or as needed",
  "directions": "1. Gather all ingredients. 2. Place chiles and 3 cups water into a medium stockpot, and bring to a boil. Remove from heat and steep for 30 minutes to soften. 3. Strain into a bowl, reserving the cooking liquid. 4. Place chiles and some of the liquid into a blender, and purée until smooth. Add more liquid as necessary to form a smooth sauce. 5. Pass sauce through a fine mesh strainer to remove any seeds or tough skins; set aside. 6. Cut beef into 1- to 2-inch chunks. Combine flour, salt, and pepper in a medium bowl. Dredge beef chunks in the seasoned flour; set aside. 7. Heat olive oil in a large pot over medium heat. Sauté onion until tender and translucent, about 5 minutes. 8. Add beef chunks a few at a time, so as not to overcrowd the pot, and cook until evenly brown. Remove seared meat, and continue browning the remaining meat. Return reserved seared meat to the pot. 9. Stir in puréed chile mixture. Add beef stock just to cover beef chunks, or to personal preference. Bring to a boil over medium heat. Reduce heat to lowest setting, and simmer for 3 hours, or until meat is tender. If necessary, adjust with more stock during cooking.",
  "prep": "20 mins",
  "cook": "3 hrs 10 mins",
  "total": "3 hrs 30 mins",
  "calories": "544"
},
{
  "url": "https://www.allrecipes.com/recipe/281868/moist-slow-cooker-roast-beef-without-vegetables/",
  "name": "Moist Slow Cooker Roast Beef Without Vegetables",
  "rating": "4.8",
  "ratingcount": "10",
  "ingredients": "1 (2 1/2 pound) boneless beef chuck roast; 1 pinch garlic salt, or to taste; ground black pepper to taste; 3 tablespoons Worcestershire sauce; 3 tablespoons soy sauce; 1 tablespoon red wine vinegar; ½ (1 ounce) package dry onion soup mix; 1 ½ cups water; 1 tablespoon cornstarch, or as needed",
  "directions": "1. Rub beef roast with garlic salt and black pepper. Place roast in the bottom of a slow cooker. 2. Mix together Worcestershire, soy sauce, and red wine vinegar in a small bowl; pour over roast. Sprinkle onion soup mix over roast. Pour water into the slow cooker around roast, not over the top. 3. Cover and cook on Low until no longer pink in the center and meat is fork tender, 4 to 6 hours. 4. Transfer sauce from the slow cooker into a saucepan. Warm over medium heat until bubbling, then mix in cornstarch to thicken.",
  "prep": "10 mins",
  "cook": "4 hrs 5 mins",
  "total": "4 hrs 15 mins",
  "calories": "232"
},
{
  "url": "https://www.allrecipes.com/recipe/265338/birria-de-res-tacos-beef-birria-tacos/",
  "name": "Birria de Res Tacos (Beef Birria Tacos)",
  "rating": "4.8",
  "ratingcount": "24",
  "ingredients": "6  dried guajillo chile peppers, seeded; 4  dried chile de arbol peppers, stemmed and seeded; 2  dried ancho chiles, stemmed and seeded; 1 tablespoon olive oil, or as needed; 4 medium Roma tomatoes; 2 tablespoons white vinegar; 2 cloves garlic; 2 teaspoons ground black pepper; 4  whole cloves; 1 pinch ground cinnamon; 1 pinch ground cumin; 1 pinch ground thyme; 1 pinch dried marjoram; 1 pinch dried oregano; 1 pinch salt; 4 pounds beef chuck roast; salt and freshly ground black pepper to taste; 18  corn tortillas; 1 large white onion, finely chopped; 1 bunch fresh cilantro, chopped; 1 cup shredded queso asadero (white Mexican cheese) (Optional)",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Fill a pot with water and bring to a boil. 2. Start the sauce: Add guajillo, arbol, and ancho chile peppers to the boiling water; boil for 5 minutes. Remove pot from the heat and allow peppers to soak until cool. Drain, reserving 1/4 cup of the cooking water. 3. Meanwhile, sear the meat: Rinse beef and pat dry with paper towels. Cut beef into chunks if desired, and season with salt and pepper. 4. Heat oil in a Dutch oven over medium-high heat. Add beef and cook until browned on all sides, about 10 minutes. Remove from the heat. 5. While the beef is searing, continue the sauce: Line a heavy cast-iron grill pan or griddle with aluminum foil and place over high heat. Arrange tomatoes in a single layer on top. Grill until tomato skin is burned on all sides and begins to peel, 3 to 5 minutes. 6. Place cooled chile peppers into a blender. Add vinegar, garlic, 2 teaspoons black pepper, cloves, cinnamon, cumin, thyme, marjoram, oregano, and salt in a blender. Pour in the reserved 1/4 cup of chile water and blend until smooth. 7. Strain chile sauce through a mesh strainer and pour over browned meat in the Dutch oven, turning the roast so it is completely covered with sauce; cover with a lid. 8. Bake in the preheated oven, basting meat every 45 minutes with sauce, until birria begins to fall apart, 3 to 4 hours. Remove the lid and bake, uncovered, until birria is crispy on top, about 20 minutes. Remove from oven, cover with 2 layers of aluminum foil, and allow to rest in a warm area for 10 minutes. 9. Remove meat to a cutting board and strain off any fat from the sauce. Shred meat with two forks, then return meat to the pot and stir with the sauce to combine. 10. Assemble and heat tacos: Fill each tortilla with birria and top with Mexican cheese, chopped onion, and cilantro. Warm tortillas on a griddle, flipping until both sides are crispy and cheese is melted. 11. Serve with extra sauce on the side for dipping.",
  "prep": "20 mins",
  "cook": "3 hrs 45 mins",
  "total": "4 hrs 15 mins",
  "calories": "268"
},
{
  "url": "https://www.allrecipes.com/recipe/238445/slow-cooker-roast-beef-in-its-own-gravy/",
  "name": "Slow Cooker Roast Beef in its own Gravy",
  "rating": "4.8",
  "ratingcount": "47",
  "ingredients": "1 pound baby red potatoes, halved; 1 (16 ounce) package baby carrots; 1  yellow onion, quartered; 1 (10 ounce) can condensed cream of celery soup; 1 (1.5 ounce) package beef stew seasoning mix; 1 (3 pound) beef chuck roast; 1 (1 ounce) envelope onion soup mix (such as Lipton® Beefy Onion)",
  "directions": "1. Arrange potatoes, carrots, and onion around the edges of a 5- to 6-quart slow cooker. 2. Whisk celery soup and beef stew seasoning mix together in a bowl until smooth and creamy. 3. Heat a saucepan over medium-high heat; cook roast until browned and seared, about 3 minutes per side. Sprinkle onion soup mix over entire roast and place roast in the center of the slow cooker, surrounding it with the vegetable mixture. Spread celery soup mixture over roast. 4. Cook on Low, 8 to 10 hours. 5. Remove roast from the slow cooker and place on cutting board; let rest for 10 minutes. 6. Strain remaining liquid in the slow cooker into a bowl and whisk until smooth, about 1 minute. 7. Slice roast and serve alongside vegetables and gravy.",
  "prep": "10 mins",
  "cook": "8 hrs 10 mins",
  "total": "8 hrs 30 mins",
  "calories": "332"
},
{
  "url": "https://www.allrecipes.com/recipe/238038/chef-johns-meatball-inspired-meatloaf/",
  "name": "Chef John's Meatball-Inspired Meatloaf",
  "rating": "4.7",
  "ratingcount": "114",
  "ingredients": "1 tablespoon olive oil; 1 tablespoon butter; 1  onion, diced; salt to taste; 4 cloves garlic, minced; 1 ½ cups very dry white bread crumbs; 1 ½ cups milk; 2 pounds ground chuck; ½ cup chopped fresh flat-leaf parsley; 2 ounces grated Parmesan cheese; 2  large eggs, beaten; 2 teaspoons salt; 1 teaspoon freshly ground black pepper; 1 pinch cayenne pepper, or to taste; 3 cups tomato sauce, or to taste",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish. 2. Heat olive oil and butter together in a large skillet over medium-high heat. Saute onion with a pinch of salt in hot oil and butter until onion is golden brown and soft, 5 to 10 minutes. Add garlic and saute until fragrant, about 30 seconds. Remove skillet from heat and cool onion mixture to room temperature. 3. Place bread crumbs in a large bowl. Add milk and stir with a fork until combined. Let sit until all of the milk is absorbed into the breadcrumbs, 15 to 20 minutes. 4. Combine ground chuck, cooled onion mixture, parsley, Parmesan cheese, eggs, 2 teaspoons salt, black pepper, and cayenne pepper in a bowl. Grab a handful of breadcrumbs and squeeze very gently to remove excess milk. Repeat with remaining breadcrumbs, transfer breadcrumbs to ground chuck mixture, and discard excess milk. Stir ground chuck mixture until evenly combined. 5. Turn chuck mixture out into prepared baking dish, and shape meat into a 3x4x10-inch meatloaf. Pour tomato sauce over the loaf and into the bottom of the dish. 6. Bake in the preheated oven until no longer pink in the center, about 1 hour 10 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Let meatloaf rest for at least 10 minutes before slicing.",
  "prep": "20 mins",
  "cook": "1 hr 15 mins",
  "total": "2 hrs",
  "calories": "286"
},
{
  "url": "https://www.allrecipes.com/recipe/262069/hamburger-stroganoff/",
  "name": "Hamburger Stroganoff",
  "rating": "4.4",
  "ratingcount": "34",
  "ingredients": "1 pound ground beef chuck; 1 (8 ounce) package sliced fresh mushrooms; 1 medium onion, chopped; 2 cloves garlic, minced; 2 tablespoons all-purpose flour; 1 (14 ounce) can beef broth; 1 (10.5 ounce) can condensed cream of mushroom soup; 2 tablespoons Worcestershire sauce; 1 teaspoon ground black pepper; ½ teaspoon salt; 1 (12 ounce) package egg noodles; 1 cup sour cream; 2 teaspoons finely grated raw horseradish (Optional)",
  "directions": "1. Cook and stir beef, mushrooms, onion, and garlic in a large nonstick skillet over medium-high heat until beef is browned and crumbly, 6 to 8 minutes. Add flour; cook and stir until combined, about 2 minutes. Stir in broth, condensed soup, Worcestershire sauce, pepper, and salt; bring to a boil. Reduce the heat and simmer, stirring occasionally, until flavors blend, about 15 minutes. 2. When you reduce the heat, bring a large pot of lightly salted water to a boil. Add egg noodles, return to a boil, and cook, uncovered and stirring occasionally, until tender yet firm to the bite, about 6 minutes. Drain and keep warm. 3. Mix sour cream and horseradish together in a bowl. Stir into beef mixture and cook until hot, about 5 minutes. Serve over egg noodles.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "737"
},
{
  "url": "https://www.allrecipes.com/recipe/271149/bobbys-smoked-chuck-roast/",
  "name": "Bobby's Smoked Chuck Roast",
  "rating": "5.0",
  "ratingcount": "11",
  "ingredients": "1 tablespoon salt; 1 tablespoon ground black pepper; 1 tablespoon garlic powder; 1 tablespoon Montreal steak seasoning; 1 (3 pound) chuck roast, or more to taste; ½ cup barbeque sauce; ¼ cup brown sugar",
  "directions": "1. Preheat a smoker to 275 degrees F (135 degrees C). 2. Combine salt, pepper, garlic powder, and steak seasoning in a bowl. Rub mixture evenly over the roast and place in a baking pan. 3. Cook roast in the smoker until meat reaches an internal temperature of 165 degrees F (74 degrees C), 4 to 4 1/2 hours. Wrap roast in aluminum foil and continue smoking until meat reaches an internal temperature of 195 degrees F (90 degrees C), about 1 hour more. 4. Remove roast from smoker and let sit for 20 minutes. Leave smoker on. 5. Cut meat into cubes and return to the baking dish. Add barbeque sauce and brown sugar. 6. Smoke meat for 1 1/2 to 2 hours more.",
  "prep": "10 mins",
  "cook": "6 hrs 30 mins",
  "total": "7 hrs",
  "calories": "209"
},
{
  "url": "https://www.allrecipes.com/recipe/244700/beef-and-vegetable-soup/",
  "name": "Beef and Vegetable Soup",
  "rating": "4.7",
  "ratingcount": "32",
  "ingredients": "½ pound boneless beef chuck roast, cut into 1/2-inch pieces; 1 tablespoon olive oil; 2 cups cubed unpeeled Yukon Gold potatoes; 2 medium carrots, peeled, cut in half lengthwise and sliced; 1 tablespoon all-purpose flour; 1 (32 ounce) carton Swanson® Lower Sodium Beef Broth; 2 tablespoons tomato paste; 1 teaspoon chopped fresh thyme leaves; 1 cup green beans, trimmed and cut into 1/2-inch pieces; 1 cup frozen peas",
  "directions": "1. Season the beef as desired. 2. Heat the oil in a 4-quart saucepan over medium-high heat. Add the beef and cook until browned, stirring often. 3. Add the potatoes and carrots to the saucepan and cook for 5 minutes or until tender, stirring occasionally. Add the flour and cook and stir for 1 minute. 4. Stir in the broth, tomato paste and thyme and heat to a boil. Reduce the heat to medium-low. Cover and cook for 40 minutes or until the beef is tender, adding the green beans and peas for the last 20 minutes of the cooking time. Season as desired.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "168"
},
{
  "url": "https://www.allrecipes.com/recipe/221360/kates-easy-german-sauerbraten/",
  "name": "Kate's Easy German Sauerbraten",
  "rating": "4.6",
  "ratingcount": "57",
  "ingredients": "2 cups water; 1 cup red wine; 1 cup cider vinegar; 1  lemon, sliced; ½ large onion, diced; 1 clove garlic, diced; 10  whole cloves; 2  bay leaves; 2 tablespoons white sugar; 2 tablespoons salt; 1 tablespoon juniper berries, crushed (Optional); 1 teaspoon whole peppercorns; 1 (4 pound) boneless beef chuck roast; 2 cups chopped onions; 2 cups chopped carrots; 1 cup diced celery; 8  gingersnap cookies, crushed",
  "directions": "1. Heat water, red wine, cider vinegar, lemon, 1/2 onion, garlic, cloves, bay leaves, white sugar, salt, juniper berries, and peppercorns in a saucepan over medium heat until sugar is dissolved, about 5 minutes. Allow marinade to cool and pour into a resealable plastic bag. Add beef roast, coat with marinade, squeeze out excess air, and seal bag. Marinate in the refrigerator 2 to 3 days, turning the roast twice a day. 2. Place onions, carrots, and celery in a slow cooker. Remove roast from marinade and place atop vegetables. Strain marinade and pour 2 1/2 cups over roast; reserve remaining marinade. 3. Cover and cook roast on Low for 8 hours. Turn slow cooker off. Transfer roast to a cutting board and cover with aluminum foil. Strain cooking liquid into a large bowl and return vegetables to slow cooker to rest. 4. Heat about 3 cups cooking liquid and gingersnaps in a saucepan over medium-high heat, adding reserved marinade as needed, until gravy is thickened, about 10 minutes. 5. Slice roast and serve with vegetables and gravy.",
  "prep": "30 mins",
  "cook": "8 hrs 20 mins",
  "total": "2 days 8 hrs 50 mins",
  "calories": "460"
},
{
  "url": "https://www.allrecipes.com/recipe/264982/instant-pot-mississippi-roast/",
  "name": "Instant Pot® Mississippi Roast",
  "rating": "4.8",
  "ratingcount": "32",
  "ingredients": "1 (14 ounce) can beef broth; 3 ½ pounds beef chuck roast, cut into 3 or 4 chunks; 1 stick butter; ½ (16 ounce) jar pepperoncini peppers and juice; 1 (1 ounce) package ranch dressing mix; 1 (1 ounce) package dry onion soup mix",
  "directions": "1. Pour broth into a multi-functional pressure cooker (such as Instant Pot®). Place beef in the pot and sprinkle with ranch dressing mix and onion soup mix. Place butter on top. Add pepperoncinis and juice. 2. Close and lock the pressure cooker lid. Select high pressure according to manufacturer's instructions; set timer for 110 minutes. Allow 10 to 15 minutes for pressure to build. 3. Release pressure using the natural-release method according to manufacturer's instructions, 10 to 40 minutes.",
  "prep": "5 mins",
  "cook": "1 hr 50 mins",
  "total": "2 hrs 5 mins",
  "calories": "343"
},
{
  "url": "https://www.allrecipes.com/recipe/215565/make-ahead-slow-cooker-beef-stew/",
  "name": "Make-Ahead Slow Cooker Beef Stew",
  "rating": "4.7",
  "ratingcount": "357",
  "ingredients": "⅓ cup all-purpose flour; 1 teaspoon Spanish smoked paprika; ½ teaspoon seasoned salt; ½ teaspoon ground black pepper; 2 pounds beef chuck, cut into 1-inch cubes; 1 tablespoon olive oil; 1  onion, chopped; 1 (8 ounce) package mushrooms, chopped; 3  potatoes, diced; 5  carrots, sliced; 2 stalks celery, chopped; 2 cloves garlic, minced; ¼ cup Marsala wine; 1 tablespoon Worcestershire sauce; 3 (10.5 ounce) cans organic beef broth; 1 (14.5 ounce) can crushed tomatoes; 1 (1 ounce) package dry onion soup mix; 1 teaspoon Spanish smoked paprika, or to taste; salt and ground black pepper to taste; 2 tablespoons cornstarch (Optional); 2 tablespoons water (Optional)",
  "directions": "1. Combine the flour, 1 teaspoon smoked paprika, seasoned salt, and 1/2 teaspoon black pepper in a large, resealable plastic bag. Add the beef, and seal the bag. Shake the bag thoroughly to coat the beef with seasoned flour. 2. Heat the olive oil in a large skillet over medium-high heat. Shake the excess seasoning off the beef, then stir the beef into the hot skillet with the onion and mushrooms. Cook and stir until the beef is evenly browned and no longer pink. Drain and discard any excess grease. 3. Place the beef mixture into a slow cooker. Place the potatoes, carrots, celery, garlic, Marsala wine, and Worcestershire sauce into the cooker with the beef mixture. Pour the beef broth and tomatoes into the cooker, and stir in the onion soup mix and 1 more teaspoon of smoked paprika. Cook on High for 4 to 6 hours, or on Low for 10 to 12 hours. Season to taste with salt and black pepper. 4. For a thicker stew, combine cornstarch and water in a small bowl. Gradually stir the mixture into the stew until thickened.",
  "prep": "30 mins",
  "cook": "4 hrs",
  "total": "4 hrs 30 mins",
  "calories": "467"
},
{
  "url": "https://www.allrecipes.com/recipe/281196/paulas-dutch-oven-pot-roast/",
  "name": "Paula's Dutch Oven Pot Roast",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "1 (2 pound) boneless beef chuck roast; 1 pinch salt and ground black pepper to taste; ¼ cup all-purpose flour, or as needed; ½ cup vegetable oil (such as Wesson®); 2 (14 ounce) cans beef broth; ⅔ cup dry white wine; 1 medium onion, chopped; 1 (1.25 ounce) package beef with onion soup mix; 1 teaspoon dried marjoram; 4 dashes Worcestershire sauce; 2  bay leaves; 2 cups water to cover; 1 (16 ounce) package baby carrots; 2 medium potatoes, peeled and quartered, or more to taste",
  "directions": "1. Season roast with salt and pepper and coat with 2 tablespoons flour. Heat oil in a large 6- to 8-quart Dutch oven. Brown the roast on all sides in the hot oil, 5 to 7 minutes. Stir in remaining flour to absorb remaining oil. Add beef broth, wine, onion, soup mix, marjoram, Worcestershire, and bay leaves. Add enough water to cover. 2. Cover and simmer on medium-low heat until tender, about 2 hours. Add carrots and potatoes. Continue to cook until vegetables are tender, about 1 hour. If gravy is too thin, uncover and continue to simmer until liquid evaporates and gravy thickens, about 20 minutes more. Remove bay leaves from gravy when serving.",
  "prep": "20 mins",
  "cook": "3 hrs 5 mins",
  "total": "3 hrs 25 mins",
  "calories": "410"
},
{
  "url": "https://www.allrecipes.com/recipe/231751/guinness-irish-stew/",
  "name": "Guinness Irish Stew",
  "rating": "4.3",
  "ratingcount": "27",
  "ingredients": "4 pounds boneless beef chuck, cut into 1-1/2-inch pieces; 2 tablespoons vegetable oil; ¼ cup all-purpose flour; 2 pinches salt and ground black pepper, or to taste; 2 pinches cayenne pepper; ¼ cup vegetable oil; 2  yellow onions, chopped; 4 cloves garlic, crushed; ¼ cup tomato paste; 1 teaspoon water, or as needed; 3 cups Irish stout beer (such as Guinness®), divided; 2 sprigs fresh thyme; 4 large potatoes, chopped; 2 cups chopped carrot; 2 tablespoons chopped fresh parsley",
  "directions": "1. Toss beef cubes with 2 tablespoons vegetable oil in a bowl. 2. Whisk flour, salt, black pepper, and cayenne pepper in a separate bowl. Dredge beef cubes through flour mixture until evenly coated. 3. Heat 1/4 cup vegetable oil in a large skillet over medium-high heat; cook and stir coated beef cubes, working in batches, until beef is browned on all sides, 5 to 10 minutes. Transfer browned beef to a Dutch oven or heavy-bottomed pot. 4. Cook and stir onions and garlic in the same skillet used for browning beef until lightly browned, 5 to 10 minutes. 5. Stir tomato paste with enough water to partially dilute; pour into onion mixture. Stir to blend. Reduce heat to medium, cover Dutch oven, and simmer for 5 minutes. 6. Pour half the Irish stout into the onion mixture, and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Transfer entire mixture to the browned beef. Pour remaining half of Irish stout into beef mixture; add thyme. 7. Cover Dutch oven, reduce heat to low, and simmer for 2 hours. Add potatoes and carrots and simmer, stirring every 20 minutes, until potatoes are soft, about 1 hour. Adjust salt as needed; garnish with parsley.",
  "prep": "20 mins",
  "cook": "3 hrs 15 mins",
  "total": "3 hrs 35 mins",
  "calories": "527"
}]