[{
  "url": "https://www.allrecipes.com/recipe/281688/texas-twinkies/",
  "name": "Texas Twinkies",
  "rating": "4.6",
  "ratingcount": "7",
  "ingredients": "12 medium jalapeño peppers; 12 tablespoons cream cheese, softened; 1 ½ pounds cooked chopped brisket; 12 slices thick-cut bacon; kosher salt and ground black pepper to taste; ½ (12 ounce) bottle BBQ sauce",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Slice jalapeños in the shape of a \"T.\" Cut a straight vertical line from top to bottom with a crosscut directly under the stem, making sure to cut only halfway through the jalapeños. Use a spoon to remove and discard all seeds and membranes. Place jalapeños on a baking sheet. 3. Bake in the preheated oven for 10 minutes. 4. Transfer jalapeños to a bowl of ice water for a few minutes to extract the rest of the seeds' oil. Blot dry with a paper towel. 5. Increase oven temperature to 350 degrees F (175 degrees C). 6. Spread 1 tablespoon cream cheese inside each jalapeño. Place about 2 ounces brisket inside each, then wrap with a slice of bacon. Place poppers on a baking sheet and season with salt and pepper. 7. Bake in the preheated oven for 30 minutes. Remove from the oven and brush the tops with BBQ sauce. Return to the oven and bake 5 more minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "212"
},
{
  "url": "https://www.allrecipes.com/recipe/84270/slow-cooker-corned-beef-and-cabbage/",
  "name": "Slow-Cooker Corned Beef and Cabbage",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "10  baby red potatoes, quartered; 4 large carrots, peeled and cut into matchstick pieces; 1  onion, peeled and cut into bite-sized pieces; 4 cups water; 1 (4 pound) corned beef brisket with spice packet; 6 ounces beer; ½ head cabbage, coarsely chopped",
  "directions": "1. Place potatoes, carrots, and onion into the bottom of a slow cooker; add water and place brisket on top of vegetables. Pour beer over brisket; sprinkle over spices from the packet and cover. 2. Cook on High for 7 hours; stir in the cabbage and cook for 1 more hour.",
  "prep": "15 mins",
  "cook": "8 hrs",
  "total": "8 hrs 15 mins",
  "calories": "473"
},
{
  "url": "https://www.allrecipes.com/recipe/221900/easy-homemade-pastrami/",
  "name": "Easy Homemade Pastrami",
  "rating": "4.6",
  "ratingcount": "69",
  "ingredients": "½ cup vegetable oil; 2 cloves garlic, crushed; ¼ cup coarsely ground fresh black pepper; 2 tablespoons smoked paprika; 2 teaspoons ground coriander; 1 teaspoon dry mustard; ½ teaspoon ground white pepper; ¼ teaspoon cayenne pepper; 4 pounds corned beef brisket",
  "directions": "1. Mix vegetable oil and garlic in a small bowl; set aside for 1 hour. 2. Preheat the oven to 225 degrees F (110 degrees C). 3. Combine black pepper, paprika, coriander, dry mustard, white pepper, and cayenne pepper in a large bowl; set aside. 4. Cover a baking sheet with a large sheet of heavy-duty aluminum foil; coat with prepared garlic oil. Lay beef brisket on the oiled foil sheet and brush with remaining garlic oil. Cover brisket completely with pepper mixture, reserving 1 to 2 tablespoons. 5. Wrap brisket, fat-side up, in the sheet of foil. Place wrapped corned beef on another sheet of aluminum foil with the seam- and fat-sides down. Place double-wrapped brisket, seam-side down, on a third sheet of aluminum foil; wrap again. 6. Bake in the preheated oven for 6 hours. 7. Remove pastrami from the oven and let cool to room temperature, about 3 hours. Do not remove the foil. 8. Place foil-wrapped pastrami in a freezer bag or other plastic bag; refrigerate for 8 to 10 hours. 9. Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Line a baking sheet with aluminum foil. 10. Remove pastrami from the refrigerator, unwrap, and place on the prepared baking sheet. Sprinkle top with 1 to 2 tablespoons remaining pepper mixture. 11. Place pastrami under the broiler and cook until surface browns, 3 to 4 minutes. Remove pastrami from the oven and cut into thin slices, about 1/8-inch thick. 12. Heat a large skillet over low heat; warm pastrami slices in the skillet with a few drops of water until fat turns translucent, about 5 minutes.",
  "prep": "40 mins",
  "cook": "6 hrs 10 mins",
  "total": "18 hrs 50 mins",
  "calories": "4709"
},
{
  "url": "https://www.allrecipes.com/recipe/232137/slow-cooker-texas-smoked-beef-brisket/",
  "name": "Slow Cooker Texas Smoked Beef Brisket",
  "rating": "4.3",
  "ratingcount": "107",
  "ingredients": "3 tablespoons smoked paprika; 2 tablespoons ground black pepper; 2 tablespoons kosher salt; 1 tablespoon brown sugar; 1 tablespoon chili powder; 1 teaspoon ground cumin; 1 ½ pounds beef brisket; ¾ cup barbeque sauce; ¼ cup water (Optional); 1 tablespoon Worcestershire sauce; ¼ teaspoon liquid smoke flavoring; ½  onion, sliced into rings",
  "directions": "1. Gather all ingredients. 2. Prepare brisket rub: Mix paprika, pepper, salt, brown sugar, chili powder, and cumin together in a bowl; rub evenly over brisket. Put brisket in a large, resealable plastic bag; refrigerate for 30 minutes to overnight. 3. When ready to cook, prepare barbeque sauce: Stir barbeque sauce, water, Worcestershire sauce, and liquid smoke together in the bottom of a slow cooker. 4. Remove brisket from the refrigerator and take out of the bag. Lay brisket in sauce in the slow cooker and arrange onions over top. 5. Cook on Low until brisket is very tender, 6 to 7 hours. 6. Rest brisket 10 minutes before slicing or shredding; serve with sauce from the slow cooker.",
  "prep": "10 mins",
  "cook": "6 hrs",
  "total": "6 hrs 50 mins",
  "calories": "342"
},
{
  "url": "https://www.allrecipes.com/recipe/30918/irish-boiled-dinner-corned-beef/",
  "name": "Irish Boiled Dinner (Corned Beef)",
  "rating": "4.7",
  "ratingcount": "169",
  "ingredients": "1 (5 1/2 pound) corned beef brisket; 2 large onions; 10  carrots, cut into 1 inch pieces; 2 heads cabbage, cored and cut into wedges; 15 small white (Irish) potatoes",
  "directions": "1. Gather all ingredients. 2. Rinse brisket under cold water and place in a large pot. Add enough water to cover roast by 6 inches. 3. Peel onions and place them in the pot. Bring to a boil; cook for about 30 minutes at a rolling boil. Reduce heat to medium-low, so water is at a gentle boil. Cover and cook for 3 1/2 hours. 4. Remove onions and cut them into wedges. Return them to the pot. Add carrots to the pot, then place cabbage over roast. Place potatoes on top of cabbage. Cover and cook until potatoes are tender, about 30 minutes more. The potatoes should be immersed in the water by now, but if not, keep the lid on so they can steam. 5. Remove vegetables from the pot and place in a separate serving bowl. Keep corned beef in the pot until ready to slice and serve because it dries out quickly.",
  "prep": "15 mins",
  "cook": "4 hrs 30 mins",
  "total": "4 hrs 45 mins",
  "calories": "918"
},
{
  "url": "https://www.allrecipes.com/recipe/216981/deluxe-corned-beef-hash/",
  "name": "Deluxe Corned Beef Hash",
  "rating": "4.7",
  "ratingcount": "212",
  "ingredients": "2 tablespoons butter; 2 tablespoons extra-virgin olive oil; 1 large onion, chopped; 5 large Yukon Gold potatoes, peeled and cut into 1/4-inch cubes; 1 large carrot, coarsely shredded; 2 pounds cooked corned beef, cubed; 2 tablespoons chopped fresh parsley; ½ teaspoon ground black pepper, or to taste; ¼ teaspoon dried thyme leaves; 1 pinch salt to taste",
  "directions": "1. Melt butter with olive oil in a large skillet over medium heat. Cook and stir onion until lightly browned, about 8 minutes. Stir in potatoes and carrot; cook, stirring occasionally, until tender, about 15 minutes. 2. Stir in corned beef, parsley, pepper, thyme, and salt. Cook, stirring often, until hash is crisp and browned, 10 to 15 more minutes.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "320"
},
{
  "url": "https://www.allrecipes.com/recipe/83646/corned-beef-roast/",
  "name": "Corned Beef Roast",
  "rating": "4.4",
  "ratingcount": "68",
  "ingredients": "1 (5 1/2 pound) corned beef brisket with spice packet; 7 small potatoes, peeled and diced; 4 medium carrots, peeled and diced; 1 medium onion, diced; 3 cloves garlic, chopped",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Place corned beef brisket in the center of a roasting pan. Arrange potatoes and carrots around the sides, then scatter onion and garlic over top. Sprinkle seasoning packet over beef, then pour in water until potatoes are almost covered. Cover with a lid or heavy aluminum foil. 3. Roast in the preheated oven until corned beef is so tender it can be flaked apart with a fork, about 5 to 6 hours.",
  "prep": "15 mins",
  "cook": "5 hrs",
  "total": "5 hrs 15 mins",
  "calories": "465"
},
{
  "url": "https://www.allrecipes.com/recipe/8524756/sous-vide-beef-brisket-with-ancho-chili-sauce/",
  "name": "Sous Vide Beef Brisket with Ancho Chili Sauce",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "1 (6 pound) beef brisket; 2 tablespoons kosher salt; 2 teaspoons onion powder; 2 teaspoons garlic powder; 1 teaspoon smoked paprika; 1 teaspoon ground black pepper; 2 ounces dried ancho chiles (about 4 medium dried chiles); ¼ cup canola oil, divided; 2 cups chopped red onion; 4 medium garlic cloves, peeled and smashed; 2 tablespoons tomato paste; ¾ cup dry red wine; ½ cup ketchup; ¼ cup melted unsalted butter; 1 tablespoon sherry vinegar; ½ teaspoon cayenne pepper or hot sauce, as desired (Optional)",
  "directions": "1. Prepare a thermocirculator and water bath according to manufacturer's directions. Set thermocirculator to 128 degrees F (53 degrees C) and allow water bath to come up to temperature. 2. While water heats, trim excess fat from the fat cap of the brisket to about 1/4 inch. Do not remove all the fat, as this will contribute to keeping the meat juicy. Pat brisket dry with a paper towel. 3. Combine salt, onion powder, garlic powder, smoked paprika and pepper in a small bowl. Completely cover all sides of the brisket with the spice mixture. 4. Place the brisket in a large vacuum sealable bag. Seal bag according to manufacturer's directions. Transfer vacuum sealed brisket to warm water bath with thermocirculator, cover vessel with aluminum foil to reduce evaporation, and cook undisturbed for 48 hours. Remove brisket from bag, reserving cooking liquid (you should have about 3 ½ cups cooking liquid). Strain cooking liquid through a fine mesh sieve and discard any solids. Set brisket aside on a plate or cutting board. 5. Place dried ancho chiles in a large, dry saucepan over medium high heat. Cook, turning often, until chiles are blistered, and aromatic. Remove chiles from heat and allow to cool briefly. Once chiles have cooled enough to handle, remove stems and seeds, and tear chiles into 2-inch pieces. Place torn chiles in a medium bowl with 1 cup of boiling water and 2 cups of strained, reserved cooking liquid; allow to stand until chiles have softened, about 10 minutes. 6. Meanwhile, heat 2 tablespoons canola oil in the same saucepan over medium-high heat. Add onions and smashed garlic cloves; cook, stirring often, until onions and garlic have softened, about 5 minutes. Add tomato paste and cook, stirring often, for 1 minute. Add red wine and allow mixture to reduce until most of the liquid excep tfor about 1/4 cup has evaporated, stirring occasionally. Remove from heat. 7. Remove softened chiles from liquid, and strain liquid through a fine mesh sieve, reserving 1/2 cup of the strained liquid. Combine softened chiles, 1/2 cup reserved liquid, onion mixture, and ketchup in a blender; blend until smooth. Add unsalted butter and sherry vinegar to the mixture and process until smooth. If you want a spicier sauce, add cayenne pepper or hot sauce to taste. 8. Preheat a grill or grill pan to medium high (350 degrees F to 400 degrees F / 175 degrees C to 200 degrees C). 9. Pat brisket dry with paper towels and rub with remaining 2 tablespoons oil. Place on the preheated grill and grill until grill marks appear, the outside is slightly charred, and the brisket is heated through, about 5 minutes per side. 10. Transfer brisket to a cutting board, let stand for 5 minutes to rest, and slice thinly against the grain of the meat and serve hot with sauce.",
  "prep": "30 mins",
  "cook": "2 days",
  "total": "2 days 55 mins",
  "calories": "1239"
},
{
  "url": "https://www.allrecipes.com/recipe/16310/corned-beef-and-cabbage-i/",
  "name": "Corned Beef and Cabbage",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 (3 pound) corned beef brisket with spice packet; 10 small red potatoes; 5 medium carrots; 1 large head cabbage",
  "directions": "1. Gather all ingredients. 2. Place corned beef in a Dutch oven and cover with water. Add spice packet, cover, and bring to a boil. Reduce heat and simmer until corned beef is just about fork-tender, about 2 hours. 3. While the corned beef is simmering, cut potatoes in half. Peel carrots and cut into 3-inch pieces. Cut cabbage into small wedges. 4. When corned beef has cooked for 2 hours, add potatoes and carrots; cook until vegetables are almost tender and meat is fork-tender, about 10 minutes. Add cabbage and cook until tender, about 15 more minutes. 5. Remove meat and let rest for 15 minutes. Leave broth and vegetables in the Dutch oven.Slice meat across the grain. Serve with vegetables and broth.",
  "prep": "",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 30 mins",
  "calories": "839"
},
{
  "url": "https://www.allrecipes.com/recipe/273034/easy-baked-beef-brisket/",
  "name": "Easy Baked Beef Brisket",
  "rating": "4.8",
  "ratingcount": "77",
  "ingredients": "3 pounds first-cut brisket (or flat-cut), trimmed of fat; 4 teaspoons kosher salt; 2 teaspoons freshly ground black pepper; ½ teaspoon cayenne pepper; 2 tablespoons butter; 1 large yellow onion, sliced; 1 teaspoon kosher salt; 4 cloves garlic, sliced; 1 tablespoon minced fresh rosemary; 1 cup apple juice",
  "directions": "1. Season both sides of the brisket generously with salt, pepper, and cayenne. For best results, place brisket over an aluminum foil \"rack\" set over a plate and refrigerate, uncovered, 8 to 12 hours. 2. Preheat the oven to 325 degrees F (165 degrees C). 3. Melt butter in a saucepan over medium heat. Add onion and salt. Cook and stir until translucent, about 5 minutes. Stir in garlic, rosemary, and apple juice. Increase heat to high and boil until liquid is reduced by about half, about 3 minutes. 4. Transfer half of the apple-onion mixture into a baking dish. Place brisket fat-side up on top; cover with remaining apple-onion mixture. Cover baking dish tightly with foil. 5. Bake in the preheated oven for 1 hour 30 minutes. Reduce oven temperature to 250 degrees F (121 degrees C) and bake until fork-tender, about 2 hours 15 minutes. Check for doneness after 2 hours. 6. Transfer brisket to a plate and tent with foil. 7. Pour the onions and braising liquid into a large measuring cup or bowl. Skim some fat off the top. Puree with a stick blender to create a gravy. 8. Slice brisket across the grain and serve with the gravy.",
  "prep": "20 mins",
  "cook": "3 hrs 55 mins",
  "total": "12 hrs 15 mins",
  "calories": "338"
},
{
  "url": "https://www.allrecipes.com/recipe/14865/reuben-dip/",
  "name": "Reuben Dip",
  "rating": "4.6",
  "ratingcount": "435",
  "ingredients": "½ cup mayonnaise; ½ cup Thousand Island dressing; 16 ounces sauerkraut, rinsed and squeezed dry; 8 ounces shredded corned beef; 16 ounces shredded Swiss cheese",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix mayonnaise and dressing together in a small bowl; set aside. 3. Spread sauerkraut into a 9x13-inch baking dish. Layer corned beef, Swiss cheese, and mayonnaise mixture on top of sauerkraut. 4. Bake in the preheated oven for 20 to 25 minutes. Serve hot.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "221"
},
{
  "url": "https://www.allrecipes.com/recipe/133958/newfoundland-jiggs-dinner/",
  "name": "Newfoundland Jigg's Dinner",
  "rating": "4.5",
  "ratingcount": "37",
  "ingredients": "1 (3 pound) boneless corned beef brisket; 1 ½ cups yellow split peas; 1 large head cabbage, quartered; 1 medium turnip, peeled and cubed; 6  carrots, peeled and cut in chunks; 6 large potatoes, peeled and quartered; 2 tablespoons butter; ½ teaspoon black pepper; 1 ½ cups all-purpose flour; 2 teaspoons white sugar; 2 teaspoons baking powder; ¾ cup water, or as needed",
  "directions": "1. Cover corned beef with cold water and soak for 8 hours to overnight in the refrigerator. 2. Drain beef, place in a large Dutch oven, and cover with fresh water. Place peas in a triple layer of cheesecloth and tie securely. Place the bag inside the Dutch oven with beef. Bring to a boil, then reduce to a simmer and cook for 2 hours. 3. Add cabbage, turnip, and carrots to the pot. Simmer for 25 minutes. 4. Add potatoes and simmer until all vegetables are fork tender, 20 to 25 minutes. 5. While vegetables are cooking, prepare the dumpling dough: Combine flour, sugar, and baking powder in a bowl, then add just enough water to make a pasty dough. Divide the dough into 6 balls, taking care to not overwork the dough. 6. During the last 5 to 10 minutes of simmering vegetables, place dumplings on top of vegetables and cover with a lid. Allow dumplings to steam in the pot for 7 minutes. 7. When dumplings are cooked through, remove all ingredients from the pot and arrange on a warm serving platter. Remove cooked peas from the cheesecloth bag and mash with butter and pepper. Serve alongside the beef and vegetables.",
  "prep": "30 mins",
  "cook": "2 hrs 45 mins",
  "total": "11 hrs 15 mins",
  "calories": "958"
},
{
  "url": "https://www.allrecipes.com/recipe/57264/simply-the-easiest-beef-brisket/",
  "name": "Simply the Easiest Beef Brisket",
  "rating": "4.7",
  "ratingcount": "456",
  "ingredients": "1 (3 pound) beef brisket, trimmed of fat; salt and pepper to taste; 1 medium onion, thinly sliced; 1 (12 fluid ounce) can beer; 1 (12 ounce) bottle tomato-based chili sauce; ¾ cup packed brown sugar",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 325 degrees F (165 degrees C). 3. Season brisket on all sides with salt and pepper and place in a glass baking dish. Cover with a layer of sliced onion. 4. Mix together beer, chili sauce, and brown sugar in a medium bowl. Pour over the roast. Cover the dish tightly with aluminum foil. 5. Bake in the preheated oven for 3 hours. Remove the aluminum foil and bake for an additional 30 minutes. 6. Let brisket rest and cool slightly before slicing and returning to the dish. Reheat in the oven with the sauce spooned over the sliced meat.",
  "prep": "10 mins",
  "cook": "4 hrs",
  "total": "4 hrs 10 mins",
  "calories": "520"
},
{
  "url": "https://www.allrecipes.com/recipe/46530/guinness-corned-beef/",
  "name": "Guinness Corned Beef",
  "rating": "4.4",
  "ratingcount": "1",
  "ingredients": "4 pounds corned beef brisket; 1 cup brown sugar; 1 (12 fluid ounce) can or bottle Irish stout beer (e.g. Guinness(r))",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Rinse brisket thoroughly, then pat dry with paper towels and place on a rack in a roasting pan or Dutch oven. Rub brown sugar all over brisket. Pour beer around and gently over brisket to wet sugar. 3. Bake, covered, in the preheated oven until tender, about 2 1/2 hours. An instant-read thermometer inserted into the center of brisket should read at least 190 degrees F (88 degrees C). Allow to rest for 5 minutes before slicing.",
  "prep": "20 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 55 mins",
  "calories": "286"
},
{
  "url": "https://www.allrecipes.com/recipe/83844/slow-cooked-corned-beef-for-sandwiches/",
  "name": "Slow Cooked Corned Beef for Sandwiches",
  "rating": "4.8",
  "ratingcount": "827",
  "ingredients": "2 (3 pound) corned beef briskets with spice packets; 2 (12 fluid ounce) bottles beer; ¼ cup peppercorns; 1 bulb garlic cloves, separated and peeled; 2 large bay leaves",
  "directions": "1. Place briskets into a large pot. Sprinkle one spice packet over top; discard remaining spice packet or save for another use. Pour in beer, then add enough water to cover briskets by 1 inch. Add peppercorns, garlic, and bay leaves, cover, and bring to a boil. 2. Reduce the heat to medium-low. Simmer, checking hourly and adding more water if necessary to keep briskets covered, until meat is tender and can be easily pulled apart with a fork, at least 4 hours or up to 5. 3. Carefully transfer briskets to a cutting board; let rest until they firm up a bit, about 10 minutes. Slice or shred meat, then place onto a platter for serving. Discard cooking liquid or save it for another use.",
  "prep": "20 mins",
  "cook": "4 hrs 5 mins",
  "total": "4 hrs 35 mins",
  "calories": "487"
},
{
  "url": "https://www.allrecipes.com/recipe/222592/easy-corned-beef-and-cabbage/",
  "name": "Easy Corned Beef and Cabbage",
  "rating": "4.6",
  "ratingcount": "212",
  "ingredients": "4  potatoes, peeled and quartered; 1 pound carrots, cut into large chunks; 1  onion, cut into wedges; 3 cups water; 2 tablespoons sugar; 2 tablespoons cider vinegar; 3 cloves garlic, minced; ½ teaspoon ground black pepper; 1  bay leaf; 1 (3 pound) corned beef brisket with spice packet, cut in half; 1 small head cabbage, cut into wedges",
  "directions": "1. Place potatoes, carrots, and onion into a 5-quart slow cooker. Combine water, sugar, vinegar, garlic, black pepper, bay leaf, and contents of spice packet in a small bowl; pour over vegetables. Top with beef brisket and cabbage. 2. Cover and cook on Low until beef and vegetables are tender, 8 to 9 hours. Remove bay leaf before serving.",
  "prep": "15 mins",
  "cook": "8 hrs",
  "total": "8 hrs 15 mins",
  "calories": "647"
},
{
  "url": "https://www.allrecipes.com/recipe/233609/basic-beef-brisket-in-a-dutch-oven/",
  "name": "Basic Beef Brisket in a Dutch Oven",
  "rating": "4.5",
  "ratingcount": "13",
  "ingredients": "1 (3 pound) beef brisket; ½ teaspoon seasoned salt; ¼ teaspoon ground black pepper; 2 tablespoons olive oil; 2 large onions, sliced; 3 cloves garlic, minced; 1 cup beef broth; 1 cup ketchup; ⅓ cup packed brown sugar; ⅓ cup cider vinegar; 3 tablespoons chili powder; 2  bay leaves; ¼ teaspoon cayenne pepper; ¼ cup cold water; 3 tablespoons all-purpose flour",
  "directions": "1. Sprinkle brisket with seasoned salt and black pepper. 2. Heat oil in a Dutch oven over medium-high heat. Sear brisket in hot oil until browned on both sides, then transfer to a large plate. Cook and stir onions and garlic in the Dutch oven until vegetables are softened, about 6 minutes. Return brisket to the Dutch oven. 3. Whisk beef broth, ketchup, brown sugar, vinegar, chili powder, bay leaves, and cayenne pepper together in a bowl; drizzle over brisket. 4. Bring mixture to a boil, then reduce the heat to low, cover, and simmer until beef is very tender and easily falls apart when pulled with a fork, 2 1/2 to 3 hours. Remove and discard bay leaves. Transfer beef to a platter, reserving liquid in the Dutch oven. Slice beef. 5. Whisk water and flour together in a small bowl; stir into the Dutch oven and bring to a boil until sauce is thickened. Serve sauce over sliced brisket.",
  "prep": "20 mins",
  "cook": "3 hrs",
  "total": "3 hrs 20 mins",
  "calories": "558"
},
{
  "url": "https://www.allrecipes.com/recipe/256535/bbq-beef-brisket-sandwiches/",
  "name": "BBQ Beef Brisket Sandwiches",
  "rating": "4.5",
  "ratingcount": "67",
  "ingredients": "2 teaspoons celery salt; 2 teaspoons ground black pepper; 1 ½ teaspoons salt; 1 teaspoon garlic salt; 1 teaspoon onion salt; 2 teaspoons Worcestershire sauce; 3 pounds beef brisket; 1 cup Russian dressing; 1 cup hickory-flavored barbeque sauce; 8  kaiser rolls, split",
  "directions": "1. Mix celery salt, pepper, salt, garlic salt, and onion salt together in a small bowl; stir in Worcestershire sauce. Spread mixture all over beef brisket. 2. Place brisket into a slow cooker. Cover and cook on Low until beef is tender and can easily be pulled apart with a fork, about 8 hours. 3. Transfer beef to a cutting board; shred into small pieces using two forks. 4. Transfer 1/2 cup cooking liquid from the slow cooker to a saucepan. Stir in Russian dressing and barbeque sauce; bring to a boil. 5. Return shredded beef to the slow cooker. Add barbeque mixture, cover, and cook on Low until flavors combine, about 1 hour. 6. Serve beef and sauce on rolls.",
  "prep": "20 mins",
  "cook": "9 hrs 5 mins",
  "total": "9 hrs 25 mins",
  "calories": "452"
},
{
  "url": "https://www.allrecipes.com/recipe/37930/brisket-marinade/",
  "name": "Brisket Marinade",
  "rating": "4.6",
  "ratingcount": "19",
  "ingredients": "½ cup red wine; ¼ cup Worcestershire sauce; ¼ cup liquid smoke flavoring; 4 teaspoons celery flakes; 4 teaspoons pepper; 2 teaspoons onion salt; 2 teaspoons garlic salt",
  "directions": "1. Combine wine, Worcestershire sauce, and liquid smoke in a medium bowl. Stir in celery flakes, pepper, onion salt, and garlic salt.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "115"
},
{
  "url": "https://www.allrecipes.com/recipe/33129/corned-beef-hash/",
  "name": "Corned Beef Hash",
  "rating": "4.4",
  "ratingcount": "242",
  "ingredients": "6 large potatoes, peeled and diced; 1 (12 ounce) can corned beef, cut into chunks; 1  medium onion, chopped; 1 cup beef broth",
  "directions": "1. Combine potatoes, corned beef, onion, and broth in a large, deep skillet over medium heat. Cover and simmer until potatoes are soft enough to mash and liquid is almost gone. Mix well and serve hot.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "434"
},
{
  "url": "https://www.allrecipes.com/recipe/22529/oh-so-tender-brisket/",
  "name": "Oh So Tender Brisket",
  "rating": "4.5",
  "ratingcount": "106",
  "ingredients": "Roasting bag; ¼ cup all-purpose flour; 3 pounds beef brisket; 1 ¾ fluid ounces liquid smoke flavoring; ½ teaspoon garlic powder; 1 (1 ounce) package dry onion soup mix; 1 teaspoon freshly ground black pepper",
  "directions": "1. Preheat oven to 275 degrees F (135 degrees C). 2. Coat the inside of an oven roasting bag with flour. Place brisket inside of bag. Pour liquid smoke over the brisket and sprinkle on garlic powder, dry onion soup mix, and ground black pepper. Seal bag. Using a fork, make two sets of holes in the top of the roasting bag. 3. Lay bag in a broiling pan. Bake in a preheated oven for 6 to 8 hours.",
  "prep": "15 mins",
  "cook": "6 hrs",
  "total": "6 hrs 15 mins",
  "calories": "416"
},
{
  "url": "https://www.allrecipes.com/recipe/149546/samoan-palusami/",
  "name": "Samoan Palusami",
  "rating": "4.4",
  "ratingcount": "34",
  "ingredients": "2 (10 ounce) bags fresh spinach; 1 (12 ounce) can corned beef, broken into pieces; 2 (10 ounce) cans coconut milk",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Make a layer of spinach leaves in the bottom of a 9x13 inch baking dish. Sprinkle with some of the corned beef, then keep repeating layers of spinach and corned beef until you run out of spinach. Don't worry about how full the dish is because the spinach will shrink as it cooks. Pour both cans of coconut milk over the dish, pressing the leaves down with a spoon. Cover tightly with a lid or aluminum foil. 3. Bake in the preheated oven for 45 to 55 minutes, or until spinach has completely wilted and the sauce is bubbly. Cool for 10 minutes before serving.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "252"
},
{
  "url": "https://www.allrecipes.com/recipe/89707/slow-cooker-reuben-dip/",
  "name": "Slow Cooker Reuben Dip",
  "rating": "4.6",
  "ratingcount": "501",
  "ingredients": "1 (16 ounce) jar sauerkraut, drained; 1 (8 ounce) package cream cheese, softened; 2 cups shredded Swiss cheese; 2 cups shredded cooked corned beef; ¼ cup thousand island dressing",
  "directions": "1. In a slow cooker, combine the sauerkraut, cream cheese, Swiss cheese, corned beef and thousand island dressing. Cover, and cook on high for 45 minutes if you're in a hurry, low for longer if you're not, or just until hot and cheese is melted. Stir occasionally while cooking. Serve with cocktail rye or crackers.",
  "prep": "4 mins",
  "cook": "45 mins",
  "total": "49 mins",
  "calories": "298"
},
{
  "url": "https://www.allrecipes.com/recipe/213754/saint-paddys-irish-sandwich/",
  "name": "Saint Paddy's Irish Sandwich",
  "rating": "4.7",
  "ratingcount": "16",
  "ingredients": "1 (3 pound) corned beef brisket with spice packet; 2 tablespoons olive oil; 1 tablespoon balsamic vinegar; 1 tablespoon spicy brown mustard; ½ teaspoon salt; ½ teaspoon ground black pepper; ½ medium head cabbage, cored and sliced thin; spicy brown mustard; 12 slices  sourdough bread, lightly toasted",
  "directions": "1. Place corned beef in large pot or Dutch oven and cover with water. Add the spice packet that came with the corned beef. Cover pot and bring to a boil, then reduce to a simmer. Simmer approximately 50 minutes per pound until tender. Remove meat and let rest 15 minutes. Slice meat across the grain. 2. Whisk together olive oil, balsamic vinegar, mustard, salt, and pepper in small bowl. Place the shredded cabbage in a large bowl and pour the dressing over it; toss to coat the cabbage with the dressing. 3. Spread a layer of mustard on 6 slices of toasted bread. Place some shredded cabbage and corned beef on each slice and top with remaining slices of bread.",
  "prep": "20 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 50 mins",
  "calories": "461"
},
{
  "url": "https://www.allrecipes.com/recipe/57905/corned-beef-and-cabbage-ii/",
  "name": "Corned Beef and Cabbage II",
  "rating": "4.6",
  "ratingcount": "217",
  "ingredients": "1 (5 1/2 pound) corned beef brisket; 2 tablespoons pickling spice; 1 large orange, sliced in rounds; 2 stalks celery, sliced; 1 large onion, sliced; ½ cup cold water; 6 tablespoons margarine, divided; 1 large head cabbage, cored and sliced; 1 cup Golden Delicious apples, cored and quartered with peel; ¼ cup cold water",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). Line a 9x13-inch roasting pan with aluminum foil, leaving enough extra extending over the sides to cover and seal in the roast. 2. Rinse the brisket, and pat dry. Rub with pickling spice, and place in the prepared roasting pan. Arrange celery, orange and onion slices on and around the roast. Pour in 1/2 cup of water, and wrap aluminum foil up over the roast tightly, making sure the ends are sealed. 3. Bake for about 4 hours in the preheated oven, or until meat is tender. 4. About 45 minutes before the roasts time is up, heat 3 tablespoons of margarine and 1/4 cup of water in a large pot. Add cabbage and apples, cover, and simmer over low heat for about 30 minutes. Occasionally shake the pot so that nothing sticks to the bottom. Serve with remaining margarine and sliced corned beef.",
  "prep": "15 mins",
  "cook": "4 hrs",
  "total": "4 hrs 15 mins",
  "calories": "482"
},
{
  "url": "https://www.allrecipes.com/recipe/18873/one-skillet-corned-beef-hash/",
  "name": "One-Skillet Corned Beef Hash",
  "rating": "4.5",
  "ratingcount": "96",
  "ingredients": "2 tablespoons vegetable oil; 2  onions, chopped; 4  potatoes, peeled and chopped; 2 (12 ounce) cans corned beef; 1 tablespoon ground black pepper; 5 tablespoons cider vinegar",
  "directions": "1. Heat oil in a large skillet over medium-high heat. Sauté onions and potatoes until slightly browned, about 5 minutes. 2. Stir in corned beef and season with pepper. Stir in vinegar, 1 tablespoon at a time, cooking for 3 to 5 minutes in between each addition. Partially cover skillet, reduce heat to medium-low, and cook, stirring occasionally, for about 20 minutes or until potatoes are tender.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "450"
},
{
  "url": "https://www.allrecipes.com/recipe/220460/raleys-irish-corned-beef-stew/",
  "name": "Raleys Irish Corned Beef Stew",
  "rating": "4.4",
  "ratingcount": "10",
  "ingredients": "⅓ cup all-purpose flour; 1 (3 pound) corned beef brisket (with spice packet), excess fat trimmed and meat cut into 1-inch cubes; ⅓ cup olive oil; 1 ½ pounds red potatoes, peeled and cubed; 2 cups peeled and cubed parsnips; 2 cups peeled and cubed carrots; 1 extra large onion, cut into chunks; 1 ½ cups water; 1 (12 fluid ounce) can or bottle Irish stout beer; 1 (10.5 ounce) can beef broth; 1 head cabbage, cored and coarsely chopped; ¼ cup distilled white vinegar",
  "directions": "1. Place flour into a large bowl; toss corned beef cubes in flour to coat. 2. Heat olive oil in a large heavy pot or Dutch oven over medium heat and brown corned beef cubes on all sides, about 10 minutes. 3. Sprinkle the spice packet from the corned beef over the meat; mix in potatoes, parsnips, carrots, onion, water, stout beer, beef broth, and any unused flour; stir to combine. Bring to a boil. 4. Reduce heat to low and simmer until corned beef is very tender and the stew has thickened, 2 to 2 1/2 hours. 5. Mix cabbage into the stew and simmer until tender, about 15 minutes. Stir in vinegar.",
  "prep": "30 mins",
  "cook": "2 hrs 10 mins",
  "total": "2 hrs 40 mins",
  "calories": "440"
},
{
  "url": "https://www.allrecipes.com/recipe/11819/spaghetti-with-corned-beef/",
  "name": "Spaghetti with Corned Beef",
  "rating": "4.4",
  "ratingcount": "24",
  "ingredients": "8 ounces spaghetti; 1 (12 ounce) can corned beef; 1 cup spaghetti sauce; 1 cube chicken bouillon; 1 teaspoon Italian seasoning; ½ teaspoon garlic powder (Optional); ½ tablespoon dried minced onion (Optional)",
  "directions": "1. Dissolve bouillon in boiling water. Cut spaghetti noodles in half and add to boiling water until done. 2. Over medium heat empty can of corned beef onto a skillet. Add spaghetti sauce to meat. Stir until heated; corned beef will come apart and a thick sauce will form. If desired, add Italian seasoning, garlic powder, dry onion, or any other spices. 3. Once noodles are done, drain and combine with corned beef sauce.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "383"
},
{
  "url": "https://www.allrecipes.com/recipe/58480/reuben-pizza/",
  "name": "Reuben Pizza",
  "rating": "4.5",
  "ratingcount": "121",
  "ingredients": "1 (1 pound) loaf frozen whole wheat bread dough, thawed; ½ cup thousand island dressing; 2 cups shredded Swiss cheese; 6 ounces deli sliced corned beef, cut into strips; 1 cup sauerkraut - rinsed and drained; ½ teaspoon caraway seed; ¼ cup chopped dill pickles (Optional)",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease a large pizza pan. 2. On a lightly floured surface, roll bread dough out into a large circle about 18-inches in diameter; transfer to the prepared pizza pan. Build up the edges, and prick the center all over with a fork so it doesn't form a dome when baking. 3. Bake for 20 to 25 minutes in the preheated oven, or until golden. 4. Spread 1/2 of the salad dressing over hot crust. Sprinkle with 1/2 of the Swiss cheese. Arrange corned beef on top of cheese, then drizzle with remaining salad dressing. Top with sauerkraut and remaining Swiss cheese. Sprinkle with caraway seed. 5. Bake for another 10 minutes in the preheated oven, until cheese melts and toppings are heated through. Sprinkle with chopped pickle. Let stand for 5 minutes before slicing.",
  "prep": "25 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "207"
},
{
  "url": "https://www.allrecipes.com/recipe/24499/sauerkraut-balls/",
  "name": "Sauerkraut Balls",
  "rating": "4.6",
  "ratingcount": "38",
  "ingredients": "3 tablespoons unsalted butter; 1  onion, finely chopped; 1 cup finely chopped cooked ham; 1 cup finely chopped corned beef; ½ clove garlic, crushed; 6 tablespoons all-purpose flour; 2 cups sauerkraut, drained and minced; 1 tablespoon chopped fresh parsley; ½ cup beef broth; 1  egg; 2 cups milk; 2 ½ cups all-purpose flour; 4 cups fine dry bread crumbs; 1 quart oil for frying",
  "directions": "1. In a large skillet, melt butter over medium-low heat. Add onion and cook until softened. Stir in ham, corned beef, and garlic. Cook mixture, stirring constantly for 1 minute. Stir in 6 tablespoons flour and cook mixture over moderate heat, stirring occasionally, for 3 minutes. 2. Stir in sauerkraut, parsley, and broth; cook for 3 minutes or until thickened and paste-like. Spread mixture on a platter and chill for at least 3 hours. 3. Heat oil in a deep fryer to 375 degrees F (190 degrees C). In a bowl, whisk together egg, milk, and 2 1/2 cups flour. Shape sauerkraut mixture by leveling teaspoons into balls, dip them into egg mixture, and roll them in bread crumbs. 4. Fry balls in batches for 2 to 3 minutes or until golden brown. Transfer to paper towels to drain. Serve warm.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "4 hrs",
  "calories": "223"
},
{
  "url": "https://www.allrecipes.com/recipe/220513/corned-beef-and-swiss-dip/",
  "name": "Corned Beef and Swiss Dip",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 tablespoon vegetable oil; ¾ medium onion, chopped; 2 (8 ounce) packages cream cheese, softened; 1 (8 ounce) carton sour cream; 3 (2.5 ounce) packages deli-sliced corned beef (such as Buddig ®), diced; 1 ½ cups mayonnaise; 1 cup shredded Swiss cheese; 1 teaspoon garlic powder; 1 (1 pound) loaf unsliced Italian bread",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Heat oil in a skillet over medium heat. Cook and stir onion in the hot skillet until tender, 5 to 7 minutes. 3. Transfer onion to a large mixing bowl. Add cream cheese, sour cream, and corned beef, then add mayonnaise, Swiss cheese, and garlic powder; mix until thoroughly combined. 4. Cut off top of bread loaf. Create a bread bowl by tearing bread into chunks from the center of the loaf, leaving 1/2 inch bread on all sides. Reserve bread chunks for dipping if desired. 5. Spoon corned beef mixture into bread bowl. Wrap bread bowl tightly with aluminum foil and place onto a baking sheet. 6. Bake in the preheated oven until the dip is fully cooked and bubbling, 1 to 1 1/2 hours.",
  "prep": "15 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 20 mins",
  "calories": "293"
},
{
  "url": "https://www.allrecipes.com/recipe/87421/beer-brisket/",
  "name": "Beer Brisket",
  "rating": "4.2",
  "ratingcount": "106",
  "ingredients": "1 (4 pound) beef brisket, trimmed of fat; salt to taste; 1 large onion, sliced; 1 (12 fluid ounce) can beer; 1 tablespoon brown sugar; 1 cube beef bouillon; 2 tablespoons coarsely ground black pepper; 2 teaspoons minced garlic; 1  bay leaf; ¼ teaspoon dried thyme; 2 tablespoons cornstarch; 2 tablespoons water",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Season brisket with salt and place in a baking dish. Cover entire roast with onion slices. 3. In a medium bowl, mix together the beer, brown sugar, beef bouillon, pepper, garlic, bay leaf, and thyme. Pour over the roast. Cover with aluminum foil. 4. Bake for 4 hours in the preheated oven. The brisket should be fork-tender. 5. Mix together cornstarch and water; stir into the juices in the baking dish to thicken. Remove the bay leaf. Slice and serve brisket.",
  "prep": "10 mins",
  "cook": "4 hrs",
  "total": "4 hrs 10 mins",
  "calories": "572"
},
{
  "url": "https://www.allrecipes.com/recipe/72190/corned-beef-potato-pancakes/",
  "name": "Corned Beef Potato Pancakes",
  "rating": "3.8",
  "ratingcount": "25",
  "ingredients": "½ (12 ounce) can corned beef, broken into very small chunks; 3 medium potatoes, shredded; 2  green onions, chopped; 1 large egg; salt and pepper to taste; ¼ cup vegetable oil",
  "directions": "1. Place corned beef into a large bowl with potatoes, green onions, and egg; season with salt and pepper. Form mixture into golf ball-sized balls. 2. Heat oil in a large skillet over medium heat. Place potato balls, a few at a time, into the hot skillet. Flatten balls with a spatula and fry until crisp and golden brown, about 7 minutes per side. Remove to a paper towel-lined plate. Repeat to cook remaining pancakes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "260"
},
{
  "url": "https://www.allrecipes.com/recipe/231696/corned-beef-irish-feast/",
  "name": "Corned Beef Irish Feast",
  "rating": "4.6",
  "ratingcount": "16",
  "ingredients": "1 (3 pound) corned beef brisket with spice packet; 1 cup brown sugar; 4 (12 fluid ounce) cans or bottles Irish stout beer (such as Guinness®), or more if needed; 1 quart beef stock; 1  onion, peeled; 2 cloves garlic, peeled; 2  bay leaves; 12  whole black peppercorns; 2 pounds red potatoes, quartered; 1 (16 ounce) package carrots, cut into sticks; 1 head cabbage, cut into wedges",
  "directions": "1. Rinse brisket thoroughly in cool water and place into a large Dutch oven. Generously coat beef with brown sugar on all sides. Pour Irish stout beer around roast, followed by beef stock. Liquid should cover brisket by about 1 inch; add another beer if more liquid is needed. 2. Place onion, garlic, bay leaves, spike packet from corned beef, and peppercorns into liquid. Bring to a boil, reduce heat to low, and cover Dutch oven. Simmer for 2 1/2 hours, turning brisket over in the beer mixture every 30 minutes. Place potatoes and carrots around roast, cover, and simmer for 20 minutes. Add cabbage wedges and simmer until tender, about 10 more minutes. Brisket should easily pull apart with your fingers or a fork. 3. Transfer vegetables to a serving bowl and place corned beef on a serving platter; let meat rest 10 minutes before slicing across the grain to serve.",
  "prep": "20 mins",
  "cook": "3 hrs",
  "total": "3 hrs 30 mins",
  "calories": "577"
},
{
  "url": "https://www.allrecipes.com/recipe/33555/dilly-rye-boat-dip/",
  "name": "Dilly Rye Boat Dip",
  "rating": "4.2",
  "ratingcount": "27",
  "ingredients": "1 (1 pound) loaf round rye bread; 1 cup sour cream; 1 cup mayonnaise; 1 (4 ounce) jar dried chipped beef, chopped; 1 teaspoon Beau Monde ™ seasoning; 2 teaspoons celery salt; 3 tablespoons dried dill weed",
  "directions": "1. Using a bread knife, remove \"crown\" of bread. Hollow out the inside of loaf, and cut into bite-sized cubes for dipping. 2. In a medium bowl, blend sour cream, mayonnaise, chipped beef, Beau Monde seasoning, celery salt, and dill weed. Mix thoroughly, cover, and chill for at least 1 hour. 3. Spoon chilled dip into hollow bread loaf, and serve with cubed bread for dipping.",
  "prep": "20 mins",
  "cook": "",
  "total": "1 hr 20 mins",
  "calories": "228"
},
{
  "url": "https://www.allrecipes.com/recipe/212741/jewish-style-sweet-and-sour-brisket/",
  "name": "Jewish Style Sweet and Sour Brisket",
  "rating": "4.8",
  "ratingcount": "225",
  "ingredients": "4 pounds beef brisket; 1 cup water; 1 cup ketchup; ½ cup white vinegar; 2  onions, sliced; 1 clove garlic, minced; ¾ cup brown sugar; 1 tablespoon salt",
  "directions": "1. Heat brisket in a large skillet or dutch oven over medium-high heat. Cook until browned on all sides. Stir in water, ketchup, vinegar, onions, garlic, brown sugar, and salt. Bring to a boil, then cover and reduce heat to medium-low. Continue simmering until tender, turning brisket occasionally, 2 hours and 30 minutes to 3 hours and 30 minutes. 2. Remove brisket and allow to cool before slicing the meat against the grain. Place brisket slices in a 9x13 inch baking pan or large platter and pour gravy on top. Cover and refrigerate overnight. Remove any excess fat and reheat before serving.",
  "prep": "15 mins",
  "cook": "2 hrs 45 mins",
  "total": "11 hrs",
  "calories": "401"
},
{
  "url": "https://www.allrecipes.com/recipe/235420/slow-cooker-3-ingredient-french-dips/",
  "name": "Slow Cooker 3-Ingredient French Dips",
  "rating": "4.7",
  "ratingcount": "35",
  "ingredients": "1 (3 pound) beef brisket; 1 envelope onion soup mix; 1 (14 ounce) can beef broth; 8  large French rolls, split",
  "directions": "1. Place beef brisket in a slow cooker. Mix onion soup mix into beef broth in a small bowl; pour over brisket. 2. Cook on Low 7 to 9 hours. 3. Transfer brisket to a cutting board and cut into slices. Fill rolls with beef. Ladle juices from the slow cooker into 5 individual bowls to serve with sandwiches for dipping.",
  "prep": "5 mins",
  "cook": "7 hrs",
  "total": "7 hrs 5 mins",
  "calories": "501"
},
{
  "url": "https://www.allrecipes.com/recipe/71756/grandmas-brisket/",
  "name": "Grandma's Brisket",
  "rating": "4.5",
  "ratingcount": "113",
  "ingredients": "1 (3 pound) beef brisket; 1 cup ketchup; 1 (1 ounce) package dry onion soup mix; 1 (12 fluid ounce) can or bottle ginger ale; 3  carrots, cut into 1 inch pieces (Optional); 1 small onion, sliced (Optional)",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Place the brisket in a roasting pan fat side up. In a medium bowl, stir together the ketchup, soup mix and ginger ale; pour over the brisket. Arrange carrots and onion around the edge of the roast if using. Cover the roast with a lid or aluminum foil. 3. Bake for 2 hours in the preheated oven. Remove the cover, and cook for 1 more hour. Let stand for a few minutes before slicing and serving.",
  "prep": "5 mins",
  "cook": "3 hrs",
  "total": "3 hrs 5 mins",
  "calories": "466"
},
{
  "url": "https://www.allrecipes.com/recipe/27024/baked-corned-beef-and-cabbage/",
  "name": "Dutch Oven Corned Beef and Cabbage",
  "rating": "4.7",
  "ratingcount": "262",
  "ingredients": "4 ½ pounds corned beef brisket; 5  black peppercorns; ½ teaspoon garlic powder; 1  onion, peeled and left whole; 2  bay leaves; 1 pinch salt; 1 small head cabbage, cored and cut into wedges; 6 large potatoes, quartered; 4 large carrots, peeled and sliced; ¼ cup chopped fresh parsley; 2 tablespoons butter",
  "directions": "1. Place beef brisket, peppercorns, garlic powder, onion, bay leaves, and salt in a 6-quart Dutch oven; fill pan with water to cover everything completely. Bring to a boil and cook for 20 minutes. Skim off any residue that floats to the top; reduce heat to a simmer and cook for 2 to 3 hours, until meat can be pulled apart with a fork. 2. Add cabbage, potatoes, and carrots, pressing them down into the liquid. Simmer for an additional 15 minutes or until the potatoes are tender. Skim off any fat that comes to the surface. Stir in butter and parsley; remove the pot from heat. 3. Remove meat from the pot and place onto a serving dish; let rest for 15 minutes. Transfer vegetables to a bowl and keep warm. Slice meat on the diagonal against the grain. Serve meat on a platter and spoon juices over meat and vegetables.",
  "prep": "20 mins",
  "cook": "3 hrs",
  "total": "3 hrs 20 mins",
  "calories": "515"
},
{
  "url": "https://www.allrecipes.com/recipe/70096/cousin-davids-slow-cooker-brisket/",
  "name": "Cousin David's Slow Cooker Brisket",
  "rating": "4.3",
  "ratingcount": "312",
  "ingredients": "1 (3 pound) beef brisket; 2 (12 ounce) bottles chili sauce; 1 (1 ounce) envelope dry onion soup mix; 2 teaspoons garlic powder",
  "directions": "1. Place the beef brisket into a slow cooker. In a medium bowl, mix together the chili sauce, onion soup mix, and garlic powder. Pour over the brisket. Cover, and cook on the Low setting for 8 to 10 hours. Slice the brisket against the grain, and pour the gravy over the slices.",
  "prep": "5 mins",
  "cook": "10 hrs",
  "total": "10 hrs 5 mins",
  "calories": "606"
},
{
  "url": "https://www.allrecipes.com/recipe/31147/irish-egg-rolls/",
  "name": "Irish Egg Rolls",
  "rating": "4.5",
  "ratingcount": "89",
  "ingredients": "4 ounces chopped corned beef; 1 cup shredded steamed cabbage; 1 cup diced cooked potatoes; 1 cup shredded carrot; ½ cup thinly sliced onion; salt and pepper, to taste; 8 (7 inch square) egg roll wrappers; 1 ½ quarts oil for deep frying",
  "directions": "1. Heat oil in a deep-fryer to 375 degrees F (190 degrees C). 2. In a medium bowl, mix together the shredded corned beef, cabbage, potatoes, carrot, and onion. Season with salt and pepper to taste. Lay the egg roll wrappers out on a clean dry surface a few at a time. Place about 1/2 cup of the mixture into the center of each wrap. Roll up into logs according to the directions on the package. Wet the edge with water to seal. 3. Fry rolls a few at a time, turning if necessary, for about 5 minutes, or until golden. Remove from hot oil to drain on paper towels.",
  "prep": "30 mins",
  "cook": "5 mins",
  "total": "50 mins",
  "calories": "286"
},
{
  "url": "https://www.allrecipes.com/recipe/221043/sensational-slow-cooked-beef-brisket/",
  "name": "Sensational Slow Cooked Beef Brisket",
  "rating": "4.6",
  "ratingcount": "59",
  "ingredients": "2 tablespoons paprika; 2 tablespoons garlic powder; 2 tablespoons ground black pepper; 2 tablespoons sea salt; 1 teaspoon cayenne pepper; ⅓ cup extra-virgin olive oil; 1 (16 ounce) package sliced fresh mushrooms; 3  shallots, chopped; ¼ cup unsalted margarine; 1 ½ cups Worcestershire sauce (such as Lea & Perrins®), divided; 1 (5 pound) beef brisket; 2 cups red wine; ½ cup water; 1 clove garlic, chopped; 1 (32 fluid ounce) container beef broth (such as Progresso®); 1 tablespoon Worcestershire sauce (such as Lea & Perrins®); 2 tablespoons unsalted margarine, thinly sliced",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Mix paprika, garlic powder, black pepper, sea salt, and cayenne pepper in a bowl until thoroughly combined. Set spice mixture aside. 3. Heat olive oil in a large skillet over medium heat; cook and stir mushrooms and shallots until mushrooms have released their liquid, 5 to 8 minutes. Set mushroom mixture aside. 4. Melt 1/4 cup margarine in a large skillet over medium-high heat and stir in 1/4 cup Worcestershire sauce. Rub beef brisket thoroughly with spice mixture; place brisket into the margarine and Worcestershire sauce. 5. Brown the brisket well on all sides, about 5 minutes per side. As the Worcestershire sauce cooks into the brisket, pour in more, about 1/2 cup at a time, until 1 1/2 cup Worcestershire sauce has been added. 6. Place a rack into a heavy Dutch oven; place the brisket onto the rack. Pour in the Worcestershire sauce pan drippings, red wine, water, garlic, and beef broth. Top the brisket with the mushroom mixture. Drizzle 1 tablespoon Worcestershire sauce over the mushrooms and top with 2 tablespoons sliced unsalted margarine. 7. Cover the Dutch oven and bake brisket in the preheated oven for 3 hours. Reduce heat to 300 degrees F (150 degrees C) and bake 1 more hour. Reduce oven temperature to 225 degrees F (105 degrees C) and bake 1 additional hour. Baste with pan drippings every hour. 8. Let the brisket rest for about 20 minutes before slicing thinly across the grain. Serve with pan gravy.",
  "prep": "30 mins",
  "cook": "5 hrs 15 mins",
  "total": "6 hrs 5 mins",
  "calories": "624"
},
{
  "url": "https://www.allrecipes.com/recipe/238689/yeah-i-lived-in-texas-smoked-brisket/",
  "name": "Yeah, I-Lived-in-Texas, Smoked Brisket",
  "rating": "4.5",
  "ratingcount": "35",
  "ingredients": "wood chips; ¼ cup paprika; ¼ cup white sugar; ¼ cup ground cumin; ¼ cup cayenne pepper; ¼ cup brown sugar; ¼ cup chili powder; ¼ cup garlic powder; ¼ cup onion powder; ¼ cup kosher salt; ¼ cup freshly cracked black pepper; 10 pounds beef brisket, or more to taste",
  "directions": "1. Soak wood chips in a bowl of water, 8 hours to overnight. 2. Mix paprika, white sugar, cumin, cayenne pepper, brown sugar, chili powder, garlic powder, onion powder, salt, and black pepper together in a bowl. Rub the spice mixture over the entire brisket; refrigerate for 24 hours. 3. Preheat smoker to between 220 degrees F (104 degrees C) and 230 degrees F (110 degrees C). Drain wood chips and place in the smoker. 4. Smoke brisket in the preheated smoker until it has an internal temperature of 165 degrees F (74 degrees C), about 12 1/2 hours. Wrap brisket tightly in butcher paper or heavy-duty aluminum foil and return to smoker. 5. Continue smoking brisket until an internal temperature of 185 degrees F (85 degrees C) is reached, about 1 hour more.",
  "prep": "15 mins",
  "cook": "13 hrs 30 mins",
  "total": "1 day 13 hrs 45 mins",
  "calories": "228"
},
{
  "url": "https://www.allrecipes.com/recipe/102160/corned-beef-hash-british-style/",
  "name": "Corned Beef Hash British Style",
  "rating": "3.3",
  "ratingcount": "17",
  "ingredients": "4 large baking potatoes, peeled and cubed; 1 (16 ounce) can baked beans; 1 (12 ounce) can corned beef, broken into pieces; 1 dash Worcestershire sauce; ½ cup shredded sharp Cheddar cheese",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Place the potatoes in a large pot with just enough water to cover. Bring to a boil and simmer until tender, about 10 minutes. Drain and mash, flavoring with milk, butter, salt or however you like to make them. 3. Pour the baked beans into the bottom of a 1 1/2 quart casserole dish. Slice the corned beef and arrange on top of the beans in an even layer. Season with a few dashes of Worcestershire sauce. Top with mashed potatoes. 4. Bake uncovered for 25 minutes in the preheated oven. The mashed potatoes should start to crisp up but not yet brown. Top with the cheese and return to the oven. Bake for another 20 minutes, or until cheese is browned.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "447"
},
{
  "url": "https://www.allrecipes.com/recipe/23909/the-real-reuben/",
  "name": "The Real Reuben",
  "rating": "4.5",
  "ratingcount": "94",
  "ingredients": "2 slices dark rye bread; ¼ pound thinly sliced corned beef; 3 ounces sauerkraut, drained; 2 slices Swiss cheese; ¼ cup thousand island dressing",
  "directions": "1. Place bread on baking sheet or broiling pan. Layer corned beef, sauerkraut and cheese on top of bread slices. 2. Broil on high heat for 3 to 4 minutes, until cheese has melted. Serve hot with Thousand Island dressing.",
  "prep": "5 mins",
  "cook": "3 mins",
  "total": "8 mins",
  "calories": "874"
},
{
  "url": "https://www.allrecipes.com/recipe/82380/oklahoma-brisket/",
  "name": "Oklahoma Brisket",
  "rating": "4.6",
  "ratingcount": "175",
  "ingredients": "½ cup honey; 3 tablespoons soy sauce; seasoned salt to taste; 1 (5 pound) beef brisket; 1 cup apple cider; seasoned salt to taste; ¾ cup ketchup; ¼ cup packed brown sugar; 2 tablespoons Worcestershire sauce; ¼ cup apple cider vinegar; seasoned salt to taste; ½ teaspoon garlic powder, or to taste",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). Season the brisket all over with seasoned salt, and place in a roasting pan. Pour the apple juice over it, and cover tightly with aluminum foil. 2. Roast the brisket for 3 hours in the preheated oven. Don't peek. 3. Prepare a grill for low heat. In a small bowl, stir together the honey and soy sauce, and season with seasoned salt. 4. When the roast comes out of the oven, place it on the preheated grill. Grill for 30 minutes, turning frequently and basting with the honey sauce. 5. Meanwhile, in a saucepan over low heat, make a barbeque sauce by combining the ketchup, brown sugar, Worcestershire sauce, cider vinegar, seasoned salt, and garlic powder. Cook and stir over low heat for 15 minutes without allowing the sauce to boil. If you boil the sauce, it becomes very vinegary. 6. Let the brisket rest for about 10 minutes after it comes off the grill. Slice and serve with the barbeque sauce.",
  "prep": "30 mins",
  "cook": "4 hrs",
  "total": "4 hrs 30 mins",
  "calories": "616"
},
{
  "url": "https://www.allrecipes.com/recipe/17855/glazed-corned-beef/",
  "name": "Glazed Corned Beef",
  "rating": "4.7",
  "ratingcount": "320",
  "ingredients": "4 ½ pounds corned beef, rinsed; 1 cup water; 1 cup apricot preserves; ¼ cup brown sugar; 2 tablespoons soy sauce",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Coat a large pan with non-stick cooking spray. Place corned beef in dish and add water. Cover tightly with aluminum foil and bake for 2 hours; drain liquid. 3. In a small bowl combine apricot preserves, brown sugar, and soy sauce. Spread the apricot mixture evenly over the corned beef. 4. Bake uncovered at 350 degrees F (175 degrees C) 25 to 30 more minutes, or until the meat is tender; basting occasionally with pan drippings. 5. Slice corned beef across grain and serve.",
  "prep": "15 mins",
  "cook": "3 hrs",
  "total": "3 hrs 15 mins",
  "calories": "463"
},
{
  "url": "https://www.allrecipes.com/recipe/14647/oven-barbecued-beef-brisket-i/",
  "name": "Oven Barbecued Beef Brisket I",
  "rating": "4.5",
  "ratingcount": "228",
  "ingredients": "4 pounds beef brisket; salt to taste; 1 teaspoon freshly ground black pepper; 1 teaspoon garlic powder; 1 cup barbecue sauce; 1 cup water",
  "directions": "1. Preheat oven to 325 degrees F (160 degrees). 2. Sprinkle both sides of brisket with salt, pepper and garlic powder. Place in a large covered roasting pan. 3. Cook covered with no water at 325 degrees F (160 degrees C) allowing 1 hour per pound. 4. Before last hour of cooking, remove brisket and slice. Return slices to pan and add barbecue sauce mixed with water. Cover meat with sauce, cover, and cook 1 hour longer.",
  "prep": "10 mins",
  "cook": "5 hrs",
  "total": "5 hrs 10 mins",
  "calories": "672"
},
{
  "url": "https://www.allrecipes.com/recipe/160206/baked-corn-beef-hash/",
  "name": "Baked Corn Beef Hash",
  "rating": "4.1",
  "ratingcount": "11",
  "ingredients": "1 tablespoon vegetable oil; 1  onion, sliced; 1 (14 ounce) can baked beans; 1 (12 ounce) can corned beef, chopped; 2 tablespoons tomato puree; 1 dash Worcestershire sauce; 2 cups mashed potatoes; 1 cup shredded extra-sharp Cheddar cheese",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Heat the vegetable oil in a skillet over medium heat. Add the onion, and cook until the onion has softened and turned translucent, about 5 minutes. Meanwhile, spread the baked beans in a casserole dish. Toss the corned beef with the tomato puree and Worcestershire sauce in a bowl and sprinkle over the beans. Spread the onions overtop, followed by the mashed potatoes. Finally, sprinkle with the shredded Cheddar cheese. 3. Bake in preheated oven for 30 minutes until the casserole is hot and bubbly.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "544"
},
{
  "url": "https://www.allrecipes.com/recipe/239927/corned-beef-dinner-for-st-patricks-day/",
  "name": "Corned Beef Dinner for St. Patrick's Day",
  "rating": "4.6",
  "ratingcount": "16",
  "ingredients": "4 pounds corned beef brisket, or more to taste; 2 quarts water, or as needed to cover; 1 medium head cabbage, cored and cut into 6 wedges; 12 small red potatoes, halved; 1 pound small white onions, peeled; 6 large carrots, peeled and cut in chunks; 1 tablespoon unsalted butter; 2 tablespoons all-purpose flour; 1 tablespoon red wine vinegar; ½ cup reduced-fat sour cream; 2 tablespoons coarse Dijon mustard",
  "directions": "1. Make the corned beef and vegetables: Place corned beef into a 6-quart Dutch oven, and pour in enough water to cover by 2 inches. Bring to a boil, skimming the liquid occasionally to remove fat from the top. Reduce the heat to medium-low, cover, and simmer for 2 hours. 2. Arrange cabbage, potatoes, onions, and carrots around beef; return to a boil. Reduce the heat to medium-low, cover, and simmer until vegetables are tender and beef can easily be pulled apart with a fork, about 40 minutes. Transfer beef to a serving platter. Remove vegetables with a slotted spoon and arrange around beef. Reserve 1 1/2 cups cooking liquid for the sauce. 3. Make the sauce: Melt butter in a small saucepan over medium heat. Whisk flour into melted butter until dissolved and bubbling, about 1 minute. Add reserved cooking liquid and vinegar; cook, stirring frequently, until sauce is slightly thickened, about 4 minutes. Remove from the heat and whisk in sour cream and mustard. 4. Serve sauce alongside corned beef and vegetables.",
  "prep": "15 mins",
  "cook": "3 hrs",
  "total": "3 hrs 15 mins",
  "calories": "545"
},
{
  "url": "https://www.allrecipes.com/recipe/160559/slow-cooker-corned-beef-style-brisket/",
  "name": "Slow Cooker Corned Beef-Style Brisket",
  "rating": "4.3",
  "ratingcount": "21",
  "ingredients": "1 small onion, minced; 3 cloves garlic, minced; ½ cup Dijon mustard; 2 tablespoons apple cider vinegar; 3  bay leaves, crumbled; 8  whole black peppercorns, crushed; 1 tablespoon pickling salt; 1 teaspoon chopped fresh parsley; 1 teaspoon celery seed; 1 (4 pound) beef brisket; 1 cup water; 4  carrots, peeled and cut into 1-inch chunks; ½ small head cabbage, sliced into strips",
  "directions": "1. Stir together the onion, garlic, mustard, vinegar, bay leaves, peppercorns, salt, parsley, and celery seed in a bowl. Cover, and refrigerate for 24 hours. 2. Rub the brisket with the mixture, wrap tightly, and refrigerate overnight. 3. To cook the brisket, place it into a slow cooker along with the water. Cover, and cook on low for 5 hours. Add the carrots, and cabbage, and continue cooking until the brisket is tender, about 3 hours more.",
  "prep": "20 mins",
  "cook": "8 hrs",
  "total": "1 day 16 hrs 20 mins",
  "calories": "340"
},
{
  "url": "https://www.allrecipes.com/recipe/220555/stout-slow-cooker-corned-beef-and-veggies/",
  "name": "Stout Slow Cooker Corned Beef and Veggies",
  "rating": "4.4",
  "ratingcount": "177",
  "ingredients": "1 ½ (12 fluid ounce) cans or bottles Irish stout beer (such as Guinness®), divided; 1 (4 pound) corned beef brisket; 1 ½ cups brown sugar; 3  sweet potatoes, cut into chunks; 1 head cabbage, cored and coarsely chopped; 2 large sweet onions, chopped; 6 large carrots, chopped; 3  red potatoes, cut into chunks",
  "directions": "1. Pour 1 bottle Irish stout beer into a slow cooker. 2. Rinse corned beef brisket and pat dry. Rub with brown sugar, including the bottom, and gently place brisket into the slow cooker with the stout beer. 3. Arrange sweet potatoes, cabbage, onion, carrots, and red potatoes on and around the brisket in the slow cooker. 4. Pour remaining 1/2 bottle Irish stout beer on and around brisket and vegetables to moisten the brown sugar. 5. Cover the cooker and cook on Low until corned beef is tender, 6 to 8 hours. Allow brisket to stand 5 minutes before slicing. 6. Serve hot and enjoy!",
  "prep": "30 mins",
  "cook": "6 hrs",
  "total": "6 hrs 30 mins",
  "calories": "289"
},
{
  "url": "https://www.allrecipes.com/recipe/236100/king-beef-oven-brisket/",
  "name": "King Beef Oven Brisket",
  "rating": "4.6",
  "ratingcount": "22",
  "ingredients": "2 tablespoons chili powder; 2 tablespoons salt; 1 tablespoon garlic powder; 1 tablespoon onion powder; 1 tablespoon freshly ground black pepper; 1 tablespoon white sugar; 2 teaspoons dry mustard; 1  bay leaf, crushed; 1 (4 pound) beef brisket; 1 ½ cups beef stock",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Mix chili powder, salt, garlic powder, onion powder, black pepper, sugar, mustard, and bay leaf together in a small bowl; season brisket with spice mixture. Arrange beef in a roasting pan or Dutch oven. Do not cover. 3. Bake in the preheated oven for 1 hour. Fill pan with enough beef stock to cover by 1/2 inch. Cover pan with lid or aluminum foil and reduce heat to 300 degrees F (150 degrees C). 4. Continue baking until beef is very tender, about 3 hours more. Slice beef thinly, across the grain and serve with juices from the pan.",
  "prep": "15 mins",
  "cook": "4 hrs",
  "total": "4 hrs 15 mins",
  "calories": "165"
},
{
  "url": "https://www.allrecipes.com/recipe/103067/jewish-grandmas-best-beef-brisket/",
  "name": "Jewish Grandma's Best Beef Brisket",
  "rating": "4.3",
  "ratingcount": "52",
  "ingredients": "1 tablespoon vegetable oil; 1 (4 pound) beef brisket; ground black pepper to taste; 2  onions, thickly sliced; 2 cloves garlic, peeled and cut in half; salt and pepper to taste",
  "directions": "1. Heat the oil in a large deep skillet or pot over medium-high heat. Season the brisket generously with black pepper. Place in the pan and cook until the surface is a rich brown color, not burnt, but dark. Lift the roast and scatter the onions in the pan. Place the uncooked side of the roast down onto the onions. Repeat the browning process. 2. Add the garlic to the pan, and fill with enough water to almost cover the roast. Bring to a simmer. Reduce heat to low and cover with a lid or tight-fitting aluminum foil. Simmer for 4 hours, turning the roast over once halfway through. The roast should be fork tender. 3. Remove the brisket to a serving platter. Bring the broth in the pan to a simmer, scraping the bottom to loosen any browned bits. Cook until reduced to a thin gravy. Taste and season with salt and pepper if needed.",
  "prep": "20 mins",
  "cook": "4 hrs",
  "total": "4 hrs 20 mins",
  "calories": "327"
},
{
  "url": "https://www.allrecipes.com/recipe/13156/reuben-soup/",
  "name": "Reuben Soup",
  "rating": "4.6",
  "ratingcount": "100",
  "ingredients": "½ cup chopped onion; ¼ cup chopped celery; 3 tablespoons butter; ¼ cup all-purpose flour; 3 cups water; 4 cubes beef bouillon; 8 ounces shredded corned beef; 1 cup sauerkraut, drained; 3 cups half-and-half cream; 3 cups shredded Swiss cheese; 8 slices rye bread, toasted and cut into triangles",
  "directions": "1. Cook onion and celery in butter in a large saucepan over medium-high heat until tender; stir in flour until smooth. Gradually stir in water and bouillon; bring to a boil. Reduce heat to low and simmer for 5 minutes. 2. Stir in corned beef, sauerkraut, cream, and 1 cup cheese. Cook and stir until slightly thickened, about 30 minutes. 3. Preheat the broiler. 4. Ladle soup into 8 oven-proof bowls. Top each serving with a slice of bread; sprinkle 1/4 cup cheese on top of each slice of bread. 5. Place in the oven under broiler until cheese melts and lightly browns.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "465"
},
{
  "url": "https://www.allrecipes.com/recipe/263159/beef-barbacoa-barbacoa-de-res/",
  "name": "Beef Barbacoa (Barbacoa de Res)",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "3 ½ pounds beef brisket; 1  white onion, halved; 3 cloves garlic; 3  bay leaves; salt to taste; water to cover; 6 small guajillo chile peppers, seeded and deveined; 2 small ancho chile peppers, seeded and deveined; 3 tablespoons white vinegar; 2 cloves garlic; 4  whole cloves; 3  whole allspice berries; ½ teaspoon ground black pepper; ¼ teaspoon dried oregano; ¼ teaspoon dried thyme; ¼ teaspoon cumin seeds; ¼ teaspoon ground ginger; 1 pinch ground cinnamon; salt to taste",
  "directions": "1. Place brisket in a stovetop pressure cooker. Add onion, garlic, bay leaves, and salt; cover with water. Close cooker securely and place pressure regulator over vent according to manufacturer's instructions. Heat until steam escapes in a steady flow and makes a whistling sound, about 10 minutes. Adjust temperature until regulator is gently rocking. Cook for 60 minutes. 2. Let pressure release naturally according to manufacturer's instructions, 5 to 10 minutes. Unlock lid and remove. 3. Remove brisket from the pressure cooker and shred with 2 forks. Strain the cooking liquid, discarding solids. Measure 2 cups for the barbacoa sauce and save the rest for another use. 4. Combine guajillo chile peppers and ancho chile peppers in a saucepan. Cover with water, bring to a boil, and cook for 5 minutes. Remove from heat and let stand in the hot water until softened, about 5 minutes. Drain. 5. Combine softened chile peppers, vinegar, garlic, cloves, allspice, black pepper, oregano, thyme, cumin, ginger, cinnamon and reserved 2 cups cooking liquid; blend until thick and very smooth. 6. Pour sauce into a heavy-bottomed pot over medium heat and season with salt. Bring to a soft boil; reduce the heat to low. Stir in shredded beef, coating completely with sauce. Cover pot and cook until flavors combine, at least 30 minutes and up to 1 hour.",
  "prep": "10 mins",
  "cook": "1 hr 50 mins",
  "total": "2 hrs 5 mins",
  "calories": "173"
},
{
  "url": "https://www.allrecipes.com/recipe/221041/wine-braised-beef-brisket/",
  "name": "Wine-Braised Beef Brisket",
  "rating": "4.7",
  "ratingcount": "211",
  "ingredients": "1 teaspoon dried thyme; 1 teaspoon salt; ¼ teaspoon ground black pepper; 1 (3 pound) beef brisket; 1 tablespoon olive oil; 1  red onion, sliced; 1 (14.5 ounce) can beef broth; 1 (8 ounce) can tomato sauce; ½ cup red wine",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Mix thyme, salt, and black pepper in a small bowl and rub the mixture over both sides of brisket. 3. Heat olive oil in a roasting pan over medium-high heat; place brisket in the hot oil and brown on both sides, 3 to 4 minutes per side. Remove brisket from pan and set aside. 4. Place red onion slices into the hot roasting pan and cook and stir until onion is slightly softened, about 2 minutes. Stir in beef broth, tomato sauce, and wine. 5. Place the brisket back into the roasting pan and cover pan with foil. 6. Roast the brisket in the preheated oven for 1 hour; remove foil and baste brisket with pan juices. Place foil back over roasting pan and roast brisket until very tender and pan sauce has thickened, 1 1/2 to 2 more hours.",
  "prep": "15 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 45 mins",
  "calories": "327"
},
{
  "url": "https://www.allrecipes.com/recipe/8346498/slow-cooker-beef-brisket/",
  "name": "Slow Cooker Beef Brisket",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "1 tablespoon brown sugar; 1 teaspoon chili powder; 1 teaspoon ground paprika; 1 teaspoon coarse salt; ¼ teaspoon freshly ground black pepper; ¼ teaspoon ground mustard powder; ¼ teaspoon onion powder; ¼ teaspoon garlic powder; 2 cups low-sodium beef broth; 1 teaspoon liquid smoke; 1 teaspoon Worcestershire Sauce; ¼ cup water, or as needed (Optional); 1 (2 pound) beef brisket; 2 medium yellow onions, quartered; 3 large carrots, cut into 1-inch pieces; ¼ cup prepared barbecue sauce",
  "directions": "1. Mix brown sugar, chili powder, paprika, salt, pepper, mustard powder, onion powder, and garlic powder for dry rub together in a small bowl. 2. Mix beef broth, liquid smoke, and Worcestershire sauce for cooking liquid in a separate bowl. 3. Place onions and carrots in a slow cooker. Pour cooking liquid over top and set to temperature High to let it warm up. 4. Meanwhile, rinse brisket under cold water. Pat it dry, then season all over with the dry rub. Place brisket in the slow cooker on top of the onions and carrots, with the fatty side facing up. The cooking liquid should reach just to the bottom of the brisket; if not, add a little water. 5. Cover and cook on Low for 8 hours. Turn the slow cooker off and transfer brisket to a foil-lined sheet pan. Trim some of the fat if desired. 6. Place barbecue sauce in a bowl. Ladle 1/4 cup hot cooking liquid from the slow cooker into the bowl and mix it with the barbecue sauce. Baste the fatty side of the brisket with this mixture. 7. Preheat the oven's broiler. 8. Place the brisket in the preheated oven so there are 6 inches between the top of the brisket and the burner. Broil until the fatty edges start to crisp up, 2 to 4 minutes; watch closely so it doesn't burn. 9. Remove from the oven and let rest for 10 minutes. Slice brisket thinly and against the grain. 10. Remove vegetables from the slow cooker with a slotted spoon, and serve alongside the brisket.",
  "prep": "35 mins",
  "cook": "8 hrs",
  "total": "8 hrs 45 mins",
  "calories": "825"
},
{
  "url": "https://www.allrecipes.com/recipe/231567/spicy-and-tender-corned-beef/",
  "name": "Spicy and Tender Corned Beef",
  "rating": "4.4",
  "ratingcount": "36",
  "ingredients": "½ (12 fluid ounce) can or bottle dark beer; 1 tablespoon dry mustard; 1 pinch salt and ground black pepper to taste; 3 cloves garlic, cut into slivers; 3  whole cloves, or to taste; 1 (3 pound) round-cut corned beef roast with spice packet; 1 (16 ounce) package carrots, cut into 2-inch pieces; 1 (16 ounce) package small red potatoes; 1 head green cabbage, cored and cut into wedges; 1 tablespoon butter, or to taste",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Pour beer into a roasting pan. Stir in corned beef seasoning packet, dry mustard, salt, and black pepper. Use a sharp knife to pierce corned beef all over; insert garlic slivers into holes. Push whole cloves into meat. Lay corned beef in the roasting pan. 3. Bake in the preheated oven for 1 hour. 4. Scatter carrots around corned beef; roast for about 1 1/2 hours more. 5. Distribute red potatoes around meat; roast until corned beef and vegetables are tender, about 40 minutes more. 6. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cabbage wedges; cover and steam until tender, about 10 minutes. 7. Transfer cabbage to a platter; season with salt and black pepper. Let butter melt over hot cabbage. Cut visible fat from corned beef and serve with cabbage, carrots, and potatoes.",
  "prep": "20 mins",
  "cook": "3 hrs 30 mins",
  "total": "3 hrs 50 mins",
  "calories": "424"
},
{
  "url": "https://www.allrecipes.com/recipe/285894/corned-beef-and-cabbage-with-guinness-dijon-gravy/",
  "name": "Corned Beef and Cabbage with Guinness®-Dijon Gravy",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "¼ medium white onion, chopped; 2 cloves garlic, minced; 1 (2 pound) corned beef brisket with spice packet; 4 cups water; 2 large bay leaves; 7 medium Yukon Gold potatoes, quartered; 4 medium carrots, cut into 1-inch chunks; ⅓ medium head cabbage, coarsely chopped; 2 tablespoons butter; 2 tablespoons all-purpose flour; 1 cup beef broth; ½ cup Irish stout beer (such as Guinness®); 2 tablespoons Dijon mustard; 1 teaspoon ground black pepper; ½ teaspoon salt",
  "directions": "1. Place onion and garlic in a slow cooker. Put corned beef brisket on top. Pour in water, then add bay leaves and spice packet. Cover and cook on Low for 8 hours, adding potatoes at the 3-hour mark, carrots at the 4-hour mark, and cabbage at the 6-hour mark. 2. Turn off the slow cooker. Remove brisket to a platter and tent with aluminum foil for 10 minutes to let juices settle. 3. Meanwhile, melt butter in a saucepan over medium-low heat. Stir in flour to make a roux; cook to burn out any flour taste, about 5 minutes. Whisk in, a little at a time, beef broth, Guinness®, and mustard. Stir until gravy is thick enough to coat the back of a spoon. Stir in pepper and salt. 4. Slice meat across the grain and plate with cabbage, potatoes, and carrots. Ladle gravy over top.",
  "prep": "25 mins",
  "cook": "8 hrs",
  "total": "8 hrs 35 mins",
  "calories": "372"
},
{
  "url": "https://www.allrecipes.com/recipe/216933/apple-and-brown-sugar-corned-beef/",
  "name": "Apple and Brown Sugar Corned Beef",
  "rating": "4.5",
  "ratingcount": "207",
  "ingredients": "4 cups apple juice; ½ cup brown sugar; 1 tablespoon prepared mustard; 2 (3 pound) corned beef briskets with spice packets; 20 small red potatoes, scrubbed; 4  carrots, cut into chunks; 2  onions, cut into 8 wedges; 1 head cabbage, cored and cut into large chunks",
  "directions": "1. Pour the apple juice into a large slow cooker, and mix in the brown sugar and mustard, stirring until the brown sugar has dissolved. Mix in the contents of the spice packets, and lay the briskets into the apple juice mixture. Top with red potatoes, carrots, onions, and cabbage chunks. Push all ingredients into the liquid. 2. Cover and cook on High until corned beef is very tender, 4 to 5 hours; or cook on Low for 8 to 10 hours. Slice meat thinly across the grain, and serve with vegetables.",
  "prep": "15 mins",
  "cook": "4 hrs",
  "total": "4 hrs 15 mins",
  "calories": "672"
}]