[{
  "url": "https://www.allrecipes.com/recipe/278327/yeasted-buckwheat-bread/",
  "name": "Yeasted Buckwheat Bread",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "¾ cup water; ¼ cup vegetable oil; ¼ cup sour cream; 1 large egg; 1 large egg yolk; 2 ⅔ cups bread flour; ¾ cup buckwheat flour; 1 tablespoon white sugar; 2 ¼ teaspoons active dry yeast; ¾ teaspoon salt",
  "directions": "1. Place water, oil, sour cream, egg, egg yolk, bread flour, buckwheat flour, sugar, salt, and yeast into a bread machine in the order listed, or follow the order recommended by the manufacturer if different. Run Bread cycle. Remove loaf from the machine after the cycle is done, about 2 hours 55 minutes.",
  "prep": "10 mins",
  "cook": "2 hrs",
  "total": "3 hrs 5 mins",
  "calories": "188"
},
{
  "url": "https://www.allrecipes.com/recipe/7226/sourdough-buckwheat-pancakes/",
  "name": "Sourdough Buckwheat Pancakes",
  "rating": "4.3",
  "ratingcount": "35",
  "ingredients": "2 cups sourdough starter; 2  eggs, beaten; 1 tablespoon vegetable oil; 3 tablespoons white sugar; ½ teaspoon vanilla extract; 1 teaspoon salt; 1 cup buckwheat flour; ½ cup all-purpose flour; ½ teaspoon baking soda; 1 teaspoon ground ginger",
  "directions": "1. In a large bowl mix the starter, egg, vegetable oil, sugar and vanilla together. Stir in the salt, buckwheat flour, all-purpose flour, baking soda and ginger. Mix until just combined. Adjust consistency with more flour or some water, depending upon how thick your starter is. The batter should be pourable, but not runny. 2. Heat a griddle to 400 degrees F (200 degrees C). Lightly grease griddle and ladle 1/4 to 1/3 cup of batter onto hot greased griddle. Cook for about 3 to 4 minutes or until top is full of bubbles. Use a spatula to turnover and cook other side for and additional 2 minutes or so. Serve hot!",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "457"
},
{
  "url": "https://www.allrecipes.com/recipe/223531/savory-french-crepes/",
  "name": "Savory French Crêpes",
  "rating": "4.4",
  "ratingcount": "5",
  "ingredients": "2  eggs; 1 ½ cups milk; 2 tablespoons butter; ¼ cup buckwheat flour; ¾ cup all-purpose flour; 1 pinch salt; 3 tablespoons butter; ½ cup cremini mushrooms, sliced; ½ cup oyster mushrooms, sliced; 1 cup diced tomatoes; 2 cups baby spinach leaves; 4 teaspoons butter, divided; 1 cup shredded Gruyère cheese, divided",
  "directions": "1. Make the crêpe batter: Combine eggs, milk, and 2 tablespoons butter in a blender. Add buckwheat flour, all-purpose flour, and a pinch of salt; purée until smooth. Cover and refrigerate for 8 hours or overnight. 2. Make the filling: Melt 3 tablespoons butter in a large skillet over medium-high heat. Add cremini and oyster mushrooms; cook and stir until golden brown, about 10 minutes. Add tomatoes and spinach; cook and stir until spinach is wilted, 3 to 4 minutes. Remove from the heat. 3. Melt 1 teaspoon butter in another large skillet over medium heat. Pour about 1/4 cup batter (depending on the size of your pan) into the hot skillet' immediately tilt and swirl the pan to evenly distribute batter along the bottom. Cook until the center is set and the edges begin to brown, 3 to 4 minutes. Sprinkle 1/4 of the filling in the middle of each crêpe, then sprinkle with 3 tablespoons Gruyère cheese. Fold the crêpe in thirds over the filling, forming a triangle shape. Sprinkle 1 tablespoon Gruyère over top. Repeat to make remaining crêpes, adding 1 teaspoon butter for each one.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "8 hrs 40 mins",
  "calories": "507"
},
{
  "url": "https://www.allrecipes.com/recipe/228526/toasted-buckwheat-tabbouleh/",
  "name": "Toasted Buckwheat Tabbouleh",
  "rating": "4.2",
  "ratingcount": "9",
  "ingredients": "1 cup kasha (toasted buckwheat groats); 1 tablespoon olive oil; 2  onions, peeled and chopped; 1 clove garlic, minced, or to taste; 1  cucumber, peeled and diced; ¾ cup chopped fresh parsley; 6 tablespoons chopped fresh mint; 1  lemon, juiced; 1 pinch dried mixed herbs",
  "directions": "1. Rinse buckwheat groats. Bring a saucepan of water to a boil, sprinkle in the buckwheat groats, and simmer until buckwheat is tender, about 10 minutes. Drain and cool. 2. Heat olive oil in a skillet over medium heat; cook and stir onions and garlic until onion is translucent, 5 to 8 minutes. Set aside to cool. 3. Lightly toss cucumber, parsley, mint, lemon juice, and mixed herbs in a large salad bowl until thoroughly combined; stir in cooked buckwheat and onion mixture.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "233"
},
{
  "url": "https://www.allrecipes.com/recipe/238579/buckwheat-cake/",
  "name": "Buckwheat Cake",
  "rating": "3.6",
  "ratingcount": "5",
  "ingredients": "1 cup all-purpose flour; 1 cup buckwheat flour; ¾ cup white sugar; 1 tablespoon baking powder; ½ teaspoon salt; ¾ cup milk; 1  egg; 2 tablespoons margarine, softened",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch baking dish. 2. Whisk all-purpose flour, buckwheat flour, sugar, baking powder, and salt together in a bowl. Add milk, egg, and margarine to flour mixture and beat until batter is smooth; pour into prepared baking dish. 3. Bake in the preheated oven until golden brown and a toothpick inserted into the center of the cake comes out clean, 30 to 40 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "309"
},
{
  "url": "https://www.allrecipes.com/recipe/14096/best-buckwheat-pancakes/",
  "name": "Best Buckwheat Pancakes",
  "rating": "4.3",
  "ratingcount": "144",
  "ingredients": "1 cup buttermilk; 1  egg; 3 tablespoons butter, melted; 6 tablespoons all-purpose flour; 6 tablespoons buckwheat flour; 1 teaspoon white sugar; ½ teaspoon salt; 1 teaspoon baking soda; 3 tablespoons butter",
  "directions": "1. In a medium bowl, whisk together the buttermilk, egg, and melted butter. 2. In another bowl, mix together white flour, buckwheat flour, sugar, salt and baking soda. Pour the dry ingredients into the egg-mixture. Stir until the two mixtures are just incorporated. 3. Heat a griddle or large frying pan to medium-hot, and place 1 tablespoon of butter, margarine or oil into it. Let the butter melt before spooning the batter into the frying pan, form 4 inch pancakes out of the batter. Once bubbles form on the top of the pancakes, flip them over, and cook them on the other side for about 3 minutes. Continue with this process until all of the batter has been made into pancakes.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "560"
},
{
  "url": "https://www.allrecipes.com/recipe/278290/lentil-and-buckwheat-soup/",
  "name": "Lentil and Buckwheat Soup",
  "rating": "4.4",
  "ratingcount": "8",
  "ingredients": "1 cup brown lentils; 1 tablespoon olive oil; 1 small onion, grated; 1 small carrot, grated; 2  bay leaves; 4 ½ cups low-sodium vegetable broth, divided; ¾ cup raw buckwheat groats; 1 (9 ounce) package fresh baby spinach; 3 tablespoons extra-virgin olive oil",
  "directions": "1. Soak lentils in a bowl of cold water for 1 hour. Drain and set aside. 2. Heat oil in a Dutch oven or heavy-bottomed stew pot over medium heat. Add grated onion and carrot and saute until soft, 3 to 5 minutes. Add lentils and bay leaves and stir until coated with oil. Pour in 3 cups vegetable broth, stir, and bring to a boil. Leave at a slow boil for 10 minutes. 3. Reduce heat to a simmer and add buckwheat. Simmer until lentils are soft but not mushy and buckwheat is cooked through, about 25 minutes, adding remaining broth if needed. Remove from the heat and fold in fresh spinach until wilted. Remove bay leaves. 4. Serve hot with a 1/2 tablespoon olive oil drizzled on top of each portion.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "1 hr 55 mins",
  "calories": "224"
},
{
  "url": "https://www.allrecipes.com/recipe/273163/gluten-free-buckwheat-brownies/",
  "name": "Gluten-Free Buckwheat Brownies",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "4 ounces semisweet baking chocolate, chopped; ¼ cup unsalted butter; ½ cup white sugar, or more to taste; 2  large eggs; 1 teaspoon vanilla extract; ⅔ cup buckwheat flour; ⅛ teaspoon baking soda; ¼ teaspoon salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C) on convection heat. Grease an 8x8-inch baking dish. 2. Place chocolate and butter in the top of a double boiler over simmering water. Stir frequently, scraping down the sides with a rubber spatula to avoid scorching, until chocolate is melted, about 5 minutes. 3. Pour chocolate mixture into a large bowl and stir in sugar. Cool slightly, then beat in eggs, 1 at a time. Stir in vanilla extract. 4. In a separate bowl, mix buckwheat flour, baking soda, and salt together. Add to chocolate mixture, stirring constantly to mix well. Pour batter into the prepared baking dish and smooth out the top. 5. Bake in the preheated oven until top is dry and edges have started to pull away from the sides of the pan, 20 to 25 minutes. Let cool completely before slicing.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "148"
},
{
  "url": "https://www.allrecipes.com/recipe/264483/gluten-free-sourdough-starter/",
  "name": "Gluten-Free Sourdough Starter",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "3 cups brown rice flour; 3 cups buckwheat flour; filtered water, at room temperature, as needed",
  "directions": "1. Mix together the brown rice flour and the buckwheat flour until well combined. 2. Day 1: Whisk together 1 cup of the flour mix and 3/4 cup filtered water in a glass jar. Stir well until smooth and no lumps remain. Cover with a piece of cheesecloth or a clean linen towel and let sit at room temperature (about 70 degrees F (21 degrees C)), far from drafts or direct sunlight. Do not cover with plastic wrap, the circulation of air is important. Every once in a while, stir the mixture with a fork or whisk. Check to see if small bubbles start to form in the mixture. These bubbles indicate that wild yeast is forming. 3. Day 2: As well as stirring, you will begin to feed the starter on day 2. In the morning, mix 1/4 cup of flour mixture and 3 tablespoons room-temperature filtered water. Once mixed well, add the flour-water mixture to the jar with the starter mixture. Stir well and continue to stir throughout the day if possible. Every 12 hours, add this same feeding mixture (1/4 cup flour plus 3 tablespoons water) to the mother mixture. 4. Day 3: By now, you should notice an overall sponge-like texture. If this is the case, your starter is ready to use. At this point, it should be kept in certain conditions to keep from over-growing. Keep it sealed, in the refrigerator. 5. If your starter has only a bit of foam at the top, but you notice a fragrant smell of yeast, these are good signs and could be that the room is too cool. Check to make sure the location is draft free. If you don't notice these minimal signs and a note a foul smell, discard starter and restart. 6. If your sponge is still very watery but has a sponge forming, mix well, take out 1 cup of the mixture, and discard (or use in another recipe) and feed the starter every 6 hours. 7. By day 4 your starter should be ready. Keep the starter covered in the refrigerator and feed very two weeks or each time you measure out any starter.",
  "prep": "10 mins",
  "cook": "",
  "total": "4 days 10 mins",
  "calories": "2708"
},
{
  "url": "https://www.allrecipes.com/recipe/261725/ellens-vegan-stuffed-peppers/",
  "name": "Ellen's Vegan Stuffed Peppers",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "1 tablespoon olive oil; 1  onion, chopped; 2 teaspoons minced garlic; ½ cup kasha (toasted buckwheat groats); 1 ¼ cups vegetable broth; 2  tomatoes, chopped; ¼ cup chopped fresh parsley; ½ teaspoon red pepper flakes, or to taste; salt and ground black pepper to taste; 4 large green bell peppers",
  "directions": "1. Heat oil in a saucepan over medium-high heat. Saute onion and garlic until onion is almost clear but not browning, about 5 minutes. Add buckwheat; stir until coated, about 1 minute. Add broth and bring to a boil. Simmer until liquid is absorbed, about 15 minutes. Add tomatoes, parsley, red pepper flakes, salt, and pepper. Cook and stir until heated through, about 3 minutes. 2. Preheat the oven to 350 degrees F (175 degrees C). 3. Remove tops and seeds from peppers. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add peppers, cover, and steam until tender, about 5 minutes. 4. Stand peppers up in a casserole dish and fill them with the buckwheat mixture. 5. Bake in the preheated oven until browned, about 15 minutes.",
  "prep": "15 mins",
  "cook": "49 mins",
  "total": "1 hr 4 mins",
  "calories": "172"
},
{
  "url": "https://www.allrecipes.com/recipe/258398/buckwheat-grissini-with-real-butter-gluten-free/",
  "name": "Buckwheat Grissini with Real Butter (Gluten Free)",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "⅓ cup buckwheat flour; ⅓ cup finely grated Parmigiano-Reggiano cheese; ¼ cup gluten-free all-purpose flour; 2 tablespoons butter, divided; 1 tablespoon black sesame seeds; 1 tablespoon fresh thyme leaves; 3 tablespoons water, or more as needed",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Mix buckwheat flour, Parmigiano-Reggiano cheese, gluten-free flour, and 1 1/2 tablespoon butter in a bowl with your hands until the mixture resembles small pebbles. Mix in sesame seeds and thyme. Add water, 1 tablespoon at a time, until the mixture pulls together into a soft dough. 3. Divide dough into 6 portions. Let dough rest for 5 minutes. 4. Roll each portion of dough into a long, thin stick about 6 to 7 inches long. Arrange side by side on the baking sheet. Brush remaining 1 1/2 teaspoon butter over dough. 5. Bake in the preheated oven until completely browned, about 20 minutes. Cool completely before serving, about 10 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "309"
},
{
  "url": "https://www.allrecipes.com/recipe/220141/wholesome-buckwheat-crepes/",
  "name": "Wholesome Buckwheat Crepes",
  "rating": "4.6",
  "ratingcount": "7",
  "ingredients": "⅔ cup raw buckwheat groats; 1 ⅓ cups water, to cover; 1  egg; 2 tablespoons brown sugar; ¼ teaspoon ground cinnamon; ¼ teaspoon salt; ½ cup water, or as needed",
  "directions": "1. Combine buckwheat groats with about 1 1/3 cup water in a bowl; allow to soak, draining and rinsing once or twice during soaking, 4 hours to overnight. 2. Rinse and drain groats one final time. Transfer drained groats to a blender with egg, brown sugar, cinnamon, salt, and 1/2 cup water; blend into a smooth batter. Blend more water into the mixture as needed to reach a smooth, spreadable texture. 3. Lightly grease a skillet and place over medium heat. 4. Pour about 1/3 cup batter into the skillet; lift and tilt the skillet to swirl the batter evenly over the skillet; return to heat. 5. Cook for about 2 minutes. Gently flip the crepe and cook the other side until the crepe is firm in the middle, about 2 minutes more; flip again and cook about 12 seconds. Plate and serve immediately.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "4 hrs 15 mins",
  "calories": "283"
},
{
  "url": "https://www.allrecipes.com/recipe/134331/buckwheat-blinis/",
  "name": "Buckwheat Blinis",
  "rating": "4.4",
  "ratingcount": "9",
  "ingredients": "2 cups warm milk (110 degrees F/45 degrees C); 1 (.25 ounce) envelope active dry yeast; 1 teaspoon sugar; 1 cup buckwheat flour; 4  eggs, beaten; ¼ cup sour cream; ½ cup heavy cream; ½ teaspoon salt; 1 ⅓ cups all-purpose flour",
  "directions": "1. Pour warm milk into a large bowl, then sprinkle yeast onto the milk, and allow to soften for 5 minutes. Stir in sugar and buckwheat flour; cover, and let rise for 1 hour. 2. Stir in the eggs, sour cream, heavy cream, salt, and flour until a batter forms. Cover again, and let rise for 2 hours. 3. Heat a large skillet over medium heat. Spray with cooking spray, then pour in small amounts of batter to form 1 1/2-inch blinis. Cook until the blinis begin to set and dry, and the bubbles begin to burst, about 2 minutes. Flip over, and continue cooking until browned on the other side, about 1 minute.",
  "prep": "10 mins",
  "cook": "12 mins",
  "total": "3 hrs 22 mins",
  "calories": "18"
},
{
  "url": "https://www.allrecipes.com/recipe/254738/overnight-buckwheat-oats/",
  "name": "Overnight Buckwheat Oats",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "¼ cup buckwheat flakes; 2 teaspoons chia seeds; 1 tablespoon coconut, divided; 1 teaspoon flax seed meal; ⅛ teaspoon ground cinnamon; ⅛ teaspoon vanilla powder; ⅓ cup milk; 2 tablespoons mixed berries; 1 teaspoon agave",
  "directions": "1. Combine buckwheat, chia seeds, 1 1/2 teaspoons coconut, flax seed meal, cinnamon, and vanilla powder in a jar; stir until well mixed. Stir in milk; cover. Place in the refrigerator, 8 hours to overnight. 2. Stir buckwheat mixture. Heat in the microwave for 30 seconds. Stir in mixed berries, remaining coconut, and agave.",
  "prep": "5 mins",
  "cook": "1 mins",
  "total": "8 hrs 6 mins",
  "calories": "215"
},
{
  "url": "https://www.allrecipes.com/recipe/264530/old-fashioned-sour-buckwheat-pancakes/",
  "name": "Old-Fashioned Sour Buckwheat Pancakes",
  "rating": "3.8",
  "ratingcount": "4",
  "ingredients": "2 cups buckwheat flour; 1 cup all-purpose flour; 1 cup buttermilk, or more as needed; ½ (0.6 ounce) cake fresh yeast; 1 teaspoon white sugar; 1 teaspoon baking soda; ⅛ teaspoon salt; 1 cup hot water, or as needed",
  "directions": "1. Combine buckwheat and all-purpose flours in a mixing bowl. Add buttermilk and yeast. Stir with a spoon until batter is smooth. Add more buttermilk, one tablespoon at a time, if batter is too stiff. 2. Cover the bowl with a dinner plate and let stand in a draft-free place, 8 hours to overnight. 3. Add sugar, baking soda, and salt after the overnight rest. Mix in enough hot water to give batter a thin, pourable consistency. 4. Heat a lightly oiled griddle over medium heat. 5. Drop batter by large spoonfuls onto the griddle and cook until bubbles appear and edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Reserve some batter as a starter for the next batch.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "8 hrs 25 mins",
  "calories": "175"
},
{
  "url": "https://www.allrecipes.com/recipe/241553/buckwheat-pancakes/",
  "name": "Buckwheat Pancakes",
  "rating": "4.8",
  "ratingcount": "188",
  "ingredients": "1 cup buckwheat flour; 1 ½ teaspoons white sugar; 1 teaspoon baking powder; ¼ teaspoon baking soda; ¼ teaspoon salt; 1 ¼ cups buttermilk; 1  large egg, beaten; ¼ teaspoon vanilla extract; 1 tablespoon unsalted butter, or as needed",
  "directions": "1. Whisk buckwheat flour, sugar, baking powder, baking soda, and salt together in a medium bowl. 2. Beat buttermilk, egg, and vanilla together in a large bowl. 3. Pour flour mixture into buttermilk mixture; whisk until batter is thick and smooth. Let batter rest until bubbles form and batter relaxes, about 5 minutes 4. Melt butter on a griddle over medium heat. Drop batter by large spoonfuls onto the hot griddle and cook until bubbles form and the edges dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter. 5. Serve with berries.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "196"
},
{
  "url": "https://www.allrecipes.com/recipe/254760/best-buckwheat-salad/",
  "name": "Best Buckwheat Salad",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "2 cups water; 1 cup buckwheat; 1  lime, juiced; 1  red onion, chopped; 1  tomato, chopped; ½ cup chopped pitted Kalamata olives; 1 bunch fresh mint, chopped; ½ bunch fresh dill, chopped; 2 tablespoons olive oil; 1 tablespoon rice wine vinegar; 1 teaspoon ground cumin; salt and ground black pepper to taste; ⅓ cup feta cheese",
  "directions": "1. Combine water and buckwheat in a saucepan; bring to a boil. Reduce heat; simmer until water is absorbed, about 10 minutes. 2. Pour lime juice into a bowl; add onion, tomato, Kalamata olives, mint, and dill. Stir in olive oil, rice wine vinegar, cumin, salt, and pepper. Add buckwheat; stir until ingredients are combined. Top with feta cheese.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "224"
},
{
  "url": "https://www.allrecipes.com/recipe/255308/peach-cobbler-celiac-friendly/",
  "name": "Peach Cobbler (Celiac-Friendly)",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "1 cup buckwheat flour; ½ cup brown sugar; ¼ cup white sugar; 2 teaspoons baking powder; 1 teaspoon vanilla extract; ½ teaspoon salt; ¾ cup vanilla-flavored almond milk; 6 tablespoons butter, melted; 1 (28 ounce) can sliced peaches, drained; 1 teaspoon ground cinnamon",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Grease a 9-inch baking dish. 2. Combine flour, brown sugar, white sugar, baking powder, vanilla extract, and salt in a bowl; mix in almond milk and butter. 3. Pour flour mixture into the prepared baking dish. Top with peaches. Sprinkle cinnamon on top. 4. Bake in the preheated oven until the top is lightly browned and the peaches are bubbling, about 30 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "265"
},
{
  "url": "https://www.allrecipes.com/recipe/239015/lentils-and-buckwheat-salad-to-go-gluten-free/",
  "name": "Lentils and Buckwheat Salad To Go (Gluten-Free)",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "¼ cup dry lentils; 3 tablespoons olive oil; ¼ teaspoon ground paprika; ¼ teaspoon ground rainbow peppercorns; ¼ teaspoon ground turmeric; ¼ teaspoon red pepper flakes; ¼ teaspoon ground mace; ¼ teaspoon ground coriander; ¼ teaspoon crushed rose petals (Optional); 4 ¼ cups water; ¼ cup buckwheat groats, rinsed; 1 teaspoon salt; 1 ½ ounces baby spinach leaves; ½ cup shredded cooked beets; ½ cup shredded carrots; 2 tablespoons finely chopped green onions; 1 teaspoon apple cider vinegar",
  "directions": "1. Place lentils into a bowl and cover with several inches of cool water; let stand at least 2 hours. Drain and rinse. 2. Mix olive oil, paprika, pepper, turmeric, red pepper flakes, mace, coriander, and rose petals together in a bowl. 3. Combine lentils and 4 1/4 cups water in a pot and bring to a boil; cook until lentils are tender yet firm to the bite, 15 to 18 minutes. Add buckwheat groats and return water to a boil; add salt. Cook lentils and buckwheat for 10 minutes; remove from heat, cover pot, and let sit until all water is absorbed, about 5 minutes. 4. Pour lentils and buckwheat into a large bowl; add spinach, beets, carrots, and green onions. Pour seasoned oil mixture over lentil mixture and stir to coat. Drizzle apple cider vinegar over salad and stir to coat. Refrigerate for flavors to blend, at least 30 minutes.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "3 hrs 35 mins",
  "calories": "380"
},
{
  "url": "https://www.allrecipes.com/recipe/279446/overnight-sourdough-buckwheat-pancakes/",
  "name": "Overnight Sourdough Buckwheat Pancakes",
  "rating": "3.3",
  "ratingcount": "3",
  "ingredients": "⅔ cup all-purpose flour; ⅔ cup buckwheat flour; ½ cup sourdough starter; 1 cup 2% milk; 2  eggs, lightly beaten; 2 tablespoons unsalted butter, melted and cooled; 1 teaspoon baking powder; ½ teaspoon vanilla extract (Optional); 1 pinch salt; cooking spray",
  "directions": "1. Stir all-purpose flour, buckwheat flour, sourdough starter, and milk together in a 1-quart container with a tight-fitting lid until evenly combined. Cover with lid and let sit on the counter, 8 hours to overnight. 2. Stir in eggs, butter, baking powder, vanilla extract, and salt the next morning. Whisk until smooth. 3. Spray a skillet with cooking spray and heat over medium heat. Pour about 2 tablespoons of batter into the skillet for each pancake and cook until bubbles form and the tops look dry, about 2 minutes. Flip pancakes over and cook for 1 more minute.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "8 hrs 25 mins",
  "calories": "154"
},
{
  "url": "https://www.allrecipes.com/recipe/259780/gluten-free-buckwheat-crepes/",
  "name": "Gluten-Free Buckwheat Crepes",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 cup milk; 2  eggs; 1 tablespoon vegetable oil; ½ cup gluten-free all-purpose baking flour; 3 tablespoons buckwheat flour; 1 teaspoon butter, or as needed",
  "directions": "1. Whisk milk, eggs, and vegetable oil together in a bowl. Sift in all-purpose flour and buckwheat flour gradually, stirring constantly, until batter is quite runny. 2. Melt butter in an 8-inch skillet or crepe pan over medium heat. Pour 1/4 cup batter into the skillet. Rotate the skillet until batter coats the bottom in a thin layer. Cook until the top of the crepe is no longer wet and the bottom has turned light brown, 1 to 2 minutes. Run a spatula around the edge of the skillet to loosen crepe; flip crepe and cook until the other side has turned light brown, about 1 minute more. Transfer to a cooling rack. Repeat with the remaining batter, whisking gently before using.",
  "prep": "10 mins",
  "cook": "2 mins",
  "total": "12 mins",
  "calories": "121"
},
{
  "url": "https://www.allrecipes.com/recipe/260486/gluten-free-buckwheat-pancakes/",
  "name": "Gluten-Free Buckwheat Pancakes",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "¾ cup gluten-free baking and pancake mix (such as Pamela's®); ¾ cup water; 1  egg; ¼ cup buckwheat flour; 1 tablespoon vegetable oil",
  "directions": "1. Mix gluten-free pancake mix, water, egg, buckwheat flour, and vegetable oil together in a bowl until there are no lumps. Add additional water if needed to thin batter. Let batter sit for 15 minutes for fluffier pancakes. 2. Heat a lightly oiled griddle over medium-low heat. Pour 1/4 cup batter onto the hot griddle and cook until golden brown, about 2 minutes. Flip and cook until opposite side is golden brown, about 1 minute more.",
  "prep": "5 mins",
  "cook": "3 mins",
  "total": "23 mins",
  "calories": "106"
},
{
  "url": "https://www.allrecipes.com/recipe/237865/gluten-free-buckwheat-avocado-salad/",
  "name": "Gluten-Free Buckwheat Avocado Salad",
  "rating": "4.4",
  "ratingcount": "10",
  "ingredients": "1 cup water; ½ cup buckwheat groats; 1 small avocado - peeled, pitted, and diced; 5  cherry tomatoes, diced; 1  lime, juiced; 2 tablespoons thinly sliced red onion; 1 ½ tablespoons extra-virgin olive oil; 1 tablespoon chopped fresh flat-leaf parsley; ½ teaspoon fennel seed; ½ teaspoon cayenne pepper; ¼ teaspoon freshly ground mixed peppercorns; ¼ cup soft goat cheese, crumbled",
  "directions": "1. Combine water and buckwheat in a saucepan; bring to a boil. Reduce heat to medium-low, cover the saucepan, and simmer until the buckwheat is firm yet tender to the bite, about 8 minutes. Rinse buckwheat under cold water and drain. 2. Stir avocado, cherry tomatoes, lime juice, red onion, olive oil, parsley, fennel seed, cayenne pepper, and mixed pepper together in a large bowl until evenly combined. Add buckwheat groats and stir gently; top with goat cheese.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "464"
},
{
  "url": "https://www.allrecipes.com/recipe/280101/gluten-free-sourdough-raisin-bread/",
  "name": "Gluten-Free Sourdough Raisin Bread",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "¾ cup raisins; 2 cups gluten-free bread flour mix; ½ cup buckwheat flour; ¼ cup coconut sugar; 1 tablespoon ground cinnamon; 1 pinch cream of tartar; 1 pinch baking soda; ¾ cup whole milk, at room temperature; ½ cup gluten-free sourdough starter; 1 teaspoon agave nectar; 3  eggs, lightly beaten; 1 teaspoon vanilla extract",
  "directions": "1. Place raisins into a bowl and cover with lukewarm water. Set aside to soak. 2. Line a loaf pan with parchment paper. Whisk gluten-free bread flour, buckwheat flour, coconut sugar, cinnamon, cream of tartar, and baking soda together in a bowl. 3. Combine milk, sourdough starter, and agave in the bowl of a stand mixer. Start mixer on low and add flour mixture 1 tablespoon at a time until well combined. Add eggs and vanilla extract and mix until well incorporated. Drain raisins and fold into the batter. 4. Pour the batter into the prepared loaf pan. Smooth out the top using a wet rubber scraper. Loosely cover the pan with plastic wrap and let rise until almost doubled in size, about 2 hours. Cover with foil. 5. Heat the oven to 350 degrees F (175 degrees C). Bake bread for 30 minutes. Remove foil and continue baking until bread is browned and has reached an internal temperature of 200 degrees F (95 degrees C), about 10 minutes more. 6. Cool in the pan for 5 minutes. Turn bread out from pan onto a wire rack and allow to cool completely before slicing.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "3 hrs",
  "calories": "219"
},
{
  "url": "https://www.allrecipes.com/recipe/286290/buckwheat-crepes/",
  "name": "Buckwheat Crepes",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "3 large eggs; 1 tablespoon white sugar; salt to taste; 2 ½ cups milk; 1 ½ cups buckwheat flour; 2 ½ tablespoons buckwheat flour; 1 ¼ cups whole wheat flour; 2 tablespoons vegetable oil, or more as needed, divided",
  "directions": "1. Whisk eggs, sugar, and salt together in a large bowl. Pour in milk and whisk to combine. Gradually add 1 1/2 cups plus 2 1/2 tablespoons buckwheat flour and whole wheat flour, whisking to combine. Don't be afraid if the mixture looks too watery; it works well. Stir in 1 tablespoon vegetable oil. 2. Heat a frying pan over medium-high heat. Brush the bottom with a little oil and pour in 1 ladle of batter in a swirl, so it spreads evenly into a thin layer. Cook until bubbles form and crepe is browned on the bottom, 1 to 3 minutes, then flip and repeat on the other side. Remove to a plate and repeat to cook remaining crepes, adding more oil as needed.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "124"
},
{
  "url": "https://www.allrecipes.com/recipe/238861/gluten-free-buckwheat-asparagus-and-pesto-salad/",
  "name": "Gluten-Free Buckwheat, Asparagus, and Pesto Salad",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 cup water; ½ cup buckwheat groats, rinsed; 8  asparagus spears; ⅓ cup pesto; 2 tablespoons grated Parmesan cheese (Optional)",
  "directions": "1. Bring 1 cup water to a boil in a saucepan. Add buckwheat; stir once. Reduce heat and simmer until buckwheat is tender yet firm to the bite, about 8 minutes. 2. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add asparagus, cover, and steam until tender, 2 to 6 minutes. Remove from steamer; cut into 1/2-inch pieces. 3. Combine asparagus and pesto in a bowl; mix until coated. Add buckwheat; toss to combine. Top with Parmesan cheese.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "193"
},
{
  "url": "https://www.allrecipes.com/recipe/254746/superfood-bar/",
  "name": "Superfood Bar",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 cup raw buckwheat; 1 cup hemp seed hearts; 1 cup slivered almonds; 1 cup unsweetened coconut flakes; ½ cup chia seeds; ½ cup cacao nibs; 1 ½ cups almond butter; 1 cup white sugar; ½ cup honey; salt to taste; 1 (12 ounce) bag dark chocolate chips (such as Ghiradelli®); 1 tablespoon almond butter, divided",
  "directions": "1. Line a 9x13-inch baking pan with parchment paper. 2. Combine buckwheat, hemp seed hearts, almonds, coconut flakes, chia seeds, and cacao nibs in a large bowl. 3. Mix 1 1/2 cup almond butter, sugar, honey, and salt together in a large saucepan over low heat. Cook, stirring frequently, until sugar dissolves, about 5 minutes. Pour in buckwheat mixture; stir until completely coated. Press mixture into the prepared pan. 4. Place chocolate chips and 1 tablespoon almond butter in a small saucepan over low heat; stir until melted, about 5 minutes. Spread melted chocolate over the mixture in the pan with a spatula. 5. Refrigerate until firm, about 1 hour. Cut into bars.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "1 hr 25 mins",
  "calories": "378"
},
{
  "url": "https://www.allrecipes.com/recipe/283095/buckwheat-buttermilk-pancakes/",
  "name": "Buckwheat Buttermilk Pancakes",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "1 cup all-purpose flour; 3 tablespoons buckwheat flour; 1 teaspoon baking soda; 1 teaspoon baking powder; ½ teaspoon salt; 1 cup milk; ⅓ cup buttermilk; ¼ cup applesauce; 1 large egg; ⅓ cup buttermilk",
  "directions": "1. Whisk flour, buckwheat flour, baking soda, baking powder, and salt together in a mixing bowl. Make a well in the center and add milk, buttermilk, applesauce, egg, and oil. Gently mix until dry ingredients are incorporated but batter is still lumpy. Let sit for at least 10 minutes before cooking. 2. Heat a griddle to 350 degrees F (175 degrees C). Working in batches, ladle 1/4 cupfuls of batter onto the hot griddle. Cook until small bubbles appear on the surface, 3 to 4 minutes. Flip and cook until golden brown on the other side, about 3 minutes more. Repeat to make remaining pancakes.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "136"
},
{
  "url": "https://www.allrecipes.com/recipe/236478/coconut-buckwheat-pancakes/",
  "name": "Coconut Buckwheat Pancakes",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "1 cup buckwheat groats; 1 ½ cups boiling water; 1 cup spelt flour; ½ cup unsweetened shredded coconut; 2 teaspoons baking powder; 1 cup soy milk; 1  egg; 2 tablespoons oil; 2 tablespoons honey (Optional); cooking spray",
  "directions": "1. Place buckwheat groats in a bowl. Pour boiling water over groats and set aside for groats to absorb water, about 10 minutes. Retain water if it doesn't all absorb. 2. Heat a skillet over medium heat. 3. Whisk flour, coconut, and baking powder together in a separate bowl. Beat milk, egg, oil, and honey together in a third bowl. Stir buckwheat groats mixture and flour mixture into milk mixture until just combined. 4. Spray skillet with cooking spray. Pour batter, 1/4 to 1/3 cup per pancake, into heated skillet. Cook until bubbles form and the edges are dry, about 2 minutes. Flip and cook until browned on the other side, 2 more minutes. Repeat with remaining batter.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "35 mins",
  "calories": "373"
},
{
  "url": "https://www.allrecipes.com/recipe/185870/wacky-buckwheat-spice-cake/",
  "name": "Wacky Buckwheat Spice Cake",
  "rating": "4.9",
  "ratingcount": "24",
  "ingredients": "½ cup all-purpose flour; ½ cup buckwheat flour; ½ cup cornstarch; ¾ cup white sugar; 1 teaspoon baking soda; ½ teaspoon salt; 1 ¼ teaspoons ground cinnamon; ½ teaspoon ground ginger; ½ teaspoon ground allspice; ⅛ teaspoon dry mustard powder; 1 pinch ground black pepper; 1 tablespoon molasses; ¼ cup vegetable oil; 1 tablespoon distilled white vinegar; 1 teaspoon vanilla; 1 cup cold water",
  "directions": "1. Preheat an oven to 350 degrees F (175 degrees C). Whisk together the all-purpose flour, buckwheat flour, cornstarch, white sugar, baking soda, salt, cinnamon, ginger, allspice, dry mustard, and ground black pepper in a large mixing bowl. 2. Stir together the molasses, oil, vinegar, vanilla, and cold water in a measuring cup. Make a well in the center of the dry ingredients; pour the wet ingredients into the well. Mix the batter together until just blended. Pour the batter into an ungreased 8x8 inch baking pan. 3. Bake in the preheated oven until a toothpick inserted in the center comes out clean, 30 to 40 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "1 hr 40 mins",
  "calories": "203"
},
{
  "url": "https://www.allrecipes.com/recipe/173765/buckwheat-and-summer-squash-salad/",
  "name": "Buckwheat and Summer Squash Salad",
  "rating": "4.2",
  "ratingcount": "5",
  "ingredients": "2 cups uncooked buckwheat; 4 cups water; ½ teaspoon salt; 1 large summer squash, thinly sliced; 1 cup cooked garbanzo beans; ½ cup chopped toasted walnuts; ¼ cup grated Parmesan cheese; 1  lemon, juiced; 1 tablespoon chopped fresh parsley; 2 tablespoons olive oil; salt and black pepper to taste",
  "directions": "1. Bring the buckwheat, water, and salt to a boil in a saucepan. Cook at a boil for 7 minutes; drain and pour into a mixing bowl. Refrigerate until cooled to room temperature. 2. Place the summer squash, garbanzo beans, walnuts, and Parmesan cheese into the bowl with the buckwheat. Season with lemon juice, parsley, olive oil, salt, and pepper. Gently stir until evenly combined; serve at room temperature.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "55 mins",
  "calories": "281"
}]