[{
  "url": "https://www.allrecipes.com/recipe/229508/pumpkin-bars-with-cream-cheese-frosting/",
  "name": "Pumpkin Bars with Cream Cheese Frosting",
  "rating": "4.8",
  "ratingcount": "149",
  "ingredients": "4 large eggs; 2 cups white sugar; 1 cup vegetable oil; 1 (15 ounce) can pumpkin purée; 2 cups all-purpose flour; 2 teaspoons baking powder; 2 teaspoons ground cinnamon; 1 teaspoon baking soda; ¾ teaspoon salt; 1 (8 ounce) package cream cheese, softened; 1 cup unsalted butter, softened; 2 teaspoons vanilla extract; 4 cups confectioners' sugar; ¼ teaspoon ground cinnamon, or to taste",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease a sheet pan, then line it with parchment paper and grease the paper. 3. Make the cake: Beat eggs in a large bowl with an electric hand mixer until foamy. Add sugar, vegetable oil, and pumpkin purée; beat on medium speed until incorporated, about 2 minutes. 4. Mix flour, baking powder, cinnamon, baking soda, and salt together in a separate bowl. Beat flour mixture into egg mixture on low speed until just combined, about 1 minute. Pour batter into the prepared pan and spread out the edges. 5. Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 25 minutes. Cool completely, about 30 minutes. 6. While the cake layer is cooling, make the frosting: Beat cream cheese, butter, and vanilla in a bowl with an electric mixer until creamy. Gradually mix in confectioners' sugar until smooth. 7. Spread frosting evenly over cooled cake layer, then sprinkle with cinnamon. 8. Cut into 24 bars.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "1 hr 15 mins",
  "calories": "373"
},
{
  "url": "https://www.allrecipes.com/recipe/90321/meatball-sandwich/",
  "name": "Meatball Sandwich",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 pound ground beef; ¾ cup bread crumbs; 1 large egg, beaten; 2 cloves garlic, minced; 2 tablespoons grated Parmesan cheese; 2 tablespoons chopped fresh parsley; 2 teaspoons dried Italian seasoning; 1  French baguette; 1 tablespoon extra-virgin olive oil; ½ teaspoon garlic powder; 1 pinch salt, or to taste; 1 (14 ounce) jar spaghetti sauce; 4 slices provolone cheese",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine ground beef, bread crumbs, egg, garlic, Parmesan cheese, parsley, and Italian seasoning in a large bowl. Mix with your hands until well combined. Shape mixture into 12 meatballs, and place in a baking dish. 3. Bake meatballs in the preheated oven until cooked through, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C). 4. While the meatballs are cooking, cut baguette in half lengthwise and open like a book. Remove and discard some of the bread from the inside to make a well for the meatballs. 5. Brush baguette with olive oil and season with garlic powder and salt. Place baguette on a baking tray, open and with the oiled sides facing up. 6. When the meatballs have 5 minutes left, slip the baguette into the oven and cook until lightly toasted. 7. Meanwhile, warm spaghetti sauce in a saucepan over medium heat. 8. Remove meatballs from the oven. Use a slotted spoon to transfer them to the hot sauce; mix gently to coat with sauce. 9. Spoon meatballs and sauce into one side of the baguette, nestling meatballs in the well. Top with slices of provolone cheese. 10. Return to the oven until cheese is melted, 2 to 3 minutes. 11. Cool slightly, then cut into 4 sandwiches.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "781"
},
{
  "url": "https://www.allrecipes.com/recipe/12011/easy-lasagna-ii/",
  "name": "Easy Lasagna",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 pound lean ground beef; 1 (32 ounce) jar spaghetti sauce; 32 ounces cottage cheese; 3 cups shredded mozzarella cheese, divided; 2  eggs; ½ cup grated Parmesan cheese; 2 teaspoons dried parsley; salt to taste; ground black pepper to taste; 9  lasagna noodles; ½ cup water",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 8 to 10 minutes. Drain and discard grease. Stir in spaghetti sauce and simmer for 5 minutes. 3. Combine cottage cheese, 2 cups of mozzarella cheese, eggs, 1/2 of the grated Parmesan cheese, dried parsley, salt, and pepper in a large bowl. 4. Spread 3/4 cup of sauce in a 9x13-inch baking dish. Cover with 3 uncooked lasagna noodles, 1 3/4 cups of cheese mixture, and 1/4 cup sauce; repeat layers once more. Top with remaining 3 noodles, sauce, mozzarella, and Parmesan cheese. Pour 1/2 cup water along the edges of the dish. Cover tightly with aluminum foil. 5. Bake in the preheated oven for 45 minutes. Uncover and bake for an additional 10 minutes. Let stand 10 minutes before serving.",
  "prep": "10 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 30 mins",
  "calories": "377"
},
{
  "url": "https://www.allrecipes.com/recipe/7402/carrot-cake-iii/",
  "name": "Carrot Cake",
  "rating": "4.7",
  "ratingcount": "7",
  "ingredients": "2 cups white sugar; 1 ¼ cups vegetable oil; 4  eggs; 2 teaspoons vanilla extract; 2 cups all-purpose flour; 2 teaspoons baking soda; 2 teaspoons baking powder; 2 teaspoons ground cinnamon; ½ teaspoon salt; 3 cups grated carrots; 1 cup chopped pecans; ½ cup butter, softened; 8 ounces cream cheese, softened; 4 cups confectioners' sugar; 1 teaspoon vanilla extract; 1 cup chopped pecans",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. 2. Beat sugar, oil, eggs, and 2 teaspoons vanilla together in a large bowl with an electric mixer until well combined. Mix in flour, baking soda, baking powder, cinnamon, and salt. Stir in carrots. Fold in pecans. Pour into the prepared pan. 3. Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, about 40 minutes. Let cool in the pan for 10 minutes, then turn out onto a wire rack and cool completely. 4. To make the frosting: Beat butter, cream cheese, confectioners' sugar, and 1 teaspoon vanilla together in a large bowl with an electric mixer until smooth and creamy. Stir in chopped pecans. Frost the cooled cake.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 20 mins",
  "calories": "575"
},
{
  "url": "https://www.allrecipes.com/recipe/13883/manicotti/",
  "name": "Manicotti",
  "rating": "4.7",
  "ratingcount": "771",
  "ingredients": "5 ½ ounces manicotti pasta; 1 pint part-skim ricotta cheese; 8 ounces shredded mozzarella cheese; ¾ cup grated Parmesan cheese, divided; 2 large eggs; 1 teaspoon dried parsley; salt and ground black pepper to taste; 1 (16 ounce) jar spaghetti sauce",
  "directions": "1. Cook manicotti in boiling water until al dente, about 10 to 12 minutes; drain and rinse with cold water. 2. Preheat oven to 350 degrees F (175 degrees C). 3. Mix ricotta, mozzarella, 1/2 cup Parmesan cheese, eggs, parsley, salt, and pepper in a large bowl until well combined. 4. Pour 1/2 cup spaghetti sauce into an 11x17-inch baking dish. Stuff each manicotti shell with 3 tablespoons cheese mixture, and arrange over sauce. Pour remaining sauce over the top of the shells and sprinkle with remaining Parmesan cheese. 5. Bake in the preheated oven until bubbly, about 45 minutes.",
  "prep": "30 mins",
  "cook": "55 mins",
  "total": "1 hr 25 mins",
  "calories": "676"
},
{
  "url": "https://www.allrecipes.com/recipe/23891/grilled-cheese-sandwich/",
  "name": "Grilled Cheese Sandwich",
  "rating": "4.8",
  "ratingcount": "860",
  "ingredients": "4 slices white bread; 3 tablespoons butter, divided; 2 slices Cheddar cheese",
  "directions": "1. Preheat a nonstick skillet over medium heat. Generously butter one side of a slice of bread. Place bread butter-side down in the hot skillet; add 1 slice of cheese. Butter a second slice of bread on one side and place butter-side up on top of cheese. 2. Cook until lightly browned on one side; flip over and continue cooking until cheese is melted. Repeat with remaining 2 slices of bread, butter, and slice of cheese.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "400"
},
{
  "url": "https://www.allrecipes.com/recipe/8849/baked-chicken-nuggets/",
  "name": "Homemade Chicken Nuggets",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "3  skinless, boneless chicken breasts; 1 cup Italian seasoned bread crumbs; ½ cup grated Parmesan cheese; 1 tablespoon dried basil; 1 teaspoon dried thyme; 1 teaspoon salt; ½ cup butter, melted",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Cut chicken breasts into 1 1/2-inch pieces. Mix the bread crumbs, Parmesan, basil, thyme, and salt together well in a medium bowl. Put melted butter in a bowl or dish for dipping. 3. Dip chicken pieces into the melted butter first, then coat with the bread crumb mixture. Place the well-coated chicken nuggets on a lightly greased cookie sheet in a single layer. 4. Bake nuggets in the preheated oven until browned and chicken is cooked through, about 20 minutes.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "308"
},
{
  "url": "https://www.allrecipes.com/recipe/47717/reuben-sandwich-ii/",
  "name": "Reuben Sandwich",
  "rating": "4.7",
  "ratingcount": "675",
  "ingredients": "8 slices rye bread; ½ cup Thousand Island dressing; 8 slices Swiss cheese; 8 slices deli sliced corned beef; 1 cup sauerkraut, drained; 2 tablespoons butter, softened",
  "directions": "1. Preheat a large griddle or skillet over medium heat. 2. Spread one side of bread slices evenly with Thousand Island dressing. On four bread slices, layer one slice Swiss cheese, 2 slices corned beef, 1/4 cup sauerkraut, and a second slice of Swiss cheese. Top with remaining bread slices, dressing-side down. Butter the top of each sandwich. 3. Place sandwiches, butter-side down on the preheated griddle; butter the top of each sandwich with remaining butter. Grill until both sides are golden brown, about 5 minutes per side. Serve hot.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "657"
},
{
  "url": "https://www.allrecipes.com/recipe/11646/pauls-pumpkin-bars/",
  "name": "Paul's Pumpkin Bars",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 (15 ounce) can pumpkin puree; 1 ⅔ cups white sugar; 1 cup vegetable oil; 4 large eggs; 2 cups all-purpose flour; 2 teaspoons ground cinnamon; 2 teaspoons baking powder; 1 teaspoon baking soda; 1 teaspoon salt; ½ cup butter, softened; 1 (3 ounce) package cream cheese, softened; 1 teaspoon vanilla extract; 2 cups sifted confectioners' sugar",
  "directions": "1. Gather cake ingredients and frosting ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). 3. Make cake: Beat pumpkin, sugar, oil, and eggs with an electric mixer in a medium bowl until well combined. 4. Sift together flour, cinnamon, baking powder, baking soda, and salt in a separate bowl. 5. Stir into pumpkin mixture until thoroughly combined. 6. Spread batter evenly into an ungreased 10x15-inch jelly roll pan. 7. Bake in the preheated oven until cake bounces back when gently pressed, 25 to 30 minutes. Remove from the oven and let cool. 8. While the cake is cooling, make frosting: Beat together butter and cream cheese until smooth; stir in vanilla. Add confectioners' sugar a little at a time, beating until mixture is smooth. 9. Spread frosting evenly on top of cooled cake. Cut into 24 squares. 10. Enjoy!",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "279"
},
{
  "url": "https://www.allrecipes.com/recipe/23596/fried-mozzarella-cheese-sticks/",
  "name": "Fried Mozzarella Cheese Sticks",
  "rating": "4.5",
  "ratingcount": "824",
  "ingredients": "2 large eggs, beaten; ¼ cup water; 1 ½ cups Italian seasoned bread crumbs; ½ teaspoon garlic salt; ⅔ cup all-purpose flour; ⅓ cup cornstarch; 2 cups oil for frying, or as needed; 1 (16 ounce) package mozzarella cheese sticks",
  "directions": "1. Gather all ingredients. 2. Whisk water and eggs together in a small bowl. Mix bread crumbs and garlic salt together in a medium bowl. Blend flour and cornstarch together in a third bowl. 3. Heat oil to 365 degrees F (185 degrees C) in a large, heavy saucepan. 4. Dredge a mozzarella stick in flour; shake off excess. Dip into egg mixture. Lift up so excess egg drips back in the bowl. Press into bread crumbs to coat. Place breaded mozzarella stick on a plate or wire rack. Repeat with remaining mozzarella sticks. 5. Use a spider spoon or a pair of tongs to lower 3 to 4 mozzarella sticks into the hot oil. Fry until golden brown, about 30 seconds. Remove from heat and drain on paper towels. Repeat to fry remaining mozzarella sticks. 6. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "789"
},
{
  "url": "https://www.allrecipes.com/recipe/11758/baked-ziti-i/",
  "name": "Baked Ziti",
  "rating": "4.7",
  "ratingcount": "8",
  "ingredients": "1 pound dry ziti pasta; 1  onion, chopped; 1 pound lean ground beef; 2 (26 ounce) jars spaghetti sauce; 6 ounces provolone cheese, sliced; 1 ½ cups sour cream; 6 ounces mozzarella cheese, shredded; 2 tablespoons grated Parmesan cheese",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook until al dente, about 8 minutes; drain. 2. Meanwhile, brown ground beef and onion in a large skillet over medium heat; stir in spaghetti sauce and simmer for 15 minutes. 3. Preheat the oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish. 4. Spread 1/2 of the ziti in the bottom of the prepared dish; top with Provolone cheese, sour cream, 1/2 of the meat sauce, remaining ziti, mozzarella cheese, and remaining meat sauce. Top with grated Parmesan cheese. 5. Bake in the preheated oven until heated through and cheeses have melted, about 30 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "578"
},
{
  "url": "https://www.allrecipes.com/recipe/234405/garlic-parmesan-wing-sauce/",
  "name": "Garlic-Parmesan Wing Sauce",
  "rating": "4.6",
  "ratingcount": "182",
  "ingredients": "½ cup butter, melted; ½ cup grated Parmesan cheese; 1 teaspoon garlic powder; ½ teaspoon onion salt; ¼ teaspoon freshly ground black pepper",
  "directions": "1. Mix butter, Parmesan cheese, garlic powder, onion salt, and black pepper in a bowl until well combined.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "83"
},
{
  "url": "https://www.allrecipes.com/recipe/49066/the-best-unbaked-cherry-cheesecake-ever/",
  "name": "Best No-Bake Cherry Cheesecake",
  "rating": "4.6",
  "ratingcount": "445",
  "ingredients": "1 ¼ cups graham cracker crumbs; ¼ cup unsalted butter, melted; ¼ cup white sugar; 1 (8 ounce) package cream cheese, softened; 1 cup powdered sugar; 1 teaspoon vanilla extract; 1 cup heavy whipping cream; 1 (12.5 ounce) can cherry pie filling (or other filling of your choice)",
  "directions": "1. Mix together graham cracker crumbs, margarine, and sugar for crust in a bowl until well incorporated and crumbly. Press mixture into a 9-inch pie plate, going up the sides as much as possible. 2. Beat cream cheese, powdered sugar, and vanilla for filling in a bowl with an electric mixer until smooth and spreadable. 3. Beat cream in a chilled glass or metal bowl with an electric mixer until soft peaks form. Fold into cream cheese mixture until smooth. 4. Pour filling into the prepared crust, and smooth the top with a spatula. Refrigerate until firm, about 2 to 3 hours. 5. Spread cherry pie filling over the chilled cheesecake. Serve immediately or refrigerate until serving. 6. Enjoy!",
  "prep": "20 mins",
  "cook": "",
  "total": "2 hrs 20 mins",
  "calories": "445"
},
{
  "url": "https://www.allrecipes.com/recipe/11959/slow-cooker-lasagna/",
  "name": "Slow Cooker Lasagna",
  "rating": "4.2",
  "ratingcount": "1",
  "ingredients": "1 pound lean ground beef; 1 medium onion, chopped; 2 teaspoons minced garlic; 1 (29 ounce) can tomato sauce; 1 (6 ounce) can tomato paste; 1 ½ teaspoons salt; 1 teaspoon dried oregano; 16 ounces shredded mozzarella cheese; 12 ounces cottage cheese; ½ cup grated Parmesan cheese; 1 (12 ounce) package lasagna noodles",
  "directions": "1. Cook ground beef, onion, and garlic in a large skillet over medium heat until the meat is browned. Add tomato sauce, tomato paste, salt, and oregano and stir until well combined and heated through. 2. Stir mozzarella, cottage cheese, and Parmesan together in a large bowl. 3. Spoon a layer of the meat mixture onto the bottom of a slow cooker. Add a double layer of uncooked lasagna noodles, breaking noodles to fit into cooker as needed. Top noodles with a portion of cheese mixture. Repeat the layering of sauce, noodles, and cheese until all the ingredients are used. 4. Cover and cook on Low for 4 to 6 hours.",
  "prep": "20 mins",
  "cook": "4 hrs 10 mins",
  "total": "4 hrs 30 mins",
  "calories": "446"
},
{
  "url": "https://www.allrecipes.com/recipe/25321/eggplant-parmesan-ii/",
  "name": "Eggplant Parmesan",
  "rating": "4.5",
  "ratingcount": "3",
  "ingredients": "3 large eggplant, peeled and thinly sliced; 2 large eggs, beaten; 4 cups Italian seasoned bread crumbs; 6 cups spaghetti sauce, divided; 1 (16 ounce) package mozzarella cheese, shredded and divided; ½ cup grated Parmesan cheese, divided; ½ teaspoon dried basil",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Dip eggplant slices in beaten egg, then in bread crumbs to coat. Place in a single layer on a baking sheet. 3. Bake in the preheated oven for 5 minutes. Flip and bake for 5 more minutes. 4. Spread spaghetti sauce to cover the bottom of a 9x13-inch baking dish. Place a layer of eggplant slices in the sauce. Sprinkle with mozzarella and Parmesan cheeses. 5. Repeat layers with remaining sauce, eggplant, and cheese, ending with a cheese layer. Sprinkle basil on top. 6. Bake in the preheated oven until golden brown, about 35 minutes. 7. Serve hot and enjoy!",
  "prep": "25 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "487"
},
{
  "url": "https://www.allrecipes.com/recipe/189930/southern-pimento-cheese/",
  "name": "Southern Pimento Cheese",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "2 cups shredded extra-sharp Cheddar cheese; 8 ounces cream cheese, softened; ½ cup mayonnaise; 1 (4 ounce) jar diced pimento, drained; 1  jalapeno pepper, seeded and minced (Optional); ¼ teaspoon garlic powder; ¼ teaspoon ground cayenne pepper (Optional); ¼ teaspoon onion powder; salt and black pepper to taste",
  "directions": "1. Gather all ingredients. 2. Place Cheddar cheese, cream cheese, mayonnaise, pimento, minced jalapeño, garlic powder, cayenne pepper, and onion powder in a large bowl. 3. Mix until thoroughly combined. 4. Season to taste with salt and black pepper. 5. Enjoy!",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "208"
},
{
  "url": "https://www.allrecipes.com/recipe/8495/chicken-cordon-bleu-i/",
  "name": "Chicken Cordon Bleu",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "nonstick cooking spray; 4  skinless, boneless chicken breast halves; ¼ teaspoon salt; ⅛ teaspoon ground black pepper; 6 slices Swiss cheese; 4 slices cooked ham; ½ cup seasoned bread crumbs",
  "directions": "1. Gather all ingredients. 2. Preheat oven to 350 degrees F (175 degrees C). Coat a 7x11-inch baking dish with nonstick cooking spray. 3. Pound chicken breasts to 1/4 inch thickness. 4. Sprinkle each piece of chicken on both sides with salt and pepper. Place 1 Swiss cheese slice and 1 ham slice on top of each breast. 5. Roll up each breast and secure with toothpicks. 6. Place in the prepared baking dish and sprinkle chicken evenly with bread crumbs. 7. Bake in the preheated oven until chicken is no longer pink, 30 to 35 minutes. 8. Remove from the oven, and place 1/2 Swiss cheese slice on top of each breast. 9. Return to the oven until cheese has melted, 3 to 5 minutes. Remove toothpicks and serve immediately.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "419"
},
{
  "url": "https://www.allrecipes.com/recipe/18417/spanakopita-greek-spinach-pie/",
  "name": "Spanakopita (Greek Spinach Pie)",
  "rating": "4.5",
  "ratingcount": "892",
  "ingredients": "3 tablespoons olive oil; 1 large onion, chopped; 1 bunch green onions, chopped; 2 cloves garlic, minced; 2 pounds spinach, rinsed and chopped; ½ cup chopped fresh parsley; 1 cup crumbled feta cheese; ½ cup ricotta cheese; 2 large eggs, lightly beaten; 8 sheets phyllo dough; ¼ cup olive oil, or as needed",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). Lightly oil a 9-inch square baking pan. 3. Heat 3 tablespoons olive oil in a large skillet over medium heat. Saute chopped onion, green onions, and garlic in the hot oil until soft and lightly browned, about 5 minutes. 4. Stir in spinach and parsley, and continue to saute until spinach is limp, about 2 minutes. Remove from the heat and set aside to cool. 5. Mix feta cheese, ricotta cheese, and eggs in a medium bowl until well combined. Stir in spinach mixture. 6. Lay one sheet of phyllo dough in the prepared baking pan, and brush lightly with olive oil. Lay another sheet of phyllo dough on top and brush with olive oil. Repeat the process with two more sheets of phyllo dough; the sheets will overlap the pan. 7. Spread spinach and cheese mixture into the pan. Fold any overhanging dough over the filling. Brush with oil. 8. Layer the remaining 4 sheets of phyllo dough, brushing each with oil. Tuck overhanging dough into the pan to seal the filling. 9. Bake in the preheated oven until golden brown, 30 to 40 minutes. 10. Cut into squares and serve while hot.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "494"
},
{
  "url": "https://www.allrecipes.com/recipe/55860/baked-garlic-parmesan-chicken/",
  "name": "Baked Garlic Parmesan Chicken",
  "rating": "4.4",
  "ratingcount": "3",
  "ingredients": "2 tablespoons olive oil; 1 clove garlic, minced; 1 cup dry bread crumbs; ⅔ cup grated Parmesan cheese; 1 teaspoon dried basil leaves; ¼ teaspoon ground black pepper; 6  skinless, boneless chicken breast halves",
  "directions": "1. Gather all ingredients. 2. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. 3. In a bowl, blend the olive oil and garlic. 4. In a separate bowl, mix the bread crumbs, Parmesan cheese, basil, and pepper. 5. Dip each chicken breast in the oil mixture, then in the bread crumb mixture. Arrange the coated chicken breasts in the prepared baking dish, and top with any remaining bread crumb mixture. 6. Bake 30 minutes in the preheated oven, or until chicken is no longer pink and juices run clear. 7. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "281"
},
{
  "url": "https://www.allrecipes.com/recipe/13731/pumpkin-roll-i/",
  "name": "Pumpkin Roll",
  "rating": "4.8",
  "ratingcount": "449",
  "ingredients": "1 cup white sugar; ⅔ cup pumpkin puree; 3 large eggs, beaten; ½ teaspoon ground cinnamon; ¾ cup all-purpose flour; 1 teaspoon baking soda; 8 ounces cream cheese, softened; 1 cup powdered sugar, or more to taste; 2 tablespoons butter, softened; ¼ teaspoon vanilla extract",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease a 10x15-inch jelly roll pan. 2. Make cake: Blend together sugar, pumpkin puree, eggs, and cinnamon in a mixing bowl. 3. Mix flour and baking soda together in a separate bowl. Add flour mixture to pumpkin mixture and blend until smooth. Evenly spread in the prepared pan. 4. Bake in the preheated oven until cake springs back when lightly touched, 15 to 25 minutes. Remove from the oven and cool for 5 minutes. 5. Invert cake onto a cotton (not terry cloth) tea towel. Starting with a short edge, roll up cake in the towel jelly-roll style; place seam-side down to cool, about 15 minutes. 6. While the cake is cooling, make filling: Beat cream cheese, powdered sugar, butter, and vanilla in a mixing bowl until smooth. 7. When cake has completely cooled, unroll and remove towel. Spread filling over cake, all the way to the edges. Roll cake up again without the towel. Wrap with plastic wrap and refrigerate until ready to serve. 8. To serve, sift powdered sugar over the roll and slice into 10 portions.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "55 mins",
  "calories": "289"
},
{
  "url": "https://www.allrecipes.com/recipe/279177/air-fryer-roasted-asparagus/",
  "name": "Air Fryer Roasted Asparagus",
  "rating": "4.7",
  "ratingcount": "31",
  "ingredients": "1 bunch fresh asparagus, trimmed; avocado oil cooking spray; ½ teaspoon garlic powder; ½ teaspoon Himalayan pink salt; ¼ teaspoon ground multi-colored peppercorns; ¼ teaspoon red pepper flakes; ¼ cup freshly grated Parmesan cheese",
  "directions": "1. Preheat the air fryer to 375 degrees F (190 degrees C). Line the basket with parchment paper. 2. Place asparagus spears in the prepared basket and mist with avocado oil. Sprinkle with garlic powder, salt, pepper, and pepper flakes. Top with Parmesan cheese. 3. Air-fry until asparagus spears start to char, 7 to 9 minutes.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "94"
},
{
  "url": "https://www.allrecipes.com/recipe/169305/sopapilla-cheesecake-pie/",
  "name": "Sopapilla Cheesecake Pie",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "cooking spray; 2 (8 ounce) packages cream cheese, softened; 1 ¾ cups white sugar, divided; 1 teaspoon Mexican vanilla extract; 2 (8 ounce) cans refrigerated crescent rolls; ½ cup butter, room temperature; 1 teaspoon ground cinnamon; ¼ cup honey",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with cooking spray. 2. Beat cream cheese, 1 cup sugar, and vanilla extract in a bowl until smooth. 3. Unroll crescent roll dough, and use a rolling pin to shape each sheet into a 9x13-inch rectangle. Press one piece into the bottom of the prepared baking dish. Evenly spread cream cheese mixture on top, then cover with remaining piece of crescent dough. 4. Mash remaining 3/4 cup sugar, butter, and cinnamon with a fork until combined. Dot mixture over top of dough. 5. Bake in the preheated oven until crescent dough has puffed and turned golden brown, about 30 minutes. 6. Remove from the oven and drizzle with honey. Cool completely in the pan for about 2 hours before cutting into 12 squares.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "2 hrs 50 mins",
  "calories": "481"
},
{
  "url": "https://www.allrecipes.com/recipe/229415/oreo-cookie-balls/",
  "name": "Oreo Cookie Balls",
  "rating": "4.7",
  "ratingcount": "263",
  "ingredients": "36  OREO Cookies, finely crushed; 1 (8 ounce) package cream cheese, softened; waxed paper; 16 ounces semi-sweet baking chocolate, melted",
  "directions": "1. Mix crushed cookies and cream cheese in a large bowl until well-blended. 2. Use your hands to shape mixture into 48 (1-inch) balls; place on a tray and freeze until thoroughly chilled, about 10 minutes. 3. Line a shallow pan with waxed paper. Dip balls in melted chocolate; place in a single layer on the prepared pan. 4. Refrigerate for 1 hour or until firm. Store in a covered container in the refrigerator.",
  "prep": "30 mins",
  "cook": "",
  "total": "1 hr 40 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/14834/simple-artichoke-dip/",
  "name": "Simple Artichoke Dip",
  "rating": "4.6",
  "ratingcount": "197",
  "ingredients": "1 (14 ounce) can artichoke hearts, drained and chopped; 1 cup mayonnaise; 1 cup grated Parmesan cheese",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Mix artichoke hearts, mayonnaise, and Parmesan cheese together in a bowl until well combined. Spread mixture in a 9x13-inch baking dish. 3. Bake in the preheated oven until bubbly and golden brown, about 15 to 20 minutes.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "293"
},
{
  "url": "https://www.allrecipes.com/recipe/275548/air-fryer-meatballs/",
  "name": "Air Fryer Meatballs",
  "rating": "4.8",
  "ratingcount": "42",
  "ingredients": "16 ounces lean ground beef; 4 ounces ground pork; ½ cup grated Parmesan cheese; ⅓ cup Italian seasoned bread crumbs; 1  egg; 2 cloves garlic, minced; 1 teaspoon Italian seasoning; ½ teaspoon salt",
  "directions": "1. Preheat an air fryer to 350 degrees F (175 degrees C). 2. Combine beef, pork, Parmesan cheese, bread crumbs, egg, garlic, Italian seasoning, and salt in a large bowl. Mix until evenly combined. Form into 16 equal meatballs (a small ice cream scoop is helpful) and place on a baking sheet. 3. Place 1/2 of the meatballs in the basket of the air fryer and cook 8 minutes. Shake the basket and cook 2 minutes more. Transfer to a serving plate and let rest for 5 minutes. Repeat with remaining meatballs.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "457"
},
{
  "url": "https://www.allrecipes.com/recipe/19673/seven-layer-taco-dip/",
  "name": "Seven-Layer Taco Dip",
  "rating": "4.7",
  "ratingcount": "2",
  "ingredients": "1 (16 ounce) can refried beans; 1 (1 ounce) package taco seasoning mix; 1 (16 ounce) container sour cream; 1 (8 ounce) package cream cheese, softened; 1 (16 ounce) jar salsa; 1 large tomato, chopped; 1 medium green bell pepper, chopped; 1 bunch chopped green onions; 1 small head iceberg lettuce, shredded; 2 cups shredded Cheddar cheese; 1 (6 ounce) can sliced black olives, drained",
  "directions": "1. Blend refried beans and taco seasoning in a medium bowl; spread mixture onto a large serving platter. 2. Mix sour cream and cream cheese in a medium bowl; spread over refried beans. 3. Top with salsa. Layer tomato, bell pepper, green onions, and lettuce over top. 4. Sprinkle over Cheddar cheese and garnish with black olives.",
  "prep": "30 mins",
  "cook": "",
  "total": "30 mins",
  "calories": "66"
},
{
  "url": "https://www.allrecipes.com/recipe/219646/authentic-mexican-chili-rellenos/",
  "name": "Authentic Mexican Chile Rellenos",
  "rating": "4.7",
  "ratingcount": "285",
  "ingredients": "6  fresh Anaheim chile peppers; 1 (8 ounce) package queso asadero (white Mexican cheese), cut into 3/4-inch thick strips; 2 large eggs, separated; 1 teaspoon baking powder; ¾ cup all-purpose flour; 1 cup vegetable shortening for frying",
  "directions": "1. Preheat the oven broiler; set the oven rack about 6 inches below the heat source. Line a baking sheet with aluminum foil. 2. Place peppers onto the prepared baking sheet and broil until skins are blackened and blistered, about 10 minutes. Use tongs to rotate peppers often to char all sides. Place blackened peppers into a bowl and tightly seal with plastic wrap. Allow peppers to steam as they cool, about 15 minutes. 3. Remove skin from peppers, then cut a slit down the long side of each one to remove seeds and core. Rinse peppers inside and out and pat dry with paper towels. Stuff peppers with strips of cheese. 4. Whisk egg yolks and baking powder in a bowl until combined. Beat egg whites with an electric mixer in a separate bowl until stiff peaks form. Gently fold beaten whites into the yolk mixture. Place flour into a separate shallow bowl. 5. Melt vegetable shortening in a skillet over medium heat. Roll each stuffed pepper in flour, tap off excess flour, and dip into the egg mixture to coat both sides. Gently lay coated peppers into the hot shortening. Fry peppers until lightly golden brown and cheese has melted, about 5 minutes per side.",
  "prep": "25 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "263"
},
{
  "url": "https://www.allrecipes.com/recipe/58745/absolutely-the-best-rich-and-creamy-blue-cheese-dressing-ever/",
  "name": "Absolutely the BEST Rich and Creamy Blue Cheese Dressing Ever!",
  "rating": "4.7",
  "ratingcount": "541",
  "ingredients": "2 ½ ounces blue cheese; 3 tablespoons buttermilk; 3 tablespoons sour cream; 2 tablespoons mayonnaise; 2 teaspoons white wine vinegar; ¼ teaspoon sugar; ⅛ teaspoon garlic powder; salt and freshly ground black pepper",
  "directions": "1. In a small bowl, mash blue cheese and buttermilk together with a fork until mixture resembles large-curd cottage cheese. 2. Stir in sour cream, mayonnaise, vinegar, sugar, and garlic powder until well blended. Season to taste with salt and pepper. 3. Enjoy!",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "93"
},
{
  "url": "https://www.allrecipes.com/recipe/17069/taco-dip-i/",
  "name": "Taco Dip",
  "rating": "4.7",
  "ratingcount": "438",
  "ingredients": "1 (16 ounce) container nonfat sour cream; 1 (8 ounce) package cream cheese, softened; 1 (1.25 ounce) package taco seasoning mix; ¼ head iceberg lettuce - rinsed, dried, and shredded; 1 cup shredded Cheddar cheese; 3 medium chopped tomatoes; 1 medium green bell pepper, chopped; 1 (2.25 ounce) can black olives, drained",
  "directions": "1. Mix sour cream, cream cheese, and taco seasoning together in a medium bowl until smooth. Spread mixture in a 9- or 10-inch round serving dish. 2. Top with shredded lettuce, then sprinkle Cheddar cheese, tomatoes, bell pepper, and black olives on top.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "78"
},
{
  "url": "https://www.allrecipes.com/recipe/21659/chicken-quesadillas/",
  "name": "Chicken Quesadillas",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 pound skinless, boneless chicken breast, diced; 1 (1.27 ounce) packet fajita seasoning; 1 tablespoon vegetable oil; 2  green bell peppers, chopped; 2  red bell peppers, chopped; 1  onion, chopped; 10 (10 inch) flour tortillas; 1 (8 ounce) package shredded Cheddar cheese; 1 (8 ounce) package shredded Monterey Jack cheese; 1 tablespoon bacon bits",
  "directions": "1. Preheat the broiler. Lightly grease a baking sheet. 2. Toss chicken with fajita seasoning, then spread onto the prepared baking sheet. Place under the broiler and cook until chicken is cooked through and no longer pink in the center, about 5 minutes. 3. Preheat the oven to 350 degrees F (175 degrees C). 4. Heat oil in a large saucepan over medium heat. Stir in bell peppers, onion, and broiled chicken. Cook and stir until vegetables have softened, about 10 minutes. 5. Layer half of each tortilla with chicken and vegetable mixture, Cheddar cheese, Monterey Jack cheese, and bacon bits. Fold tortillas in half and place onto a baking sheet. 6. Bake quesadillas in the preheated oven until cheeses have melted, about 10 minutes. Cut each quesadilla into wedges and serve.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "472"
},
{
  "url": "https://www.allrecipes.com/recipe/258013/easy-tortilla-pizza/",
  "name": "Easy Tortilla Pizza",
  "rating": "4.8",
  "ratingcount": "57",
  "ingredients": "1 (8 inch) soft flour tortilla; 1 teaspoon olive oil; 1 pinch garlic powder; salt and ground black pepper to taste; 3 tablespoons tomato sauce; 1  cooked chicken breast, sliced; ½  green bell pepper, chopped; 2  green onions, finely chopped; ⅓ cup shredded mozzarella cheese; 1 pinch dried oregano",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Place tortilla on a baking sheet. Brush with olive oil; sprinkle garlic powder, salt, and pepper on top. 3. Bake in the preheated oven until golden, 3 to 5 minutes. Remove from the oven and spread tomato sauce on top; arrange chicken breast, green bell pepper, and green onions over tomato sauce. Sprinkle with mozzarella cheese. 4. Bake in the preheated oven until cheese is melted, about 5 minutes. Sprinkle oregano over cheese. Slice pizza into wedges using a pizza cutter.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "833"
},
{
  "url": "https://www.allrecipes.com/recipe/8519758/3-ingredient-boursin-cheese-pasta/",
  "name": "3-Ingredient Boursin Cheese Pasta",
  "rating": "4.4",
  "ratingcount": "5",
  "ingredients": "1 pound angel hair pasta; 1 (5.2 ounce) package garlic and herb cheese spread (such as Boursin®); ¾ cup grape tomatoes, sliced (Optional); chopped fresh parsley for garnish (Optional); ½ cup reserved pasta water, or as needed",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Cook angel hair pasta in the boiling water, stirring occasionally, until tender yet firm to the bite, 5 to 7 minutes. 2. Drain pasta, reserving 3/4 cup water ( you may not need it all). 3. Pour 1/2 cup reserved water into sauce pan. Add Boursin cheese, whisking to combine until smooth. Add tomatoes and cook, no longer than 2 minutes. Add pasta back into the sauce. Garnish with fresh parsley.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "235"
},
{
  "url": "https://www.allrecipes.com/recipe/8509695/mashed-butternut-squash-with-blue-cheese-and-pecans/",
  "name": "Mashed Butternut Squash with Blue Cheese and Pecans",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 ½ pounds butternut squash, cubed; ½ teaspoon salt; ⅛ teaspoon black pepper; ½ cup chopped toasted pecans; 2 tablespoons pure maple syrup; 2 ounces blue cheese crumbles; 1 teaspoon fresh thyme leaves",
  "directions": "1. Put butternut squash in a microwave-safe baking dish with a lid. Season with salt and pepper. Microwave, covered, until squash is tender, 8 to 10 minutes. 2. Coarsely mash with a potato masher or fork. Stir in pecans, maple syrup, blue cheese crumbles, and fresh thyme leaves until combined.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "256"
},
{
  "url": "https://www.allrecipes.com/recipe/8525280/adjarian-khachapuri/",
  "name": "Adjarian Khachapuri",
  "rating": "3.5",
  "ratingcount": "2",
  "ingredients": "1 ¼ cups whole milk, heated to lukewarm (110° to 115°F); 1 teaspoon active dry yeast; ¾ teaspoon sugar; 3 cups flour, plus more for dusting; 1 tablespoon sunflower oil, plus more for brushing; ¾ teaspoon plus a pinch of kosher salt; 2 ¼ cups shredded whole-milk mozzarella cheese; ½ cup whole-milk ricotta cheese; 4 large egg yolks; 2 tablespoons unsalted butter, softened",
  "directions": "1. Whisk together milk, yeast, and sugar in a large bowl. Let stand, covered with a kitchen towel, until mixture is foamy, about 10 minutes. 2. Sift flour into milk mixture. Add oil and 3/4 teaspoon salt; stir with a rubber spatula until mixture is well combined and a shaggy dough forms. Transfer to a work surface and shape into a ball; knead until smooth and soft but slightly sticky, about 5 minutes. 3. Shape dough into a ball and lightly brush with oil; transfer to a large bowl and cover loosely with plastic wrap. Let rise in a warm (70 to 80 degrees F (21 to 26 degrees C)) place until doubled in size, about 1 1/2 hours. 4. Stir together mozzarella and ricotta in a small bowl. Season with remaining pinch of salt; stir to combine. 5. Divide dough into 4 equal portions. Roll each into a 5x8-inch oval, about 1/4 inch thick, on a lightly floured work surface. Spread about 1/4 cup cheese mixture over each oval, leaving a 11/2-inch border uncovered. Fold the long edges of each oval inward to meet at the center and pinch the seam together tightly to seal in cheese mixture. Turn dough over, so the seam side is down. Use a small, sharp knife to make a shallow lengthwise slit down the center of the top layer of dough, stopping within 1 inch of each end. Use your fingers to roll each long edge away from the slit and tuck it under to create a rolled border, sealing in some of the cheese mixture. 6. Evenly divide and spread remaining cheese mixture (about 1/4 cup each) in the centers of each flatbread, lightly pressing into dough. Arrange flatbreads 2 to 3 inches apart on 2 parchment-lined baking sheets. Cover with a kitchen towel in a warm place (70° to 80°F) until slightly puffed, 25 to 30 minutes. 7. Preheat the oven to 400 degrees F (200 degrees C). 8. Bake, rotating baking sheets halfway through, until edges are golden brown, 20 to 25 minutes. Use a spoon to make a well in the center of the filling in each flatbread. Put an egg yolk in each well. Bake until yolks are thickened but still runny, 30 to 40 seconds more. 9. Transfer flatbreads to a serving platter. Top each with 1/2 tablespoon butter. Stir yolks into melted cheese. Serve hot.",
  "prep": "40 mins",
  "cook": "25 mins",
  "total": "3 hrs 10 mins",
  "calories": "715"
},
{
  "url": "https://www.allrecipes.com/recipe/8502503/italian-mac-and-cheese/",
  "name": "Italian Mac and Cheese",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "8 ounces penne pasta; 10 ounces Italian sausage; 1 ½ tablespoons unsalted butter; 2 cloves garlic, minced; 1 pinch crushed red pepper flakes (Optional); 1 tablespoon flour; 1 cup 1% milk; ½ cup heavy whipping cream; ¼ cup reserved pasta water; 1 ¼ ounces grated mozzarella cheese; 1 ¼ ounces grated provolone cheese; 1 ¼ ounces grated Fontina cheese; 1 ¼ ounces finely grated Parmesan cheese; ¼ cup julienned sun-dried tomatoes",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add penne and cook, stirring occasionally, until penne start to get tender, about 8 minutes. Drain and reserve 1/4 cup pasta water. 2. Preheat the oven to 375 degrees F (190 degrees C). 3. Meanwhile, cook Italian sausage in a heavy skillet over medium-high heat until brown and crumbly, about 5 minutes. Transfer to a paper towel lined plate. 4. Melt butter in a skillet over medium heat. Sauté minced garlic and red pepper flakes until garlic is fragrant, 30 to 45 seconds. Sprinkle flour over mixture and stir to combine, making sure there are no lumps. 5. Pour in milk, cream, and reserved pasta water. Mix mozzarella, provolone, Fontina, and Parmesan cheeses in a bowl and stir in about 4/5th of the cheese mixture. Stir to combine. Add penne, cooked Italian sausage, and julienned sun dried tomatoes to the cheese sauce. Mix to combine and pour into an 8x8 inch casserole dish. Sprinkle with remaining cheese mixture. 6. Bake in the preheated oven until cheese is melted and lightly browned, about 25 minutes.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "603"
},
{
  "url": "https://www.allrecipes.com/recipe/255462/lasagna-flatbread/",
  "name": "Lasagna Flatbread",
  "rating": "4.5",
  "ratingcount": "42",
  "ingredients": "1 (15 ounce) container ricotta cheese; 1 (8 ounce) package shredded mozzarella cheese, divided; 1 (3 ounce) package Parmesan cheese; 1  egg; 2 teaspoons Italian seasoning; 1 pound sausage; ½ (26 ounce) jar marinara sauce; 6  flatbreads",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Combine ricotta cheese, 1/2 of the mozzarella cheese, Parmesan cheese, egg, and Italian seasoning in a bowl. 3. Cook sausage in a skillet over medium heat until no longer pink, 5 to 10 minutes; drain. Stir in marinara sauce. 4. Spread 1/6 of the cheese mixture evenly on each flatbread; cover with sausage mixture. Top with remaining mozzarella cheese. 5. Bake in the preheated oven until cheese is melted and bubbly, 10 to 15 minutes.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "40 mins",
  "calories": "602"
},
{
  "url": "https://www.allrecipes.com/recipe/216756/baked-ham-and-cheese-party-sandwiches/",
  "name": "Baked Ham and Cheese Sliders",
  "rating": "4.8",
  "ratingcount": "989",
  "ingredients": "¾ cup melted butter; 1 ½ tablespoons Dijon mustard; 1 ½ teaspoons Worcestershire sauce; 1 ½ tablespoons poppy seeds; 1 tablespoon dried minced onion; 24  mini sandwich rolls; 1 pound thinly sliced cooked deli ham; 1 pound thinly sliced Swiss cheese",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 3. Mix butter, Dijon mustard, Worcestershire sauce, poppy seeds, and dried onion in a bowl. 4. Separate the tops from the bottoms of the rolls; arrange the bottom pieces in a layer in the prepared baking dish. Layer about 1/2 of the ham onto the rolls; add a layer of Swiss cheese and top with remaining ham slices. 5. Place the tops of the rolls onto the sandwiches. Pour mustard mixture evenly over the rolls 6. Bake in the preheated oven until the rolls are lightly browned and the cheese has melted, about 20 minutes. Slice into individual rolls through the ham and cheese layers to serve.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "208"
},
{
  "url": "https://www.allrecipes.com/recipe/214931/oven-roasted-asparagus/",
  "name": "Oven-Roasted Asparagus",
  "rating": "4.8",
  "ratingcount": "3",
  "ingredients": "1 bunch thin asparagus spears, trimmed; 3 tablespoons olive oil; 1 ½ tablespoons grated Parmesan cheese (Optional); 1 clove garlic, minced (Optional); 1 teaspoon sea salt; ½ teaspoon ground black pepper; 1 tablespoon lemon juice (Optional)",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Place asparagus into a mixing bowl; drizzle with olive oil and toss to coat. Sprinkle with Parmesan cheese, garlic, salt, and pepper. Arrange asparagus in a single layer in a baking dish. 3. Bake in the preheated oven until just tender, 12 to 15 minutes depending on thickness. Sprinkle with lemon juice just before serving.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "123"
},
{
  "url": "https://www.allrecipes.com/recipe/216759/the-perfect-cinnamon-roll-icing/",
  "name": "The Perfect Cinnamon Roll Icing",
  "rating": "4.8",
  "ratingcount": "512",
  "ingredients": "7 tablespoons butter, softened; 2 ounces cream cheese, softened; 2 tablespoons milk; ½ teaspoon vanilla extract; 1 ½ cups confectioners' sugar, sifted; ¼ teaspoon salt",
  "directions": "1. Beat butter and cream cheese together in a large bowl with an electric mixer until creamy. 2. Blend in milk and vanilla, then gradually mix in confectioners' sugar and salt until smooth and fluffy.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "69"
},
{
  "url": "https://www.allrecipes.com/recipe/213131/homemade-four-cheese-ravioli/",
  "name": "Homemade Four Cheese Ravioli",
  "rating": "4.3",
  "ratingcount": "216",
  "ingredients": "2 cups all-purpose flour; 1 pinch salt; 2  eggs; 1 ½ tablespoons water; 1 teaspoon olive oil; 1 (8 ounce) container ricotta cheese; 1 (4 ounce) package cream cheese, softened; ½ cup shredded mozzarella cheese; ½ cup shredded provolone cheese; 1  egg; 1 ½ teaspoons dried parsley; 2 tablespoons olive oil; 2 cloves garlic, crushed; 3 tablespoons prepared basil pesto sauce; 2 cups heavy cream; ¼ cup grated Parmesan cheese; 1 (24 ounce) jar marinara sauce; 1  egg; 1 tablespoon water",
  "directions": "1. Mound flour and salt together on a work surface and form a well. Beat eggs, water, and olive oil in a bowl. Pour 1/2 of the egg mixture into the well. Begin mixing egg and flour with one hand; use your other hand to keep the flour mound steady. Add remaining egg mixture and knead to form a dough. 2. Knead dough until smooth, 8 to 10 minutes; add more flour if the dough is too sticky. Form dough into a ball and wrap tightly with plastic. Refrigerate for 1 hour. 3. While the dough is resting, prepare the ravioli filling: Mix ricotta cheese, cream cheese, mozzarella cheese, provolone cheese, egg, and parsley until well combined. Set the filling aside. 4. Heat 2 tablespoons of olive oil in a skillet over medium heat. Stir in crushed garlic and pesto sauce and cook for one minute. Stir in heavy cream; increase the heat to high and bring to a boil. Reduce the heat and simmer for 5 minutes. Whisk in Parmesan cheese until melted. Remove the pan from the heat and keep warm. 5. Meanwhile, warm marinara sauce over medium-low heat in a separate saucepan. 6. Preheat the oven to 375 degrees F (190 degrees C). Beat egg and 1 tablespoon of water together in a small bowl to make the egg wash. 7. Roll out the pasta dough into thin sheets no thicker than a nickel. To assemble the ravioli, brush the egg wash over a sheet of pasta. Drop cheese filling in 1-teaspoon portions onto the dough, 1-inch apart. 8. Cover the filling with the top sheet of pasta; use your fingers to press around each portion of filling, making the seal as airtight as possible. Cut out individual ravioli with a knife or pizza cutter. Use your fingers to seal the edges. 9. Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the ravioli and return to a boil. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 4 to 8 minutes. Drain well. 10. Grease a baking sheet. Place the cooked ravioli on the baking sheet and bake in the preheated oven until brown, about 4 minutes. 11. To serve, divide ravioli between four warmed serving bowls. Drizzle marinara sauce on top, followed by cream sauce.",
  "prep": "45 mins",
  "cook": "15 mins",
  "total": "2 hrs",
  "calories": "1270"
},
{
  "url": "https://www.allrecipes.com/recipe/238691/simple-macaroni-and-cheese/",
  "name": "Simple Macaroni and Cheese",
  "rating": "4.4",
  "ratingcount": "981",
  "ingredients": "1 (8 ounce) box elbow macaroni; ¼ cup butter; ¼ cup all-purpose flour; ½ teaspoon salt; ground black pepper to taste; 2 cups milk; 2 cups shredded Cheddar cheese",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. 2. At the same time, melt butter in a saucepan over medium heat. 3. Add flour, salt, and pepper and stir until smooth, about 5 minutes. 4. Pour in milk slowly, while stirring continuously. Continue to cook and stir until mixture is smooth and bubbling, about 5 minutes, making sure the milk doesn't burn. 5. Add Cheddar cheese and stir until melted, 2 to 4 minutes. 6. Drain macaroni and fold into cheese sauce until coated. 7. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "630"
},
{
  "url": "https://www.allrecipes.com/recipe/68461/buffalo-chicken-dip/",
  "name": "Buffalo Chicken Dip",
  "rating": "4.7",
  "ratingcount": "5",
  "ingredients": "2 (10 ounce) cans chunk chicken, drained; ¾ cup hot pepper sauce (such as Frank's RedHot®); 2 (8 ounce) packages cream cheese, softened; 1 cup ranch dressing; 1 ½ cups shredded Cheddar cheese; 1 bunch celery, cut into 4-inch pieces; 1 (8 ounce) box chicken-flavored crackers",
  "directions": "1. Gather all ingredients. 2. Heat chicken and hot pepper sauce in a skillet over medium heat until heated through, 3 to 5 minutes. Stir in cream cheese and ranch dressing. Cook and stir until well blended and warm, 3 to 5 minutes. 3. Mix in 1/2 of the Cheddar cheese, and transfer the mixture to a slow cooker. Sprinkle the remaining cheese over top. 4. Cover and cook on Low until dip is hot and bubbly, about 35 minutes. 5. Serve with celery sticks and crackers.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "284"
},
{
  "url": "https://www.allrecipes.com/recipe/22831/alfredo-sauce/",
  "name": "Alfredo Sauce",
  "rating": "4.6",
  "ratingcount": "4",
  "ingredients": "¼ cup butter; 1 cup heavy cream; 1 ½ cups freshly grated Parmesan cheese; 1 clove garlic, crushed; ¼ cup chopped fresh parsley",
  "directions": "1. Gather all ingredients. 2. Melt butter in a medium saucepan over low heat. Stir in cream and simmer for 5 minutes. 3. Add cheese and garlic; whisk continuously until heated through. Stir in parsley and serve. 4. Serve immediately and enjoy!",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "439"
},
{
  "url": "https://www.allrecipes.com/recipe/8379/basic-cream-cheese-frosting/",
  "name": "Basic Cream Cheese Frosting",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "8 ounces cream cheese; ½ cup butter, softened; 2 teaspoons vanilla extract; 4 cups confectioners' sugar",
  "directions": "1. Beat cream cheese, softened butter, and vanilla together in a large bowl with an electric mixer until light and creamy. 2. Gradually beat in confectioners' sugar until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "292"
},
{
  "url": "https://www.allrecipes.com/recipe/53304/cream-corn-like-no-other/",
  "name": "Cream Corn Like No Other",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "2 (10 ounce) packages frozen corn kernels, thawed; 1 cup heavy cream; 1 teaspoon salt, or to taste; 2 tablespoons granulated sugar; ¼ teaspoon freshly ground black pepper, or to taste; 2 tablespoons butter; ½ cup whole milk; 2 tablespoons all-purpose flour; ¼ cup freshly grated Parmesan cheese, or more to taste",
  "directions": "1. Combine corn, heavy cream, sugar, butter, salt, and pepper in a skillet over medium heat. Cook, stirring occasionally, until butter has melted, 3 to 5 minutes. 2. Meanwhile, whisk together milk and flour in a small bowl until smooth. 3. Add milk mixture to the skillet and continue to cook, stirring constantly, until sauce is thickened and corn is cooked through, about 4 minutes. 4. Remove from the heat, and stir in Parmesan cheese until melted. Serve hot.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "253"
},
{
  "url": "https://www.allrecipes.com/recipe/15184/mouth-watering-stuffed-mushrooms/",
  "name": "Mouth-Watering Stuffed Mushrooms",
  "rating": "4.6",
  "ratingcount": "4",
  "ingredients": "12  whole fresh mushrooms; 1 tablespoon vegetable oil; 1 tablespoon minced garlic; 1 (8 ounce) package cream cheese, softened; ¼ cup grated Parmesan cheese; ¼ teaspoon ground black pepper; ¼ teaspoon onion powder; ¼ teaspoon ground cayenne pepper",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Spray a baking sheet with cooking spray. Clean mushrooms with a damp paper towel; carefully break off stems. Chop stems extremely fine, discarding the tough end of stems. 2. Heat oil in a large skillet over medium heat. Add garlic and chopped mushroom stems; fry until any moisture has evaporated, taking care not to burn garlic. Set aside to cool. 3. Stir in cream cheese, Parmesan cheese, black pepper, onion powder, and cayenne. The mixture will be very thick; use a teaspoon to fill each mushroom cap with a generous amount of stuffing. Arrange mushroom caps on the prepared cookie sheet. 4. Bake in the preheated oven until the mushrooms are piping hot, about 20 minutes.",
  "prep": "25 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "88"
},
{
  "url": "https://www.allrecipes.com/recipe/234933/how-to-make-perfect-polenta/",
  "name": "How to Make Perfect Polenta",
  "rating": "4.9",
  "ratingcount": "254",
  "ingredients": "4 cups water; 1 teaspoon fine salt; 1 cup polenta; 3 tablespoons butter, divided; ½ cup freshly grated Parmigiano-Reggiano cheese, plus more for garnish",
  "directions": "1. Bring water and salt to a boil in a large saucepan; pour polenta slowly into boiling water, whisking constantly until there are no lumps. 2. Reduce heat to low and simmer, whisking often, until polenta starts to thicken, about 5 minutes. Polenta mixture should still be slightly loose. Cover and cook for 30 minutes, whisking every 5 to 6 minutes. When polenta is too thick to whisk, stir with a wooden spoon. Polenta is done when texture is creamy and the individual grains are tender. 3. Turn off heat and gently stir 2 tablespoons butter into polenta until butter partially melts; mix 1/2 cup Parmigiano-Reggiano cheese into polenta until cheese has melted. Cover and let stand for 5 minutes to thicken. 4. Stir polenta and transfer to a serving bowl. Top polenta with remaining 1 tablespoon butter and about 1 tablespoon freshly grated Parmigiano-Reggiano cheese for garnish.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "291"
},
{
  "url": "https://www.allrecipes.com/recipe/8457754/creamy-whipped-feta/",
  "name": "Creamy Whipped Feta",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "8 ounces chopped feta cheese; ¾ cup Greek yogurt; 1 clove garlic, minced; ½ teaspoon lemon zest; freshly ground black pepper to taste; 3 tablespoons olive oil, divided; 1 tablespoon minced oil-packed dried tomatoes; 1 tablespoon pine nuts; 1 tablespoon minced fresh parsley",
  "directions": "1. Gather all ingredients. 2. Combine feta cheese, Greek yogurt, garlic, lemon zest, and black pepper in a food processor. 3. Pulse several times to combine. With motor running, slowly drizzle in 2 tablespoons olive oil until dip is smooth and creamy, approximately 1 minute, scraping down the sides of the bowl as needed. 4. Transfer mixture to a bowl or onto a plate and top with sun-dried tomatoes, pine nuts, and parsley. Drizzle with remaining olive oil and serve.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "122"
},
{
  "url": "https://www.allrecipes.com/recipe/19402/quick-and-easy-alfredo-sauce/",
  "name": "Quick and Easy Alfredo Sauce",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "½ cup butter; 1 (8 ounce) package cream cheese; 2 teaspoons garlic powder; 2 cups milk; 6 ounces grated Parmesan cheese; ⅛ teaspoon ground black pepper",
  "directions": "1. Gather all ingredients. 2. Melt butter in a medium, non-stick saucepan over medium heat. Add cream cheese and garlic powder, stirring with a wire whisk until smooth. Add milk, a little at a time, whisking to smooth out lumps. Stir in Parmesan cheese and pepper. 3. Remove from heat when sauce reaches desired consistency. Sauce will thicken rapidly. Thin with milk if cooked too long. 4. Toss with hot pasta to serve.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "648"
},
{
  "url": "https://www.allrecipes.com/recipe/8465725/feta-spinach-puff-pastry-bites/",
  "name": "Feta-Spinach Puff Pastry Bites",
  "rating": "5.0",
  "ratingcount": "6",
  "ingredients": "nonstick cooking spray; 1 sheet frozen puff pastry, thawed in the refrigerator; ¾ cup mayonnaise; 1 (6 ounce) container crumbled feta cheese; ½ cup freshly grated Parmesan cheese; 1 (10 ounce) package frozen chopped spinach, thawed and drained; 2 cloves garlic, minced; ¼ teaspoon ground black pepper",
  "directions": "1. Preheat the oven to 375 degrees F (180 degrees C). Spray cups of a 24-cup mini muffin pan (or 2 12-cup mini muffin pans) with nonstick cooking spray. 2. Roll out the thawed but cold puff pastry sheet on a lightly floured surface into a rectangle using a rolling pin. Cut into 24 (approximately 2 1/2-inch) squares using a pizza cutter. Lightly press puff pastry squares into each cup of the prepared mini muffin pan and prick with the tines of a fork. 3. Mix the mayonnaise, feta cheese, Parmesan cheese, spinach, garlic, and pepper together in a bowl. 4. Spoon feta-spinach mixture evenly into the cups, being careful not to overflow the cups. 5. Bake in the preheated oven until pastry is puffed and the corners are golden brown, 15 to 16 minutes. 6. Cool in the pan on a wire rack for 5 minutes before transferring the bites to a serving dish.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "131"
},
{
  "url": "https://www.allrecipes.com/recipe/13477/double-layer-pumpkin-cheesecake/",
  "name": "Double Layer Pumpkin Cheesecake",
  "rating": "4.8",
  "ratingcount": "3",
  "ingredients": "2 (8 ounce) packages cream cheese, softened; ½ cup white sugar; ½ teaspoon vanilla extract; 2 large eggs; 1 (9 inch) prepared graham cracker crust; ½ cup pumpkin puree; ½ teaspoon ground cinnamon; 1 pinch ground cloves, or more to taste; 1 pinch ground nutmeg, or more to taste",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Make cheesecake layer: Beat cream cheese, sugar, and vanilla in a large bowl with an electric mixer until smooth. Add eggs, one at a time, blending well after each addition. 3. Spread 1 cup batter in the graham cracker crust. 4. Make pumpkin layer: Add pumpkin puree, cinnamon, cloves, and nutmeg to the remaining batter; stir gently until well blended. 5. Carefully spread on top of plain cheesecake batter in the crust. 6. Bake in the preheated oven until the edges are puffed and the surface is firm except for a small spot in the center that jiggled when the pan is gently shaken, 35 to 40 minutes. 7. Remove from the oven, set on a wire rack, and cool to room temperature, 1 to 2 hours. 8. Refrigerate for at least 3 hours before serving, preferably overnight.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "4 hrs 55 mins",
  "calories": "415"
},
{
  "url": "https://www.allrecipes.com/recipe/26819/hot-artichoke-and-spinach-dip-ii/",
  "name": "Hot Spinach Artichoke Dip",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1 (8 ounce) package cream cheese, softened; ¼ cup mayonnaise; ¼ cup grated Parmesan cheese; ¼ cup grated Romano cheese; 1 clove garlic, peeled and minced; ½ teaspoon dried basil; ¼ teaspoon garlic salt; salt and pepper to taste; 1 (14 ounce) can artichoke hearts, drained and chopped; ½ cup frozen chopped spinach, thawed and drained; ¼ cup shredded mozzarella cheese",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a small baking dish. 2. Mix cream cheese, mayonnaise, Parmesan cheese, Romano cheese, garlic, basil, garlic salt, salt, and pepper together in a medium bowl. Gently stir in artichoke hearts and spinach. 3. Transfer the mixture to the prepared baking dish; top with mozzarella cheese. Bake in the preheated oven until bubbly and lightly browned, about 25 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "134"
},
{
  "url": "https://www.allrecipes.com/recipe/13309/rich-and-simple-french-onion-soup/",
  "name": "Rich and Simple French Onion Soup",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "½ cup unsalted butter; 2 tablespoons olive oil; 4 cups sliced onions; 5 cups beef broth; 2 tablespoons dry sherry; 1 teaspoon dried thyme; 1 pinch salt and pepper to taste; 4 slices French bread; 4 slices provolone cheese; 2 slices Swiss cheese, diced; ¼ cup grated Parmesan cheese",
  "directions": "1. Gather all ingredients. 2. Melt butter with olive oil in an 8-quart stock pot over medium heat. Add onions to butter and continually stir until tender and translucent. Do not brown the onions. 3. Add beef broth, sherry, and thyme. Season with salt and pepper. Let simmer for 30 minutes. 4. Meanwhile, preheat the oven's broiler. 5. Ladle soup into oven-safe serving bowls and place one slice of bread on top of each (bread may be broken into pieces if you prefer). Layer each slice of bread with a slice of provolone, 1/2 slice diced Swiss and 1 tablespoon Parmesan cheese. 6. Place bowls on a cookie sheet and broil in the preheated oven until cheese bubbles and browns slightly, 2 to 3 minutes. 7. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "586"
},
{
  "url": "https://www.allrecipes.com/recipe/11679/homemade-mac-and-cheese/",
  "name": "Homemade Mac and Cheese",
  "rating": "4.2",
  "ratingcount": "2",
  "ingredients": "8 ounces uncooked elbow macaroni; ¼ cup salted butter; 3 tablespoons all-purpose flour; 2 ½ cups milk, or more as needed; 2 cups shredded sharp Cheddar cheese; ½ cup finely grated Parmesan cheese; salt and ground black pepper to taste (Optional); 2 tablespoons salted butter; ½ cup dry bread crumbs; 1 pinch ground paprika",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish. 2. Make the macaroni and cheese: Bring a large pot of lightly salted water to a boil. Add macaroni and simmer, stirring occasionally, until tender yet firm to the bite, about 8 minutes; it will finish cooking in the oven. Drain and transfer to the prepared baking dish. 3. While the macaroni is cooking, melt 1/4 cup butter in a medium skillet over low heat. Whisk in flour and stir until the mixture becomes paste-like and light golden brown, 3 to 5 minutes. 4. Gradually whisk 2 1/2 cups milk into the flour mixture, and bring to a simmer. Stir in shredded Cheddar and finely grated Parmesan cheeses; season with salt and pepper. Cook and stir over low heat until cheese is melted and sauce has thickened, 3 to 5 minutes, adding up to 1/2 cup more milk if needed. Pour cheese sauce over macaroni and stir until well combined. 5. Make the bread crumb topping: Melt 2 tablespoons butter in a skillet over medium heat. Add bread crumbs; cook and stir until well coated and browned. Spread bread crumbs over macaroni and cheese, then sprinkle with paprika. 6. Bake in the preheated oven until topping is golden brown and macaroni and cheese is bubbling, about 30 minutes.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "55 mins",
  "calories": "845"
},
{
  "url": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/",
  "name": "World's Best Lasagna",
  "rating": "4.8",
  "ratingcount": "20",
  "ingredients": "1 pound sweet Italian sausage; ¾ pound lean ground beef; ½ cup minced onion; 2 cloves garlic, crushed; 1 (28 ounce) can crushed tomatoes; 2 (6.5 ounce) cans canned tomato sauce; 2 (6 ounce) cans tomato paste; ½ cup water; 2 tablespoons white sugar; 4 tablespoons chopped fresh parsley, divided; 1 ½ teaspoons dried basil leaves; 1 ½ teaspoons salt, divided, or to taste; 1 teaspoon Italian seasoning; ½ teaspoon fennel seeds; ¼ teaspoon ground black pepper; 12  lasagna noodles; 16 ounces ricotta cheese; 1  egg; ¾ pound mozzarella cheese, sliced; ¾ cup grated Parmesan cheese",
  "directions": "1. Gather all your ingredients. 2. Cook sausage, ground beef, onion, and garlic in a Dutch oven over medium heat until well browned. 3. Stir in crushed tomatoes, tomato sauce, tomato paste, and water. Season with sugar, 2 tablespoons parsley, basil, 1 teaspoon salt, Italian seasoning, fennel seeds, and pepper. Simmer, covered, for about 1 1/2 hours, stirring occasionally. 4. Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. 5. In a mixing bowl, combine ricotta cheese with egg, remaining 2 tablespoons parsley, and 1/2 teaspoon salt. 6. Preheat the oven to 375 degrees F (190 degrees C). 7. To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with 1/2 of the ricotta cheese mixture. Top with 1/3 of the mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. 8. Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray or make sure the foil does not touch the cheese. 9. Bake in the preheated oven for 25 minutes. Remove the foil and bake for an additional 25 minutes. 10. Rest lasagna for 15 minutes before serving.",
  "prep": "30 mins",
  "cook": "2 hrs 30 mins",
  "total": "3 hrs 15 mins",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/223042/chicken-parmesan/",
  "name": "Chicken Parmesan",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "4  skinless, boneless chicken breast halves; salt and freshly ground black pepper to taste; 2 large eggs; 1 cup panko bread crumbs, or more as needed; ¾ cup grated Parmesan cheese, divided; 2 tablespoons all-purpose flour, or more if needed; ½ cup olive oil for frying, or as needed; ½ cup prepared tomato sauce; ¼ cup fresh mozzarella, cut into small cubes; ¼ cup chopped fresh basil; ½ cup grated provolone cheese; 2 teaspoons olive oil",
  "directions": "1. Preheat an oven to 450 degrees F (230 degrees C). 2. Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. 3. Season chicken thoroughly with salt and pepper. Using a sifter or strainer; sprinkle flour over chicken breasts, evenly coating both sides 4. Beat eggs in a shallow bowl and set aside. 5. Mix bread crumbs and 1/2 cup Parmesan cheese in a separate bowl, set aside. 6. Dip a flour-coated chicken breast in beaten eggs. Transfer breast to the bread crumb mixture, pressing crumbs into both sides. Repeat for each breast. Let chicken rest for 10 to 15 minutes. 7. Heat 1/2 inch olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken in the hot oil until golden, about 2 minutes per side. The chicken will finish cooking in the oven. 8. Transfer chicken to a baking dish. Top each breast with 2 tablespoons tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle remaining Parmesan over top and drizzle each with 1/2 teaspoon olive oil. 9. Bake in the preheated oven until cheese is browned and bubbly and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "471"
}]