[{
  "url": "https://www.allrecipes.com/recipe/8458926/air-fryer-cherry-cream-cheese-croissants/",
  "name": "Air Fryer Cherry Cream Cheese Croissants",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "flour for dusting; 1 (8 ounce) package refrigerated crescent roll dough (such as Pillsbury®; 1 (8 ounce) tub cream cheese; 1 (15 ounce) can pitted sour cherries, drained; cooking spray; ground cinnamon to taste",
  "directions": "1. Lightly dust a work surface with flour. Unroll crescent dough and divide into triangles along the perforated lines. 2. Spread each triangle with cream cheese. 3. Drop 3 or 4 cherries on the wider portion of each crescent dough triangle. Carefully roll up each crescent, making sure the cherries stay tucked in. Fold down the ends of each roll slightly so it forms a crescent shape. 4. Spray the basket of the air fryer with non stick cooking spray spray. Carefully set the croissants into the basket. 5. Set air fryer to 400 degrees F (200 degrees C). 6. Air fry croissants until puffed up and lightly browned, about 5 minutes. Check to make sure croissants are not sticking to each other and that they are not overly browned. Continue cooking for 2 to 3 minutes longer, making sure they do not get too done. 7. Transfer croissants to a plate and sprinkle with cinnamon.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "227"
},
{
  "url": "https://www.allrecipes.com/recipe/257398/fresh-cherry-cake/",
  "name": "Fresh Cherry Cake",
  "rating": "4.6",
  "ratingcount": "7",
  "ingredients": "2 cups all-purpose flour; 2 teaspoons baking powder; ½ teaspoon salt; 1 ½ cups white sugar, divided; ½ cup butter, softened; 1 cup milk; 1 teaspoon vanilla extract; 4 cups halved and pitted cherries; 1 ¼ cups cherry juice",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease a deep 9x13-inch baking dish. 2. Whisk flour, baking powder, and salt together in a bowl. 3. Beat 1 cup sugar and butter in a separate bowl with an electric mixer until light and fluffy, 4 to 5 minutes. Stir in milk and vanilla. Add flour mixture and mix until batter is well blended and thick, 2 to 3 minutes. 4. Spread batter in the prepared baking dish. Arrange cherries over the batter, then drizzle cherry juice over top. Sprinkle remaining 1/2 cup sugar over the surface. 5. Bake in the preheated oven until a toothpick inserted in the center comes out clean, 40 to 45 minutes.",
  "prep": "25 mins",
  "cook": "40 mins",
  "total": "1 hr 5 mins",
  "calories": "302"
},
{
  "url": "https://www.allrecipes.com/recipe/74422/classic-cherries-jubilee/",
  "name": "Classic Cherries Jubilee",
  "rating": "4.7",
  "ratingcount": "54",
  "ingredients": "½ cup white sugar; 2 tablespoons cornstarch; ¼ cup cold water; ¼ cup orange juice; 1 pound Bing or other dark, sweet cherries, rinsed and pitted (or use frozen pitted cherries); ½ teaspoon finely grated orange zest; 3 cups vanilla bean ice cream; ¼ teaspoon cherry extract; ¼ cup brandy",
  "directions": "1. Whisk sugar and cornstarch together in a wide saucepan. Stir in water and orange juice; bring to a boil over medium-high heat, whisking until thickened. Stir in cherries and orange zest; return to a boil, then reduce heat, and simmer for 10 minutes. While cherries are cooking, spoon ice cream into serving bowls. 2. Remove cherries from heat and stir in cherry extract. Pour in brandy and ignite with a long lighter. Gently shake the pan until blue flame has extinguished itself. Spoon cherries over ice cream.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "296"
},
{
  "url": "https://www.allrecipes.com/recipe/218433/sweet-polish-cherry-cake/",
  "name": "Polish Cherry Cake",
  "rating": "4.1",
  "ratingcount": "31",
  "ingredients": "1 cup white sugar; 2 ½ cups all-purpose flour; 1 tablespoon baking powder; 1 teaspoon baking soda; 1 tablespoon butter; 2 cups pitted fresh sweet cherries; 1 tablespoon white sugar; ½ cup olive oil; 4 large eggs; 1 (6 ounce) container plain yogurt; 1 tablespoon olive oil (Optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Whisk 1 cup sugar, flour, baking powder, and baking soda in a mixing bowl until evenly combined. 2. Melt butter in a skillet over medium heat. Cook and stir pitted cherries in the butter until tender, sprinkling them with 1 tablespoon of sugar, 8 to 10 minutes. Set aside. 3. Form a well in the center of the dry ingredients, and pour in 1/2 cup olive oil, eggs, and yogurt; lightly stir the mixture to make a soft dough. Scrape batter into a 9x12-inch baking dish. Drizzle with 1 tablespoon of olive oil (if using), and top with cherries. 4. Bake in the preheated oven until cake is set and golden on top and a toothpick inserted into the center of the cake comes out clean, about 40 minutes.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "313"
},
{
  "url": "https://www.allrecipes.com/recipe/7307/mini-cheesecakes-i/",
  "name": "Mini Cheesecakes",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 (12 ounce) package vanilla wafers; 2 (8 ounce) packages cream cheese; ¾ cup white sugar; 2  eggs; 1 teaspoon vanilla extract; 1 (21 ounce) can cherry pie filling",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line two 24-cup miniature muffin tins with paper liners. 2. Crush vanilla wafers. Place 1/2 teaspoon of crushed vanilla wafers into each paper cup. 3. Beat cream cheese, sugar, eggs, and vanilla in a mixing bowl until light and fluffy. Fill each miniature muffin liner with this mixture, almost to the top. 4. Bake in the preheated oven for 15 minutes until the cheesecake is set. Cool. Top with a teaspoonful of cherry pie filling.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "95"
},
{
  "url": "https://www.allrecipes.com/recipe/49066/the-best-unbaked-cherry-cheesecake-ever/",
  "name": "Best No-Bake Cherry Cheesecake",
  "rating": "4.6",
  "ratingcount": "445",
  "ingredients": "1 ¼ cups graham cracker crumbs; ¼ cup unsalted butter, melted; ¼ cup white sugar; 1 (8 ounce) package cream cheese, softened; 1 cup powdered sugar; 1 teaspoon vanilla extract; 1 cup heavy whipping cream; 1 (12.5 ounce) can cherry pie filling (or other filling of your choice)",
  "directions": "1. Mix together graham cracker crumbs, margarine, and sugar for crust in a bowl until well incorporated and crumbly. Press mixture into a 9-inch pie plate, going up the sides as much as possible. 2. Beat cream cheese, powdered sugar, and vanilla for filling in a bowl with an electric mixer until smooth and spreadable. 3. Beat cream in a chilled glass or metal bowl with an electric mixer until soft peaks form. Fold into cream cheese mixture until smooth. 4. Pour filling into the prepared crust, and smooth the top with a spatula. Refrigerate until firm, about 2 to 3 hours. 5. Spread cherry pie filling over the chilled cheesecake. Serve immediately or refrigerate until serving. 6. Enjoy!",
  "prep": "20 mins",
  "cook": "",
  "total": "2 hrs 20 mins",
  "calories": "445"
},
{
  "url": "https://www.allrecipes.com/recipe/258354/simple-tart-cherry-compote/",
  "name": "Fresh Cherry Compote",
  "rating": "4.0",
  "ratingcount": "2",
  "ingredients": "¾ cup water; ½ cup white sugar; ¼ teaspoon ground cinnamon; 3 ½ cups pitted tart cherries; 2 tablespoons water; 2 tablespoons cornstarch",
  "directions": "1. Bring 3/4 cup water, sugar, and cinnamon to a boil in a saucepan; reduce heat and simmer until sugar is dissolved, 3 to 4 minutes. Add cherries; bring back to a boil. Reduce heat and simmer until cherries soften, about 5 minutes. 2. Mix 2 tablespoons water and cornstarch together in a small bowl; pour over the cherry mixture in the saucepan. Stir until thickened, 1 to 2 minutes. Let cool, 10 to 15 minutes. Transfer to a container and refrigerate.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "80"
},
{
  "url": "https://www.allrecipes.com/recipe/241782/bacon-wrapped-cherries/",
  "name": "Bacon-Wrapped Cherries",
  "rating": "4.7",
  "ratingcount": "6",
  "ingredients": "36  maraschino cherries, stemmed, drained and juice reserved; 18 slices bacon slices, halved; 36  toothpicks",
  "directions": "1. Set the oven rack about 6 inches from the heat source and preheat the oven's broiler. 2. Wrap each cherry with a bacon half, secure with a toothpick, and arrange on a baking sheet. Drizzle reserved cherry juice over wrapped cherries. 3. Broil in the preheated oven until bacon is crisped to your liking, 3 to 10 minutes.",
  "prep": "20 mins",
  "cook": "5 mins",
  "total": "25 mins",
  "calories": "65"
},
{
  "url": "https://www.allrecipes.com/recipe/277008/cherry-dump-cake/",
  "name": "Cherry Dump Cake",
  "rating": "4.6",
  "ratingcount": "10",
  "ingredients": "2 (21 ounce) cans cherry pie filling; 1 (15.25 ounce) package white cake mix; ¼ cup butter, melted; ½ cup coarsely chopped pecans",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Spread cherry pie filling over the bottom of a 9x13-inch baking pan. Stir cake mix and butter together into a gooey, clumpy mixture. Break into pieces between your fingers and crumble evenly on top of the cherry filling. Sprinkle pecans on top. 3. Bake in the preheated oven until golden brown on top, 35 to 40 minutes.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "333"
},
{
  "url": "https://www.allrecipes.com/recipe/218432/cherry-pie-filling/",
  "name": "Cherry Pie Filling",
  "rating": "4.7",
  "ratingcount": "307",
  "ingredients": "4 cups pitted tart red cherries; 1 cup white sugar; ¼ cup cornstarch",
  "directions": "1. Place cherries into a saucepan over medium heat. Cover and cook, stirring often, until cherries release their juices and come to a simmer, 10 to 15 minutes. 2. Whisk sugar with cornstarch in a bowl until combined; pour mixture into hot cherries and juice. Stir until thoroughly combined. 3. Bring to a simmer over low heat; cook until thickened, about 2 minutes. Remove from heat and let cool before using as pie filling.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "40 mins",
  "calories": "219"
},
{
  "url": "https://www.allrecipes.com/recipe/72815/fresh-cherry-cobbler/",
  "name": "Fresh Cherry Cobbler",
  "rating": "4.3",
  "ratingcount": "475",
  "ingredients": "½ cup butter; 1 cup all-purpose flour; 1 ¾ cups white sugar, divided; 1 teaspoon baking powder; 1 cup milk; 2 cups pitted sour cherries; 1 tablespoon all-purpose flour",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Place butter in a 9x13-inch baking dish, and place in the oven to melt while the oven is preheating. Remove as soon as butter has melted, about 5 minutes. 2. Stir together 1 cup flour, 1 cup sugar, and baking powder in a medium bowl. Mix in milk until well blended, then pour the batter into the pan over the melted butter. Do not stir. 3. Rinse out the bowl from the batter, and dry. Place cherries into the bowl, and toss with remaining 3/4 cup sugar and 1 tablespoon flour. Distribute the cherry mixture evenly over the batter. Do not stir. 4. Bake in the preheated oven until golden brown, 50 to 60 minutes. A toothpick inserted into the cobber should come out clean.",
  "prep": "1 hr",
  "cook": "1 hr",
  "total": "2 hrs",
  "calories": "244"
},
{
  "url": "https://www.allrecipes.com/recipe/221320/old-fashioned-cocktail/",
  "name": "Old Fashioned Cocktail",
  "rating": "4.7",
  "ratingcount": "18",
  "ingredients": "1  sugar cube; 1 teaspoon water; 1 dash bitters; 2 fluid ounces whiskey (rye or bourbon); 1  lemon twist; ½ cup ice cubes, or as needed; 1  orange slice, for garnish; 1  maraschino cherry, for garnish",
  "directions": "1. Muddle sugar cube, water, and bitters in an old fashioned glass for 1 minute. Pour in whiskey; stir for 1 minute. 2. Squeeze lemon twist over the glass and drop it in. Add ice cubes. Garnish with orange slice and maraschino cherry; serve with a swizzle stick.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "168"
},
{
  "url": "https://www.allrecipes.com/recipe/273774/grandmas-skillet-pineapple-upside-down-cake/",
  "name": "Grandma's Skillet Pineapple Upside-Down Cake",
  "rating": "4.6",
  "ratingcount": "37",
  "ingredients": "1 stick butter; 1 ½ cups packed brown sugar; 1 (20 ounce) can sliced pineapple; 1 (4 ounce) jar cherries; 1 ½ cups all-purpose flour; 2 ½ teaspoons baking powder; ½ teaspoon salt; 1 ½ cups white sugar; ½ cup butter; 2 large eggs; 1 cup milk; 2 teaspoons vanilla extract",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Melt 1 stick butter in the bottom of a cast iron skillet over medium heat, about 3 minutes. Remove from heat and sprinkle brown sugar evenly over butter. Add pineapple slices to the skillet in a decorative layer with a cherry in the middle of each pineapple ring. Set aside. 3. Sift flour, baking powder, and salt together in a bowl. 4. Cream sugar and 1/2 cup butter together in a bowl. Add eggs and mix. Add flour mixture and milk in an alternating fashion. Add vanilla extract and mix well. Pour mixture evenly over pineapples in the skillet. 5. Bake in the preheated oven until cake is golden brown, about 40 minutes. 6. Let cake cool in the skillet for 10 minutes before inverting onto a serving plate. Serve warm.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "465"
},
{
  "url": "https://www.allrecipes.com/recipe/20423/cherry-bomb/",
  "name": "Cherry Bomb",
  "rating": "4.6",
  "ratingcount": "41",
  "ingredients": "1 liter lime soda; 4 fluid ounces rum; 4 fluid ounces grenadine syrup; 1  lime, juiced; 1  lime, sliced; 4  maraschino cherries",
  "directions": "1. Stir together lime soda, rum, grenadine, and lime juice in a mixing glass. Pour into 4 chilled glasses. Garnish with lime slices and cherries.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/24698/chocolate-covered-cherries/",
  "name": "Chocolate-Covered Cherries",
  "rating": "4.7",
  "ratingcount": "343",
  "ingredients": "60  maraschino cherries with stems; 3 tablespoons butter, softened; 3 tablespoons corn syrup; 2 cups sifted confectioners' sugar; 1 pound chocolate confectioners' coating",
  "directions": "1. Gather all ingredients. 2. Drain cherries and set on paper towels to dry. 3. Stir together butter and corn syrup in a medium bowl until smooth. 4. Mix in confectioners' sugar and knead to form a dough. 5. Wrap each cherry in about 1 teaspoon dough. Chill in the refrigerator until firm. 6. Melt confectioners' coating in a heavy saucepan over low heat. 7. Holding onto the stem, dip each cherry into coating and place on waxed paper-lined sheet trays. Chill in the refrigerator until coating is set. Store in an airtight container in a cool place.",
  "prep": "1 hr",
  "cook": "",
  "total": "1 hr 30 mins",
  "calories": "68"
},
{
  "url": "https://www.allrecipes.com/recipe/8095/black-forest-cake-i/",
  "name": "Black Forest Cake",
  "rating": "4.5",
  "ratingcount": "486",
  "ingredients": "2 ⅛ cups all-purpose flour; 2 cups white sugar; ¾ cup unsweetened cocoa powder; 1 ½ teaspoons baking powder; ¾ teaspoon baking soda; ¾ teaspoon salt; 3  eggs; 1 cup milk; ½ cup vegetable oil; 1 tablespoon vanilla extract; 2 (20 ounce) cans pitted sour cherries; 1 cup white sugar; ¼ cup cornstarch; 1 teaspoon vanilla extract; 3 cups heavy whipping cream; ⅓ cup confectioners' sugar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round cake pans; line bottoms with parchment paper. Place a medium bowl in the refrigerator to chill. 2. Whisk flour, sugar, cocoa, baking powder, baking soda, and salt together in a large bowl. Add eggs, milk, oil, and vanilla; beat until combined. Pour cake batter into the prepared pans. 3. Bake in the preheated oven until a toothpick inserted in the centers comes out clean, about 35 minutes. Cool layers in pans on wire racks for 10 minutes. Run a paring knife around edges to loosen and invert carefully onto racks to cool completely, 1 to 2 hours. 4. While cake layers bake, drain cherries for topping, reserving 1/2 cup juice. Combine reserved juice, cherries, sugar, and cornstarch in a 2-quart saucepan. Cook, stirring constantly, over low heat until thickened. Stir in vanilla. Let cool at room temperature for 30 minutes. Transfer to the refrigerator to cool completely before assembling cake. 5. Combine whipping cream and confectioners' sugar for frosting in the chilled medium bowl. Beat with an electric mixer at high speed until stiff peaks form. 6. Split each cake layer in half horizontally using a long serrated knife. Tear one layer into crumbs; set aside. Gently brush loose crumbs off top and sides of remaining layers using a pastry brush or your hands. Reserve 1 1/2 cups frosting for piping decorations on cake; set aside. 7. To assemble, place one cake layer on a cake plate. Spread with 1 cup frosting; top with 3/4 cup cherry topping. Top with second cake layer; repeat layers of frosting and cherry topping. Top with third cake layer and frost sides of cake. 8. Pat reserved cake crumbs onto sides of cake. Spoon reserved 1 1/2 cups frosting into a pastry bag fitted with a star decorator tip. Pipe around top and bottom edges of cake. Spoon remaining cherry topping on top of cake. 9. Store covered in the refrigerator until ready to serve.",
  "prep": "50 mins",
  "cook": "35 mins",
  "total": "2 hrs 55 mins",
  "calories": "662"
},
{
  "url": "https://www.allrecipes.com/recipe/7870/best-boiled-fruitcake/",
  "name": "Best Boiled Fruitcake",
  "rating": "4.8",
  "ratingcount": "64",
  "ingredients": "1 ½ cups white sugar; 12 ounces candied mixed fruit; 1 cup milk; ¾ cup butter; 5 ounces glace cherries, roughly chopped; 2 ounces candied mixed citrus peel; 2 ounces chopped walnuts; 1 teaspoon ground allspice; ½ teaspoon baking soda; 12 ounces sifted self-rising flour; 2 large eggs",
  "directions": "1. Preheat the oven to 325 degrees F (160 degrees C). Line an 8-inch deep cake pan with parchment paper. 2. Place sugar, candied mixed fruit, milk, butter, cherries, citrus peel, walnuts, allspice, and baking soda in a medium-sized saucepan. Bring to a boil, reduce heat, and simmer for 5 minutes. Remove from heat and allow to cool slightly. 3. Stir flour and eggs into fruit mixture. Pour batter into the prepared pan. Wrap the outside of the pan with brown paper or newspaper. 4. Bake cake in the preheated oven for 40 minutes. Reduce temperature to 300 degrees F (150 degrees C) and continue baking cake for 1 1/2 hours. 5. Let cake sit at room temperature for 5 minutes, then invert it onto a wired rack. Remove parchment paper, flip cake, and allow to cool completely on the rack. Cake may be stored wrapped in foil and in an airtight container for up to 6 months.",
  "prep": "15 mins",
  "cook": "2 hrs 20 mins",
  "total": "2 hrs 40 mins",
  "calories": "588"
},
{
  "url": "https://www.allrecipes.com/recipe/272616/pineapple-upside-down-bundt-cake/",
  "name": "Pineapple Upside-Down Bundt Cake",
  "rating": "4.9",
  "ratingcount": "83",
  "ingredients": "cooking spray with flour; ½ cup melted butter; ½ cup packed brown sugar; 1 (8 ounce) can pineapple rings; 1 (4 ounce) jar maraschino cherries; 1 (15.25 ounce) package yellow cake mix; 1 (3.5 ounce) package instant vanilla pudding mix; ¼ cup whole milk, or more as needed; ⅓ cup vegetable oil; 3 large eggs",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 10-inch fluted tube pan (such as Bundt) with cooking spray with flour. 2. Pour melted butter into the bottom of the prepared pan. Sprinkle brown sugar evenly on top. Drain pineapple rings over a measuring cup; reserve juice. Cut rings in half. Alternate placing halved pineapple rings and maraschino cherries around the pan. Set aside. 3. Combine cake mix and pudding mix in a large mixing bowl. Pour enough milk into the reserved pineapple juice to make 1 cup of liquid; add to cake and pudding mixture. Pour in vegetable oil. Mix on low speed, adding 1 egg at a time, until blended. Increase speed to medium; mix until thoroughly combined and smooth, about 2 minutes. Pour batter over pineapples and cherries in the pan. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Let cool for 10 minutes before removing from the pan.",
  "prep": "30 mins",
  "cook": "35 mins",
  "total": "1 hr 15 mins",
  "calories": "417"
},
{
  "url": "https://www.allrecipes.com/recipe/7900/thirty-day-friendship-cake/",
  "name": "Thirty-Day Friendship Cake",
  "rating": "4.6",
  "ratingcount": "71",
  "ingredients": "2 cups Friendship Fruit Starter; 1 (15 ounce) can sliced peaches with juice; 5 ½ cups white sugar, divided; 1 (15 ounce) can pineapple chunks with juice; 2 (10 ounce) jars maraschino cherries, drained; 1 tablespoon all-purpose flour for dusting; 2 (15.25 ounce) packages yellow cake mix; 8 large eggs; 1 ⅓ cups vegetable oil; 2 (3.4 ounce) packages instant vanilla pudding mix; 2 cups golden raisins; 2 cups chopped walnuts; 2 cups flaked coconut",
  "directions": "1. Day One: Place starter into a large glass jar or bowl. Strain peach juice over starter. Cut each peach slice into 4 pieces and add to starter-juice mixture. Stir in 2 1/2 cups sugar until combined. Cover the jar loosely with a clean dish towel. Let sit at room temperature for 10 days, stirring once each day. A pan of water underneath the jar will keep ants out. 2. Day Ten: Strain pineapple juice over starter mixture. Cut each pineapple in half and add to starter mixture. Stir in 1/2 cup sugar until combined. Let sit, loosely covered, at room temperature for 10 days, stirring once each day. The color should change and mixture should foam when stirred. 3. Day Twenty: Slice each maraschino cherry in half and add to starter mixture. Stir in remaining 2 1/2 cups sugar until combined. Let sit, loosely covered, at room temperature for the final 10 days, stirring once each day. The color will turn slightly pink from the cherries. 4. Day Thirty: Drain liquid from fruit and pour into 3 glass or ceramic pint jars — one for you to make your next cake and two for friends. Set aside fruit. 5. Preheat the oven to 325 degrees F (165 degrees C). Grease and flour two 9x13-inch baking dishes. 6. Beat together 1 box cake mix, 4 eggs, 2/3 cup oil, and 1 package instant pudding in a large bowl until well combined. Mix in 1/2 of the reserved fruit. Stir in 1 cup raisins, 1 cup nuts, and 1 cup coconut until incorporated; batter will be stiff. Pour into the prepared baking dish. Repeat this step for second cake. 7. Bake cakes in the preheated oven until a toothpick inserted into the centers comes out clean, 55 to 65 minutes.",
  "prep": "1 hr",
  "cook": "55 mins",
  "total": "30 days 1 hr 55 mins",
  "calories": "346"
},
{
  "url": "https://www.allrecipes.com/recipe/214000/baked-ham-with-sweet-glaze/",
  "name": "Baked Ham with Sweet Glaze",
  "rating": "4.7",
  "ratingcount": "101",
  "ingredients": "1 (10 pound) fully-cooked, bone-in ham; 4 cups boiling water, or as needed; 1 cup packed brown sugar; 2 tablespoons all-purpose flour; 2 tablespoons dry mustard powder; ¼ cup honey; 1 teaspoon fresh lemon juice, or as needed; 1 (20 ounce) can pineapple chunks, drained; 1 (10 ounce) jar maraschino cherries, drained; toothpicks",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Place ham on a rack set in a roasting pan, and carefully pour about 1/2 inch of boiling water into the pan beneath the ham. 2. Bake the ham in the preheated oven for 2 hours, or until a meat thermometer inserted into the thickest part of the meat (do not touch the bone) reads at least 140 degrees F (60 degrees C.) 3. Reduce oven heat to 350 degrees F (175 degrees C.) In a bowl, mix together the brown sugar, flour, dry mustard, honey, and lemon juice as needed to make a thick, smooth paste. Brush the ham generously with glaze. Skewer 1 pineapple chunk and 1 maraschino cherry per toothpick, and insert the decorated picks all over the ham. 4. Return the ham to the oven, and roast for 15 minutes. Baste the ham, fruit and all, with glaze and juices that have collected in the bottom of the pan, return to the oven, and roast for an additional 15 minutes. Let the ham rest for at least 10 minutes before slicing.",
  "prep": "20 mins",
  "cook": "2 hrs 30 mins",
  "total": "3 hrs",
  "calories": "668"
},
{
  "url": "https://www.allrecipes.com/recipe/254770/fresh-cherry-muffins/",
  "name": "Fresh Cherry Muffins",
  "rating": "4.6",
  "ratingcount": "80",
  "ingredients": "1 ½ cups all-purpose flour; ¾ cup white sugar; 2 teaspoons baking powder; ½ teaspoon salt; ⅓ cup vegetable oil; ⅓ cup milk; 1 large egg; ½ teaspoon almond extract; 1 cup fresh pitted and quartered sweet cherries; 1 tablespoon white sugar",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a 12-cup muffin tin with paper liners. 2. Mix flour, 3/4 cup sugar, baking powder, and salt together in a bowl. 3. Whisk oil, milk, egg, and almond extract together in a small bowl; pour into flour mixture and gently stir until incorporated. Fold in cherries. Spoon batter into the prepared muffin cups, filling each 2/3 full. Sprinkle remaining sugar over top. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes. Transfer to a wire rack to cool.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "182"
},
{
  "url": "https://www.allrecipes.com/recipe/12148/easy-fruit-cobbler/",
  "name": "Easy Fruit Cobbler",
  "rating": "4.3",
  "ratingcount": "491",
  "ingredients": "1 cup all-purpose flour; 2 teaspoons baking powder; ¾ cup white sugar; ¾ cup milk; ¼ cup butter; 2 cups sliced fresh peaches",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). Melt butter in a 9 x 9 inch baking dish. 2. Blend together flour, baking powder, sugar, and milk. 3. Pour batter in baking dish over the butter. Sprinkle fruit on top of the batter, do not stir. Bake for 1 hour or until golden brown.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "200"
},
{
  "url": "https://www.allrecipes.com/recipe/22621/old-time-mincemeat-pie/",
  "name": "Old-Time Mincemeat Pie",
  "rating": "4.9",
  "ratingcount": "14",
  "ingredients": "1 ¼ pounds round steak, cut into small pieces; 1 cup apple cider; 4  Granny Smith apples - peeled, cored and finely diced; 2 ½ cups dried currants; 2 ½ cups raisins; 1 (16 ounce) jar sour cherry preserves; 1 ⅓ cups white sugar; ½ pound chopped candied mixed fruit peel; ½ cup butter; 1 teaspoon ground ginger; ½ teaspoon ground cloves; ½ teaspoon ground nutmeg; ½ teaspoon ground cinnamon; ½ teaspoon salt; 1 (16 ounce) can pitted sour cherries, drained; 1 (14.1 ounce) package double-crust pie pastry, thawed; 2 tablespoons heavy cream; 1 teaspoon white sugar, for sprinkling",
  "directions": "1. Combine steak and cider in a Dutch oven. Bring to a boil, then reduce heat to a simmer. Cover and cook until steak is tender, about 20 minutes. Remove steak to a cutting board; coarsely chop, then return to the pot. 2. Stir in apples, currants, raisins, cherry preserves, 1 1/3 cups sugar, mixed fruit peel, and butter. Add ginger, cloves, nutmeg, cinnamon, and salt. Simmer, uncovered, over low heat until mixture is very thick, about 1 hour 30 minutes. Stir in cherries and remove from heat. 3. Transfer filling to a container and allow to cool at room temperature. Cover tightly and refrigerate for at least 1 week before using. 4. Preheat the oven to 350 degrees F (175 degrees C). 5. Line a 9-inch pie dish with 1 pastry crust. Spoon filling into crust and cover with second pastry crust. Crimp edges and cut several slits into top pastry. Brush with cream and sprinkle with 1 teaspoon sugar. 6. Bake in the preheated oven until golden brown, about 45 minutes.",
  "prep": "45 mins",
  "cook": "2 hrs 55 mins",
  "total": "7 days 3 hrs 40 mins",
  "calories": "1106"
},
{
  "url": "https://www.allrecipes.com/recipe/8445/english-trifle/",
  "name": "English Trifle",
  "rating": "4.8",
  "ratingcount": "227",
  "ingredients": "2 (8 or 9 inch) white cake layers, baked and cooled; 2 pints fresh strawberries; ¼ cup white sugar; 1 pint fresh blueberries; 2  bananas; ¼ cup orange juice; 1 (3.5 ounce) package instant vanilla pudding mix; 2 cups milk; 1 cup heavy whipping cream; ¼ cup blanched slivered almonds; 12  maraschino cherries",
  "directions": "1. Slice strawberries and sprinkle them with sugar. Cut the bananas into slices and toss with orange juice. Combine pudding mix with milk and mix until smooth. Cut the cake into 1 inch cubes. 2. Use half of the cake cubes to line the bottom of a large glass bowl. Layer half of the strawberries followed by half of the blueberries, and then half of the bananas. Spread half of the pudding over the fruit. Repeat layers in the same order. 3. In a medium bowl, whip the cream to stiff peaks and spread over top of trifle. Garnish with maraschino cherries and slivered almonds.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "633"
},
{
  "url": "https://www.allrecipes.com/recipe/17116/pineapple-glaze-for-ham/",
  "name": "Pineapple Glaze for Ham",
  "rating": "4.5",
  "ratingcount": "102",
  "ingredients": "1 (15.25 ounce) can sliced pineapple, drained with juice reserved; 1 (4 ounce) jar maraschino cherries, drained; 1 cup brown sugar",
  "directions": "1. Before baking ham, place pineapple slices on ham with toothpicks and place cherries in center of pineapple. 2. In a medium microwave safe bowl combine brown sugar and reserved pineapple juice. Mix together and microwave for about 5 minutes, until mixture is thick. Pour some of this glaze over the ham about every 15 minutes in the last hour of baking, until all is used.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "93"
},
{
  "url": "https://www.allrecipes.com/recipe/254501/the-best-cherry-pie/",
  "name": "The Best Cherry Pie",
  "rating": "4.9",
  "ratingcount": "10",
  "ingredients": "1 (15 ounce) package double crust ready-to-use pie crust; 3 cups cherries, pitted; ¾ cup white sugar; 3 tablespoons cornstarch; ¼ teaspoon almond extract; 2 tablespoons salted butter, cut into bits",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil. Place bottom pie crust into a 9-inch pie pan; made pricks along the bottom with a fork. 2. Bake in the preheated oven until pie crust is lightly browned, about 8 minutes. Remove crust from oven and cool for 5 minutes. 3. Combine cherries, sugar, cornstarch, and almond extract together in a bowl. Pour cherry mixture into the prepared pie pan; dot with butter. Cover with top crusts, crimp the edges to seal, and cut vents into the top with a sharp knife. Place the pie on a foil-covered baking sheet. 4. Bake in the preheated oven for 30 minutes. If it is browning too fast cover the pie with an aluminum foil tent. Continue baking until crust is golden brown and filling is bubbly, 10 to 20 minutes. Place on a wire rack to cool, about 15 minutes.",
  "prep": "15 mins",
  "cook": "48 mins",
  "total": "1 hr 23 mins",
  "calories": "395"
},
{
  "url": "https://www.allrecipes.com/recipe/233524/homemade-old-fashioned-mix/",
  "name": "Homemade Old Fashioned Mix",
  "rating": "4.7",
  "ratingcount": "19",
  "ingredients": "3 cups water; 3 cups white sugar; 3  clementine oranges, quartered; 5  maraschino cherries, or more to taste; 1  cinnamon stick; 2 tablespoons bitters, or to taste",
  "directions": "1. Bring water and sugar to a boil in a saucepan; remove from heat. Stir oranges, cherries, and cinnamon stick into sugar mixture. Cover saucepan and steep for 1 hour. 2. Remove fruit and cinnamon stick from mixture using a slotted spoon; stir in bitters.",
  "prep": "10 mins",
  "cook": "",
  "total": "1 hr 10 mins",
  "calories": "66"
},
{
  "url": "https://www.allrecipes.com/recipe/244754/door-county-cherry-bounce/",
  "name": "Door County Cherry Bounce",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "2 cups pitted tart cherries (such as Door County cherries); ⅓ cup white sugar, or to taste; 1 cup vodka, or as needed",
  "directions": "1. Put cherries in a clean, 1-quart glass jar; add sugar. Fill the rest of the jar with vodka. Place lid on jar and shake. 2. Store jar in a cool, dark area for 1 to 4 months, shaking jar occasionally.",
  "prep": "10 mins",
  "cook": "",
  "total": "19 days 17 hrs 12 mins",
  "calories": "101"
},
{
  "url": "https://www.allrecipes.com/recipe/172463/simple-summer-smoothie/",
  "name": "Simple Summer Smoothie",
  "rating": "4.5",
  "ratingcount": "46",
  "ingredients": "1  banana; 1 cup frozen strawberries; 1 cup frozen blueberries; 1 cup frozen cherries; 4  ice cubes; ½ cup orange juice; ¾ cup vanilla yogurt; ½ teaspoon honey (Optional)",
  "directions": "1. Place the banana, strawberries, blueberries, cherries, and ice cubes into a blender. Pour in the orange juice, vanilla yogurt, and honey. Puree until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "139"
},
{
  "url": "https://www.allrecipes.com/recipe/9979/chocolate-covered-cherry-cookies-ii/",
  "name": "Chocolate Covered Cherry Cookies",
  "rating": "4.6",
  "ratingcount": "489",
  "ingredients": "1 cup white sugar; ½ cup butter; 1  egg; 1 ½ teaspoons vanilla extract; 1 ½ cups all-purpose flour; ½ cup unsweetened cocoa powder; ¼ teaspoon salt; ¼ teaspoon baking soda; ¼ teaspoon baking powder; 1 (10 ounce) jar maraschino cherries; ½ cup sweetened condensed milk; 1 cup semisweet chocolate chips",
  "directions": "1. Preheat the oven to 350 degrees F (180 degrees C). 2. Beat sugar and butter together in a large bowl with an electric mixer until light and fluffy. Add egg and vanilla; beat well. Stir in flour, cocoa powder, salt, baking soda, and baking powder until smooth. Roll dough into walnut-size balls and place 2 inches apart on ungreased cookie sheets. Make an indentation with your thumb in the center of each cookie. 3. Drain cherries and reserve juice. Place a cherry in the indentation of each cookie ball. 4. Combine chocolate chips with condensed milk in a saucepan over low heat; stir until chocolate is melted. Stir in 4 teaspoons of cherry juice. Drizzle or spoon about 1 teaspoon of chocolate cherry mixture over each cherry to cover. 5. Bake in the preheated for 10 minutes. Cool on the baking sheets briefly before removing to a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "223"
},
{
  "url": "https://www.allrecipes.com/recipe/50341/fresh-cherry-crisp/",
  "name": "Fresh Cherry Crisp",
  "rating": "4.4",
  "ratingcount": "316",
  "ingredients": "4 cups pitted sour cherries; 1 ½ cups white sugar; 4 tablespoons all-purpose flour; 1 ½ cups all-purpose flour; 1 cup old-fashioned oats; 1 cup brown sugar; ½ cup butter; ½ cup shortening",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. In a large bowl, combine cherries, 1 1/2 cups white sugar, and 4 tablespoons flour. Pour into 9x13 inch baking dish. In a medium bowl, combine 1 1/2 cups flour, oats, and brown sugar. Cut in butter and shortening until crumbly. Sprinkle over cherries. 3. Bake in preheated oven for 45 to 50 minutes, or until topping is golden brown.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "606"
},
{
  "url": "https://www.allrecipes.com/recipe/257425/chef-johns-classic-rice-pudding/",
  "name": "Chef John's Classic Rice Pudding",
  "rating": "4.7",
  "ratingcount": "129",
  "ingredients": "½ cup uncooked long-grain white rice; ¼ teaspoon kosher salt; 1 cup water; ¼ cup white sugar; 1 ⅓ cups milk; ½ teaspoon vanilla extract; ⅛ teaspoon ground cinnamon; 1  large egg yolk; 1 tablespoon cold butter; 2 tablespoons dried cherries, chopped",
  "directions": "1. Place rice, salt, and water into a saucepan. Bring to a boil over medium-high heat. Reduce heat to low, cover, and cook until tender, about 20 minutes. Remove from heat; sprinkle with sugar and pour in milk. Stir with a whisk until until the thin layer of cooked-on starch at the bottom of the pan is cleared and incorporated into the mixture, 2 or 3 minutes. 2. Place pan over medium heat, stirring frequently, until it reaches your desired of level of doneness and creaminess, 8 to 10 minutes. The longer it cooks, the thicker and stickier it will be. Remove from heat. Add vanilla and cinnamon. Very quickly whisk in the egg yolk (to prevent it from cooking). Whisk for about 1 more minute. Add butter and dried cherries; stir thoroughly. 3. Transfer warm pudding to serving dishes. Cool to room temperature. Cover and refrigerate until thoroughly chilled, 3 to 4 hours.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "3 hrs 35 mins",
  "calories": "235"
},
{
  "url": "https://www.allrecipes.com/recipe/218434/bc-cherry-jam/",
  "name": "Cherry Jam",
  "rating": "4.5",
  "ratingcount": "48",
  "ingredients": "3 cups pitted, chopped fresh cherries; ½ cup unsweetened apple juice; 2 teaspoons lemon juice; 2 (2 ounce) packages powdered fruit pectin; 3 cups white sugar; 4  half pint canning jars with lids and rings",
  "directions": "1. Place cherries, apple juice, lemon juice, and pectin into a large saucepan over medium heat; bring to a boil and mix in sugar. Cook jam at a rolling boil for 2 minutes, stirring constantly. Remove from heat and skim off any foam. 2. Sterilize the jars and lids in boiling water for at least 5 minutes. Pack cherry jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. 3. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 15 minutes, or the time as recommended by your county Extension agent. 4. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "67"
},
{
  "url": "https://www.allrecipes.com/recipe/11223/cherry-winks/",
  "name": "Cherry Winks",
  "rating": "4.7",
  "ratingcount": "62",
  "ingredients": "¾ cup shortening; 1 cup white sugar; 2  eggs; 2 tablespoons milk; 1 teaspoon vanilla extract; 2 ¼ cups sifted all-purpose flour; 1 teaspoon baking powder; ½ teaspoon baking soda; ½ teaspoon salt; 1 cup chopped pecans; 1 cup dates, pitted and chopped; ⅓ cup maraschino cherries, chopped; 2 ½ cups crushed cornflakes cereal; 10  maraschino cherries, quartered",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheets. 2. Cream the shortening with the sugar. Blend in the eggs, milk and vanilla. 3. Sift together the flour, baking powder, baking soda and salt. Add the flour mixture to the creamed mixture and mix well. Stir in the chopped pecans, chopped dates and 1/3 cup maraschino cherries. 4. Shape teaspoonful sized chunks of dough into balls. Roll each ball in the crushed corn flakes. Place balls on the prepared baking sheets and top each cookie with 1/4 maraschino cherry. 5. Bake at 375 degrees F (190 degrees C) for 10 to 12 minutes. Let cool completely before storing in airtight containers.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "164"
},
{
  "url": "https://www.allrecipes.com/recipe/217221/monte-carlo-cocktail/",
  "name": "Monte Carlo Cocktail",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "ice; 2 fluid ounces rye whiskey; ¾ fluid ounce Benedictine liqueur; 2 dashes aromatic bitters (such as Peychaud's®; 1  maraschino cherry",
  "directions": "1. Fill a cocktail shaker with ice. Pour in whiskey and Benedictine. Shake in bitters. Cover and shake well. Strain into a chilled glass. Garnish with maraschino cherry.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "224"
},
{
  "url": "https://www.allrecipes.com/recipe/12245/baked-fresh-cherry-pie/",
  "name": "Baked Fresh Cherry Pie",
  "rating": "4.6",
  "ratingcount": "354",
  "ingredients": "1 recipe pastry for a 9 inch double crust pie; 4 tablespoons quick-cooking tapioca; ⅛ teaspoon salt; 1 cup white sugar; 4 cups pitted cherries; ¼ teaspoon almond extract; ½ teaspoon vanilla extract; 1 ½ tablespoons butter",
  "directions": "1. Preheat oven to 400 degrees F (205 degrees C). Place bottom crust in pie pan. Set top crust aside, covered. 2. In a large mixing bowl combine tapioca, salt, sugar, cherries, and extracts. Let stand 15 minutes. Turn out into bottom crust and dot with butter. Cover with top crust, flute edges and cut vents in top. Place pie on a foil-lined cookie sheet--in case of drips! 3. Bake for 50 minutes in the preheated oven, until golden brown. Let cool for several hours before slicing.",
  "prep": "30 mins",
  "cook": "50 mins",
  "total": "3 hrs 20 mins",
  "calories": "410"
},
{
  "url": "https://www.allrecipes.com/recipe/259161/clafoutis-aux-cerises-classic-clafouti/",
  "name": "Clafoutis aux Cerises (Classic Clafouti)",
  "rating": "4.7",
  "ratingcount": "17",
  "ingredients": "1 ½ cups milk; ½  vanilla bean, split (Optional); 1 teaspoon unsalted butter; 4 cups cherries (with pits); ½ cup all-purpose flour; 1 pinch salt; ½ cup white sugar; 3  eggs; 3 tablespoons heavy cream; 2 tablespoons white sugar",
  "directions": "1. Combine milk and vanilla bean in a pot and steep for at least 1 hour. 2. Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch baking dish with butter. Spread out cherries in the bottom of the prepared baking dish. 3. Combine 1/2 cup flour, 1/2 cup sugar and salt in a bowl. Add eggs one at a time; beat with an electric mixer after each addition until smooth and creamy. 4. Remove vanilla bean from milk and discard. Add milk to egg mixture. Pour in heavy cream; mix until smooth. Pour mixture evenly over cherries. 5. Bake in the preheated oven until top of clafoutis is golden, 45 to 50 minutes. Remove from the oven and sprinkle 2 tablespoons sugar on top. Let cool slightly before serving so that the clafoutis is set. Serve warm or at room temperature.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "2 hrs",
  "calories": "215"
},
{
  "url": "https://www.allrecipes.com/recipe/7436/dried-cherry-cake/",
  "name": "Dried Cherry Cake",
  "rating": "4.6",
  "ratingcount": "97",
  "ingredients": "½ cup chopped dried cherries; ½ cup hot water; ½ teaspoon almond extract; 1 ½ cups all-purpose flour; 2 teaspoons baking powder; ¼ teaspoon salt; 1 cup white sugar; 1 (8 ounce) container vanilla yogurt; ½ cup vegetable oil; 1  egg; 1  egg white; ¼ cup chopped pecans; 1 tablespoon white sugar",
  "directions": "1. Combine cherries, hot water, and almond extract: let stand 20 minutes. Drain cherries, and pat dry between layers of paper towels. Set aside. 2. In a large bowl, combine flour, salt, baking powder, and 1 cup white sugar. Add yogurt, eggs, and oil. Stir well. Fold in cherries. Pour batter into a greased and floured 9 inch round cake pan. 3. Stir pecans and 1 tablespoon white sugar together. Sprinkle on top of batter in pan. 4. Bake at 350 degrees F (175 degrees C) for 35 minutes, or until wooden pick comes out clean. Cool in pan on wire rack 10 minutes. Serve warm, or at room temperature.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "266"
},
{
  "url": "https://www.allrecipes.com/recipe/7605/no-bake-fruitcake/",
  "name": "No Bake Fruitcake",
  "rating": "4.4",
  "ratingcount": "19",
  "ingredients": "1 pound halved candied cherries; 4 cups chopped pecans; 1 (14 ounce) can sweetened condensed milk; 1 (14 ounce) can coconut milk; 1 cup flaked coconut; 1 cup raisins; 1 teaspoon vanilla extract; 1 (12 ounce) package vanilla wafers, crushed",
  "directions": "1. In a large bowl mix the candied cherries, chopped pecans, sweetened condensed milk, coconut milk, flaked coconut, raisins, vanilla, and crushed vanilla wafers. Batter will be very stiff. Place into pan and store in the refrigerator.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "475"
},
{
  "url": "https://www.allrecipes.com/recipe/44746/cherry-ham-glaze/",
  "name": "Cherry Ham Glaze",
  "rating": "4.7",
  "ratingcount": "65",
  "ingredients": "3 tablespoons water; ¼ cup white vinegar; 2 tablespoons light corn syrup; 1 (12 ounce) jar cherry preserves; ¼ teaspoon ground cinnamon; ¼ teaspoon ground cloves; ¼ teaspoon ground nutmeg",
  "directions": "1. Stir together water, vinegar, corn syrup, preserves, cinnamon, cloves, and nutmeg in a saucepan over medium-high heat. Bring to a boil, then reduce heat to low and simmer for 2 minutes. 2. Brush 1/4 to 1/3 cup of this glaze over your ham about 30 minutes before it is finished baking. Stir any ham drippings into the remaining glaze and serve alongside the sliced ham.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "88"
},
{
  "url": "https://www.allrecipes.com/recipe/143665/vanilla-cherry-ice-cream/",
  "name": "Vanilla Cherry Ice Cream",
  "rating": "4.6",
  "ratingcount": "87",
  "ingredients": "2 cups heavy cream; 1 cup milk; ¾ cup white sugar; 1 tablespoon vanilla extract; 1 teaspoon almond extract; 2 cups fresh cherries, pits removed and cut in half",
  "directions": "1. Combine the cream, milk, and sugar in a bowl. Stir until the sugar is completely dissolved. Stir in the vanilla and almond extract. Add the cherries. Pour the mixture into an ice cream maker and churn according to the manufacturer's instructions. Transfer to a freezer-safe container and freeze for at least 2 hours before serving.",
  "prep": "3 hrs 15 mins",
  "cook": "",
  "total": "5 hrs 15 mins",
  "calories": "325"
},
{
  "url": "https://www.allrecipes.com/recipe/8016/dump-cake-v/",
  "name": "Dump Cake V",
  "rating": "4.7",
  "ratingcount": "285",
  "ingredients": "1 (21 ounce) can cherry pie filling; 1 (20 ounce) can crushed pineapple, drained; 1 (18.25 ounce) package yellow cake mix; 1 cup margarine, melted; 1 cup flaked coconut; ½ cup chopped walnuts",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. 2. In the prepared dish, layer the cherry pie filling and the drained pineapple. Sprinkle the dry cake mix over the top, covering evenly. Pour the melted margarine over the cake mix, and sprinkle the top with the coconut and chopped walnuts. 3. Bake 50 to 60 minutes in the preheated oven, until browned and bubbly.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "310"
},
{
  "url": "https://www.allrecipes.com/recipe/16225/cherry-chicken-salad/",
  "name": "Cherry Chicken Salad",
  "rating": "4.7",
  "ratingcount": "110",
  "ingredients": "3  cooked, boneless chicken breast halves, diced; ⅓ cup  dried cherries; ⅓ cup diced celery; ⅓ cup toasted, chopped pecans; ⅓ cup low-fat mayonnaise; 1 tablespoon buttermilk; ½ teaspoon salt; ½ teaspoon ground black pepper; ⅓ cup cubed apples (Optional)",
  "directions": "1. In a large bowl, combine the chicken, dried cherries, celery, nuts, mayonnaise, milk, salt and pepper and apple if desired. Toss together well and refrigerate until chilled. Serve on toasted cracked wheat bread or croissants.",
  "prep": "15 mins",
  "cook": "",
  "total": "45 mins",
  "calories": "264"
},
{
  "url": "https://www.allrecipes.com/recipe/12671/ground-cherry-pie-ii/",
  "name": "Ground Cherry Pie II",
  "rating": "4.4",
  "ratingcount": "23",
  "ingredients": "2 ½ cups ground cherries; ½ cup packed brown sugar; 1 tablespoon all-purpose flour; 2 tablespoons water; 1 (9 inch) pie shell; 3 tablespoons all-purpose flour; 3 tablespoons white sugar; 2 tablespoons butter",
  "directions": "1. Preheat oven to 425 degrees F (220 degrees C). 2. Wash ground cherries and place in unbaked pie shell. Mix brown sugar and 1 tablespoon flour and sprinkle over cherries. Sprinkle water over top. Mix together 3 tablespoons flour and 3 tablespoons sugar. Cut butter in until crumbly. Top cherry mixture with crumbs. 3. Bake in the preheated oven for 15 minutes, reduce temperature to 375 degrees F (190 degrees C) and continue to bake for 25 minutes.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "214"
},
{
  "url": "https://www.allrecipes.com/recipe/52607/cherry-pound-cake/",
  "name": "Cherry Pound Cake",
  "rating": "4.7",
  "ratingcount": "178",
  "ingredients": "2 cups all-purpose flour; 3 teaspoons baking powder; ½ teaspoon salt; 1 cup butter; 1 (8 ounce) package cream cheese; 1 ½ cups white sugar; 4  eggs; 1 teaspoon vanilla extract; 1 teaspoon almond extract; 1 cup maraschino cherries, drained and halved; ¼ cup all-purpose flour",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). Grease and flour an 8 inch tube pan. Mix together the flour, baking powder, and salt; set aside. 2. In a large bowl, cream together the butter, cream cheese, and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla and almond extract. Beat in the flour mixture, mixing just until incorporated. Dredge cherries in 1/4 cup flour, then fold into batter. Spread into prepared pan. 3. Bake in the preheated oven for 80 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.",
  "prep": "20 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 40 mins",
  "calories": "433"
},
{
  "url": "https://www.allrecipes.com/recipe/17562/ice-box-fruitcake/",
  "name": "Ice Box Fruitcake",
  "rating": "4.7",
  "ratingcount": "69",
  "ingredients": "1 cup chopped pecans; 1 cup chopped walnuts; 1 cup chopped raisins; 1 (4 ounce) jar maraschino cherries, drained and chopped; 1 (14 ounce) can sweetened condensed milk; 1 (12 ounce) package vanilla wafers, crushed",
  "directions": "1. In a medium bowl, stir together the pecans, raisins, walnuts, cherries, condensed milk and vanilla wafers. Dough will be very thick, you will need to use your hands. 2. Form dough into a ring shape on top of a dinner plate. Wrap in many layers of plastic wrap and/or aluminum foil. Allow to age in the refrigerator for at least a week. The flavors will have a chance to blend and all of the milk will be absorbed into the cake.",
  "prep": "20 mins",
  "cook": "",
  "total": "20 mins",
  "calories": "356"
},
{
  "url": "https://www.allrecipes.com/recipe/7673/crushed-pineapple-fruitcake/",
  "name": "Crushed Pineapple Fruitcake",
  "rating": "4.9",
  "ratingcount": "11",
  "ingredients": "¾ cup butter; 1 cup white sugar; 2  eggs; 2 cups all-purpose flour; 2 teaspoons baking powder; 1 teaspoon salt; 1 teaspoon almond extract; 3 cups golden raisins; ½ cup red candied cherries; 1 cup candied mixed fruit peel; 1 (15 ounce) can crushed pineapple with juice",
  "directions": "1. Line an angel food pan with parchment paper and brush with melted butter. 2. Cream butter or margarine, and then beat in sugar. Beat in eggs one at a time, beating well after each addition. Stir in extract. Mix in flour, baking powder, and salt. Stir in raisins, cherries, pineapple, and mixed peel. Cover bowl and let sit at room temperature, 8 hours to overnight. 3. Bake at 300 degrees F (150 degrees C) for 2 1/2 hours with a pan of hot water placed on the lowest rack of your oven during baking. Brush warm cake with some melted butter.",
  "prep": "15 mins",
  "cook": "2 hrs 30 mins",
  "total": "10 hrs 45 mins",
  "calories": "400"
},
{
  "url": "https://www.allrecipes.com/recipe/50950/almond-tortoni/",
  "name": "Almond Tortoni",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "1  egg white; ¼ cup confectioners' sugar; 1 cup heavy cream; 1 teaspoon sherry wine or Marsala; 1 teaspoon almond extract; 1 cup almond macaroon crumbs; ½ cup ground almonds; 6  red maraschino cherries, chopped; 6  green maraschino cherries, chopped; ¼ cup slivered almonds; 4  maraschino cherries, halved for garnish",
  "directions": "1. In a small bowl, beat egg white until foamy. Gradually beat in sugar, and continue beating until thick and glossy; set aside. 2. Whip cream in a large bowl. Carefully fold in sherry, almond extract, macaroon crumbs, ground almonds, and chopped red and green cherries. Gently fold egg white into cream mixture. 3. Spoon into 8 paper baking cups placed in medium size muffin tray. Sprinkle with slivered almonds. Cover muffin tray with clear plastic wrap, then wrap with aluminum foil. Freeze overnight. 4. To serve: Let sit for 5 minutes at room temperature, then garnish with maraschino cherry halves.",
  "prep": "35 mins",
  "cook": "",
  "total": "8 hrs 35 mins",
  "calories": "251"
},
{
  "url": "https://www.allrecipes.com/recipe/73882/pineapple-upside-down-cake-martinis/",
  "name": "Pineapple Upside-down Cake Martinis",
  "rating": "4.6",
  "ratingcount": "97",
  "ingredients": "⅔ cup pineapple juice, chilled; ⅓ cup vanilla flavored vodka; 1 dash grenadine syrup; 2  pineapple wedges; 2  maraschino cherries",
  "directions": "1. Pour the pineapple juice, vodka and grenadine into a shaker full of ice. Shake, then strain into two martini glasses. Garnish with a piece of pineapple and a cherry on a skewer.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/246422/paleo-almond-date-cookies/",
  "name": "Paleo Almond Date Cookies",
  "rating": "4.6",
  "ratingcount": "15",
  "ingredients": "2 ½ cups blanched almond flour; 1 cup pitted and chopped dates; ½ cup chopped dried cherries; ½ cup chopped walnuts; 2 tablespoons chia seeds, or more to taste; ½ teaspoon baking soda; ½ teaspoon sea salt; ½ cup coconut oil; 1  egg; 2 tablespoons maple syrup; 1 tablespoon vanilla extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper. 2. Combine almond flour, dates, cherries, walnuts, chia seeds, baking soda, and sea salt in a large bowl; whisk to blend. Add coconut oil, egg, maple syrup, and vanilla extract; blend well with a spoon or fork until dough comes together. 3. Scoop dough onto prepared baking sheets with a small cookie scoop. 4. Bake in the preheated oven until edges are golden, about 15 minutes. Turn off oven and let cookies sit with oven door closed, about 10 minutes more. Remove from oven and let cool.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "50 mins",
  "calories": "174"
},
{
  "url": "https://www.allrecipes.com/recipe/7704/cherry-cream-cheese-cake/",
  "name": "Cherry Cream Cheese Cake",
  "rating": "4.6",
  "ratingcount": "39",
  "ingredients": "1 (8 ounce) package cream cheese, softened; 1 cup butter, softened; 1 ½ cups white sugar; 1 ½ teaspoons vanilla extract; 4  eggs; 2 ¼ cups all-purpose flour; 1 ½ teaspoons baking powder; ⅛ teaspoon salt; 1 cup candied cherries, halved; ¼ cup all-purpose flour; ½ cup chopped pecans",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Cream the cream cheese, butter or margarine, sugar, and vanilla together until smooth. Beat in eggs one at a time. Sift together 2 1/4 cup flour, baking powder, and salt; fold into cream cheese mixture. Dredge cherries in 1/4 cup flour, and fold into batter. 3. Sprinkle pecans over the bottom of an ungreased 10 inch angel food tube pan. Bottom should be completely covered. Add a few more pecans if necessary. Spoon batter into pan on top of nuts. 4. Bake for about 75 minutes, or until an inserted wooden pick comes out clean. Allow cake to cool in pan. Run knife around outside edge and center tube. Ease cake out of pan, and onto plate.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "418"
},
{
  "url": "https://www.allrecipes.com/recipe/228047/cherry-pie-with-almond-crumb-topping/",
  "name": "Cherry Pie with Almond Crumb Topping",
  "rating": "4.7",
  "ratingcount": "75",
  "ingredients": "1  1 (9 inch) unbaked pie crust (see footnote for recipe link); ½ cup slivered almonds; ½ cup light brown sugar; ⅓ cup rolled oats; ⅓ cup all-purpose flour; ¾ teaspoon salt; 6 tablespoons cold, unsalted butter, cut into pieces; 2 pounds cherries, pitted; ½  lemon, juiced; ⅓ cup white sugar, or more to taste; ¼ cup cornstarch",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil. 2. Roll out pie crust and lay into a 9-inch pie pan. 3. Combine almonds, brown sugar, oats, flour, and salt in a large bowl. Work butter into the almond mixture with your fingers, breaking up any large pieces, until incorporated completely. Cover and chill for 15 minutes. 4. Combine cherries, lemon juice, white sugar, and cornstarch. Stir until well coated and no dry lumps remain, 3 to 4 minutes. 5. Pour cherries and any accumulated juices into the prepared pie pan. Press down into the pan. Crumble oat mixture over the top. Place the pan on the prepared baking sheet. 6. Bake in the preheated oven until cherries are bubbling and the crust and crumble topping are browned, about 1 hour 15 minutes. Let cool completely.",
  "prep": "20 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 50 mins",
  "calories": "3565"
},
{
  "url": "https://www.allrecipes.com/recipe/92782/cherry-chicken/",
  "name": "Cherry Chicken",
  "rating": "4.3",
  "ratingcount": "27",
  "ingredients": "3 tablespoons vegetable oil; 1 (4 pound) whole chicken, cut into 8 pieces; salt and pepper to taste; ½ cup all-purpose flour for dusting; 1 (15 ounce) can pitted dark cherries packed in water; ½ cup white sugar; 1 tablespoon cornstarch; 1  orange - with peel, quartered and thinly sliced; ½ cup slivered almonds, toasted",
  "directions": "1. Heat oil in a large skillet over medium-high heat. Season chicken with salt and pepper, then coat with flour. Fry in hot oil until browned, turning as needed. Reduce heat to medium, cover, and cook until meat is tender and juices run clear, about 25 minutes. 2. Remove chicken from the skillet; pour off all but 1/4 cup drippings. Return the skillet to medium heat and stir in cherries, reserving some cherry liquid for later. Stir in sugar and bring to a boil. Dissolve cornstarch in reserved cherry liquid, then stir into the skillet. Cook, stirring gently, until thickened. 3. Add orange slices and almonds to the skillet, then return chicken pieces to the skillet. Spoon sauce over chicken to coat; simmer over low heat for 5 to 10 minutes before serving.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "1149"
},
{
  "url": "https://www.allrecipes.com/recipe/108206/fruity-sweet-and-sour-sauce/",
  "name": "Fruity Sweet and Sour Sauce",
  "rating": "4.2",
  "ratingcount": "69",
  "ingredients": "½ cup white sugar, or to taste; ½ cup white vinegar, or more to taste; ½ cup maraschino cherry juice; ½ cup pineapple juice; 1 ½ tablespoons cornstarch; ¼ cup cold water",
  "directions": "1. Mix the sugar, vinegar, maraschino cherry juice, and pineapple juice in a saucepan over medium-low heat, stirring to dissolve the sugar. 2. Place the cornstarch in a small bowl, and stir the water into it to make a smooth paste. Stir the cornstarch paste into the juice mixture, and bring to a simmer. Stir constantly until the mixture thickens, about 1 minute.",
  "prep": "1 mins",
  "cook": "9 mins",
  "total": "10 mins",
  "calories": "42"
},
{
  "url": "https://www.allrecipes.com/recipe/265814/preserved-cherries/",
  "name": "Preserved Cherries",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 pounds fresh cherries, stems removed; 4 cups water; ¾ cup white sugar",
  "directions": "1. Inspect 8 half-pint jars for cracks and rings for rust, discarding any defective ones. Immerse in simmering water for 10 minutes to sterilize. Wash new, unused lids and rings in warm soapy water. 2. Fill sterilized jars with cherries up to the \"neck\" of the jar. 3. Pour water into a large pan and bring to a boil. Add sugar and keep boiling until sugar dissolves. Pour hot simple syrup over cherries into the jars up to 1/8-inch from the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe rims with a moist paper towel to remove any spills. Top with lids and tightly screw on rings. 4. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 20 minutes. 5. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart. Let rest for 24 hours without moving the jars. Gently press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "77"
},
{
  "url": "https://www.allrecipes.com/recipe/7330/maraschino-cherry-nut-cake/",
  "name": "Maraschino Cherry Nut Cake",
  "rating": "3.9",
  "ratingcount": "14",
  "ingredients": "1 (10 ounce) jar maraschino cherries; 2 ¼ cups sifted cake flour; 2 ½ teaspoons baking powder; ½ teaspoon salt, divided; ½ cup shortening; 1 ⅓ cups white sugar; 3  egg whites, room temperature; ⅔ cup milk, room temperature; ½ cup chopped pecans; ¾ cup butter, room temperature; 6 cups sifted confectioners' sugar, divided; ⅓ cup milk; 6 drops red food coloring; 1 ½ teaspoons vanilla extract; 12  maraschino cherries, with stems",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and lightly flour two 8- or 9-inch round cake pans or one 9x13-inch cake pan. 2. Reserve 1/4 cup maraschino cherry juice. Coarsely chop cherries to make 1/2 cup. Set aside. 3. Sift cake flour, baking powder, and 1/4 teaspoon salt and set aside. 4. Beat shortening in a large bowl with an electric mixer on medium-high speed for 30 seconds. Add white sugar and beat until well combined. Add egg whites, one at a time, beating well after each. 5. Combine 2/3 cup milk and reserved 1/4 cup cherry juice. Add the flour and milk mixture alternately to the shortening mixture, beating on low speed after each addition until just combined. Stir in the chopped cherries and nuts. Pour batter into prepared pans. 6. Bake in the preheated oven until cake springs back when lightly touched with a finger or a tester comes out clean, 20 to 25 minutes for round cakes (or 30 to 35 minutes for a 9x13 inch pan). Cool cakes in pans on a wire rack for 10 minutes, then invert onto a wire rack to cool completely. 7. To make frosting: Beat butter in a large bowl until fluffy. Gradually add 3 cups sifted confectioners' sugar; beat well. Slowly beat in 1/3 cup milk, vanilla, and remaining 1/4 teaspoon salt. Gradually beat in the remaining 3 cups sifted confectioners' sugar. Beat in additional milk (1 to 2 tablespoons) if needed, to make the frosting spreading consistency. If desired, tint the frosting pink by adding 6 drops red food coloring. 8. Once the cake is completely cool, frost with butter frosting and decorate with maraschino cherries with stems.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "2 hrs 20 mins",
  "calories": "676"
},
{
  "url": "https://www.allrecipes.com/recipe/17584/cherry-cheese-pie-i/",
  "name": "Cherry Cheese Pie I",
  "rating": "4.7",
  "ratingcount": "155",
  "ingredients": "1 (9 inch) prepared graham cracker crust; 1 (8 ounce) package cream cheese, softened; ½ cup white sugar; 2 cups frozen whipped topping, thawed; 1 (21 ounce) can cherry pie filling",
  "directions": "1. In a medium mixing bowl, beat together softened cream cheese and sugar until light and fluffy. Fold in whipped topping and blend until mixture is smooth. Spread into graham cracker crust and spoon pie filling over top. Cover with plastic wrap and chill 2 hours before serving.",
  "prep": "15 mins",
  "cook": "",
  "total": "2 hrs 15 mins",
  "calories": "421"
},
{
  "url": "https://www.allrecipes.com/recipe/13700/bing-cherry-congealed-salad/",
  "name": "Bing Cherry Congealed Salad",
  "rating": "4.3",
  "ratingcount": "23",
  "ingredients": "1 (16.5 ounce) can pitted Bing cherries, drained, juice reserved; 1 (15 ounce) can crushed pineapple, drained with juice reserved; 1 (6 ounce) package cherry Jell-O®; 1 (3 ounce) package cream cheese; 6 fluid ounces cola-flavored carbonated beverage; 1 cup chopped pecans",
  "directions": "1. In a sauce pan, combine reserved cherry juice and pineapple juice to equal 1 cup. Bring to boil, add gelatin and whisk together. Remove from heat and add cream cheese and blend together until smooth. 2. Add cola and beat until mixture becomes fluffy. Fold in cherries, pineapple, and nuts. Pour into molded container, chill 6 to 8 hours or until firm.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "249"
},
{
  "url": "https://www.allrecipes.com/recipe/22995/marshmallow-log/",
  "name": "Marshmallow Log",
  "rating": "4.6",
  "ratingcount": "11",
  "ingredients": "2 cups flaked coconut; 2 cups miniature colored marshmallows; 2 cups crushed graham crackers; 1 (14 ounce) can sweetened condensed milk; 1 cup chopped walnuts; 10  candied cherries, quartered",
  "directions": "1. Sprinkle coconut evenly on a sheet of waxed paper. 2. In a medium bowl, stir together marshmallows, graham cracker crumbs, condensed milk, walnuts, and cherries. Shape into a log; place on waxed paper and roll in coconut. Wrap with waxed paper and refrigerate until firm.",
  "prep": "15 mins",
  "cook": "",
  "total": "45 mins",
  "calories": "332"
},
{
  "url": "https://www.allrecipes.com/recipe/274193/cherry-cheesecake-brownies/",
  "name": "Cherry Cheesecake Brownies",
  "rating": "4.0",
  "ratingcount": "23",
  "ingredients": "1 cup butter; 2 cups white sugar; ⅔ cup cocoa powder; 4  eggs; 2 teaspoons vanilla extract; 1 cup gluten-free all purpose baking flour; ½ teaspoon gluten-free baking powder; ¼ teaspoon salt; 1 (8 ounce) package cream cheese, softened; ⅓ cup white sugar; 1  egg; 1 (21 ounce) can cherry pie filling",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan. 2. Melt butter in the microwave, about 1 minute. Stir in sugar and cocoa powder. Blend in 4 eggs, one at a time, using an electric mixer; add vanilla extract. Combine flour (see Cook's Note), baking powder, and salt in a small bowl, and add to the batter. Mix until well combined and pour into the prepared baking pan. Level with a knife or spatula. 3. Beat together cream cheese, sugar, and 1 egg in a second bowl until smooth. Dollop the cream cheese mixture on top of the brownie batter. 4. Separate cherries from the jelled filling and dollop them over the cream cheese mixture, saving leftover jelly for another use if desired. Swirl together using a knife. 5. Bake in the preheated oven until brownies are set and edges pull away from the sides of the pan, 35 to 45 minutes. Remove from the oven and cool thoroughly before cutting into bars.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr 50 mins",
  "calories": "326"
}]