[{
  "url": "https://www.allrecipes.com/recipe/254738/overnight-buckwheat-oats/",
  "name": "Overnight Buckwheat Oats",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "¼ cup buckwheat flakes; 2 teaspoons chia seeds; 1 tablespoon coconut, divided; 1 teaspoon flax seed meal; ⅛ teaspoon ground cinnamon; ⅛ teaspoon vanilla powder; ⅓ cup milk; 2 tablespoons mixed berries; 1 teaspoon agave",
  "directions": "1. Combine buckwheat, chia seeds, 1 1/2 teaspoons coconut, flax seed meal, cinnamon, and vanilla powder in a jar; stir until well mixed. Stir in milk; cover. Place in the refrigerator, 8 hours to overnight. 2. Stir buckwheat mixture. Heat in the microwave for 30 seconds. Stir in mixed berries, remaining coconut, and agave.",
  "prep": "5 mins",
  "cook": "1 mins",
  "total": "8 hrs 6 mins",
  "calories": "215"
},
{
  "url": "https://www.allrecipes.com/recipe/246908/avocado-blueberry-banana-and-chia-smoothie/",
  "name": "Avocado, Blueberry, Banana, and Chia Smoothie",
  "rating": "4.1",
  "ratingcount": "7",
  "ingredients": "1 cup vanilla-flavored almond milk; 1  avocado - peeled, pitted, and halved; 1 cup fresh blueberries; 1  banana; 1 cup ice; 1 tablespoon chia seeds",
  "directions": "1. Combine almond milk, avocado, blueberries, banana, ice, and chia seeds in a blender; blend until smooth.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "643"
},
{
  "url": "https://www.allrecipes.com/recipe/256156/overnight-light-pbj-oats/",
  "name": "Overnight Light PB&J Oats",
  "rating": "4.5",
  "ratingcount": "21",
  "ingredients": "½ cup almond milk; ¼ cup fresh raspberries; ¼ cup rolled oats; 2 tablespoons powdered peanut butter (such as PB2®); 1 ½ teaspoons chia seeds; 1 teaspoon white sugar",
  "directions": "1. Mix almond milk, raspberries, rolled oats, powdered peanut butter, chia seeds, and sugar together in a container. Cover and refrigerate until oats are soft, 8 hours to overnight.",
  "prep": "5 mins",
  "cook": "",
  "total": "8 hrs 5 mins",
  "calories": "203"
},
{
  "url": "https://www.allrecipes.com/recipe/234473/banana-chia-pudding/",
  "name": "Banana Chia Pudding",
  "rating": "4.2",
  "ratingcount": "18",
  "ingredients": "1 ½ cups vanilla-flavored flax milk; 1 large banana, cut in chunks; 7 tablespoons chia seeds; 3 tablespoons honey; 1 teaspoon vanilla extract; ⅛ teaspoon sea salt",
  "directions": "1. Put milk, banana, chia seeds, honey, vanilla extract, and sea salt in respective order in the blender; blend until smooth. Pour mixture into a bowl and refrigerate until thickened, at least 2 hours. Spoon mixture into small bowls to serve.",
  "prep": "10 mins",
  "cook": "",
  "total": "2 hrs 10 mins",
  "calories": "112"
},
{
  "url": "https://www.allrecipes.com/recipe/222058/chia-pudding/",
  "name": "Chia Pudding",
  "rating": "4.2",
  "ratingcount": "25",
  "ingredients": "2 cups milk; ⅔ cup chia seeds; 1 tablespoon white sugar; ½ teaspoon vanilla extract; 2 tablespoons unsweetened coconut flakes; 2 tablespoons raisins",
  "directions": "1. Combine milk, chia seeds, sugar, and vanilla extract in a bowl; let sit about 10 minutes. Stir the mixture, cover the bowl with plastic wrap, and refrigerate 8 hours to overnight. 2. Top the pudding with coconut and raisins to serve.",
  "prep": "5 mins",
  "cook": "",
  "total": "8 hrs 15 mins",
  "calories": "109"
},
{
  "url": "https://www.allrecipes.com/recipe/234681/chia-fresca/",
  "name": "Chia Fresca",
  "rating": "4.9",
  "ratingcount": "7",
  "ingredients": "1 ½ cups water; 3 tablespoons lemon juice; 2 ½ teaspoons white sugar; 1 teaspoon chia seeds",
  "directions": "1. Stir water, lemon juice, and sugar together in a glass until sugar is completely dissolved; add chia seeds. Let stand until a gel forms around the chia seeds, about 10 minutes; stir.",
  "prep": "5 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "24"
},
{
  "url": "https://www.allrecipes.com/recipe/284711/overnight-oats-with-strawberries-and-greek-yogurt/",
  "name": "Overnight Oats with Strawberries and Greek Yogurt",
  "rating": "4.0",
  "ratingcount": "3",
  "ingredients": "2 cups rolled oats; 2 cups almond milk; 1 cup Greek yogurt; 1 cup chopped fresh strawberries; 1 tablespoon honey; 1 tablespoon chia seeds",
  "directions": "1. Stir together oats, almond milk, and Greek yogurt in a bowl. Mix in strawberries, honey, and chia seeds until well combined. Spoon mixture into 3 glass jars with lids. 2. Refrigerate the jars overnight to allow the oats to soften. Serve cold in the morning.",
  "prep": "10 mins",
  "cook": "",
  "total": "8 hrs 10 mins",
  "calories": "390"
},
{
  "url": "https://www.allrecipes.com/recipe/282003/bread-pudding-muffins/",
  "name": "Bread Pudding Muffins",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "4 large eggs; 2 cups milk; ¾ cup white sugar; 1 teaspoon ground cinnamon; ¼ teaspoon salt; 2 tablespoons unsalted butter, melted; 6 slices stale bread; ½ cup chocolate chips; 1 tablespoon chia seeds; ¼ cup brown sugar, or as needed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 12-cup muffin tin or line with paper liners. 2. Whisk eggs in a large bowl just until mixed. Add milk, white sugar, cinnamon, and salt; mix well. Mix in melted butter. 3. Break bread into small pieces into the bowl and mix until well combined and bread is wet. Add chocolate chips and chia seeds; mix well. 4. Divide mixture evenly between the prepared muffin cups and sprinkle with brown sugar. 5. Bake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, about 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "199"
},
{
  "url": "https://www.allrecipes.com/recipe/238550/seedy-good-health-banana-bread/",
  "name": "Seedy Good-Health Banana Bread",
  "rating": "5.0",
  "ratingcount": "6",
  "ingredients": "¼ cup coconut oil; ½ cup applesauce; 2  large eggs; ¼ cup butter, melted and cooled; ½ cup white sugar; ½ cup raw sugar; 2 teaspoons vanilla extract; 1 teaspoon sea salt; 2  bananas, mashed; ½ cup sour cream; 1 ½ teaspoons baking soda; ¾ cup all-purpose flour; ¾ cup whole wheat flour; ½ cup chopped roasted almonds; ¼ cup teff; ¼ cup poppy seeds; ¼ cup chia seeds; ¼ cup flax seeds",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease two 9x5-inch loaf pans with the coconut oil. 2. Beat applesauce, eggs, and butter together in a large bowl until smooth. Add white sugar, raw sugar, vanilla extract, and salt; mix well. 3. Whisk bananas, sour cream, and baking soda together in a separate bowl until smooth; stir into the applesauce mixture until evenly combined. 4. Gradually stir all-purpose flour, 1/4 cup at a time, into banana mixture until well mixed. Gradually stir whole wheat flour, 1/4 cup at a time, into banana-flour mixture until batter is well mixed. Fold almonds, teff, poppy seeds, chia seeds, and flax seeds into the batter. Pour batter into the prepared loaf pans. 5. Bake on the middle rack of the preheated oven until a toothpick inserted in the center comes out clean, 40 to 50 minutes. Cool bread in the pans for 15 minutes before transferring to a wire rack to cool, about 20 minutes.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 40 mins",
  "calories": "197"
},
{
  "url": "https://www.allrecipes.com/recipe/256414/chia-seed-muffins/",
  "name": "Chia Seed Muffins",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "cooking spray; 3 cups all-purpose flour; 2 ⅓ cups white sugar; 1 ½ cups almond milk; 1 cup vegetable oil; 2 tablespoons vegetable oil; 3  eggs, beaten; 2 tablespoons chia seeds; 2 ½ teaspoons almond extract; 2 teaspoons vanilla extract; 1 ½ teaspoons baking powder; 1 ½ teaspoons salt",
  "directions": "1. Preheat oven to 300 degrees F (150 degrees C). Grease 2 muffin tins lightly with cooking spray. 2. Mix flour, sugar, almond milk, 1 cup plus 2 tablespoons vegetable oil, eggs, chia seeds, almond extract, vanilla extract, baking powder, and salt together in a large bowl. Scoop batter into the prepared muffin tins. 3. Bake in the preheated oven until a toothpick inserted into the center comes out clean and tops are light golden in color, about 40 minutes.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "242"
},
{
  "url": "https://www.allrecipes.com/recipe/272227/apple-carrot-and-chia-muffins/",
  "name": "Apple, Carrot, and Chia Muffins",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "1 ¾ cups all-purpose flour; ½ cup whole wheat flour; 1 teaspoon baking soda; ½ teaspoon salt; 1 cup buttermilk; ½ cup melted butter; ½ cup honey; ½ cup brown sugar; 1  egg; 1 teaspoon vanilla extract; 1 cup diced apple; 1 cup shredded carrot; 2 tablespoons chia seeds",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line 16 muffin cups with liners. 2. Combine all-purpose flour, whole wheat flour, baking soda, and salt in a bowl. 3. Beat buttermilk, melted butter, honey, brown sugar, egg, and vanilla extract in another bowl. Stir in flour mixture. Fold in apple, carrot, and chia seeds. Spoon batter into the prepared muffin cups. 4. Bake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, about 25 minutes. 5. Cool for 5 minutes before transferring to a wire rack.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "197"
},
{
  "url": "https://www.allrecipes.com/recipe/264207/keto-chocolate-smoothie/",
  "name": "Keto Chocolate Smoothie",
  "rating": "3.0",
  "ratingcount": "3",
  "ingredients": "1 tablespoon chia seeds; 3 tablespoons water; 1 cup full-fat coconut milk; ½  frozen avocado; 1 tablespoon peanut butter; 1 tablespoon coconut oil; 2 teaspoons unsweetened cocoa powder; ½ cup ice cubes; ¼ cup water; 2 tablespoons cocoa nibs; 1 teaspoon ground cinnamon",
  "directions": "1. Soak chia seeds in 3 tablespoons water for 10 minutes. 2. Combine coconut milk, avocado, peanut butter, chia seeds, coconut oil, cocoa powder, ice cubes, and 1/4 cup water in a blender. Blend until smooth. Top with cocoa nibs and cinnamon.",
  "prep": "5 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "498"
},
{
  "url": "https://www.allrecipes.com/recipe/256460/superfood-stevia-smoothie/",
  "name": "Superfood Stevia Smoothie",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 ½ cups frozen mango cubes; 1 cup baby kale; 1 cup unsweetened almond milk; ½ cup orange juice; 2 (1 gram) packets Stevia In The Raw®; 1 tablespoon chia seeds",
  "directions": "1. In a blender, combine mango, kale, almond milk, orange juice, stevia, and chia seeds. Blend until smooth.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "207"
},
{
  "url": "https://www.allrecipes.com/recipe/255674/berry-apricot-smoothie/",
  "name": "Berry Apricot Smoothie",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 ½ cups Original Unsweetened Almond Breeze Almondmilk; ½  banana; 1 cup mixed frozen berries; 2  fresh apricots, pitted; 1 tablespoon chia seeds; 1 scoop protein powder",
  "directions": "1. Place all ingredients into blender and blend on high until smooth.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "198"
},
{
  "url": "https://www.allrecipes.com/recipe/244251/no-cook-overnight-oatmeal/",
  "name": "Easy Overnight Oats ",
  "rating": "4.8",
  "ratingcount": "244",
  "ingredients": "⅓ cup milk; ¼ cup Greek yogurt; ¼ cup rolled oats; 2 teaspoons honey; 2 teaspoons chia seeds; 1/4 teaspoon ground cinnamon or more to taste; ¼ cup fresh blueberries",
  "directions": "1. Combine milk, yogurt, oats, honey, chia seeds, and cinnamon in a 1/2-pint jar with a lid; cover and shake until combined. Fold in blueberries. 2. Cover and refrigerate, 8 hours to overnight.",
  "prep": "5 mins",
  "cook": "",
  "total": "8 hrs 5 mins",
  "calories": "279"
},
{
  "url": "https://www.allrecipes.com/recipe/241934/super-food-chocolate-chip-cookies/",
  "name": "Super Food Chocolate Chip Cookies",
  "rating": "4.7",
  "ratingcount": "17",
  "ingredients": "1 cup packed brown sugar; 1 cup coconut sugar; ½ cup butter, softened; ½ cup coconut oil; 2  eggs; 2 teaspoons vanilla extract; 2 teaspoons hot water; 1 teaspoon baking soda; ½ teaspoon cream of tartar; 3 cups all-purpose flour; 1 cup dark chocolate chips (such as Ghirardelli® 60% Cacao); ½ cup chopped walnuts; ¼ cup chia seeds; ¼ cup ground flax seeds; ¼ cup cocoa nibs; ½ teaspoon salt",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Beat brown sugar, coconut sugar, butter, and coconut oil with an electric mixer in a large bowl until smooth. Beat the first egg into creamed butter mixture until completely blended; beat in vanilla extract with the last egg. 3. Stir hot water and baking soda together in a small bowl until baking soda is dissolved; stir into butter mixture. Add cream of tartar and mix well. 4. Mix flour into butter mixture until dough is smooth; fold in walnuts, chia seeds, flax seeds, cocoa nibs, and salt. Drop dough by rounded tablespoons onto prepared baking sheet. 5. Bake in the preheated oven until cookies are lightly browned around the edges, about 12 minutes. Transfer cookies to a wire rack to cool.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "107"
},
{
  "url": "https://www.allrecipes.com/recipe/264880/vanilla-chia-pudding/",
  "name": "Vanilla Chia Pudding",
  "rating": "4.8",
  "ratingcount": "8",
  "ingredients": "2 cups milk; ⅔ cup chia seeds; 1 tablespoon vanilla extract; 1 tablespoon white sugar",
  "directions": "1. Combine milk, chia seeds, vanilla extract, and sugar in a bowl. Let sit at room temperature for 10 minutes. Cover and refrigerate at least 8 hours or overnight.",
  "prep": "5 mins",
  "cook": "",
  "total": "8 hrs 15 mins",
  "calories": "181"
},
{
  "url": "https://www.allrecipes.com/recipe/237469/chia-coconut-pudding-with-coconut-milk/",
  "name": "Chia Coconut Pudding with Coconut Milk",
  "rating": "4.8",
  "ratingcount": "61",
  "ingredients": "2 cups sweetened coconut milk; 6 tablespoons unsweetened coconut milk; 1 tablespoon agave nectar, or more to taste; ½ teaspoon vanilla extract; ¼ teaspoon ground cinnamon; 1 pinch salt; ½ cup chia seeds; ½ cup diced fresh strawberries (Optional)",
  "directions": "1. Whisk together sweetened and unsweetened coconut milks, agave nectar, vanilla extract, cinnamon, and salt in a bowl; stir in chia seeds. Allow mixture to soak until thickened, at least 20 minutes, or cover the bowl with plastic wrap and refrigerate overnight. 2. Stir pudding and top with strawberries.",
  "prep": "10 mins",
  "cook": "",
  "total": "30 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/269573/overnight-chia-oats/",
  "name": "Overnight Chia Oats",
  "rating": "4.7",
  "ratingcount": "24",
  "ingredients": "1 cup Almond Breeze Vanilla almondmilk; ½ cup rolled oats; ½ medium banana, mashed; 1 tablespoon chia seeds",
  "directions": "1. Combine almond milk, oats, mashed banana, and chia seeds in a 1-pint jar. Seal with a lid and shake until well combined. Refrigerate until chia seeds have swelled and mixture is thick and gel-like, 8 hours to overnight.",
  "prep": "5 mins",
  "cook": "",
  "total": "8 hrs 5 mins",
  "calories": "338"
},
{
  "url": "https://www.allrecipes.com/recipe/256230/hearty-multigrain-seeded-bread/",
  "name": "Hearty Multigrain Seeded Bread",
  "rating": "4.7",
  "ratingcount": "9",
  "ingredients": "1 cup warm water; ¼ cup white sugar; 1 (.25 ounce) package active dry yeast; 2 cups bread flour; 1 cup whole wheat flour; ¼ cup coconut oil; 1 teaspoon salt; 1 tablespoon chia seeds; 1 tablespoon wheat germ; 1 tablespoon flax seeds; 1 tablespoon millet; 2 tablespoons hulled hemp seeds, divided; 2 tablespoons salted roasted sunflower seeds, divided; 2 tablespoons old-fashioned oats, divided",
  "directions": "1. Mix warm water and sugar together in a bowl until sugar is dissolved; stir in yeast. Set aside until a creamy foam starts to form, about 5 minutes. 2. Combine bread flour, whole wheat flour, coconut oil, and salt in a food processor; pulse 4 times. Add chia seeds, wheat germ, flax seeds, millet, 1 tablespoon hemp seeds, 1 tablespoon sunflower seeds, and 1 tablespoon oats; pulse until incorporated. 3. Pour yeast mixture over flour mixture in the food processor; process until a dough ball forms, about 1 minute. 4. Turn dough into a well-oiled large bowl and cover with a damp towel; allow to rise in a warm area until doubled in size, about 1 hour. 5. Punch dough down and knead a few times. Form dough into an oblong shape and place in a greased bread pan. Lightly press the remaining hemp seeds, sunflower seeds, and oats onto the loaf. Cover with a damp towel and let rise in a warm area for 30 minutes. 6. Preheat oven to 350 degrees F (175 degrees C). 7. Bake in the preheated oven until cooked through and crust is lightly browned, about 30 minutes. Cool bread in the pan for 5 minutes before transferring to a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "2 hrs 30 mins",
  "calories": "124"
},
{
  "url": "https://www.allrecipes.com/recipe/257457/meyer-lemon-avocado-toast/",
  "name": "Meyer Lemon Avocado Toast",
  "rating": "4.8",
  "ratingcount": "65",
  "ingredients": "2 slices whole grain bread; ½  avocado; 2 tablespoons chopped fresh cilantro, or more to taste; 1 teaspoon Meyer lemon juice, or to taste; ¼ teaspoon Meyer lemon zest; 1 pinch cayenne pepper; 1 pinch fine sea salt; ¼ teaspoon chia seeds",
  "directions": "1. Toast bread slices to desired doneness, 3 to 5 minutes. 2. Mash avocado in a bowl; stir in cilantro, Meyer lemon juice, Meyer lemon zest, cayenne pepper, and sea salt. Spread avocado mixture onto toast and top with chia seeds.",
  "prep": "10 mins",
  "cook": "3 mins",
  "total": "13 mins",
  "calories": "72"
},
{
  "url": "https://www.allrecipes.com/recipe/233822/almond-strawberry-chia-seed-pudding/",
  "name": "Almond Strawberry Chia Seed Pudding",
  "rating": "4.3",
  "ratingcount": "46",
  "ingredients": "2 cups almond milk; 1 (16 ounce) package fresh strawberries, hulled; ½ cup chia seeds; ¼ cup honey; 1 teaspoon vanilla extract",
  "directions": "1. Puree almond milk and strawberries in a blender until smooth; pour into a bowl. Stir chia seeds, honey, and vanilla extract into the strawberry puree. 2. Cover bowl with plastic wrap and refrigerate until set, about 4 hours.",
  "prep": "10 mins",
  "cook": "",
  "total": "4 hrs 10 mins",
  "calories": "209"
},
{
  "url": "https://www.allrecipes.com/recipe/222060/chia-gel/",
  "name": "Chia Gel",
  "rating": "4.9",
  "ratingcount": "17",
  "ingredients": "2 cups water; ⅓ cup chia seeds",
  "directions": "1. Mix the Chia seeds and water in a small, sealable jar. Shake for 15 seconds and rest 1 minute. Shake another 15 seconds and refrigerate until gelatinous, about 10 minutes.",
  "prep": "5 mins",
  "cook": "",
  "total": "15 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/263457/blueberry-chia-pudding-with-almond-milk/",
  "name": "Blueberry Chia Pudding with Almond Milk",
  "rating": "4.6",
  "ratingcount": "8",
  "ingredients": "2 cups almond milk; 6 tablespoons chia seeds, or more to taste; ⅓ cup fresh blueberries; 1 tablespoon maple syrup, or more to taste; ½ teaspoon vanilla extract; 1 pinch ground cinnamon",
  "directions": "1. Combine almond milk, chia seeds, blueberries, maple syrup, vanilla extract, and cinnamon in a blender; blend until smooth. Pour into 3 ramekins or glasses. 2. Chill until set, 8 hours to overnight. Serve chilled.",
  "prep": "10 mins",
  "cook": "",
  "total": "8 hrs 10 mins",
  "calories": "146"
},
{
  "url": "https://www.allrecipes.com/recipe/234988/chia-seed-jam/",
  "name": "Chia Seed Jam",
  "rating": "4.7",
  "ratingcount": "17",
  "ingredients": "¼ cup chia seeds; ½ cup water; 2 cups frozen raspberries; ½ cup frozen blackberries; ½ cup frozen blueberries; 2  frozen strawberries, or more to taste; ⅓ cup honey, or more to taste",
  "directions": "1. Soak chia seeds in water until mixture has a jelly-like texture, about 5 minutes. 2. Heat raspberries, blackberries, blueberries, strawberries, and honey in a saucepan over medium heat until berries are soft, about 15 minutes. Lightly crush berries with a fork or masher. 3. Stir chia seed mixture into berry mixture. Remove from heat and let cool for at least 10 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "70"
},
{
  "url": "https://www.allrecipes.com/recipe/222063/chocolate-chia-seed-pudding/",
  "name": "Chocolate Chia Seed Pudding",
  "rating": "4.5",
  "ratingcount": "95",
  "ingredients": "2 tablespoons cocoa powder; 2 tablespoons brown sugar; 1 teaspoon hazelnut flavor instant coffee powder (Optional); ¼ cup chia seeds; 1 cup milk; 2 teaspoons honey, or to taste",
  "directions": "1. Mix cocoa powder, brown sugar, and instant coffee powder together in a bowl; stir until no lumps remain. Fold chia seeds into the mixture. Pour milk into the bowl and stir to incorporate; let the mixture sit a few minutes before stirring again. Repeat resting and stirring a few times over the course of 20 minutes. 2. Cover the bowl with plastic wrap and refrigerate 2 hours to overnight. 3. Drizzle honey over the pudding to serve.",
  "prep": "25 mins",
  "cook": "",
  "total": "2 hrs 25 mins",
  "calories": "312"
},
{
  "url": "https://www.allrecipes.com/recipe/245557/healthy-aussie-bites/",
  "name": "Healthy Aussie Bites™",
  "rating": "4.3",
  "ratingcount": "19",
  "ingredients": "2 cups whole wheat flour; 2 cups rolled oats; 1 cup chopped dried mixed fruit; ⅔ cup brown sugar; ½ cup unsweetened shredded coconut; ½ cup sunflower seeds; ⅓ cup flaxseed meal; ¼ cup chia seeds; 1 teaspoon vanilla extract; ½ teaspoon salt; 1 cup unsalted butter; ¼ cup honey; 1 teaspoon baking soda; 2 tablespoons hot water",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Mix whole wheat flour, oats, dried fruit, brown sugar, coconut, sunflower seeds, flaxseed meal, chia seeds, vanilla extract, and salt together in a large bowl. 3. Melt butter and honey together in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each interval, 1 to 2 minutes. 4. Dissolve baking soda in hot water in a small bowl; add to the butter mixture and mix well. 5. Pour butter mixture over flour mixture; mix well to combine. Spoon tablespoons of mixture into ungreased mini muffin pans and flatten tops slightly. 6. Bake in the preheated oven until golden, about 10 minutes. Transfer to wire racks to cool.",
  "prep": "20 mins",
  "cook": "11 mins",
  "total": "31 mins",
  "calories": "171"
},
{
  "url": "https://www.allrecipes.com/recipe/246422/paleo-almond-date-cookies/",
  "name": "Paleo Almond Date Cookies",
  "rating": "4.6",
  "ratingcount": "15",
  "ingredients": "2 ½ cups blanched almond flour; 1 cup pitted and chopped dates; ½ cup chopped dried cherries; ½ cup chopped walnuts; 2 tablespoons chia seeds, or more to taste; ½ teaspoon baking soda; ½ teaspoon sea salt; ½ cup coconut oil; 1  egg; 2 tablespoons maple syrup; 1 tablespoon vanilla extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper. 2. Combine almond flour, dates, cherries, walnuts, chia seeds, baking soda, and sea salt in a large bowl; whisk to blend. Add coconut oil, egg, maple syrup, and vanilla extract; blend well with a spoon or fork until dough comes together. 3. Scoop dough onto prepared baking sheets with a small cookie scoop. 4. Bake in the preheated oven until edges are golden, about 15 minutes. Turn off oven and let cookies sit with oven door closed, about 10 minutes more. Remove from oven and let cool.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "50 mins",
  "calories": "174"
},
{
  "url": "https://www.allrecipes.com/recipe/265332/vegetarian-garden-stir-fry/",
  "name": "Vegetarian Garden Stir-Fry",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1  serving cooking spray; ½ cup sugar snap peas; ¼ cup cherry tomatoes, halved; ½ cup dried fruit and nut mix, such as cranberries, almonds, and cashews; ¼ cup chopped mushrooms; ¼ cup bell pepper, thinly sliced; 2 tablespoons chia seeds; 2 teaspoons cayenne pepper, or to taste; 1 tablespoon garlic, minced; salt to taste; 3 tablespoons egg whites; 2 tablespoons shredded Cheddar cheese, or as desired",
  "directions": "1. Grease a large skillet with cooking spray and heat over medium-low heat. Add sugar snap peas, cherry tomatoes, fruit and nut mix, mushrooms, bell pepper, and chia seeds. Stir-fry about 2 minutes. Season with cayenne, garlic, and salt. Cook and stir about 2 minutes more. 2. Stir in egg whites slowly, mixing until they are cooked through, but not crusty, 3 to 5 minutes. Transfer stir-fry to a large bowl and sprinkle with Cheddar cheese. Let cheese melt and serve.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "158"
},
{
  "url": "https://www.allrecipes.com/recipe/272394/healthy-whole-wheat-bread-machine-buns/",
  "name": "Healthy Whole Wheat Bread Machine Buns",
  "rating": "5.0",
  "ratingcount": "7",
  "ingredients": "1 ¼ cups warm water; 1  egg; 1 ½ tablespoons olive oil; 3 tablespoons honey; 1 tablespoon molasses; 2 tablespoons chia seeds; 3 ¾ cups whole wheat flour; 1 ½ teaspoons salt; 3 teaspoons active dry yeast; cooking spray; 1 tablespoon butter, melted, or more as needed",
  "directions": "1. Place warm water, egg, olive oil, honey, molasses, chia seeds, whole wheat flour, salt, and yeast into a bread machine in the order listed by the manufacturer. Run Dough cycle. Remove dough from the machine after the cycle is done, about 1 hour 30 minutes. 2. Spray a baking sheet with nonstick cooking spray. Form dough into 12 buns and arrange on the baking sheet. Let rise until doubled in size, about 55 minutes. 3. Preheat the oven to 400 degrees F (200 degrees C). 4. Bake in the preheated oven until buns are golden brown, about 14 minutes. Let cool for 10 minutes before transferring to a wire rack. Brush with melted butter.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "3 hrs",
  "calories": "188"
},
{
  "url": "https://www.allrecipes.com/recipe/259128/chia-pumpkin-pie/",
  "name": "Chia Pumpkin Pie",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "2 ½ cups unbleached all-purpose flour; ¾ cup butter, cut into squares; ½ cup coconut oil; 3 tablespoons white sugar; ½ teaspoon salt; ¼ cup water; 2 fluid ounces whiskey; 1 (15 ounce) can pumpkin puree; 1 (14 ounce) can sweetened condensed milk; ½ cup finely ground chia seeds; 1 teaspoon vanilla extract; 1 teaspoon ground cinnamon; ½ teaspoon salt; ½ teaspoon ground ginger; ¼ teaspoon ground cloves; ½ teaspoon ground nutmeg; 2 tablespoons white sugar",
  "directions": "1. Preheat oven to 450 degrees F (230 degrees C). 2. Mix all-purpose flour, butter, coconut oil, 3 tablespoons sugar, 1/2 teaspoon salt together in a bowl until well distributed. Stir in water and whiskey to form a clumpy dough. Divide dough in half; place in separate containers. Cover and refrigerate until ready to use. 3. Pour pumpkin, condensed milk, chia seeds, vanilla extract, cinnamon, 1/2 teaspoon salt, ginger, cloves, and nutmeg into a blender. Blend filling until smooth. 4. Line a pie pan with 1 of the dough halves. Pour filling over the pie crust. Roll out the rest of the dough onto a flat work surface and cut into decorative shapes of your choice. Arrange shapes on top of the filling. Sprinkle 2 tablespoons sugar on top. 5. Bake pie in the preheated oven until crust starts to brown, about 20 minutes. Cover with aluminum foil and reduce heat to 325 degrees F (163 degrees C); continue baking until set, about 40 minutes.",
  "prep": "25 mins",
  "cook": "1 hr",
  "total": "1 hr 25 mins",
  "calories": "451"
},
{
  "url": "https://www.allrecipes.com/recipe/254559/chia-milk/",
  "name": "Chia Milk",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "5 cups water, divided; ¼ cup chia seeds; 2 tablespoons walnuts; 2 tablespoons sesame tahini; 1 teaspoon honey, or to taste; 1 dash vanilla extract (Optional)",
  "directions": "1. Combine 3 cups water, chia seeds, and walnuts in a bowl; stir to prevent clumps from forming. Let soak for 8 hours to overnight. 2. Pour chia seed mixture into a blender; add 1 cup water, tahini, honey, and vanilla extract. Cover and blend until smooth; add reminding water.",
  "prep": "5 mins",
  "cook": "",
  "total": "8 hrs 5 mins",
  "calories": "45"
},
{
  "url": "https://www.allrecipes.com/recipe/237859/oatmeal-chia-seed-cookies/",
  "name": "Oatmeal Chia Seed Cookies",
  "rating": "4.6",
  "ratingcount": "39",
  "ingredients": "2 cups rolled oats; 1 cup brown sugar; ⅔ cup whole wheat flour; 2 tablespoons chia seeds; 1 teaspoon ground cinnamon; 1 teaspoon baking soda; ½ teaspoon baking powder; ½ teaspoon salt; ⅔ cup applesauce; 3 tablespoons coconut oil; 1 cup dried cranberries; ½ cup chocolate chips (Optional); ¼ cup shredded unsweetened coconut (Optional)",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Combine oats, brown sugar, flour, chia seeds, cinnamon, baking soda, baking powder, and salt in a bowl. Stir applesauce and coconut oil into oat mixture until dough is evenly mixed. Fold cranberries, chocolate chips, and coconut into dough. Spoon dough onto the prepared baking sheet. 3. Bake in the preheated oven until edges of cookies are lightly browned, 10 to 15 minutes.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "262"
},
{
  "url": "https://www.allrecipes.com/recipe/241259/kiwi-banana-apple-smoothie/",
  "name": "Kiwi Banana Apple Smoothie",
  "rating": "4.8",
  "ratingcount": "9",
  "ingredients": "1  apple, roughly chopped; 1  banana, broken into chunks; 2  kiwifruit, peeled; 1 ¼ cups milk; ¼ cup ice, or as desired; 2 teaspoons chia seeds; 1 teaspoon maca powder",
  "directions": "1. Blend apple, banana, kiwifruit, milk, ice, chia seeds, and maca powder together in a blender until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "232"
},
{
  "url": "https://www.allrecipes.com/recipe/246520/raw-chia-porridge/",
  "name": "Raw Chia 'Porridge'",
  "rating": "4.8",
  "ratingcount": "12",
  "ingredients": "¼ cup chia seeds; 1  banana; 2  dates, pitted; 1 cup almond milk; ¼ teaspoon ground cinnamon; salt to taste; ¼ cup fresh blueberries, or more to taste",
  "directions": "1. Place chia seeds in a bowl. 2. Layer banana and dates in a blender; add almond milk, cinnamon, and salt. Blend mixture until smooth and pour over chia seeds, stirring well. Let mixture sit until thickened, at least 15 minutes. 3. Stir chia \"porridge\" and top with blueberries.",
  "prep": "10 mins",
  "cook": "",
  "total": "25 mins",
  "calories": "385"
},
{
  "url": "https://www.allrecipes.com/recipe/233897/blueberry-oatmeal-chia-seed-muffins/",
  "name": "Blueberry Oatmeal Chia Seed Muffins",
  "rating": "4.5",
  "ratingcount": "57",
  "ingredients": "1 cup all-purpose flour; 1 cup white sugar; 2 ½ teaspoons baking powder; 1 teaspoon salt; ½ teaspoon baking soda; 1 cup rolled oats; ½ cup chia seeds; 1 cup orange juice; ½ cup applesauce; ½ cup cooking oil; 2  eggs, beaten; 2 cups blueberries; 2 tablespoons brown sugar; ¼ teaspoon ground cinnamon",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease 24 muffin cups or line with paper liners. 2. Sift flour, white sugar, baking powder, salt, and baking soda together in a large bowl; add oats and chia seeds. 3. Mix orange juice, applesauce, oil, and eggs together in a bowl; stir into flour mixture until batter is just combined. Fold blueberries into batter. Spoon batter into prepared muffin cups, filling 3/4-full. 4. Mix brown sugar and cinnamon together in a bowl; sprinkle over batter. 5. Bake in the preheated oven until tops spring back when lightly pressed, about 18 to 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "141"
},
{
  "url": "https://www.allrecipes.com/recipe/257039/berry-overnight-oats/",
  "name": "Berry Overnight Oats",
  "rating": "4.9",
  "ratingcount": "28",
  "ingredients": "½ cup Quaker® Oats (Quick or Old Fashioned, uncooked); ½ cup non-fat milk; ½ cup non-fat plain Greek yogurt; 1 teaspoon chia seeds (Optional); 1 cup fresh mixed berries and fruit",
  "directions": "1. Add Quaker® Oats to your container of choice and pour in milk. 2. Layer Greek yogurt, chia seeds and mixed fruit and berries. 3. Refrigerate overnight and enjoy in the morning!",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "378"
},
{
  "url": "https://www.allrecipes.com/recipe/239077/healthy-multigrain-chia-waffles/",
  "name": "Healthy Multigrain Chia Waffles",
  "rating": "4.9",
  "ratingcount": "69",
  "ingredients": "cooking spray; 1 ¾ cups almond milk; ½ cup unsweetened applesauce; 1  egg, beaten; 2 tablespoons chia seeds; 1 teaspoon vanilla extract; 1 ¼ cups whole wheat flour; ½ cup rolled oats; ¼ cup flax seed meal; 4 teaspoons baking powder; 2 teaspoons white sugar, or more to taste; ¼ teaspoon salt (Optional)",
  "directions": "1. Preheat a waffle iron according to the manufacturer's instructions; spray the inside with cooking spray. 2. Whisk almond milk, applesauce, egg, chia seeds, and vanilla extract together in a bowl; let sit until chia seeds start to thicken mixture, about 2 minutes. 3. Whisk flour, oats, flax seed meal, baking powder, sugar, and salt into almond milk mixture until batter is smooth. 4. Scoop 1/2 cup batter into the preheated waffle iron and cook until crisp and golden, about 5 minutes per waffle. Repeat with remaining batter.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "147"
},
{
  "url": "https://www.allrecipes.com/recipe/237680/chia-seed-pudding/",
  "name": "Chia Seed Pudding",
  "rating": "4.6",
  "ratingcount": "55",
  "ingredients": "1 cup unsweetened vanilla-flavored almond milk; 1 cup vanilla fat-free yogurt; 2 tablespoons pure maple syrup; 1 teaspoon pure vanilla extract; ⅛ teaspoon salt; ¼ cup chia seeds; 1 pint strawberries, hulled and chopped; 4 teaspoons pure maple syrup; ¼ cup toasted almonds",
  "directions": "1. Whisk almond milk, yogurt, 2 tablespoons maple syrup, vanilla, and salt together in a bowl until just blended; add chia seeds, whisk to incorporate, and let the chia seeds soak for 30 minutes. 2. Stir the chia seed mixture to redistribute seeds that have settled throughout the mixture. Cover the bowl with plastic wrap and refrigerate 8 hours to overnight. 3. Drizzle 4 teaspoons maple syrup over strawberries in a bowl; stir to coat. Add almonds to strawberries; stir. 4. Spoon chia seed mixture into 4 bowls; top each with a portion of the strawberry mixture.",
  "prep": "15 mins",
  "cook": "",
  "total": "8 hrs 45 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/237288/overnight-chai-oatmeal/",
  "name": "Overnight Chai Oatmeal",
  "rating": "4.1",
  "ratingcount": "39",
  "ingredients": "1 cup oats; 1 cup almond-coconut milk; 2 tablespoons chia seeds; 2 tablespoons shredded coconut; ¼ teaspoon ground cardamom; ¼ teaspoon ground cinnamon; ¼ teaspoon vanilla extract; ¼ teaspoon ground ginger; ¼ teaspoon nutmeg",
  "directions": "1. Combine oats, almond-coconut milk, chia seeds, coconut, cardamom, cinnamon, vanilla extract, ginger, and nutmeg in a bowl. Cover bowl with plastic wrap and refrigerate, 8 hours to overnight.",
  "prep": "10 mins",
  "cook": "",
  "total": "8 hrs 10 mins",
  "calories": "267"
},
{
  "url": "https://www.allrecipes.com/recipe/255798/oatmeal-almond-butter-bites/",
  "name": "Oatmeal Almond Butter Bites",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "2 ½ cups rolled oats; 1 cup almond butter; 1 cup semisweet chocolate chips; ½ cup honey; ¼ cup chia seeds; ¼ cup ground flax seeds; ¼ cup finely shredded unsweetened coconut",
  "directions": "1. Mix oats, almond butter, chocolate chips, honey, chia seeds, ground flax seeds, and coconut together in a stand mixer fitted with the paddle attachment, gradually increasing speed, or by hand in a large bowl, until mixture is well combined and forms a large ball. 2. Shape into 1-inch balls. Place balls onto a parchment-lined baking sheet and freeze until firm, about 30 minutes.",
  "prep": "20 mins",
  "cook": "",
  "total": "50 mins",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/255094/healthy-after-school-granola-bars/",
  "name": "Healthy After-School Granola Bars",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "2 ½ cups oats; 1 ½ cups quinoa; 1 cup slivered almonds; ⅓ cup chia seeds; 1 cup crunchy peanut butter; ½ cup honey; ¼ cup coconut oil, warmed; ½ cup flaxseed meal; 1 teaspoon salt; 2 cups dark chocolate chips",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Spread oats, quinoa, almonds, and chia seeds on a baking sheet. 2. Toast in the preheated oven, stirring halfway through, until golden brown, about 15 minutes. 3. Mix peanut butter, honey, and coconut oil together in a bowl until thoroughly combined. Mix in oat mixture, flaxseed meal, and salt until well combined. Press granola mixture into a 12x18-inch baking pan. 4. Bake in the preheated oven until bars set, about 5 minutes. Remove from oven; sprinkle with chocolate chips. Bake until chocolate is just melted, about 5 minutes. Spread melted chocolate evenly over bars with a rubber spatula. 5. Place in the freezer until chocolate is firm, about 20 minutes; cut into bars.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "1 hr",
  "calories": "223"
},
{
  "url": "https://www.allrecipes.com/recipe/256565/chocolate-protein-cookies/",
  "name": "Chocolate Protein Cookies",
  "rating": "4.0",
  "ratingcount": "3",
  "ingredients": "1 small ripe banana; ¼ cup golden flax seeds; 2 teaspoons chia seeds; 2 scoops vanilla protein powder; 1 tablespoon powdered peanut butter; 2 tablespoons dairy-free mini chocolate chips",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Mash banana in a bowl with an electric mixer until creamy. Blend in flax seeds and chia seeds. Mix in protein powder and powdered peanut butter. Fold in chocolate chips using a spatula. 3. Drop 6 cookies onto the baking sheet using an ice cream scoop. Flatten each cookie with the palm of your hand. 4. Bake in the preheated oven until cookies are firm in the center and edges are browned, 8 to 9 minutes. Transfer to a wire rack; cool for 10 minutes.",
  "prep": "10 mins",
  "cook": "8 mins",
  "total": "28 mins",
  "calories": "141"
},
{
  "url": "https://www.allrecipes.com/recipe/273428/blueberry-cornbread-cobbler/",
  "name": "Blueberry Cornbread Cobbler",
  "rating": "3.0",
  "ratingcount": "2",
  "ingredients": "3 ½ cups frozen blueberries; 3 tablespoons chia seeds; 2 tablespoons white sugar, or to taste; ½  lemon, zested and juiced; ¼ teaspoon salt; ⅔ cup medium-grind cornmeal (such as Bob's Red Mill®); ⅔ cup all-purpose flour; 3 tablespoons white sugar; 1 tablespoon baking powder; ½ teaspoon baking soda; ½ teaspoon salt; 1 stick cold butter, cut into cubes; ½ cup buttermilk; 1 cup fresh corn kernels",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Mix blueberries, chia seeds, sugar, lemon zest, juice, and salt together in a 2-quart baking dish. Set aside. 3. Whisk cornmeal, flour, sugar, baking powder, baking soda, and salt together in a bowl. Cut in butter with a pastry blender until mixture looks like small peas. Mix in buttermilk, then fold in corn kernels. 4. Drop golf ball-sized scoops of the cornmeal batter over the blueberries. 5. Bake in the preheated oven until blueberry juices are bubbling and the topping is golden brown, about 40 minutes. Cool for 15 to 30 minutes before serving.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "291"
},
{
  "url": "https://www.allrecipes.com/recipe/269991/almond-milk-overnight-chia-oats/",
  "name": "Almond Milk Overnight Chia Oats",
  "rating": "4.0",
  "ratingcount": "2",
  "ingredients": "¾ cup almond milk; ¼ cup rolled oats; 1 tablespoon chia seeds; 1 tablespoon honey; 1 teaspoon ground cinnamon; ½ teaspoon vanilla extract; 1 pinch salt",
  "directions": "1. Stir together almond milk, oats, chia seeds, honey, cinnamon, vanilla, and salt in a jar or container with a lid. Cover and refrigerate for 8 hours to overnight.",
  "prep": "5 mins",
  "cook": "",
  "total": "8 hrs 5 mins",
  "calories": "252"
},
{
  "url": "https://www.allrecipes.com/recipe/245768/superfood-berry-green-smoothie/",
  "name": "Superfood Berry-Green Smoothie",
  "rating": "4.8",
  "ratingcount": "9",
  "ingredients": "1 ¼ cups unsweetened almond milk; 1  clementine (such as Cuties®), peeled; ½ cup frozen raspberries; 1 cup spinach, or more to taste; 1 tablespoon chia seeds; 1 tablespoon flaxseed meal; 1 cup frozen blueberries; 1 scoop vanilla protein powder",
  "directions": "1. Place almond milk, clementine, raspberries, spinach, chia seeds, flaxseed meal, blueberries, and protein powder in a blender, respectively. Blend on high until smooth, about 30 seconds.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "490"
},
{
  "url": "https://www.allrecipes.com/recipe/239130/dark-choco-bliss/",
  "name": "Dark Choco Bliss",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "⅓ cup small pearl tapioca; 2 tablespoons chia seeds; 1 ½ cups water; 4 cups coconut milk; 1 cup palm sugar; ½ cup cocoa powder; 3 tablespoons arrowroot powder; ½ teaspoon salt; 1 teaspoon vanilla extract",
  "directions": "1. Combine tapioca and chia seeds in a pot and cover with water; let soak until thickened and gelatinous, at least 1 hour. 2. Mix coconut milk, palm sugar, cocoa powder, arrowroot powder, and salt into tapioca mixture; cook and stir over medium heat until desired thickness is reached, 10 to 15 minutes. Remove saucepan from heat and stir vanilla into the pudding.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "1 hr 20 mins",
  "calories": "348"
},
{
  "url": "https://www.allrecipes.com/recipe/262471/vegan-vanilla-nut-oatmeal/",
  "name": "Vegan Vanilla Nut Oatmeal",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "¾ cup vanilla soy milk; ½ cup rolled oats; 2 teaspoons white sugar; 2 teaspoons chia seeds (Optional); 2 teaspoons chopped almonds; 1 teaspoon vanilla bean powder; ¼ teaspoon sea salt; ¼ teaspoon ground cinnamon",
  "directions": "1. Combine soy milk, oats, sugar, chia seeds, almonds, vanilla bean powder, salt, and cinnamon in a saucepan over medium heat. Cook and stir frequently until thickened to your preference, 5 to 7 minutes.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "352"
},
{
  "url": "https://www.allrecipes.com/recipe/234680/cornmeal-waffles-with-chia-seeds/",
  "name": "Cornmeal Waffles with Chia Seeds",
  "rating": "4.9",
  "ratingcount": "7",
  "ingredients": "2  egg whites; 1 cup all-purpose flour; 1 cup cornmeal; 1 tablespoon chia seeds; 2 teaspoons baking powder; 1 teaspoon baking soda; 1 teaspoon white sugar; ½ teaspoon salt; 2 cups buttermilk; ¼ cup canola oil; 2  egg yolks",
  "directions": "1. Preheat waffle iron according to manufacturer's instructions. 2. Beat egg whites in a glass or metal bowl using an electric mixer on high until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks. 3. Whisk flour, cornmeal, chia seeds, baking powder, baking soda, white sugar, and salt together in a bowl. Whisk buttermilk, canola oil, and egg yolks together in a separate bowl; stir into flour mixture until batter is smooth. Gently fold egg whites into batter until just mixed. 4. Pour about 1/4 cup batter into preheated waffle iron; cook according to manufacturer's instructions until golden brown, about 5 minutes. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "231"
},
{
  "url": "https://www.allrecipes.com/recipe/257439/mango-overnight-oats/",
  "name": "Mango Overnight Oats",
  "rating": "4.7",
  "ratingcount": "16",
  "ingredients": "½ cup Quaker® Oats; ¼ cup low-fat milk; ⅓ cup low-fat plain yogurt; ⅛ teaspoon almond extract; ½ cup diced mango; 1 teaspoon honey; 1 teaspoon chia seeds",
  "directions": "1. Add oats to your container of choice. Pour in low-fat milk and yogurt. 2. Mix in almond extract. Add a layer of mango. Top off with a drizzle of honey and chia seeds. 3. Place in the refrigerator for 3 hours to overnight.",
  "prep": "10 mins",
  "cook": "",
  "total": "3 hrs 10 mins",
  "calories": "265"
},
{
  "url": "https://www.allrecipes.com/recipe/237210/bananutter-chia-spread/",
  "name": "Bananutter-Chia spread",
  "rating": "5.0",
  "ratingcount": "6",
  "ingredients": "2 small bananas; 2 tablespoons peanut butter; 1 tablespoon chia seeds",
  "directions": "1. Mash bananas and peanut butter together in a bowl until desired consistency is reached; stir in chia seeds. Cover bowl with plastic wrap and refrigerate.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "51"
}]