[{
  "url": "https://www.allrecipes.com/recipe/274876/chicagos-chicken-vesuvio/",
  "name": "Chicago's Chicken Vesuvio",
  "rating": "4.5",
  "ratingcount": "40",
  "ingredients": "2 pounds bone-in, skin-on chicken pieces; salt and freshly ground black pepper to taste; ¼ cup olive oil; 2 cups Yukon Gold potato wedges; ½  onion, chopped; 5 cloves garlic, sliced; ⅔ cup dry white wine; ⅔ cup chicken stock; 2 tablespoons chopped fresh parsley; 1 tablespoon Italian seasoning; 1 tablespoon butter, or more as needed; ½ cup frozen peas",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Dry chicken pieces well and season liberally with salt and pepper. 2. Heat olive oil in an oven-safe skillet over medium heat. Add chicken, skin-side down, and cook until skin is crisp, 5 to 7 minutes. Turn over and cook until golden brown on the other side, 4 to 5 more minutes. Remove chicken and set aside. 3. Add potatoes, onion, and garlic to the skillet and cook until onion is translucent and potato wedges start to brown nicely on cut sides, 5 to 7 minutes. Remove vegetables from the skillet and set aside. 4. Pour wine into the skillet and cook until reduced by 1/2 while scraping the browned bits of food off the bottom of the pan with a wooden spoon. 5. Add potatoes, onion, and garlic back into the skillet. Stir in chicken stock, parsley, and Italian seasoning. Add chicken pieces on top; cover with an oven-safe lid. 6. Cook in the preheated oven until chicken is cooked through and no longer pink at the bone, about 45 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 7. Return the skillet to the stove and remove chicken and vegetables, leaving the liquid; bring to a simmer. Add butter and stir until smooth, about 5 minutes. Season with salt and pepper to taste. Add peas and cook 1 to 2 minutes longer. Serve chicken atop potato wedges and garnish with pan sauce and peas.",
  "prep": "10 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 20 mins",
  "calories": "306"
},
{
  "url": "https://www.allrecipes.com/recipe/202463/shoyu-chicken/",
  "name": "Shoyu Chicken",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 cup soy sauce; 1 cup brown sugar; 1 cup water; 1  onion, chopped; 4 cloves garlic, minced; 1 tablespoon grated fresh ginger root; 1 tablespoon ground black pepper; 1 tablespoon dried oregano; 1 teaspoon crushed red pepper flakes (Optional); 1 teaspoon ground cayenne pepper (Optional); 1 teaspoon ground paprika (Optional); 5 pounds skinless chicken thighs",
  "directions": "1. Whisk together soy sauce, brown sugar, water, onion, garlic, ginger, black pepper, oregano, red pepper flakes, cayenne pepper, and paprika in a large glass or ceramic bowl. Add chicken thighs and toss to coat evenly. Cover the bowl with plastic wrap; marinate chicken in the refrigerator for at least 1 hour. 2. Preheat an outdoor grill to medium heat. Lightly oil the grate. 3. Remove chicken thighs from marinade; discard remaining marinade. 4. Grill chicken thighs on the preheated grill until no longer pink in the center and the juices run clear, about 15 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "1 hr 40 mins",
  "calories": "338"
},
{
  "url": "https://www.allrecipes.com/recipe/235163/chicken-with-barley-soup/",
  "name": "Chicken with Barley Soup",
  "rating": "4.7",
  "ratingcount": "92",
  "ingredients": "8 cups water; 2 pounds chicken thighs, or more to taste; 1 ½ cups chopped carrots; 1 cup chopped celery (try to include celery leaves); 1  onion, chopped; ¾ cup pearl barley; 3  bay leaves; 1 cube chicken bouillon, or more to taste; 1 teaspoon poultry seasoning; 1 teaspoon rubbed sage; 1 teaspoon salt, or to taste; ¼ teaspoon ground black pepper; 2 tablespoons lemon juice",
  "directions": "1. Combine water, chicken thighs, and bay leaves in a large stock pot; bring to a boil, reduce heat to low, cover, and simmer until chicken is tender, about 30 minutes. 2. Transfer chicken thighs to a cutting board to cool. Remove and discard bones, skin, and fat; cut the remaining chicken into bite-sized pieces and add to broth. 3. Cool broth until the fat congeals on the surface; skim and discard fat. 4. Add carrots, celery, onion, pearl barley, bay leaves, chicken bouillon, poultry seasoning, sage, salt, and black pepper to broth. Bring to a boil, reduce heat to low, cover, and simmer until barley is cooked and vegetables are tender, 60 to 90 minutes. Stir lemon juice into soup just before serving.",
  "prep": "20 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 50 mins",
  "calories": "352"
},
{
  "url": "https://www.allrecipes.com/recipe/282124/honey-garlic-chicken-thighs/",
  "name": "Honey Garlic Chicken Thighs",
  "rating": "4.8",
  "ratingcount": "106",
  "ingredients": "8 (5 ounce) boneless chicken thighs; salt and ground black pepper to taste; 2 tablespoons olive oil, or as needed; ½ medium onion, finely chopped; 7 cloves garlic, chopped, or to taste; 1 cup honey; ½ cup soy sauce; 1 pinch onion powder, or to taste; 1 pinch garlic powder, or to taste; ¼ cup chopped fresh cilantro",
  "directions": "1. Season chicken on both sides with salt and pepper. 2. Cover the bottom of a cast iron skillet with olive oil and bring to medium-high heat. Add chicken and brown on one side, 3 to 5 minutes. Flip chicken and add onion and garlic; continue to cook until chicken is mostly (but not fully) cooked and onion and garlic are soft, 5 to 7 minutes more. Remove chicken to a plate. 3. Add honey, soy sauce, onion powder, and garlic powder to the skillet. Stir and scrape the bottom of the pan with a wooden spoon to get garlic and onion to mix with the liquid. 4. Put chicken back into the pan, cover, and reduce heat to medium. Cook until no longer pink in the center and juices run clear, about 10 more minutes, turning once halfway through. An instant-read thermometer inserted into the center of a thigh should read at least 165 degrees F (74 degrees C). 5. Place on a serving tray and drizzle liquid from the pan on top. Sprinkle with chopped cilantro before serving.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "368"
},
{
  "url": "https://www.allrecipes.com/recipe/272659/air-fryer-buttermilk-fried-chicken/",
  "name": "Air Fryer Buttermilk Fried Chicken",
  "rating": "4.7",
  "ratingcount": "9",
  "ingredients": "1 ½ pounds boneless, skinless chicken thighs; 2 cups buttermilk; 1 cup all-purpose flour; 1 tablespoon seasoned salt; ½ tablespoon ground black pepper; 1 cup panko bread crumbs; cooking spray",
  "directions": "1. Place chicken thighs in a shallow casserole dish. Pour buttermilk over chicken and refrigerate for 4 hours, or overnight. 2. Preheat an air fryer to 380 degrees F (190 degrees C). 3. Mix flour, seasoned salt, and pepper in a large gallon-sized resealable plastic bag. Dredge chicken thighs in seasoned flour. Dip back into buttermilk, then coat with panko bread crumbs. 4. Spray the air fryer basket with nonstick cooking spray. Arrange 1/2 of the chicken thighs in the basket, making sure none are touching. Spray top of each chicken thigh with cooking spray. 5. Cook in the preheated air fryer for 15 minutes. Flip the thighs and spray tops of chicken again. Cook until chicken is no longer pink in the center and the juices run clear, about 10 more minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Repeat with remaining chicken.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "4 hrs 35 mins",
  "calories": "335"
},
{
  "url": "https://www.allrecipes.com/recipe/279903/garlic-brown-sugar-chicken-thighs/",
  "name": "Garlic-Brown Sugar Chicken Thighs",
  "rating": "4.6",
  "ratingcount": "239",
  "ingredients": "8 (5 ounce) bone-in, skin-on chicken thighs; salt and ground black pepper to taste; 3 tablespoons unsalted butter, divided; 4 cloves garlic, minced; ¼ cup packed brown sugar; 1 tablespoon honey; ½ teaspoon dried oregano; ¼ teaspoon dried thyme; ¼ teaspoon dried basil",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 400 degrees F (200 degrees C). 3. Season chicken thighs with salt and pepper. 4. Melt 2 tablespoons butter in a large oven-proof skillet over medium-high heat. Add chicken, skin-side down, and sear until brown, 2 to 3 minutes per side. Remove chicken to a plate. 5. Melt remaining 1 tablespoon butter in the skillet, stirring to loosen any browned bits on the bottom. Add garlic; cook and stir until fragrant, about 30 seconds. Stir in brown sugar, honey, oregano, thyme, and basil until well combined. Turn off the heat and return chicken to the skillet, skin-side down. 6. Roast in the preheated oven until chicken is no longer pink at the bone and the juices run clear, 25 to 40 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 7. Drizzle pan sauce over chicken thighs when serving.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "264"
},
{
  "url": "https://www.allrecipes.com/recipe/281362/oven-fried-chicken-thighs/",
  "name": "Oven-\"Fried\" Chicken Thighs",
  "rating": "4.5",
  "ratingcount": "44",
  "ingredients": "2 cups all-purpose flour; 2 pinches cayenne pepper, divided, or to taste; 2 pinches garlic powder, divided, or to taste; salt and ground black pepper to taste; 3 large eggs; 2 cups panko bread crumbs; 6  chicken thighs",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a baking pan with parchment paper. 2. Combine flour, 1 pinch cayenne, 1 pinch garlic powder, salt, and pepper in a shallow bowl. Beat eggs in a second bowl. Combine panko bread crumbs with remaining 1 pinch cayenne, remaining 1 pinch garlic powder, salt, and pepper in a third bowl. 3. Dredge chicken thighs in flour mixture; shake off excess. Dip into beaten egg then press into panko mixture to coat both sides. Transfer breaded chicken thighs to the prepared pan. 4. Bake in the preheated oven until golden brown and chicken thighs are no longer pink in the center, about 40 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "454"
},
{
  "url": "https://www.allrecipes.com/recipe/244188/copycat-chipotle-chicken/",
  "name": "Copycat Chipotle Chicken",
  "rating": "4.8",
  "ratingcount": "73",
  "ingredients": "1 ounce dried chipotle chile pepper; 1 ounce dried ancho chile pepper; ½ cup water; ½  red onion, cut into small chunks; 4 cloves garlic; 2 teaspoons sea salt; 1 teaspoon ground cumin; 1 teaspoon dried oregano; 1 teaspoon freshly ground black pepper; 2 tablespoons olive oil; 2 ½ pounds skinless, boneless chicken thighs",
  "directions": "1. Place chipotle and ancho chile peppers in a shallow bowl; pour in water. Cover the bowl and let sit at room temperature until peppers are softened, 10 to 12 hours. Drain water and remove seeds from peppers. 2. Blend chile peppers, red onion, garlic, sea salt, cumin, oregano, and black pepper in a blender until a coarse paste forms; add olive oil and blend until marinade is smooth. 3. Place chicken thighs between 2 sheets of heavy plastic on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a 1/2-inch thickness. 4. Place chicken in a resealable plastic bag and add marinade. Turn chicken several times to coat. Seal bag and marinate in the refrigerator for at least 8 hours. 5. Preheat an indoor grill with top and bottom plates for medium-high heat. 6. Remove chicken from the bag and discard marinade. 7. Place chicken on the preheated grill, close the lid, and cook until no longer pink in the center and the juices run clear, 5 to 7 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cut chicken into strips and serve warm.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "18 hrs 15 mins",
  "calories": "293"
},
{
  "url": "https://www.allrecipes.com/recipe/257306/easy-skinless-fried-chicken-thighs/",
  "name": "Easy Skinless Fried Chicken Thighs",
  "rating": "4.4",
  "ratingcount": "27",
  "ingredients": "1 cup corn oil, or as needed; ½ cup all-purpose flour; 2 teaspoons salt; ½ teaspoon ground black pepper; ½ teaspoon paprika; ½ teaspoon garlic powder; 8  skinless chicken thighs",
  "directions": "1. Heat oil in a large, deep skillet to 350 degrees F (175 degrees C). 2. Combine flour, salt, pepper, paprika, and garlic powder in a large resealable plastic bag; mix well. 3. Pat chicken thighs dry with paper towels. Add to flour mixture in the plastic bag; seal the bag and shake until thoroughly coated. 4. Fry chicken in hot oil, turning occasionally, until deep golden brown, about 20 minutes. Drain on a paper towel-lined plate.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "483"
},
{
  "url": "https://www.allrecipes.com/recipe/239867/chef-johns-chicken-tikka-masala/",
  "name": "Chef John's Chicken Tikka Masala",
  "rating": "4.8",
  "ratingcount": "562",
  "ingredients": "1 ½ pounds skinless, boneless chicken thighs; 1 tablespoon vegetable oil; 2 teaspoons kosher salt; 2 teaspoons garam masala; 2 teaspoons ground cumin; 1 teaspoon ground coriander; 1 teaspoon smoked paprika; 1 teaspoon ground turmeric; ½ teaspoon ground black pepper; ¼ teaspoon cayenne pepper; ⅛ teaspoon ground cardamom; 2 tablespoons clarified butter (ghee), or more as needed; 1  onion, chopped; ¼ cup tomato paste; 4 cloves garlic, finely grated; 1 tablespoon finely grated ginger, or more to taste; 1 cup crushed tomatoes; 1 (13 ounce) can coconut milk; ½ cup chicken broth, or as needed; 2 tablespoons chopped fresh cilantro; ½ teaspoon red pepper flakes; salt and ground black pepper to taste",
  "directions": "1. Place chicken in a bowl. Drizzle vegetable oil over chicken; toss to coat. 2. Whisk together salt, garam masala, cumin, coriander, paprika, turmeric, black pepper, cayenne pepper, and cardamom in a small bowl. Sprinkle over chicken and turn to coat evenly. 3. Melt clarified butter in a large, heavy skillet over high heat. Cook chicken thighs in hot butter until browned on all sides, 5 to 10 minutes. Transfer chicken to a plate. When cool enough to handle, cut chicken into bite-sized pieces. 4. Make sauce: Place the skillet with chicken drippings over medium-high heat. Stir onion into the skillet; sauté until onion softens and turns translucent, 5 to 6 minutes. Stir in tomato paste and cook until paste caramelizes, about 5 minutes. Stir garlic and ginger into tomato-onion mixture; cook until fragrant, about 1 minute. 5. Pour crushed tomatoes into the skillet. Bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Pour in coconut milk and chicken broth; bring to a simmer, reduce heat to medium-low, and cook, stirring occasionally, until flavors blend and sauce is slightly reduced, about 15 minutes. 6. Stir chicken and any accumulated juices into sauce. Add cilantro and red pepper flakes; bring to a simmer, reduce heat to medium-low, and cook until chicken is cooked through and tender, 10 to 15 minutes. Season with salt and black pepper.",
  "prep": "25 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "625"
},
{
  "url": "https://www.allrecipes.com/recipe/258878/crispy-baked-chicken-thighs/",
  "name": "Crispy Baked Chicken Thighs",
  "rating": "4.8",
  "ratingcount": "387",
  "ingredients": "6  skin-on, bone-in chicken thighs; salt and ground black pepper to taste; 1 pinch garlic powder, or to taste",
  "directions": "1. Preheat oven to 475 degrees F (245 degrees C). Set a wire rack inside a broiler pan or baking pan. 2. Pat chicken thighs dry with paper towels. Lift up skin gently; sprinkle salt, pepper, and garlic powder under the skin. Replace skin. Season skin and underside of the thighs with salt, pepper, and garlic powder. 3. Arrange on the rack. 4. Roast in the preheated oven until golden, about 20 minutes. Reduce oven temperature to 400 degrees F (200 degrees C). Continue roasting until juices run clear, about 30 minutes more. Let rest for 5 minutes before serving. 5. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "189"
},
{
  "url": "https://www.allrecipes.com/recipe/16360/cock-a-leekie-soup/",
  "name": "Cock-a-Leekie Soup",
  "rating": "4.5",
  "ratingcount": "79",
  "ingredients": "4 pounds chicken thighs, bone in, skin removed; 10 cups water; 1 medium onion, chopped; ⅓ cup barley; 1 (10.5 ounce) can condensed chicken broth; 7 medium leeks, sliced; 2 stalks celery, thickly sliced; 1 tablespoon chopped fresh parsley; 1 teaspoon salt; ½ teaspoon ground black pepper; 1 sprig fresh thyme, chopped",
  "directions": "1. Place chicken into a large pot; pour in water and add onion and barley. Bring to a boil over high heat, then reduce the heat to low and simmer for 1 hour. 2. Use tongs to transfer chicken to a cutting board. Discard skin and bones; chop meat into bite-sized pieces and return to the pot. 3. Add condensed broth, leeks, celery, parsley, salt, pepper, and thyme; simmer until vegetables are tender, about 30 minutes.",
  "prep": "10 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 40 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/272544/baked-lemon-butter-chicken-thighs/",
  "name": "Baked Lemon Butter Chicken Thighs",
  "rating": "4.6",
  "ratingcount": "118",
  "ingredients": "4 tablespoons butter, divided; 4 cloves garlic; 2 tablespoons lemon juice; ¼ teaspoon onion powder; 4 (8 ounce) skin-on, bone-in chicken thighs; salt and ground black pepper to taste; 2 tablespoons fresh parsley, chopped",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Place 3 tablespoons butter in a microwave-safe bowl and heat in a microwave oven until melted, 1 to 2 minutes. Smash garlic cloves with the side of a chef's knife and add garlic to the warm butter. Stir in lemon juice and onion powder; set aside. 3. Sprinkle both sides of chicken thighs with salt and pepper. Heat remaining 1 tablespoon butter in a medium oven-safe skillet over medium-high heat. Brown chicken, skin-side down, for 3 to 4 minutes. Flip chicken over and brush skin with lemon-butter mixture. Pour remaining butter mixture into skillet and remove from heat. 4. Bake in the preheated oven until chicken is no longer pink at the bone and the juices run clear, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Brush skin every 10 minutes with pan juices. 5. Remove skillet from the oven and place chicken on a serving platter. Drizzle chicken with pan juices and garnish with parsley.",
  "prep": "5 mins",
  "cook": "40 mins",
  "total": "45 mins",
  "calories": "510"
},
{
  "url": "https://www.allrecipes.com/recipe/239230/chef-johns-coq-au-vin/",
  "name": "Chef John's Coq au Vin",
  "rating": "4.9",
  "ratingcount": "767",
  "ingredients": "6  bone-in, skin-on chicken thighs; kosher salt and freshly ground black pepper to taste; 8 ounces bacon, sliced crosswise into 1/2-inch pieces; 10 large button mushrooms, quartered; ½ large yellow onion, diced; 2  shallots, sliced; 2 teaspoons all-purpose flour; 2 teaspoons butter; 1 ½ cups red wine; 6 sprigs fresh thyme; 1 cup chicken broth",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Season chicken thighs all over with salt and black pepper. 2. Sauté bacon in a large, oven-proof skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer bacon with a slotted spoon to a paper towel-lined plate, leaving drippings in the skillet. 3. Increase the heat to high and place chicken thighs, skin-side down, into the skillet. Cook until browned, 2 to 4 minutes per side. Transfer chicken to a plate; drain and discard all but 1 tablespoon drippings from the skillet. 4. Lower the heat to medium-high; sauté mushrooms, onion, and shallots with a pinch of salt in the hot skillet until golden and caramelized, 7 to 12 minutes. 5. Stir flour and butter into vegetable mixture until completely incorporated, about 1 minute. 6. Pour red wine into the skillet and bring to a boil while scraping browned bits of food off of the bottom of the pan with a wooden spoon. Stir bacon and thyme into red wine mixture; simmer until wine is about 1/3 reduced, 3 to 5 minutes. Pour chicken broth into wine mixture and return chicken thighs to the skillet; bring to a simmer. 7. Transfer the skillet to the preheated oven and cook for 30 minutes. Spoon pan juices over the chicken and continue cooking until no longer pink at the bone and the juices run clear, about 30 minutes more. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Transfer chicken to a platter. 8. Place skillet over high heat and reduce pan juices, skimming fat off the top as necessary, until sauce thickens slightly, about 5 minutes. Season with salt and pepper; remove and discard thyme. Pour sauce over chicken to serve.",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "255"
},
{
  "url": "https://www.allrecipes.com/recipe/255936/chicken-sausage-peppers-and-potatoes/",
  "name": "Chicken, Sausage, Peppers, and Potatoes",
  "rating": "4.8",
  "ratingcount": "445",
  "ingredients": "2 tablespoons olive oil, divided; 4  large links hot Italian sausage; 6  bone-in, skin on chicken thighs; ½ pound assorted sweet peppers, seeded; 4 large Yukon Gold potatoes, quartered; 1 small red onion, sliced; ½ medium yellow onion, sliced; 2 teaspoons dried Italian herbs; 2 teaspoons kosher salt; freshly ground black pepper to taste; 1 tablespoon chopped fresh Italian parsley",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). 2. Heat 1 tablespoon oil in a skillet over medium heat. Add sausage links and cook until browned and fat begins to render, about 3 minutes per side. While they cook, lightly pierce sausages in several places with the tip of a sharp knife to release fats and juices. Remove from the heat and place on a cutting board to cool slightly, 3 to 5 minutes. 3. Cut cooled sausages into 2-inch slices; return to the skillet along with any accumulated juices from the cutting board. 4. Cut two slashes down to the bone on the skin side of each chicken thigh. Halve or quarter any large peppers. 5. Place chicken and peppers into a large mixing bowl with onions, sausage and juices, Italian herbs, salt, and pepper. Drizzle with remaining 1 tablespoon oil and mix with your hands until all ingredients are coated in oil, 3 to 4 minutes. 6. Transfer mixture to a large, heavy-duty roasting pan. Evenly space chicken thighs with the skin facing up and position potatoes near the top. 7. Roast in the preheated oven until chicken is cooked through and everything is caramelized, about 1 hour. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Sprinkle with chopped fresh Italian parsley.",
  "prep": "30 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 45 mins",
  "calories": "664"
},
{
  "url": "https://www.allrecipes.com/recipe/272545/ranch-baked-chicken-thighs-with-bacon-brussels-sprouts-and-potatoes/",
  "name": "Chicken and Brussels Sprouts with Bacon and Potatoes",
  "rating": "4.3",
  "ratingcount": "42",
  "ingredients": "4  skin-on, bone-in chicken thighs; 1 pound red potatoes, halved or quartered if large; 1 pound Brussels sprouts, trimmed; 1 teaspoon minced garlic; 1 tablespoon olive oil, or as needed; cracked salt and freshly ground black pepper to taste; ½ teaspoon dried thyme; 1 (1 ounce) package ranch dressing mix; 6 slices bacon, chopped",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Place chicken thighs in a 9x13-inch baking dish. 2. Toss potatoes, Brussels sprouts, and garlic together with olive oil in a bowl until vegetables are lightly coated. Add vegetables around and between chicken thighs in the baking dish. Season with salt, pepper, and thyme. Evenly pour the entire packet of ranch seasoning over chicken and vegetables. Sprinkle chopped bacon on top. 3. Bake in the preheated oven until chicken is no longer pink at the bone and the juices run clear, 30 to 35 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 4. Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Place the baking dish under the broiler and cook until chicken skin becomes golden brown and a bit crisp, 2 to 3 minutes.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "429"
},
{
  "url": "https://www.allrecipes.com/recipe/216159/perfect-chicken/",
  "name": "Perfect Chicken",
  "rating": "4.5",
  "ratingcount": "393",
  "ingredients": "2 cups chicken broth; ½ cup chopped onion; 2 cloves garlic, minced; 1 cup white wine; ½ cup sliced fresh mushrooms, or more to taste; 1 teaspoon dried rosemary; 1 teaspoon dried sage; 1 cup heavy cream; 2 tablespoons butter; ½  lemon, juiced; 1 tablespoon capers, drained; ½ cup cornstarch, or as needed; 4  skinless, boneless chicken thighs; 2 tablespoons olive oil",
  "directions": "1. Pour the chicken broth into a saucepan with the onion and garlic; bring to a boil and cook at a boil until the liquid reduces by half, about 10 minutes. Pour in the white wine, return to a boil, and reduce the liquid by half again, about 10 minutes. Stir in mushrooms, rosemary, and sage; simmer until the mushrooms are tender and have given up their juice, about 15 more minutes. Stir in cream, butter, lemon, and capers; reduce heat and simmer the sauce until thickened, about 10 minutes (45 minutes in all). 2. Preheat oven to 350 degrees F (175 degrees C). 3. Place the cornstarch into a shallow bowl and press the chicken thighs into the cornstarch on all sides until thoroughly coated. Shake off excess cornstarch. Heat the olive oil in a skillet over medium heat; pan-fry the chicken thighs until they develop a golden brown crust, about 8 minutes per side. Place the chicken thighs into a 9x9-inch baking dish and pour the sauce over the chicken. 4. Bake in the preheated oven until the sauce is bubbling and the chicken is no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center of a chicken thigh should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 25 mins",
  "calories": "610"
},
{
  "url": "https://www.allrecipes.com/recipe/272543/baked-italian-chicken-thighs/",
  "name": "Baked Italian Chicken Thighs",
  "rating": "4.8",
  "ratingcount": "88",
  "ingredients": "½ cup low-fat ricotta cheese; ¼ cup freshly grated Parmesan cheese; ½ teaspoon Italian seasoning; ⅛ teaspoon salt; 1 pound skinless, boneless chicken thighs; 1 teaspoon garlic powder; salt to taste; 1 tablespoon olive oil; 1 ½ cups marinara sauce; ¾ cup shredded mozzarella cheese; 2 tablespoons chopped fresh parsley (Optional)",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Combine ricotta cheese, Parmesan cheese, Italian seasoning, and salt in a small bowl; set aside. 3. Season chicken thighs on both sides with garlic powder and salt. 4. Heat olive oil in an oven-proof skillet over medium-high heat. Cook chicken thighs, smooth-side down, in hot oil until the bottoms are browned, 3 to 4 minutes. Flip thighs over and remove the skillet from heat. Top each thigh with an equal amount of ricotta cheese mixture. Spoon marinara sauce on top and around chicken thighs. 5. Bake in the preheated oven until chicken is no longer pink in the center and the juices run clear, about 25 minutes. An instant-read thermometer inserted into the centers of thighs should read at least 165 degrees F (74 degrees C). 6. Top each thigh with mozzarella cheese and continue baking until cheese is melted, 2 to 3 minutes. Garnish with parsley to serve.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "35 mins",
  "calories": "378"
},
{
  "url": "https://www.allrecipes.com/recipe/28372/chicken-jalfrezi/",
  "name": "Chicken Jalfrezi",
  "rating": "4.6",
  "ratingcount": "474",
  "ingredients": "2 tablespoons vegetable oil; 1  onion, grated; 2 cloves garlic, chopped; 1 ½ pounds boneless skinless chicken thighs, cut in half; 3 teaspoons ground turmeric; 1 teaspoon chili powder; 1 ½ teaspoons salt; 1 (14.5 ounce) can peeled and diced tomatoes; 2 tablespoons ghee (clarified butter); 3 teaspoons ground cumin; 3 teaspoons ground coriander; 2 tablespoons grated fresh ginger root; ½ cup chopped cilantro leaves",
  "directions": "1. Heat the oil in a large deep skillet over medium-high heat. Add onions and garlic, and cook for about 2 minutes. Add the chicken, and season with turmeric, chili powder and salt. Fry gently, scraping the bottom of the pan frequently and turning the chicken. 2. Pour in the tomatoes with their juice, cover the pan, and simmer over medium heat for 20 minutes. Uncover, and simmer for another 10 minutes to let the excess liquid evaporate. 3. Add the ghee, cumin, ground coriander, ginger and cilantro, and simmer for another 5 to 7 minutes. Serve the chicken pieces with sauce spooned over the top.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "1 hr 15 mins",
  "calories": "265"
},
{
  "url": "https://www.allrecipes.com/recipe/259101/crispy-panko-chicken-thighs/",
  "name": "Crispy Panko Chicken Thighs",
  "rating": "4.7",
  "ratingcount": "94",
  "ingredients": "cooking spray; 1 cup mayonnaise; 1 teaspoon paprika; ¾ cup panko bread crumbs, or as needed; 1 teaspoon garlic powder; 4  bone-in chicken thighs",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Line a baking dish with aluminum foil; grease with cooking spray. 2. Combine mayonnaise and paprika in a bowl; mix well. Stir together panko and garlic powder in a second bowl. 3. Spread mayonnaise mixture over each chicken thigh; press into panko mixture to coat. Place in the prepared baking dish; spritz thighs with cooking spray. 4. Bake in the preheated oven until chicken is no longer pink at the bone and the juices run clear, about 1 hour. An instant-read thermometer inserted near the bone should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "639"
},
{
  "url": "https://www.allrecipes.com/recipe/283454/air-fried-breaded-chicken-thighs/",
  "name": "Air-Fried Breaded Chicken Thighs",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "4 medium bone-in, skin-on chicken thighs; 1 cup buttermilk; ¼ cup all-purpose flour; ¼ cup plain bread crumbs; 2 tablespoons grated Parmesan cheese; ½ teaspoon ground paprika; 1 teaspoon garlic powder; 1 teaspoon salt; ½ teaspoon onion powder; ½ teaspoon black pepper; nonstick cooking spray",
  "directions": "1. Place chicken thighs and buttermilk in a non-reactive container with a lid or a resealable plastic bag. Marinate in the refrigerator for at least 1 hour or overnight. 2. Remove chicken from the refrigerator. Pour off buttermilk and let chicken rest on the counter while preparing the breading mixture. 3. Combine flour, bread crumbs, Parmesan cheese, paprika, garlic powder, salt, onion powder, and black pepper in a large, shallow bowl or pie plate; whisk or stir with a fork until evenly combined. 4. Preheat the air fryer to 375 to 380 degrees F (190 to 195 degrees C). Spray air fryer basket lightly with nonstick spray. 5. Once air fryer is hot, press chicken thighs, 1 at a time, into the breading mixture and make sure breading sticks onto all sides as much as possible. Gently set into the air fryer basket. Repeat until all thighs are breaded and in the basket. Do not stack them on top of each other. 6. Set air fryer for 25 minutes. When the time is up check temperature with an instant-read thermometer. Internal temperature should be 180 degrees F (82 degrees C). If they aren't quite done but the breading is getting dark, just close the basket again and let them rest, or you can turn the air fryer on again for a few minutes and check again. Serve immediately.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "1 hr 40 mins",
  "calories": "850"
},
{
  "url": "https://www.allrecipes.com/recipe/238844/korean-fried-chicken/",
  "name": "Korean Fried Chicken",
  "rating": "4.6",
  "ratingcount": "144",
  "ingredients": "1 pound skinless, boneless chicken thighs, quartered; ½  yellow onion, grated; 4 cloves garlic, minced; 1 teaspoon fine salt; ½ teaspoon freshly ground black pepper; 4 cups oil for frying, or as needed; ¾ cup cornstarch; ½ cup self-rising flour; 1 teaspoon white sugar; ½ teaspoon ground black pepper; ¼ teaspoon salt; 1 cup very cold water, or as needed",
  "directions": "1. Make marinade: Stir together chicken, onion, garlic, salt, and pepper in a medium bowl until chicken is coated. Cover the bowl with plastic wrap and refrigerate, 4 hours to overnight. 2. Heat oil in a deep fryer or large saucepan to 340 degrees F (171 degrees C). 3. While oil is heating, make batter: Whisk together cornstarch, flour, sugar, pepper, and salt in a large bowl. Gradually whisk in cold water until mixture resembles smooth pancake batter. Use tongs to remove chicken from marinade to batter; stir to coat chicken completely. Discard marinade. 4. Working in batches, fry chicken in hot oil for 4 minutes. Transfer chicken to a cooling rack. 5. Increase oil temperature to 375 degrees F (190 degrees C). 6. Working in batches, fry chicken again in hot oil until golden brown and crispy, 3 to 4 minutes. Transfer to a wire rack to drain.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "4 hrs 30 mins",
  "calories": "472"
},
{
  "url": "https://www.allrecipes.com/recipe/282524/one-pot-crispy-chicken-and-rice/",
  "name": "One-Pot Crispy Chicken and Rice",
  "rating": "4.6",
  "ratingcount": "54",
  "ingredients": "1 tablespoon olive oil; 6 (4 ounce) bone-in, skin-on chicken thighs; 1 ½ teaspoons kosher salt, divided; ¾ teaspoon ground black pepper; 1 tablespoon unsalted butter; ⅔ cup finely chopped yellow onion; 2 cloves garlic, minced; 1 ½ cups uncooked long-grain rice; 3 cups chicken stock, divided, or more to taste; 1 tablespoon finely chopped flat-leaf parsley; 1 medium lemon, cut into wedges",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Heat oil in large Dutch oven over medium-high heat. Sprinkle chicken thighs evenly with 1 teaspoon salt and 1/2 teaspoon pepper. 3. Place chicken skin-side down in the Dutch oven; cook undisturbed until golden crisp and easily released from the bottom, about 5 minutes. Flip chicken and cook for 3 minutes more. Transfer to a plate and set aside. Chicken will not be cooked through at this point. 4. Add butter to the drippings and melt. Add onion and cook, stirring often, until translucent, about 3 minutes. Add garlic; cook for 1 minute. Add rice; cook, stirring to coat grains in drippings and lightly toast, about 1 minute. Stir in 3 cups stock and remaining salt and pepper. Bring to a boil. Use a wooden spoon to scrape any browned bits from the bottom of the Dutch oven. Place the chicken thighs over the rice. 5. Bake in the preheated oven until all liquid has been absorbed and chicken is cooked through, 45 to 55 minutes. Add remaining stock if liquid is absorbed before rice and chicken are cooked through. Sprinkle with parsley and squeeze lemon juice over the top.",
  "prep": "15 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 20 mins",
  "calories": "413"
},
{
  "url": "https://www.allrecipes.com/recipe/269068/honey-garlic-chicken-thighs/",
  "name": "Honey-Garlic Chicken Thighs",
  "rating": "4.7",
  "ratingcount": "35",
  "ingredients": "6  chicken thighs; 2 teaspoons garlic powder; salt and ground black pepper to taste; 6 cloves garlic, crushed; ⅓ cup honey; ¼ cup water; 2 tablespoons rice wine vinegar; 1 tablespoon soy sauce",
  "directions": "1. Season chicken with garlic powder, salt, and pepper. 2. Heat a pan over medium-high heat. Add chicken and sear until golden, 10 to 12 minutes. An instant-read thermometer inserted into the centers should read at least 165 degrees F (74 degrees C). Drain most of the excess grease from the pan, leaving about 2 tablespoons behind. 3. Arrange chicken thighs skin-side down in the pan. Place crushed garlic between the chicken and fry until fragrant, about 30 seconds. Add honey, water, vinegar, and soy sauce. Increase heat to medium-high and cook until sauce reduces down and thickens slightly, 3 to 4 minutes.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/244979/chef-johns-peanut-curry-chicken/",
  "name": "Chef John's Peanut Curry Chicken",
  "rating": "4.8",
  "ratingcount": "586",
  "ingredients": "1 tablespoon kosher salt, plus more to taste; 2 teaspoons ground coriander; 2 teaspoons ground cumin; 1 teaspoon ground turmeric; 1 teaspoon paprika; ½ teaspoon cayenne pepper; 2 ½ pounds skinless, boneless chicken thighs, cut into 2-inch pieces; 2 tablespoons vegetable oil; 1 large yellow onion, chopped; 6 cloves garlic, minced; 1 tablespoon finely grated fresh ginger; 3 ½ cups chicken broth, or to taste; ¾ cup unsweetened natural peanut butter; ½ cup ketchup; 1 tablespoon packed brown sugar; 1 pound zucchini, cut into chunks; 1 medium red bell pepper, cut into chunks; 1 medium green poblano pepper, diced; ½ cup roasted peanuts, plus more for garnish; 2 cups hot cooked rice; 1 medium lime, cut into wedges; 3 tablespoons chopped fresh cilantro, for garnish",
  "directions": "1. Make the spice blend: Mix salt, coriander, cumin, turmeric, paprika, and cayenne pepper together in a small bowl. 2. Make the curry: Place chicken in a large bowl. Add 1/2 of the spice blend and mix until chicken is thoroughly coated. 3. Heat oil in a heavy pot over high heat. Add 1/2 of the chicken and cook until browned on all sides, 5 to 7 minutes. Transfer to a bowl. Repeat to brown remaining chicken. 4. Reduce the heat to medium, add onion to the chicken drippings, and sauté for 1 to 2 minutes. Add garlic and ginger; cook until fragrant, about 1 minute. Add remaining spice blend; cook and stir for 1 minute. Pour in chicken broth; add browned chicken plus accumulated juices. Stir in peanut butter, ketchup, and brown sugar; bring to a simmer. 5. Reduce the heat to maintain a gentle, steady simmer. Simmer, stirring occasionally, for 30 minutes. Stir in zucchini, bell pepper, poblano pepper, and 1/2 cup peanuts; continue to simmer until chicken juices run clear and vegetables are fork-tender, 30 to 40 minutes. Remove from the heat. 6. Serve curry over rice with a squeeze of lime. Garnish with cilantro and more peanuts as desired.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "648"
},
{
  "url": "https://www.allrecipes.com/recipe/8516210/chicken-adovada/",
  "name": "Chicken Adovada",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "4  dried pasilla chiles, stemmed and seeded; 4  dried ancho chilies, stemmed and seeded; 2 (14.5 ounce) cans low-sodium chicken broth; ½ cup frozen orange juice concentrate; 1 tablespoon distilled white vinegar; 3  dried pitted dates; ¼ cup chipotle peppers in adobo sauce; 2  bay leaves; 1 tablespoon ground cumin; 2 teaspoons dried Mexican oregano; 3 pounds boneless, skinless chicken thighs, cut into large pieces; 1 tablespoon olive oil; 1 large onion, cut into 1/4-inch slices; 1 ½ tablespoons minced garlic; salt to taste; 8 (6 inch) corn tortillas; ¼ cup sliced red onion (Optional); ¼ cup chopped fresh cilantro (Optional); ¼ cup crumbled cotija cheese (Optional); 8  lime wedges, for garnish (Optional)",
  "directions": "1. Lightly toast peppers on the bare surface of a large Dutch oven over medium heat, stirring, until the peppers begin to have a toasted aroma, 2 to 5 minutes. Remove from heat immediately. 2. Add chicken stock, orange juice concentrate, vinegar, dates, and chipotle peppers. Bring to a boil, then reduce the heat and simmer, uncovered, for about 15 minutes. 3. Using a stick blender, puree the pepper mixture until smooth. 4. Add bay leaves, cumin, and oregano to pepper sauce; leave sauce on low simmer while preparing chicken. 5. Pat chicken dry with paper towels. Heat olive oil in a large non-stick skillet over medium heat. Add in chicken pieces all at once; allow to cook undisturbed until browned, about 8 minutes. Add browned chicken to the pepper sauce. 6. Cook onion slices in the same skillet until beginning to brown slightly, 3 to 4 minutes. Stir in garlic and cook until fragrant, about 30 seconds more. 7. Add skillet contents to the chicken and pepper sauce. Bring to a boil, then reduce heat to simmer. Cover partially with a tilted lid to allow some liquid to evaporate. Simmer, stirring occasionally, until chicken is fall-apart tender, about 1 hour. Season to taste with salt. 8. To serve, spoon into corn tortillas, and serve with sliced red onions, cilantro, cheese, and lime wedges.",
  "prep": "45 mins",
  "cook": "1 hr",
  "total": "1 hr 45 mins",
  "calories": "395"
},
{
  "url": "https://www.allrecipes.com/recipe/266405/slow-cooker-bbq-chicken-thighs/",
  "name": "Slow Cooker BBQ Chicken Thighs",
  "rating": "4.3",
  "ratingcount": "32",
  "ingredients": "1 ½ cups barbecue sauce; ¼ cup honey; 2 teaspoons Creole mustard; ¼ teaspoon Worcestershire sauce; ¼ teaspoon hot pepper sauce; 9 Tyson boneless, skinless chicken thighs; ½ teaspoon salt; ¼ teaspoon pepper",
  "directions": "1. Stir barbecue sauce, honey, mustard, Worcestershire sauce, and hot pepper sauce together in a bowl until well combined. 2. Season chicken all over with salt and pepper. Place into a slow cooker and pour barbecue mixture over top; stir to until well coated. 3. Cover and cook on Low until chicken is no longer pink inside and the juices run clear, about 5 hours. An instant-read thermometer inserted into the middle should read at least 165 degrees F (74 degrees C).",
  "prep": "5 mins",
  "cook": "5 hrs",
  "total": "5 hrs 5 mins",
  "calories": "409"
},
{
  "url": "https://www.allrecipes.com/recipe/8466000/chef-johns-mulligatawny-soup/",
  "name": "Chef John's Mulligatawny Soup",
  "rating": "5.0",
  "ratingcount": "12",
  "ingredients": "1 tablespoon unsalted butter; 1 tablespoon vegetable oil; 1 ¼ cups boneless, skinless chicken thighs; 1 teaspoon kosher salt, or more to taste; 1 tablespoon curry powder; 1 teaspoon garam masala; ½ teaspoon ground cumin; ½ teaspoon freshly ground black pepper; ¼ teaspoon ground mustard; ¼ teaspoon ground coriander; ¼ teaspoon cayenne pepper; 4 cloves garlic, minced; 1 tablespoon finely grated fresh ginger; 1 large yellow onion, diced; 2  carrots, diced; 2 stalks celery, diced; 1 tablespoon tomato paste; 1 cup cubed Yukon Gold potatoes; ½ cup seeded and diced tomato; 2 small Granny Smith apples - peeled, cored, and diced; ½ cup dry red lentils; 1  bay leaf; 1 teaspoon tamarind paste; 6 cups chicken broth; 3 tablespoons coconut cream (Optional); ½ cup plain Greek yogurt, or to taste; ¼ cup chopped fresh cilantro, or to taste; ¼ cup sliced green onion, or to taste; 1 pinch red pepper flakes, or to taste",
  "directions": "1. Melt butter and oil in a soup pot over medium-high heat. Add chicken thighs and season with salt; let brown for 4 to 5 minutes. Flip and brown on opposite side, 4 to 5 minutes more. 2. While chicken browns, combine curry powder, garam masala, cumin, black pepper, ground mustard, coriander, and cayenne in a small bowl. 3. Remove browned chicken from the pot and transfer to a plate to cool enough to handle; roughly chop or shred. 4. While chicken cools, reduce heat to medium and add spice blend to pot; cook and stir until fragrant, about 30 seconds. Add garlic and ginger; cook and stir until fragrant, about 1 minute. Add onions, carrots, and celery. Season with salt and cook, stirring, until onions turn translucent, 3 to 4 minutes. Stir in tomato paste and continue to cook for 3 minutes more. Stir in potatoes, tomatoes, and apples. Add red lentils, bay leaf, and tamarind paste. 5. Pour in chicken broth, stir, and raise heat to high; add coconut cream. Bring to a simmer. Stir and reduce heat to medium-low. Let simmer, stirring occasionally, for about 30 minutes. 6. Stir chopped chicken and any accumulated juices into the soup. Continue to let simmer, stirring occasionally, until vegetables are fully cooked, lentils are tender, and soup has thickened, 20 to 30 minutes more. Taste and adjust as needed. 7. Serve in warm bowls topped with Greek yogurt, cilantro, and scallions. Sprinkle with red chili flakes.",
  "prep": "30 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 40 mins",
  "calories": "263"
},
{
  "url": "https://www.allrecipes.com/recipe/272858/air-fryer-chicken-thighs/",
  "name": "Air Fryer Chicken Thighs",
  "rating": "4.7",
  "ratingcount": "147",
  "ingredients": "4  skin-on, boneless chicken thighs; 2 teaspoons extra-virgin olive oil; 1 teaspoon smoked paprika; ¾ teaspoon garlic powder; ½ teaspoon salt; ½ teaspoon ground black pepper",
  "directions": "1. Preheat an air fryer to 400 degrees F (200 degrees C). 2. Pat chicken thighs dry with a paper towel and brush skins with olive oil. Place chicken thighs, skin-side down, in a single layer on a plate. 3. Combine smoked paprika, garlic powder, salt, and pepper in a bowl. Sprinkle 1/2 of the seasoning mixture evenly over thighs. Turn thighs over and evenly sprinkle with remaining seasoning. Arrange thighs, skin-side up, in a single layer in the air fryer basket. 4. Cook in the preheated air fryer until thighs are brown and the juices run clear, about 18 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "213"
},
{
  "url": "https://www.allrecipes.com/recipe/257938/spicy-thai-basil-chicken-pad-krapow-gai/",
  "name": "Spicy Thai Basil Chicken (Pad Krapow Gai)",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "⅓ cup chicken broth; 1 tablespoon oyster sauce; 1 tablespoon soy sauce, or as needed; 2 teaspoons fish sauce; 1 teaspoon white sugar; 1 teaspoon brown sugar; 2 tablespoons vegetable oil; 1 pound skinless, boneless chicken thighs, coarsely chopped; ¼ cup sliced shallots; 4 cloves garlic, minced; 2 tablespoons minced Thai chilies, Serrano, or other hot pepper; 1 cup very thinly sliced fresh basil leaves; 2 cups hot cooked rice",
  "directions": "1. Gather ingredients. 2. Whisk chicken broth, oyster sauce, soy sauce, fish sauce, white sugar, and brown sugar together in a bowl until well blended. 3. Heat large skillet over high heat. Drizzle in oil. Add chicken and stir fry until it loses its raw color, 2 to 3 minutes. 4. Stir in shallots, garlic, and sliced chilies. Continue cooking on high heat until some of the juices start to caramelize in the bottom of the pan, about 2 or 3 more minutes. 5. Add about a tablespoon of the sauce mixture to the skillet; cook and stir until sauce begins to caramelize, about 1 minute. 6. Pour in the rest of the sauce. Cook and stir until sauce has deglazed the bottom of the pan. Continue to cook until sauce glazes onto the meat, 1 or 2 more minutes. Remove from heat. 7. Stir in basil. Cook and stir until basil is wilted, about 20 seconds. Serve with rice. 8. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "715"
},
{
  "url": "https://www.allrecipes.com/recipe/231097/caldo-de-pollo/",
  "name": "Caldo de Pollo",
  "rating": "4.8",
  "ratingcount": "68",
  "ingredients": "5 pounds chicken leg quarters; 2 gallons water; 2 tablespoons minced garlic; 2 tablespoons salt; 1 tablespoon garlic powder; 1 cube chicken bouillon; 4 large carrots, peeled and cut into large chunks; 4 large potatoes, peeled and cut into large chunks; 4  zucchini, cut into large chunks; 1  chayote, cut into large chunks; 1 large white onion, cut into large chunks; ½ bunch fresh cilantro, chopped",
  "directions": "1. Place chicken legs into a large stockpot; pour water over chicken. Add minced garlic, salt, and garlic powder. 2. Cover and bring to a boil over high heat. Reduce to a simmer and cook until chicken meat falls off the bones, 1 to 2 hours. 3. Stir in chicken bouillon cube until dissolved; add carrots, potatoes, zucchini, chayote, and white onion. Reduce heat to medium-low and simmer until carrots and potatoes are tender, 45 minutes to 1 hour. 4. Stir chopped cilantro into soup. Simmer for 5 minutes and serve.",
  "prep": "20 mins",
  "cook": "1 hr 50 mins",
  "total": "2 hrs 10 mins",
  "calories": "606"
},
{
  "url": "https://www.allrecipes.com/recipe/8506346/chef-johns-chicken-fricassee/",
  "name": "Chef John's Chicken Fricassee",
  "rating": "5.0",
  "ratingcount": "10",
  "ingredients": "6  bone-in, skin-on chicken thighs; 2 teaspoons kosher salt, plus more to taste; 1 tablespoon vegetable oil; 2 cups thickly sliced fresh mushrooms; 1 cup diced yellow onion; ½ cup sliced shallots (Optional); 2 cloves garlic, minced; ½ teaspoon freshly ground black pepper; 1 pinch cayenne; 2 teaspoons all-purpose flour; 1 ½ cups white wine; 6 sprigs thyme; 1 cup chicken broth; ½ cup heavy cream",
  "directions": "1. Season chicken thighs with salt on both sides. 2. Heat vegetable oil in a skillet over medium-high heat and place chicken skin-side-down into the hot oil. Cook until there is a good sear and fat is rendered, about 5 minutes. Flip and cook the other side until seared as well, about 2 minutes. Set aside. 3. Leave 2 tablespoons of the rendered fat in the pan and add sliced mushrooms. Cook until browned, 5 to 8 minutes. Add onion, shallots, and garlic and cook, stirring occasionally, until onions are soft and translucent, about 5 minutes. Season with pepper and cayenne and stir in flour to thicken the mixture, about 1 minute. 4. Pour in white wine and cook, stirring, until alcohol has evaporated. Raise the heat to high and keep cooking until sauce has reduced to half, 3 to 5 minutes. 5. Add chicken broth, thyme, and bay leaf and bring to a boil over high heat. Reduce heat to medium-lo and add chicken and any accumulated juices back into the skillet, skin side up. Cover and simmer gently for 45 minutes, turning over thighs halfway through. 6. Remove lid and turn thighs back to skin side up. Continue to simmer uncovered, basting occasionally, until chicken is tender and sauce reduces even more. If the pan gets dry before the chicken is tender, add some more water or broth. 7. Add cream and simmer until sauce reaches desired thickness. Heat can be raised to medium to reduce cream faster if chicken is already tender. Sauce can be served thin and runny, or reduced to a thick sauce. Sprinkle with fresh thyme and serve.",
  "prep": "30 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 50 mins",
  "calories": "407"
},
{
  "url": "https://www.allrecipes.com/recipe/236609/honey-garlic-slow-cooker-chicken-thighs/",
  "name": "Honey-Garlic Slow Cooker Chicken Thighs",
  "rating": "4.0",
  "ratingcount": "3",
  "ingredients": "4  skinless, boneless chicken thighs; ½ cup soy sauce; ½ cup ketchup; ⅓ cup honey; 3 cloves garlic, minced; 1 teaspoon dried basil",
  "directions": "1. Arrange chicken thighs in a single layer in the bottom of a 4-quart slow cooker. 2. Whisk soy sauce, ketchup, honey, garlic, and basil together in a bowl; pour over chicken thighs. 3. Cover and cook on Low for 6 hours or High for 3 to 4 hours.",
  "prep": "10 mins",
  "cook": "3 hrs",
  "total": "3 hrs 10 mins",
  "calories": "325"
},
{
  "url": "https://www.allrecipes.com/recipe/235153/easy-baked-chicken-thighs/",
  "name": "Easy Baked Chicken Thighs",
  "rating": "4.2",
  "ratingcount": "199",
  "ingredients": "4  chicken thighs; 4 teaspoons garlic powder; 4 teaspoons onion flakes",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Place chicken thighs in a baking dish; season both sides with garlic powder and onion flakes. 3. Bake in the preheated oven until no longer pink at the bone and juices run clear, about 30 minutes. An instant-read thermometer inserted into thickest part of thigh, near the bone, should read 165 degrees F (74 degrees C).",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "35 mins",
  "calories": "162"
},
{
  "url": "https://www.allrecipes.com/recipe/212929/chicken-tinola/",
  "name": "Chicken Tinola",
  "rating": "4.6",
  "ratingcount": "92",
  "ingredients": "1 tablespoon cooking oil; 1 medium onion, chopped; 2 cloves garlic, minced; 1 (1 1/2 inch) piece fresh ginger, peeled and thinly sliced; 1 tablespoon fish sauce; 3 pounds chicken legs and thighs, rinsed and patted dry; 2 (14 ounce) cans chicken broth; 1  chayote squash, peeled and cut into bite-sized pieces; salt and ground black pepper to taste; 1 head bok choy, chopped; 1 (8 ounce) package fresh spinach, chopped",
  "directions": "1. Gather all ingredients. 2. Heat oil in a large pot over medium heat. Add onion and garlic; cook and stir until fragrant, about 2 minutes. 3. Add ginger and fish sauce; cook and stir for 1 to 2 minutes. Stir in chicken and cook for 5 minutes. 4. Pour in chicken broth and cook for 5 minutes. Add squash and simmer until chicken is no longer pink in the center, about 10 minutes. Season with salt and pepper. 5. Add bok choy and spinach; cook until spinach is just wilted, 1 to 2 minutes. Serve hot.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "532"
},
{
  "url": "https://www.allrecipes.com/recipe/242352/greek-lemon-chicken-and-potatoes/",
  "name": "Greek Lemon Chicken and Potatoes",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "4 pounds skin-on, bone-in chicken thighs; 3  russet potatoes, peeled and quartered; ½ cup fresh lemon juice; ½ cup olive oil; 6 cloves garlic, minced; 1 tablespoon dried oregano; 1 tablespoon kosher salt; 1 teaspoon dried rosemary; 1 teaspoon freshly ground black pepper; 1 pinch cayenne pepper; 1 cup chicken broth, divided; 1 teaspoon chopped fresh oregano, or to taste",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Lightly oil a large roasting pan. 2. Place chicken and potatoes in a large bowl. Add lemon juice, olive oil, garlic, dried oregano, salt, rosemary, black pepper, and cayenne. Toss until chicken and potatoes are evenly coated. 3. Place chicken pieces skin-side up in the prepared pan. Tuck potato pieces around chicken. Drizzle with 2/3 cup chicken broth. Spoon any remaining marinade from the bowl over chicken and potatoes. 4. Bake in the preheated oven for 20 minutes. Toss chicken and potatoes, then place chicken skin-side up again. 5. Continue baking until chicken is browned and cooked through, about 25 minutes more; an instant-read thermometer inserted near the bone should register 165 degrees F (74 degrees C). 6. Transfer chicken to a serving platter and keep warm; leave potatoes in the pan. 7. Turn on the broiler, or set oven to highest heat. Toss potatoes again to coat in pan juices. Place the pan under the broiler and broil until potatoes are crisped, about 3 minutes. 8. Transfer potatoes to the platter with chicken. 9. Place the roasting pan on the stovetop over medium heat. Add the remaining 1/3 cup chicken broth and scrape up browned bits from the bottom of the pan. Strain pan juices over chicken and potatoes. Sprinkle with fresh oregano.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "1139"
},
{
  "url": "https://www.allrecipes.com/recipe/281733/jamaican-brown-stew-chicken/",
  "name": "Jamaican Brown Stew Chicken",
  "rating": "4.8",
  "ratingcount": "44",
  "ingredients": "4 cloves garlic, minced; ½ cup sliced green onions, white and green parts separated, divided; 2 tablespoons packed dark brown sugar; 2 tablespoons fresh thyme leaves, chopped; 1 tablespoon minced habanero pepper; 1 tablespoon cider vinegar; 2 teaspoons minced fresh ginger root; 2 teaspoons kosher salt; 1 teaspoon freshly ground black pepper; 1 teaspoon smoked paprika; ½ teaspoon ground allspice; 8 (5 ounce) bone-in, skin-on chicken thighs; 3 tablespoons olive oil, divided; 1 large yellow onion, diced; 1 pinch kosher salt; 1 tablespoon brown sugar; 4 cups chicken broth; ⅓ cup ketchup; 2  bay leaves; 1 cup sliced carrot; 1 cup quartered baby bell peppers",
  "directions": "1. Whisk together garlic, white parts of green onions, brown sugar, thyme, habanero, vinegar, ginger, salt, pepper, paprika, and allspice in a large mixing bowl. 2. Make 2 cuts, about 1-inch apart, into the skin side of each thigh, perpendicular to the bone, cutting all the way down to the bone. Add chicken thighs to marinade; mix until evenly coated. Cover and place in the refrigerator to marinate, at least 4 hours or up to 12 hours. If possible, flip thighs several times while marinating. 3. Remove chicken from marinade. Scrape off any chunks of marinade from chicken into the bowl and reserve for later. 4. Heat 2 tablespoons oil in a large, deep, heavy-bottomed skillet or Dutch oven over medium-high heat until almost smoking. Working in batches, brown the chicken all over, about 5 minutes per side. Transfer chicken to the marinade bowl; set aside. 5. Heat 1 tablespoon oil in the same pan over medium-high heat. Add onion and a pinch of salt; cook until golden brown, 3 to 5 minutes. Stir in 1 tablespoon brown sugar and cook until onions are dark brown and caramelized, 3 to 5 minutes more. 6. Add chicken broth, ketchup, and bay leaves to the pan; bring to a boil. Add carrots, bell peppers, browned chicken thighs, and reserved marinade. 7. Reduce heat to medium-low. Simmer, stirring occasionally, until chicken is tender and no longer pink in the center and sauce has reduced and thickened, 1 to 1 1/2 hours. Skim excess fat that floats to the top; baste chicken occasionally with sauce. 8. Taste and adjust seasoning. Stir in green parts of green onions.",
  "prep": "40 mins",
  "cook": "1 hr 20 mins",
  "total": "6 hrs",
  "calories": "343"
},
{
  "url": "https://www.allrecipes.com/recipe/235151/crispy-and-tender-baked-chicken-thighs/",
  "name": "Crispy and Tender Baked Chicken Thighs",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "cooking spray; 8  bone-in, skin-on chicken thighs; ¼ teaspoon garlic salt; ¼ teaspoon onion salt; ¼ teaspoon dried oregano; ¼ teaspoon ground thyme; ¼ teaspoon ground paprika; ¼ teaspoon ground black pepper",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil; spray foil with cooking spray. 2. Arrange chicken thighs, skin-side up, on the prepared baking sheet. 3. Combine garlic salt, onion salt, oregano, thyme, paprika, and pepper in a small bowl; mix until well combined. 4. Sprinkle spice mixture liberally over chicken thighs. 5. Bake chicken in the preheated oven until skin is crispy, thighs are no longer pink at the bone, and the juices run clear, about 1 hour. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 6. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "190"
},
{
  "url": "https://www.allrecipes.com/recipe/8841/oven-fried-chicken-ii/",
  "name": "Oven Fried Chicken",
  "rating": "4.3",
  "ratingcount": "1",
  "ingredients": "12  chicken thighs; 1 cup all-purpose flour; salt and pepper to taste; 1 cup Italian seasoned bread crumbs; 3  eggs; ½ cup vegetable oil; 1 teaspoon paprika",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Place flour in a shallow plate or bowl and season with salt and pepper to taste. Put bread crumbs in another shallow plate or bowl and beat eggs in another bowl. 3. Dredge chicken piece by piece in the flour, then the egg, then the bread crumbs, until all pieces are coated. 4. Pour oil into a large baking dish; add the breaded chicken thighs and sprinkle with paprika to taste. 5. Bake in the preheated oven for 30 minutes, then turn pieces over and bake for another 30 minutes. Remove from the oven and drain on paper towels. 6. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "310"
},
{
  "url": "https://www.allrecipes.com/recipe/174543/slow-cooker-butter-chicken/",
  "name": "Slow Cooker Butter Chicken",
  "rating": "4.5",
  "ratingcount": "707",
  "ingredients": "2 tablespoons butter; 2 tablespoons vegetable oil; 4 large skinless, boneless chicken thighs, cut into bite-sized pieces; 1  onion, diced; 3 cloves garlic, minced; 1 (6 ounce) can tomato paste; 1 tablespoon curry paste; 2 teaspoons curry powder; 2 teaspoons tandoori masala; 1 teaspoon garam masala; 15  green cardamom pods; 1 (14 ounce) can coconut milk; 1 cup low-fat plain yogurt; salt to taste",
  "directions": "1. Heat butter and vegetable oil in a large skillet over medium heat. Stir in chicken, onion, and garlic. Cook and stir until onion has softened and turned translucent, about 10 minutes. Stir in tomato paste, curry paste, curry powder, tandoori masala, and garam masala until no lumps of tomato paste remain. 2. Pour mixture into a slow cooker; stir in cardamom pods, coconut milk, and yogurt. Season with salt. 3. Cook on High for 4 to 6 hours (or on Low for 6 to 8 hours) until chicken is tender and sauce has reduced to desired consistency. Remove and discard cardamom pods before serving.",
  "prep": "15 mins",
  "cook": "4 hrs 15 mins",
  "total": "4 hrs 30 mins",
  "calories": "480"
},
{
  "url": "https://www.allrecipes.com/recipe/222712/soy-sauce-chicken/",
  "name": "Soy Sauce Chicken",
  "rating": "4.6",
  "ratingcount": "136",
  "ingredients": "1 cup white sugar; 1 cup soy sauce; 1 cup water; ¼ cup minced garlic; ¼ cup minced fresh ginger; 5 pounds bone-in chicken thighs with skin; ¼ cup chopped green onions",
  "directions": "1. Combine sugar, soy sauce, water, garlic, and ginger into a large stockpot over medium heat; stir until sugar dissolves. 2. Add chicken thighs and bring to a boil. Simmer, turning the chicken thighs with tongs every 5 minutes, until the sauce is a rich, brown glaze and the chicken is no longer pink at the bone and juices run clear, about 35 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Remove pot from the heat and let cool 10 minutes. 3. Transfer chicken thighs to a platter; sprinkle with chopped green onions.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "564"
},
{
  "url": "https://www.allrecipes.com/recipe/45957/chicken-makhani-indian-butter-chicken/",
  "name": "Chicken Makhani (Indian Butter Chicken)",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "2 tablespoons peanut oil, divided; 1  shallot, finely chopped; ¼  white onion, chopped; 2 tablespoons butter; 1 tablespoon ginger garlic paste; 2 teaspoons lemon juice; 2 teaspoons garam masala, divided; 1 teaspoon chili powder; 1 teaspoon ground cumin; 1  bay leaf; 1 cup tomato puree; 1 cup half-and-half; ¼ cup plain yogurt; 1 pinch salt and ground black pepper to taste; 1 pound boneless, skinless chicken thighs, cut into bite-size pieces; ¼ teaspoon cayenne pepper, or to taste; 1 tablespoon cornstarch; ¼ cup water",
  "directions": "1. Heat 1 tablespoon oil in a large saucepan over medium-high heat. Sauté shallot and onion until soft and translucent, about 5 minutes. 2. Stir in butter, ginger-garlic paste, lemon juice, 1 teaspoon garam masala, chili powder, cumin, and bay leaf. Cook and stir for 1 minute. Add tomato sauce, and cook for 2 minutes, continuing to frequently stir. 3. Stir in half-and-half and yogurt. Reduce heat to low, and simmer for 10 minutes, frequently stirring. Season with salt and pepper. Remove from heat and set aside. 4. Heat remaining 1 tablespoon oil in a large heavy skillet over medium heat. Cook chicken until lightly browned, about 10 minutes. 5. Reduce heat, and season with remaining 1 teaspoon garam masala and cayenne. Stir in a few spoonfuls of sauce, and simmer until liquid has reduced, and chicken is no longer pink. Add cooked chicken into sauce and stir together. 6. Dissolve cornstarch into water, then mix into the sauce. Cook for 5 to 10 minutes, or until thickened. 7. Serve over rice with naan.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "408"
},
{
  "url": "https://www.allrecipes.com/recipe/244632/turkish-chicken-kebabs/",
  "name": "Turkish Chicken Kebabs",
  "rating": "4.8",
  "ratingcount": "154",
  "ingredients": "1 cup whole-milk Greek yogurt; 6 cloves garlic, minced; 2 tablespoons olive oil; 2 tablespoons freshly squeezed lemon juice, or more to taste; 2 tablespoons ketchup; 1 tablespoon Aleppo red pepper flakes; 1 tablespoon kosher salt; 1 ½ teaspoons ground cumin; 1 teaspoon freshly ground black pepper; 1 teaspoon paprika; ⅛ teaspoon ground cinnamon; 2 ½ pounds boneless, skinless chicken thighs, halved; 4  long metal skewers",
  "directions": "1. Whisk yogurt, garlic, olive oil, lemon juice, ketchup, red pepper flakes, salt, cumin, black pepper, paprika, and cinnamon together in a large bowl. 2. Place chicken thigh halves into the yogurt marinade and coat them thoroughly on all sides. Cover the bowl with plastic wrap and refrigerate, 2 to 8 hours. 3. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 4. Using 2 skewers for each kebab, thread half of the chicken thighs onto each pair of skewers making a fairly thick \"log\" shape. 5. Place kebabs on the preheated grill. Do not try to turn them until they begin to unstick from the grill, 3 or 4 minutes. Turn kebabs and grill the other side for 3 to 4 minutes. Continue cooking and turning until chicken is no longer pink in the center, about 6 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "12 mins",
  "total": "2 hrs 27 mins",
  "calories": "539"
},
{
  "url": "https://www.allrecipes.com/recipe/91499/general-tsaos-chicken-ii/",
  "name": "General Tso's Chicken",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "4 cups vegetable oil for frying; 1 large egg; 1 ½ pounds skinless, boneless chicken thighs, cut into 1 1/2-inch pieces; 1 teaspoon salt; 1 teaspoon white sugar; 1 pinch white pepper; 1 cup cornstarch; 2 tablespoons vegetable oil; 3 tablespoons chopped green onion; 1 clove garlic, minced; 6  dried whole red chilies; 1 strip orange zest; ½ cup white sugar; ¼ cup soy sauce; 3 tablespoons chicken broth; 2 tablespoons peanut oil; 1 tablespoon rice vinegar; 2 teaspoons sesame oil; ¼ teaspoon ground ginger; 2 teaspoons cornstarch; ¼ cup water",
  "directions": "1. Heat vegetable oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). 2. Whisk egg in large mixing bowl. Add chicken, salt, sugar, and pepper; mix well. Mix in cornstarch, a little bit at a time, until chicken is well coated. 3. Working in batches, carefully drop one piece of chicken at a time into the hot oil. Fry until chicken turns golden brown and begins to float, about 3 minutes. Remove chicken to a plate and allow to cool as you fry the next batch. 4. Once all of the chicken has been fried, refry the chicken, starting with the batch that was cooked first. Fry each batch until chicken turns deep golden brown, about 2 minutes more. Drain on a paper towel-lined plate. 5. Prepare sauce: Heat vegetable oil in a wok or large skillet over high heat. Stir in green onion, garlic, whole chiles, and orange zest. Cook and stir until garlic turns golden and chiles brighten, 1 to 2 minutes. 6. Add sugar, soy sauce, chicken broth, peanut oil, rice vinegar, sesame oil, and ginger; bring to a boil and cook for 3 minutes. Whisk 2 teaspoons of cornstarch in water until dissolved. Stir into the boiling sauce. Return to a boil and cook until the sauce thickens and is no longer cloudy from the cornstarch, about 1 minute. 7. Stir chicken into the boiling sauce. Reduce heat to low and cook until chicken is heated through and has absorbed some of the sauce, about 3 minutes.",
  "prep": "25 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "634"
},
{
  "url": "https://www.allrecipes.com/recipe/241607/vietnamese-grilled-lemongrass-chicken/",
  "name": "Vietnamese Grilled Lemongrass Chicken",
  "rating": "4.6",
  "ratingcount": "81",
  "ingredients": "2 tablespoons canola oil; 2 tablespoons finely chopped lemongrass; 1 tablespoon lemon juice; 2 teaspoons soy sauce; 2 teaspoons light brown sugar; 2 teaspoons minced garlic; 1 teaspoon fish sauce; 1 ½ pounds chicken thighs, or more to taste, pounded to an even thickness",
  "directions": "1. Mix together canola oil, lemongrass, lemon juice, soy sauce, brown sugar, garlic, and fish sauce in a glass bowl until sugar is dissolved; add chicken and turn to coat in marinade. 2. Marinate chicken in the refrigerator for 20 minutes to 1 hour. 3. Preheat grill for medium heat and lightly oil the grate. 4. Remove chicken thighs from marinade; shake to remove excess. Discard remaining marinade. 5. Cook chicken on the preheated grill until no longer pink in the center and juices run clear, 3 to 5 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "308"
},
{
  "url": "https://www.allrecipes.com/recipe/260109/instant-pot-chicken-cacciatore/",
  "name": "Instant Pot Chicken Cacciatore",
  "rating": "4.7",
  "ratingcount": "299",
  "ingredients": "4 (6 ounce) bone-in chicken thighs, with skin; 2 tablespoons olive oil; 1 (4 ounce) package sliced fresh mushrooms; 3 stalks celery, chopped; ½  onion, chopped; 2 cloves garlic, minced; 1 (14 ounce) can stewed tomatoes; 2 tablespoons tomato paste; 2 teaspoons herbes de Provence; ¾ cup water; 3 cubes  chicken bouillon, crumbled; 1 pinch red pepper flakes (Optional); 1 pinch ground black pepper to taste (Optional)",
  "directions": "1. Rinse chicken thighs and pat dry with paper towels. Heat oil in the pot of an electric pressure cooker (such as Instant Pot) on Sauté mode; add chicken. Cook until browned, about 6 minutes per side. Transfer chicken to a plate, reserving drippings in the pot. 2. Place mushrooms, celery, and onion in the pot; cook and stir until soft, about 5 minutes. Add garlic; cook until fragrant, about 2 minutes. Place chicken back in the pot; add tomatoes and tomato paste. Sprinkle with herbes de Provence. Top with water and bouillon. 3. Close and lock the lid. Select high pressure according to manufacturer's instructions. Allow 10 to 15 minutes for pressure to build. Cook for 11 minutes. 4. Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid carefully, turning it away from you. Test chicken for doneness; an instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Season to taste with red pepper flakes and black pepper.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "392"
},
{
  "url": "https://www.allrecipes.com/recipe/128589/oyakodon-japanese-chicken-and-egg-rice-bowl/",
  "name": "Oyakodon (Japanese Chicken and Egg Rice Bowl)",
  "rating": "4.6",
  "ratingcount": "135",
  "ingredients": "1 tablespoon olive oil; 4  skinless, boneless chicken thighs, cut into small pieces; 1  onion, cut in half and sliced; 2 cups dashi stock, made with dashi powder; ¼ cup soy sauce; 3 tablespoons mirin (Japanese rice wine); 3 tablespoons brown sugar; 4 large eggs; 4 cups hot cooked white rice",
  "directions": "1. Heat oil in a large skillet over medium heat. Add chicken and cook until beginning to brown, about 5 minutes. Add onion; cook and stir until onion is translucent, about 5 minutes. 2. Pour in stock, then whisk in soy sauce, mirin, and brown sugar; stir until sugar dissolves. Bring to a boil, then lower heat and simmer until slightly reduced, about 10 minutes. 3. Whisk eggs in a bowl until well-beaten, then pour into the hot stock mixture. Cover the skillet, reduce the heat, and steam until egg is cooked, about 5 minutes. Remove from the heat. 4. Divide rice among 4 deep soup bowls and top with equal amounts of the soup mixture.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "688"
},
{
  "url": "https://www.allrecipes.com/recipe/216943/asian-glazed-chicken-thighs/",
  "name": "Asian Glazed Chicken Thighs",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "½ cup rice vinegar; ⅓ cup soy sauce (such as Silver Swan®); 5 tablespoons honey; ¼ cup Asian (toasted) sesame oil; 3 tablespoons Asian chili garlic sauce; 3 tablespoons minced garlic; salt to taste; 8  skinless, boneless chicken thighs; 1 tablespoon chopped green onion (Optional)",
  "directions": "1. Whisk vinegar, soy sauce, honey, toasted sesame oil, chili garlic sauce, minced garlic, and salt together in a bowl. Pour 1/2 of the marinade into a resealable plastic bag; retain the other 1/2 of the marinade for the sauce. Place chicken thighs into the bag, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 1 hour, turning the bag once or twice. 2. Preheat the oven to 425 degrees F (220 degrees C). Meanwhile, pour reserved marinade into a saucepan over medium heat. Bring to a boil and simmer, stirring often, until thick, 3 to 5 minutes; set sauce aside. 3. Remove chicken thighs from the marinade and shake off excess. Discard used marinade. Place chicken thighs into a 9x13-inch baking dish; brush with 1/3 of the thickened marinade from the saucepan. 4. Bake in the preheated oven for 30 minutes, basting one more time after 10 minutes; an instant-read thermometer inserted into a chicken thigh should read 165 degrees F (75 degrees C). Let stand for 5 or 10 minutes. 5. Bring sauce back to a boil for 1 minute; serve over chicken and sprinkle with green onions.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "1 hr 40 mins",
  "calories": "544"
},
{
  "url": "https://www.allrecipes.com/recipe/272437/keto-smothered-chicken-thighs/",
  "name": "Keto Smothered Chicken Thighs",
  "rating": "4.8",
  "ratingcount": "138",
  "ingredients": "4 (8 ounce) skin-on, bone-in chicken thighs; 1 teaspoon paprika; salt and pepper to taste; 4 slices bacon, cut into 1/2 inch pieces; ⅓ cup low-sodium chicken broth; 4 ounces sliced mushrooms; ¼ cup heavy whipping cream; 2  green onions, white and green parts separated and sliced",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Season chicken thighs on all sides with paprika, salt, and pepper. 3. Cook bacon in a cast iron skillet or oven-safe pan over medium-high heat until browned, 4 to 5 minutes. Remove from skillet and drain on a paper towel-lined plate. Drain and discard excess grease from the skillet. 4. Return the skillet to medium heat and cook chicken thighs, skin-side down, for 3 to 4 minutes. Flip chicken over and place the skillet in the preheated oven. 5. Bake until chicken thighs are no longer pink at the bone and juices run clear, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Remove chicken to a plate and cover with foil to keep warm. Remove all but 2 tablespoons of drippings from the skillet. 6. Return the skillet to the stove over medium-high heat. Pour in chicken broth while whisking up brown bits from the bottom of the skillet. Add mushrooms and cook until soft, about 3 to 4 minutes. Pour in heavy whipping cream and whisk together until lightly simmering, then reduce heat to medium-low. Season with salt and pepper, if necessary. 7. Return chicken and any juices back into the skillet; top with bacon and green onions. Serve immediately, spooning sauce over chicken.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "466"
}]