[{
  "url": "https://www.allrecipes.com/recipe/283815/easy-baked-chicken-drumsticks/",
  "name": "Easy Baked Chicken Drumsticks",
  "rating": "4.2",
  "ratingcount": "9",
  "ingredients": "6 (4 ounce) bone-in chicken drumsticks, with skin; 6 tablespoons unsalted butter; ½ cup extra-virgin olive oil, divided; 1 pinch garlic salt, or to taste; 1 pinch seasoned salt, or to taste; salt and ground black pepper to taste",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Line a glass baking dish with aluminum foil. 2. Spread 1/4 cup of olive oil over the bottom of the prepared baking dish and line up drumsticks on top, alternating directions so that they fit. Top with 1 tablespoon of butter each, on the thick part of the chicken. Sprinkle with garlic salt, seasoned salt, salt, and pepper. 3. Bake in the preheated oven for 35 minutes. Cover chicken with remaining olive oil; continue to bake until juices run clear and chicken is no longer pink in the centers, 10 to 15 more minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Serve.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "55 mins",
  "calories": "398"
},
{
  "url": "https://www.allrecipes.com/recipe/231097/caldo-de-pollo/",
  "name": "Caldo de Pollo",
  "rating": "4.8",
  "ratingcount": "68",
  "ingredients": "5 pounds chicken leg quarters; 2 gallons water; 2 tablespoons minced garlic; 2 tablespoons salt; 1 tablespoon garlic powder; 1 cube chicken bouillon; 4 large carrots, peeled and cut into large chunks; 4 large potatoes, peeled and cut into large chunks; 4  zucchini, cut into large chunks; 1  chayote, cut into large chunks; 1 large white onion, cut into large chunks; ½ bunch fresh cilantro, chopped",
  "directions": "1. Place chicken legs into a large stockpot; pour water over chicken. Add minced garlic, salt, and garlic powder. 2. Cover and bring to a boil over high heat. Reduce to a simmer and cook until chicken meat falls off the bones, 1 to 2 hours. 3. Stir in chicken bouillon cube until dissolved; add carrots, potatoes, zucchini, chayote, and white onion. Reduce heat to medium-low and simmer until carrots and potatoes are tender, 45 minutes to 1 hour. 4. Stir chopped cilantro into soup. Simmer for 5 minutes and serve.",
  "prep": "20 mins",
  "cook": "1 hr 50 mins",
  "total": "2 hrs 10 mins",
  "calories": "606"
},
{
  "url": "https://www.allrecipes.com/recipe/212929/chicken-tinola/",
  "name": "Chicken Tinola",
  "rating": "4.6",
  "ratingcount": "92",
  "ingredients": "1 tablespoon cooking oil; 1 medium onion, chopped; 2 cloves garlic, minced; 1 (1 1/2 inch) piece fresh ginger, peeled and thinly sliced; 1 tablespoon fish sauce; 3 pounds chicken legs and thighs, rinsed and patted dry; 2 (14 ounce) cans chicken broth; 1  chayote squash, peeled and cut into bite-sized pieces; salt and ground black pepper to taste; 1 head bok choy, chopped; 1 (8 ounce) package fresh spinach, chopped",
  "directions": "1. Gather all ingredients. 2. Heat oil in a large pot over medium heat. Add onion and garlic; cook and stir until fragrant, about 2 minutes. 3. Add ginger and fish sauce; cook and stir for 1 to 2 minutes. Stir in chicken and cook for 5 minutes. 4. Pour in chicken broth and cook for 5 minutes. Add squash and simmer until chicken is no longer pink in the center, about 10 minutes. Season with salt and pepper. 5. Add bok choy and spinach; cook until spinach is just wilted, 1 to 2 minutes. Serve hot.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "532"
},
{
  "url": "https://www.allrecipes.com/recipe/281393/smoked-chicken-drumsticks/",
  "name": "Smoked Chicken Drumsticks",
  "rating": "3.7",
  "ratingcount": "6",
  "ingredients": "12  chicken drumsticks; ¼ cup vegetable oil, or as needed; ⅓ cup BBQ rub",
  "directions": "1. Place drumsticks on a rack over a drip tray or baking sheet. Air-dry in the refrigerator, 8 hours to overnight. 2. Preheat an electric smoker to 275 degrees F (135 degrees C) and add wood chips according to manufacturer's instructions. 3. Brush drumsticks lightly with vegetable oil. Place drumsticks in a resealable plastic bag and sprinkle with the rub. Toss to coat evenly. 4. Place drumsticks on the rack in the smoker. Smoke until chicken has reached an internal temperature of 165 degrees F (74 degrees C), about 2 hours.",
  "prep": "10 mins",
  "cook": "2 hrs",
  "total": "10 hrs 10 mins",
  "calories": "165"
},
{
  "url": "https://www.allrecipes.com/recipe/256872/slow-cooked-chicken-drumsticks/",
  "name": "Slow-Cooked Chicken Drumsticks",
  "rating": "4.4",
  "ratingcount": "47",
  "ingredients": "cooking spray; 5 pounds chicken drumsticks; 2 teaspoons Cajun seasoning; 2 teaspoons poultry seasoning; 1 teaspoon garlic powder; salt and ground black pepper to taste; 1 teaspoon all-purpose flour; 1 cup barbeque sauce",
  "directions": "1. Preheat the oven to 250 degrees F (120 degrees C). Grease a baking pan with cooking spray. 2. Arrange chicken drumsticks in the prepared pan; sprinkle with Cajun seasoning, poultry seasoning, garlic powder, salt, and pepper. Sprinkle flour on top. Spray chicken with cooking spray; cover the baking pan with aluminum foil. 3. Bake in the preheated oven until juices run clear, about 2 1/2 hours. Remove foil and pour barbeque sauce evenly over chicken. Continue baking, uncovered, until chicken is tender and falling off the bone, about 30 minutes more.",
  "prep": "10 mins",
  "cook": "3 hrs",
  "total": "3 hrs 10 mins",
  "calories": "352"
},
{
  "url": "https://www.allrecipes.com/recipe/8544579/chicken-leg-toast/",
  "name": "Chicken Leg Toast",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2  chicken drumsticks; ¼ cup diced carrot; ¼ cup diced celery; ¼ cup diced onion; 2 cups chicken broth; freshly ground black pepper to taste; 1 teaspoon salt, or to taste; 1 teaspoon fresh thyme leaves; 1 teaspoon lemon zest; cayenne pepper to taste; ⅓ cup creme fraiche or heavy cream; 2 large eggs; 2 thick slices day old French bread (1 to 1 1/2 inch thick); 1 tablespoon butter for browning bread, plus a teaspoon for greasing pan; 2 tablespoons grated Parmigiano-Reggiano cheese; ¼ cup maple syrup; 1 tablespoon Sriracha sauce; ½ teaspoon cayenne pepper",
  "directions": "1. Combine chicken drumsticks, carrots, onions, celery, and broth in a saucepan. Bring to a simmer over high heat. Reduce heat to medium-low, cover, and simmer for 20 minutes. Turn drumsticks over, cover, and cook for another 20 minutes. 2. Remove chicken and transfer to a plate. Allow to cool, wrap, and transfer into the refrigerator until needed. 3. Turn heat to medium-high and reduce cooking liquids in the saucepan to about 1/3 cup. Strain liquid into a mixing bowl, pressing some of the cooked vegetables through the sieve. Season gravy with black pepper, salt, thyme leaves, lemon zest, and cayenne; add creme fraiche and eggs and whisk everything together until a smooth batter forms. 4. Place bread in a shallow baking dish just large enough to fit the slices, and pour over the batter. Toss several times, wrap and place in the fridge for 1 hour or until almost all the batter is absorbed. 5. Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with foil and lightly grease with butter. 6. Melt butter in a small skillet over medium heat and brown bread for a few minutes per side. Transfer bread onto the prepared baking sheet. 7. Press one drumstick into the top of each slice of bread. Brush over any excess batter. Sprinkle with salt, dust with Parmesan cheese, and finish with a shake of cayenne. 8. Bake in the preheated oven until nicely browned, 30 to 35 minutes. 9. Mix together maple syrup, Sriracha hot sauce, and cayenne pepper in a little bowl (\"dragon syrup\"). 10. Serve chicken leg toast drizzled with dragon syrup.",
  "prep": "20 mins",
  "cook": "1 hr 10 mins",
  "total": "2 hrs 30 mins",
  "calories": "691"
},
{
  "url": "https://www.allrecipes.com/recipe/150340/punjabi-chicken-in-thick-gravy/",
  "name": "Punjabi Chicken in Thick Gravy",
  "rating": "4.3",
  "ratingcount": "73",
  "ingredients": "2 tablespoons vegetable oil; 2 tablespoons ghee (clarified butter); 1 teaspoon cumin seeds; 1  onion, finely chopped; 5 cloves garlic, minced; 2 tablespoons minced fresh ginger root; 1 cup water; 1 small tomato, coarsely chopped; 1  serrano chile pepper, seeded and minced; 1 tablespoon tomato paste; 1 tablespoon garam masala; 1 tablespoon ground turmeric; 1 teaspoon salt, or to taste; 8  chicken legs, skin removed; ¼ cup chopped fresh cilantro",
  "directions": "1. Heat oil and ghee in a large pot over medium heat. Cook cumin seeds in hot oil-ghee mixture until seeds begin to change color. 2. Stir in onion; cook and stir until onion has softened and turned translucent, about 5 minutes. Add garlic and ginger; continue cooking until onions are browned, about 5 minutes more. 3. Mix in water, tomato, serrano pepper, tomato paste, garam masala, turmeric, and salt; simmer for 5 minutes. Lay chicken into sauce; mix gently to coat. Cover, reduce heat to medium-low, and cook until chicken is no longer pink near the bone, about 40 minutes. Garnish with cilantro to serve.",
  "prep": "25 mins",
  "cook": "1 hr",
  "total": "1 hr 25 mins",
  "calories": "325"
},
{
  "url": "https://www.allrecipes.com/recipe/259061/true-dominican-sancocho-latin-7-meat-stew/",
  "name": "True Dominican Sancocho (Meat and Vegetable Stew)",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "¼ cup dried oregano; 5 cloves garlic, minced; 2 teaspoons salt, divided; 1 pound bone-in beef chuck; 1 pound bone-in pork loin roast; 5  chicken drumsticks, or more to taste; 2 large lemons, juiced; 2 large onions, quartered; 2 tablespoons vegetable oil; 1 tablespoon vinegar; ½ cup vegetable oil; 1 ¼ gallons water, or as needed; 1 (14 ounce) can chicken broth; 1 (10.5 ounce) can beef consomme; 4  beef bouillon cubes, divided; 1 ½ pounds Spanish pumpkin, peeled and cut into 1 1/2-inch chunks; 1 pound sweet potatoes, peeled and cut into 1 1/2-inch chunks; 1 pound eddeos, peeled and cut into 1 1/2-inch chunks; ½ pound yuca (cassava) roots, peeled and cut into 1 1/2-inch chunks; ½ pound potatoes, peeled and cut into 1 1/2-inch chunks; 2  green plantains, peeled and cut into 1 1/2-inch chunks; 2 ears corn on the cob, cut into quarters; 3 stalks celery, diced; 2 large carrots, chopped, or more to taste; 1 large green bell pepper, diced; 1 bunch cilantro, chopped; 1 pinch adobo seasoning (Optional)",
  "directions": "1. Mash oregano, garlic, and 1 teaspoon salt in a bowl until well combined. 2. Mix beef, pork, chicken, and lemon juice together in a large bowl; drain 1/2 of the liquid. Mix in onions, mashed garlic mixture, 2 tablespoons oil, and vinegar. 3. Heat 1/2 cup vegetable oil in a large skillet over medium-high heat. Add meat mixture in three batches and cook until browned on all sides, 10 to 15 minutes per batch. 4. Transfer browned meats to an 8-quart Dutch oven. Pour in 1/2 of the water, then add chicken broth, beef consommé, 2 bouillon cubes, and remaining 1 teaspoon salt. Bring to a boil, then reduce the heat to low, cover, and simmer until meats are more than halfway cooked through, about 40 minutes. 5. Add pumpkin, sweet potatoes, eddeos, yuca, potatoes, plantains, corn, celery, carrots, bell pepper, cilantro, remaining bouillon cubes, and adobo seasoning to the Dutch oven. Increase the heat to medium and return to a boil. Reduce the heat to low and simmer, stirring in remaining water as needed in gradual increments to replace evaporated liquid, until root vegetables are soft and liquid has thickened, 1 to 2 hours. 6. During the last 30 minutes of cooking, transfer beef, pork, and chicken to a cutting board. Let cool slightly, then remove bones and chop or shred meat. Return meat to the stew and finish cooking.",
  "prep": "10 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 40 mins",
  "calories": "497"
},
{
  "url": "https://www.allrecipes.com/recipe/112818/chicken-long-rice-soup/",
  "name": "Chicken Long Rice Soup",
  "rating": "4.6",
  "ratingcount": "70",
  "ingredients": "3 pounds chicken leg quarters; 3 (32 ounce) cartons low-sodium chicken broth; 1 tablespoon Hawaiian sea salt; 1 (1/2 inch) piece fresh ginger root, sliced; 1 large Maui sweet onion, cubed; 1 (8 ounce) package uncooked bean threads (cellophane noodles); 1 bunch green onions, thinly sliced; 1 small head bok choy, chopped",
  "directions": "1. Place chicken, chicken broth, salt, and ginger into a large pot. Bring to a boil over high heat, then reduce heat to medium-low and simmer until the chicken is tender and no longer pink, about 35 minutes. Remove chicken, and strain broth into a new pot. Discard the solids. 2. Fill a bowl with hot tap water. Add the long rice noodles, and let sit for 30 minutes to soften. 3. Stir onion into the broth, and bring to a boil, then reduce heat to medium-low. Meanwhile, remove the skin and bones from the chicken and discard. Roughly chop the meat and set aside. Add the noodles, chicken meat, green onion and bok choy; simmer until noodles are tender. 4. After the noodles have sat for 30 minutes, stir in the chicken meat, green onion, and bok choy. Reheat and serve.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr 30 mins",
  "calories": "396"
},
{
  "url": "https://www.allrecipes.com/recipe/236901/southern-bbq-chicken/",
  "name": "Southern BBQ Chicken",
  "rating": "4.5",
  "ratingcount": "64",
  "ingredients": "2 tablespoons brown sugar; 2 large cloves cloves garlic, chopped; 2 teaspoons salt; 1 teaspoon black pepper; 10  chicken drumsticks; 2 tablespoons vegetable oil; ½ cup finely chopped onion; ¾ cup ketchup; 2 tablespoons white wine vinegar; 2 tablespoons Worcestershire sauce",
  "directions": "1. Mash brown sugar, garlic, salt, and pepper together in a mortar and pestle to form a paste. Spoon paste into a resealable plastic bag. Add chicken, coat with paste, squeeze out excess air, and seal the bag. Marinate in the refrigerator, 8 hours to overnight. 2. When ready to cook, heat oil in a small saucepan over medium heat. Add onion and sauté until softened, about 5 minutes. Stir in ketchup, vinegar, and Worcestershire sauce. Bring to a simmer and cook until flavors blend, about 10 minutes. 3. Meanwhile, preheat an outdoor grill for medium heat and lightly oil the grate. Remove chicken from the bag. 4. Cook chicken on the preheated grill until brown, 3 to 5 minutes, turning once halfway through. Turn off one of the burners and move chicken over indirect heat. Maintain the temperature at 300 to 350 degrees F (150 to 175 degrees C). 5. Cook chicken for 20 minutes, turning halfway through. Baste with sauce, then continue to cook, basting every 10 minutes, until chicken is no longer pink at the bone and the juices run clear, 20 to 25 more minutes. An instant-read thermometer inserted near the bone should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "1 hr 5 mins",
  "total": "9 hrs 20 mins",
  "calories": "424"
},
{
  "url": "https://www.allrecipes.com/recipe/25492/firecracker-fried-chicken-drumsticks/",
  "name": "Firecracker Fried Chicken Drumsticks",
  "rating": "4.4",
  "ratingcount": "246",
  "ingredients": "8  chicken drumsticks, skin removed; ¼ cup hot pepper sauce; 1 quart vegetable oil for frying; ⅓ cup all-purpose flour; 2 tablespoons yellow cornmeal; ½ teaspoon salt",
  "directions": "1. Place chicken into a resealable plastic bag and pour in hot sauce. Massage the bag to coat chicken with sauce, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 1 hour, or up to 24 hours for spicer chicken. 2. Heat oil in a deep-fryer or large skillet to 350 degrees F (175 degrees C). 3. Combine flour, cornmeal, and salt in another resealable plastic bag. Add the marinated drumsticks, seal the bag, and shake to coat. 4. Fry chicken, uncovered, in the preheated deep fryer, turning occasionally, until golden brown, crispy, and the juices run clear, 25 to 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "1 hr 45 mins",
  "calories": "475"
},
{
  "url": "https://www.allrecipes.com/recipe/8532992/lemon-pepper-chicken-drummies/",
  "name": "Lemon Pepper Chicken Drummies",
  "rating": "3.0",
  "ratingcount": "1",
  "ingredients": "1 pound chicken drummies; ¼ cup freshly squeezed lemon juice; all purpose seasoning to taste; 2 tablespoons vegetable oil, or as needed; 2 medium lemons, zested; freshly ground black pepper to taste; 1 tablespoon butter",
  "directions": "1. Clean pat dry chicken drummies with paper towels and set into a bowl. Pour lemon juice evenly over drummies and sprinkle with all purpose seasoning; toss until well combined. 2. Pour lemon juice over drummies evenly, sprinkle with all purpose seasoning and toss well. 3. Preheat the oven to 375 degrees F (190 degrees C). 4. Heat vegetable oil in a cast iron skillet over medium-high heat. Add drummies to hot oil and cook, turning occasionally, until chicken is cooked through, 5 to 10 minutes. Remove cooked drummies from the skillet and transfer into a bowl. 5. Melt butter in a microwave safe container. Mix in lemon zest and black pepper until well combined. Pour seasoned butter over chicken drummies and mix well. Spread out drummies on a non-stick baking sheet 6. Bake in the preheated oven until skin is crisp, about 5 minutes. Remove from oven and sprinkle with additional lemon zest and pepper to taste.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "282"
},
{
  "url": "https://www.allrecipes.com/recipe/17449/indian-tomato-chicken/",
  "name": "Indian Tomato Chicken",
  "rating": "4.5",
  "ratingcount": "317",
  "ingredients": "1 large onion, chopped; 4 cloves garlic, chopped; 1 slice fresh ginger root; 1 tablespoon olive oil; 2 teaspoons ground cumin; 1 teaspoon ground turmeric; 1 teaspoon salt; 1 teaspoon ground black pepper; ½ teaspoon ground cardamom; 1 (1 inch) piece cinnamon stick; ¼ teaspoon ground cloves; 2  bay leaves; ¼ teaspoon ground nutmeg; 6  skinless chicken thighs; 1 (14.5 ounce) can whole peeled tomatoes, crushed",
  "directions": "1. Place onion, garlic and ginger in a food processor and process into a paste. Heat oil in a large skillet over medium heat, add onion paste and saute, stirring continuously, for about 10 minutes. 2. Stir in the cumin, turmeric, salt, pepper, cardamom, cinnamon, cloves, bay leaves and nutmeg. Saute, stirring, for 1 to 2 minutes. Place chicken pieces in skillet and stir them around with the spice mixture until they are well coated. 3. Saute for another 4 minutes, then pour in the tomatoes with liquid and stir. Reduce heat to low and simmer for 1 to 2 hours, or until the oil has separated from the liquid. Stir occasionally. (Note: If you simmer uncovered, the sauce will thicken; add water, or keep covered while simmering.)",
  "prep": "15 mins",
  "cook": "2 hrs",
  "total": "2 hrs 15 mins",
  "calories": "134"
},
{
  "url": "https://www.allrecipes.com/recipe/8521490/air-fryer-bbq-chicken-drummies/",
  "name": "Air Fryer BBQ Chicken Drummies",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "2 pounds chicken drummies; 1 ½ tablespoons olive oil; 1 teaspoon garlic powder; ½ teaspoon salt; ⅛ teaspoon freshly ground black pepper; ¾ cup barbecue sauce",
  "directions": "1. Preheat an air fryer to 360 degrees F (180 degrees C). 2. Place drummies in a large bowl. Add olive oil, garlic powder, salt, and pepper. Mix until evenly combined. Spread out drummies in the basket of the air fryer. 3. Cook drummies for 25 minutes. 4. Using tongs, remove drummies from the air fryer and place in a large bowl. Pour barbecue over the top and shake to coat. 5. Place coated drummies back in the basket of the air fryer. Cook until drummies are no longer pink at the bone and the juices run clear, about 5 more minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Serve immediately.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "35 mins",
  "calories": "483"
},
{
  "url": "https://www.allrecipes.com/recipe/275257/baked-cajun-chicken-drumsticks/",
  "name": "Baked Cajun Chicken Drumsticks",
  "rating": "4.7",
  "ratingcount": "18",
  "ingredients": "8  chicken drumsticks; 2 tablespoons vegetable oil; 1 teaspoon paprika; ½ teaspoon salt; ½ teaspoon ground black pepper; ½ teaspoon onion powder; ½ teaspoon garlic powder; ½ teaspoon oregano; ½ teaspoon basil; ¼ teaspoon ground thyme; ¼ teaspoon cayenne pepper",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil. 2. Place chicken in a gallon-sized resealable plastic bag. Drizzle vegetable oil over the chicken. Seal the bag and massage the oil into the chicken. 3. Combine paprika, salt, pepper, onion powder, garlic powder, oregano, basil, thyme, and cayenne pepper in a small bowl. Mix until evenly combined. Pour spice mixture into the bag with the chicken. Seal the bag and toss to coat. 4. Transfer drumsticks to the prepared baking sheet, discarding the plastic bag. 5. Bake until chicken is no longer pink at the bone and the juices run clear, about 25 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 6. For extra crispy skin, set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Broil chicken for 5 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "170"
},
{
  "url": "https://www.allrecipes.com/recipe/222932/oven-bbq-chicken-drumsticks/",
  "name": "Oven BBQ Chicken Drumsticks",
  "rating": "4.2",
  "ratingcount": "600",
  "ingredients": "6  chicken drumsticks; ⅓ cup ketchup; ⅓ cup white vinegar; ½ cup water, or more to taste (Optional); ¼ cup brown sugar; 4 teaspoons butter, cut into small chunks; 1 teaspoon salt, or to taste; 2 teaspoons Worcestershire sauce, or to taste; 2 teaspoons dry mustard; 2 teaspoons chili powder, or to taste",
  "directions": "1. Assemble ingredients, preheat oven to 400 degrees F (200 degrees C), and place drumsticks in a 7x11-inch baking dish. 2. Whisk ketchup, vinegar, water, brown sugar, butter, salt, Worcestershire sauce, mustard, and chili powder together in a bowl; pour mixture over drumsticks. Cover with aluminum foil. 3. Bake in the preheated oven until no longer pink at the bone and the juices run clear, about 1 hour, turning chicken about halfway through. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 4. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 5 mins",
  "calories": "443"
},
{
  "url": "https://www.allrecipes.com/recipe/266404/crispy-baked-chicken-drumsticks/",
  "name": "Crispy Baked Chicken Drumsticks",
  "rating": "4.3",
  "ratingcount": "24",
  "ingredients": "6  Tyson® Fresh Chicken Drumsticks; ⅓ cup flour; ¼ cup fat-free egg product; 1 tablespoon water; 1 cup baked potato chips, coarsely crushed",
  "directions": "1. Preheat oven to 375 degrees F. Spray baking sheet with nonstick cooking spray. 2. Place flour in large resealable plastic bag. Blend egg product and water in small shallow dish. Place crushed potato chips in separate shallow dish. 3. Add drumsticks to flour in bag; shake to coat evenly. One at a time, dip drumsticks in egg mixture; coat evenly with potato chips and place on baking sheet. 4. Bake 30 to 35 minutes or until chicken reaches an internal temperature of 180 degrees F.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "252"
},
{
  "url": "https://www.allrecipes.com/recipe/16255/logas-microwave-chicken/",
  "name": "Loga's Microwave Chicken",
  "rating": "4.2",
  "ratingcount": "24",
  "ingredients": "1 cup ketchup; 5 tablespoons curry powder; 1 teaspoon cayenne pepper; 8  chicken legs",
  "directions": "1. In a large, round microwave safe casserole dish combine the ketchup, curry powder and cayenne powder and mix together. Add chicken pieces and turn to coat. Arrange chicken legs in a fan, with the thin part of the legs in the center of the dish. Cover and cook in the microwave on high for 12 to 15 minutes or until chicken is cooked through and juices run clear.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "568"
},
{
  "url": "https://www.allrecipes.com/recipe/219072/cindyds-somewhat-southern-fried-chicken/",
  "name": "CindyD's Somewhat Southern Fried Chicken",
  "rating": "4.4",
  "ratingcount": "53",
  "ingredients": "2  eggs; 1 ½ cups all-purpose flour; 1 tablespoon rubbed sage; 1 teaspoon salt; 1 teaspoon ground black pepper; ½ teaspoon onion powder; ½ teaspoon garlic powder; 2 cups vegetable oil for frying, or as needed; 4  chicken leg quarters, cut into thighs and drumsticks",
  "directions": "1. Beat the eggs thoroughly in a shallow bowl. Sift together the flour, sage, salt, black pepper, onion powder, and garlic powder in a bowl to combine. 2. Heat the vegetable oil in a large, deep skillet over medium-high heat. Oil should be about 2 inches deep. Dip chicken pieces into the beaten egg, then dredge in the seasoned flour to thoroughly coat. 3. Fry chicken in the hot oil until golden brown on the first side, about 10 minutes; reduce heat to medium, and fry chicken on second side until golden brown and the meat is no longer pink inside, about 20 more minutes. An instant-read meat thermometer inserted into the thickest part of a thigh should read 160 degrees F (70 degrees C).",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "661"
},
{
  "url": "https://www.allrecipes.com/recipe/18059/eves-chicken-quarters/",
  "name": "Eve's Chicken Quarters",
  "rating": "4.3",
  "ratingcount": "105",
  "ingredients": "4  chicken leg quarters; 1 (4.5 ounce) package instant long grain and wild rice; 2 cups water; 1 (10.75 ounce) can  condensed cream of chicken soup; 1 (8 ounce) container sour cream; 2 cloves garlic, crushed; 1 tablespoon minced garlic; 1 cup chopped broccoli",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Place chicken quarters in a 9x13 inch baking dish and bake in preheated oven, covered, for 45 minutes. 3. Meanwhile, in a large bowl combine rice and seasoning packages, water, soup, sour cream, crushed garlic, minced garlic and broccoli. Mix well. 4. Remove chicken to a platter and drain oil. Spread rice mixture in the bottom of the baking dish, then arrange chicken on top of rice. Bake uncovered for 30 to 45 minutes, or until wild rice is opened up and liquid is absorbed.",
  "prep": "10 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 40 mins",
  "calories": "629"
},
{
  "url": "https://www.allrecipes.com/recipe/273998/cornflake-crusted-chicken-drumsticks-in-the-air-fryer/",
  "name": "Cornflake-Crusted Chicken Drumsticks in the Air Fryer",
  "rating": "4.8",
  "ratingcount": "12",
  "ingredients": "1  egg; 1 tablespoon water; ½ cup cornflake crumbs; ½ teaspoon garlic powder; ½ teaspoon onion powder; ½ teaspoon salt; ¼ teaspoon Cajun seasoning; ¼ teaspoon chili powder; ¼ teaspoon paprika; 6  large chicken drumsticks; salt to taste; nonstick cooking spray",
  "directions": "1. Mix together egg and water in a shallow bowl. Combine cornflake crumbs, garlic powder, onion powder, 1/2 teaspoon salt, Cajun seasoning, chili powder, and paprika in a second shallow bowl. 2. Preheat the air fryer to 400 degrees F (200 degrees C). 3. Season drumsticks on both sides lightly with salt. Dip each drumstick into the egg mixture, followed by the cornflake mixture, rolling drumsticks and pressing down to ensure all surfaces are coated. 4. Spray the top of the chicken with cooking spray and place, sprayed side down, into the air fryer basket. Spray top of the drumsticks - you may need to put the drumsticks on their side depending on how large they are. 5. Air-fry for 10 minutes and carefully turn them over. Lower the temperature to 325 degrees F (160 degrees C). Cook for an additional 10 minutes or until the internal temperature of the chicken is at least 165 degrees F (74 degrees C). Check doneness after 5 minutes as drumstick size will determine time.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "536"
},
{
  "url": "https://www.allrecipes.com/recipe/216398/garlic-roasted-chicken-and-potatoes/",
  "name": "Garlic Roasted Chicken and Potatoes",
  "rating": "4.6",
  "ratingcount": "537",
  "ingredients": "¼ cup butter; 6  chicken leg quarters, split into drumsticks and thighs; 6 large Yukon Gold potatoes, cut into chunks; 24 cloves garlic, unpeeled; salt and ground black pepper to taste; ¼ cup maple syrup",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). 2. Place the butter into a roasting pan, and melt in the oven. When butter is melted, swirl to coat the bottom of the roasting pan, and place the chicken drumsticks and thighs, potatoes, and unpeeled garlic cloves into the pan. Sprinkle with salt and black pepper; turn the chicken, potatoes, and garlic to coat with butter. 3. Bake in the preheated oven until the chicken is no longer pink inside and the juices run clear, about 40 minutes, basting 3 times with pan drippings. Brush maple syrup over the chicken pieces, and spoon pan drippings over the potatoes. 4. Return to oven, and bake until the chicken and potatoes are tender and browned, about 20 more minutes. An instant-read thermometer inserted into a thick part of a thigh should read at least 165 degrees F (74 degrees C). To serve, squeeze garlic from the baked cloves, and spread the soft garlic over the chicken. Pour pan juices over chicken and potatoes.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "464"
},
{
  "url": "https://www.allrecipes.com/recipe/272539/orange-marmalade-chicken/",
  "name": "Orange Marmalade Chicken",
  "rating": "4.6",
  "ratingcount": "11",
  "ingredients": "6  chicken drumsticks; salt and ground black pepper to taste; ½ cup orange marmalade; 2 tablespoons Dijon mustard; 2 tablespoons barbeque sauce; 1 tablespoon sambal oelek; ½ tablespoon soy sauce",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Season drumsticks with salt and pepper and place in an oven-proof dish. 3. Bake in the preheated oven for 20 minutes. 4. Combine orange marmalade, Dijon mustard, barbeque sauce, sambal oelek, and soy sauce in a small bowl. 5. Remove dish from oven and brush chicken with marmalade mixture. Return to the oven and bake an additional 10 minutes. 6. Remove dish again, turn chicken over, brush with marmalade mixture, and continue baking until chicken is no longer pink at the bone and the juices run clear, about 10 more minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 7. Remove dish from oven and baste chicken with remaining marmalade mixture. Preheat the oven's broiler. Return to the oven and broil until chicken starts to blacken and blister, 3 to 5 minutes.",
  "prep": "5 mins",
  "cook": "40 mins",
  "total": "45 mins",
  "calories": "408"
},
{
  "url": "https://www.allrecipes.com/recipe/85482/jennys-cuban-style-slow-cooker-chicken-fricassee/",
  "name": "Jenny's Cuban-Style Slow-Cooker Chicken Fricassee",
  "rating": "4.0",
  "ratingcount": "109",
  "ingredients": "1 large onion, chopped; 6 cloves garlic, chopped; ½  green bell pepper, chopped; 8 small whole peeled potatoes; 1 (8 ounce) can tomato sauce; ½ cup dry white wine; ½ tablespoon cumin; 1 leaf fresh sage; salt and pepper to taste; 2 pounds chicken leg quarters",
  "directions": "1. Combine onion, garlic, bell pepper, and potatoes in a medium bowl. Stir in tomato sauce and wine; season with cumin, sage leaf, salt, and pepper. 2. Place chicken legs in the slow cooker. Pour onion mixture over chicken. 3. Cover and cook on Low until juices run clear, 6 to 8 hours.",
  "prep": "15 mins",
  "cook": "6 hrs",
  "total": "6 hrs 15 mins",
  "calories": "316"
},
{
  "url": "https://www.allrecipes.com/recipe/254685/chicken-cacciatore-pasta/",
  "name": "Chicken Cacciatore Pasta",
  "rating": "4.6",
  "ratingcount": "9",
  "ingredients": "4 (11 ounce) chicken leg quarters; 1 ¾ teaspoons salt, or more to taste, divided; 3 tablespoons vegetable oil; 1  red bell pepper, cut into strips; 1 cup sliced onion; 6 cloves garlic, thinly sliced; 2 tablespoons chopped fresh oregano; 1 ½ teaspoons dried thyme; 1 (28 ounce) can tomato puree; ½ cup water; 1 (15.5 ounce) can cannellini beans, drained and rinsed; 2 tablespoons red wine vinegar; 8 ounces dried fusilli or penne pasta",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Sprinkle chicken with 1 teaspoon salt. Heat oil in a wide, heavy, oven-safe pot over medium-high heat until hot but not smoking, about 1 minute. Add chicken, skin sides down, and cook, turning once, until browned, about 10 minutes. Transfer to a plate. 3. Pour off all but 2 tablespoons fat. Reduce heat to medium and cook pepper, onion, and garlic, stirring, until softened, about 5 minutes. Stir in oregano, thyme, tomato puree, water, and remaining 3/4 teaspoon salt; bring to a simmer. Return chicken to pot, return to a simmer, cover, and transfer to oven. Bake until chicken is tender, 45 to 50 minutes. 4. Transfer chicken to a bowl and chill, uncovered, until cool enough to handle (20 minutes). Discard skin and bones. Pull meat into coarse shreds. 5. Add chicken, beans, and vinegar to tomato mixture in pot and simmer until heated through, about 5 minutes. 6. Meanwhile, cook pasta in salted water according to package directions. Drain, reserving 1 cup pasta water. Stir pasta into chicken mixture, thinning with pasta water as needed. Season with additional salt, if desired.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 50 mins",
  "calories": "631"
},
{
  "url": "https://www.allrecipes.com/recipe/237992/roasted-greek-chicken/",
  "name": "Roasted Greek Chicken",
  "rating": "4.6",
  "ratingcount": "135",
  "ingredients": "4  chicken leg quarters, with bone and skin; ¼ cup olive oil; 4  lemons, halved; 4 teaspoons dried oregano; 4 teaspoons dried basil; 4 teaspoons garlic powder; 4 teaspoons salt; 4 teaspoons ground black pepper",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Place chicken legs in a deep, large baking dish. Massage 1 tablespoon olive oil onto each chicken leg. Squeeze lemon juice over the chicken. Arrange lemons around the chicken. 3. Mix oregano, basil, garlic powder, salt, and pepper together in a bowl; sprinkle evenly over each chicken leg, flipping the chicken to season both sides. 4. Cook chicken in the preheated oven until no longer pink at the bone and the juices run clear, about 1 hour 15 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 25 mins",
  "calories": "516"
},
{
  "url": "https://www.allrecipes.com/recipe/215207/apricot-chicken-curry/",
  "name": "Apricot Chicken Curry",
  "rating": "4.8",
  "ratingcount": "12",
  "ingredients": "8  chicken drumsticks; salt and pepper to taste; 2 tablespoons olive oil; 3 cloves garlic, minced; ½ teaspoon red pepper flakes, or to taste; 4 cups apricot nectar; 1 tablespoon water; 1 teaspoon cornstarch, or as needed; 3 tablespoons Madras curry powder; 1 cup dried apricots; 4 medium carrots, thinly sliced; 1 large onion, roughly chopped; 1 large green bell pepper, roughly chopped; 1  fresh green chile pepper, minced (Optional); ½ cup chopped water chestnuts (Optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Season chicken with salt and pepper. 2. Heat oil in a large cast iron skillet over medium heat. Add garlic and red pepper flakes; cook and stir until garlic is soft and fragrant, 1 to 2 minutes. Add chicken and brown for about 3 minutes per side. 3. Transfer the skillet to the preheated oven and bake until chicken is no longer pink at the bone and the juices run clear, 7 to 10 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 4. Bring apricot nectar to a boil in a large pot over medium-high heat, then reduce then heat to medium-low. Mix water and cornstarch together in a small bowl; stir into apricot nectar. Stir in curry powder, then apricots. Add baked chicken. 5. Place the cast iron skillet with chicken drippings over medium heat. Stir in carrots, onion, bell pepper, and chile pepper; cook and stir until onion is translucent, about 5 minutes. Pour chicken and apricot sauce into the skillet; cover and simmer until vegetables are tender, about 10 minutes. Season again with salt and pepper. Stir in water chestnuts just before serving.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "649"
},
{
  "url": "https://www.allrecipes.com/recipe/8352963/golden-chicken/",
  "name": "Golden Chicken",
  "rating": "5.0",
  "ratingcount": "16",
  "ingredients": "4 (12 ounce) chicken leg quarters; 2 teaspoons kosher salt, plus more to taste; 1 tablespoon olive oil; 1 cup diced onion; ½ cup diced celery; ½ cup diced jalapeño pepper; 2 teaspoons ground cumin; 1 teaspoon smoked paprika; ¼ teaspoon ground coriander; ¼ teaspoon ground turmeric; ½ teaspoon freshly ground black pepper; ⅛ teaspoon cayenne pepper; ⅛ teaspoon ground cinnamon; 3 cloves garlic, crushed; 1 tablespoon tomato paste; 3 tablespoons white wine vinegar; 2 ½ cups cold water; 1 teaspoon saffron threads, crushed; 1 teaspoon dried currants; 1 teaspoon chicken bouillon base",
  "directions": "1. Place chicken leg quarters on a work surface with the skin facing up. Make a cut into the thickest part of each drumstick, all the way down to the bone. Then make two cuts, about 1 inch apart, right in the center of each thigh. Season both sides generously with 2 teaspoons kosher salt. 2. Heat oil in a large skillet over high heat. Add chicken, skin-side down, and sear until skin is nicely browned, 5 to 6 minutes. Flip and sear for 2 more minutes. Turn off the heat and remove chicken to a plate, leaving any rendered fat in the skillet. 3. Turn the heat back on to medium; add onion, celery, jalapeño, and a pinch of salt to the skillet. Sauté until onion turns translucent and veggies have softened, 5 to 7 minutes. Add cumin, paprika, coriander, turmeric, pepper, cayenne, cinnamon, and garlic; cook and stir until garlic has cooked a bit and spices are toasted, about 2 minutes. 4. Stir in tomato paste, vinegar, water, and saffron. Increase heat to high and stir in currants and chicken base; bring to a simmer. 5. Add chicken to the skillet, skin-side up, and reduce heat to low. Baste chicken with the liquid. Cover and cook over low or medium-low heat at a gentle simmer for 1 hour. 6. Flip chicken, cover, and simmer gently until the meat is fork-tender and almost falling off the bone, about 30 more minutes. 7. Flip and baste chicken again. Increase heat to medium and cook, uncovered, until chicken is very tender and the braising liquid has reduced a bit, 20 to 30 minutes more. 8. Taste the braising liquid and adjust seasoning if needed before serving.",
  "prep": "15 mins",
  "cook": "2 hrs 10 mins",
  "total": "2 hrs 25 mins",
  "calories": "707"
},
{
  "url": "https://www.allrecipes.com/recipe/74705/spicy-hot-chicken-legs/",
  "name": "Spicy Hot Chicken Legs",
  "rating": "4.2",
  "ratingcount": "380",
  "ingredients": "12  chicken drumsticks; 1 (5 ounce) bottle hot red pepper sauce; ¼ cup butter, cubed; ½ teaspoon garlic powder; ½ teaspoon onion powder; salt and pepper to taste; 1 ½ cups blue cheese salad dressing",
  "directions": "1. Place drumsticks in a slow cooker, and sprinkle evenly with pieces of butter. Pour hot sauce over the chicken, then season with garlic powder, onion powder, salt, and pepper. 2. Cover, and cook on High for 3 hours, or until tender. Serve chicken legs with blue cheese dressing on the side.",
  "prep": "5 mins",
  "cook": "3 hrs",
  "total": "3 hrs 5 mins",
  "calories": "685"
},
{
  "url": "https://www.allrecipes.com/recipe/231544/authentic-chicken-adobo/",
  "name": "Authentic Chicken Adobo",
  "rating": "4.5",
  "ratingcount": "22",
  "ingredients": "2 cups coconut vinegar; ½ cup soy sauce; 1 head garlic, peeled and coarsely chopped; 10  bay leaves; 1 tablespoon garlic powder; 1 ½ teaspoons ground black pepper; 1 ½ teaspoons annatto powder; 5 ½ pounds cut-up chicken parts; 3 tablespoons vegetable oil, divided; 1 head garlic, peeled and coarsely chopped; 1 ½ teaspoons annatto powder",
  "directions": "1. Combine vinegar, soy sauce,1 head garlic, bay leaves, garlic powder, black pepper, and 1 1/2 teaspoons annatto powder in a large bowl. Add chicken, stir to coat with marinade, cover, and refrigerate for at least 4 hours. 2. Remove chicken from the marinade and pat dry. Reserve the marinade. 3. Heat 2 tablespoons vegetable oil in a large skillet over medium-high heat. Cook chicken in the hot oil until browned, about 4 minutes per side. Remove skillet from heat. 4. Heat 1 tablespoon vegetable oil in a small skillet over medium heat. Cook and stir 1 head garlic until browned, about 3 minutes. Add 1 1/2 teaspoons annatto powder; simmer for 3 minutes. 5. Pour annatto mixture over chicken and add reserved marinade. Bring to a simmer, cover, and cook until chicken is tender, about 45 minutes. Uncover and cook until sauce has reduced slightly, about 10 minutes.",
  "prep": "20 mins",
  "cook": "1 hr 30 mins",
  "total": "5 hrs 50 mins",
  "calories": "635"
},
{
  "url": "https://www.allrecipes.com/recipe/259978/nigerian-jollof-rice-with-chicken-and-fried-plantains/",
  "name": "Nigerian Jollof Rice with Chicken and Fried Plantains",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "2 pounds chicken drumsticks; ½ large onion, diced; 1 (2 inch) piece fresh ginger root, peeled and thinly sliced; 2 cubes  chicken bouillon, crushed; 2 cloves garlic, diced; 1 tablespoon curry powder, or more to taste; 1 teaspoon herbes de Provence; freshly ground black pepper; 1 pinch cayenne pepper; 1 cup water; 3 tablespoons vegetable oil; ½ large onion, diced; 1 (14 ounce) can tomato sauce; 1 (14 ounce) can coconut milk; 1 teaspoon herbes de Provence; 1 teaspoon salt, or to taste; ½ teaspoon ground black pepper, or to taste; 3 cups parboiled rice (such as Uncle Ben's®); 1 (10 ounce) package frozen mixed vegetables (carrots, corn, peas); 4  ripe plantains, peeled and cut diagonally into 1/2-inch slices; ½ cup canola oil for frying",
  "directions": "1. Place chicken drumsticks in a large Dutch oven over medium heat. Add 1/2 onion, ginger, crushed bouillon cubes, garlic, curry powder, 1 teaspoon herbes de Provence, black pepper, and cayenne pepper. Mix well. Cook until chicken starts sticking to the bottom, about 5 minutes. Pour in water, mix, cover the pot, and bring to a gentle simmer; cook for 15 minutes. Remove from heat. 2. Transfer chicken to a baking dish using a slotted spoon. Strain cooking liquid through a fine-mesh sieve. Reserve 1 1/2 cups liquid. Discard solids. 3. Preheat oven to 400 degrees F (200 degrees C). 4. Bake chicken in the preheated oven until no longer pink in the middle and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the thickest part should read 165 degrees F (74 degrees C). 5. Heat 3 tablespoons vegetable oil in a large pot over medium-low heat and cook 1/2 onion until soft and translucent but not browned, about 5 minutes. Add tomato sauce; cook and stir until slightly thickened and infused into the oil, 5 to 7 minutes. 6. Stir reserved chicken broth, coconut milk, 1 teaspoon herbes de Provence, salt, and pepper into the pot. Bring to a simmer; add rice. Cook, stirring often, until rice is almost tender, 15 to 20 minutes. Add frozen vegetables and continue cooking until rice is tender and creamy, about 5 minutes. 7. Heat 1/2 cup of canola oil in a nonstick pan over medium heat. Add plantains and fry on both sides until golden and crispy, about 2 to 3 minutes per side. Drain on paper towels. Garnish jollof rice with friend plantains and serve with chicken.",
  "prep": "25 mins",
  "cook": "1 hr 4 mins",
  "total": "1 hr 29 mins",
  "calories": "703"
},
{
  "url": "https://www.allrecipes.com/recipe/235165/roasted-orange-rosemary-honey-glazed-chicken/",
  "name": "Honey Orange Glazed Chicken",
  "rating": "4.4",
  "ratingcount": "126",
  "ingredients": "8  large chicken legs; 1 tablespoon salt; 1 cup honey; 1 cup orange juice with pulp; ½ cup unsalted butter, at room temperature; 7 sprigs fresh rosemary, finely chopped; 2  oranges, zested; 2 cloves garlic, minced (Optional); ground black pepper to taste",
  "directions": "1. Sprinkle chicken with salt and place in a large glass or plastic bowl. 2. Whisk together honey, orange juice with pulp, butter, rosemary, orange zest, garlic, and pepper in a separate bowl. Pour orange mixture over chicken; cover with plastic wrap and refrigerate for at least 1 hour to overnight. 3. Preheat the oven to 350 degrees F (175 degrees C). 4. Place chicken in a single layer in a roasting pan; pour orange mixture over chicken. 5. Bake in the preheated oven for 30 minutes. Baste chicken with pan juices and reduce oven temperature to 325 degrees F (160 degrees C). Continue basting chicken every 20 minutes and cook until chicken is a deep orange-brown color, no longer pink at the bone, and the juices run clear, about 90 minutes. An instant-read thermometer inserted into the thickest part of the meat near the bone should read at least 165 degrees F (74 degrees C).",
  "prep": "20 mins",
  "cook": "2 hrs",
  "total": "3 hrs 20 mins",
  "calories": "777"
},
{
  "url": "https://www.allrecipes.com/recipe/276018/air-fried-peruvian-chicken-drumsticks-with-green-crema/",
  "name": "Air-Fried Peruvian Chicken Drumsticks with Green Crema",
  "rating": "4.8",
  "ratingcount": "22",
  "ingredients": "olive oil for brushing; 1 tablespoon honey; 1 tablespoon olive oil; 2 cloves garlic, grated; 1 teaspoon salt; 1 teaspoon ground cumin; ½ teaspoon smoked paprika; ½ teaspoon dried oregano; ¼ teaspoon ground black pepper; 6 (4 ounce) chicken drumsticks; 1 cup baby spinach leaves, stems removed; ¾ cup sour cream; ¼ cup cilantro leaves; ½  jalapeno pepper, seeded; 2 tablespoons fresh lime juice; 1 clove garlic, smashed; ¼ teaspoon salt; ¼ teaspoon ground black pepper",
  "directions": "1. Brush an air fryer basket with olive oil. 2. Combine honey, 1 tablespoon olive oil, garlic, salt, cumin, paprika, oregano, and pepper in a large bowl. Add drumsticks; toss to coat. Arrange drumsticks vertically in the prepared basket, leaning against the basket wall and one another. 3. Cook in the air fryer at 400 degrees F (200 degrees C) until an instant-read thermometer inserted in the thickest part of drumstick reads 165 degrees F (74 degrees C), 15 to 20 minutes. Rearrange drumsticks with kitchen tongs halfway through cooking for even cooking. 4. Meanwhile, make sauce: Combine spinach, sour cream, cilantro, jalapeño, lime juice, garlic, salt, and pepper in the bowl of a food processor; process until crema sauce is smooth. 5. Drizzle some crema sauce over drumsticks and serve with remaining crema.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "271"
},
{
  "url": "https://www.allrecipes.com/recipe/242438/easy-grilled-chicken-from-reynolds-wrap/",
  "name": "Easy Grilled Chicken from Reynolds Wrap®",
  "rating": "3.9",
  "ratingcount": "10",
  "ingredients": "3 pounds chicken drumsticks and thighs; 1 (16 ounce) bottle Italian salad dressing; ⅓ cup lemon juice; ⅓ cup honey; ¼ cup Worcestershire sauce; 2 teaspoons paprika; Reynolds Wrap® Heavy Duty Aluminum Foil",
  "directions": "1. Rinse chicken under cold water pat dry. 2. Combine Italian salad dressing, lemon juice, honey, Worcestershire sauce and paprika in a plastic zipper bag. Reserve 1/2 cup marinade for basting chicken during grilling. Add chicken. Close the bag and turn to coat chicken. Marinate 1 hour, turning chicken once. Remove chicken from marinade and discard marinade. 3. Preheat grill to medium. Tear off a sheet of Reynolds Wrap® 18-inch Wide Heavy Duty Aluminum Foil long enough to cover grill grate. Make drainage holes in sheet foil with a large grilling fork. 4. Place aluminum foil sheet with holes on grill rack. Immediately place chicken on aluminum foil. 5. Grill chicken 5 minutes; turn. Continue grilling and turning every 5 minutes until chicken is tender and reaches 180 degrees F, about 30 minutes. Brush with reserved marinade during last 5 minutes grilling time.",
  "prep": "",
  "cook": "30 mins",
  "total": "30 mins",
  "calories": "958"
},
{
  "url": "https://www.allrecipes.com/recipe/230854/perfect-crispy-fried-chicken/",
  "name": "Perfect Crispy Fried Chicken",
  "rating": "4.3",
  "ratingcount": "23",
  "ingredients": "3  chicken leg quarters, cut into thighs and drumsticks; 2 cups buttermilk, or as needed to cover; ¾ cup all-purpose flour; ¼ cup cornmeal; 1 tablespoon salt; 1 teaspoon granulated onion; 1 teaspoon granulated garlic; 1 teaspoon ground thyme; ½ teaspoon paprika; ¼ teaspoon monosodium glutamate (MSG) (Optional); ¼ teaspoon baking powder; ⅛ teaspoon cayenne pepper; 4 large egg whites, beaten until foamy; 4 cups vegetable oil for frying, or as needed",
  "directions": "1. Place chicken thighs and drumsticks in a bowl and pour enough buttermilk over chicken to cover. Cover and refrigerate for 12 to 24 hours. 2. Combine flour, cornmeal, salt, granulated onion, granulated garlic, thyme, paprika, monosodium glutamate, baking powder, and cayenne pepper in a large, wide bowl. 3. Remove chicken from buttermilk and shake off excess; discard buttermilk. Pat chicken dry with paper towels. Dip chicken in beaten egg whites, then press in flour mixture to coat. Allow coated chicken to rest on a wire rack for 20 to 30 minutes. 4. Meanwhile, fill a cast iron skillet or deep fryer to about 1/3 full of oil and heat to 350 degrees F (175 degrees C). Preheat the oven to 250 degrees F (120 degrees C). 5. Fry chicken in hot oil in batches until golden brown, no longer pink in the center, and the juices run clear, 8 to 10 minutes per side. An instant-read thermometer inserted into the center of chicken near the bone should read at least 165 degrees F (74 degrees C). Transfer fried chicken to a wire rack or a paper towel-lined tray to drain. Keep fried chicken warm in the preheated oven while frying remaining pieces.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "13 hrs 10 mins",
  "calories": "767"
},
{
  "url": "https://www.allrecipes.com/recipe/8636/parmesan-chicken-ii/",
  "name": "Parmesan Chicken Legs",
  "rating": "4.4",
  "ratingcount": "645",
  "ingredients": "1 large egg; 2 cups grated Parmesan cheese; 1 teaspoon ground black pepper; 1 teaspoon salt; 12  chicken drumsticks",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a baking dish with foil. 2. Whisk egg in a shallow bowl. Mix Parmesan, pepper, and salt together in another shallow bowl. Dip each chicken drumstick in egg; lift up so excess egg drips back into the bowl. Roll in Parmesan mixture until well coated. Place into the prepared baking pan. 3. Bake in the preheated oven until golden brown on the outside, no longer pink at the bone, and the juices run clear, about 45 minutes. An instant-read thermometer inserted near the bone should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "466"
},
{
  "url": "https://www.allrecipes.com/recipe/272540/instant-pot-hawaii-style-shoyu-chicken-drumsticks/",
  "name": "Instant Pot® Hawaii-Style Shoyu Chicken Drumsticks",
  "rating": "4.6",
  "ratingcount": "12",
  "ingredients": "1 cup soy sauce; ½ cup water; ½ cup brown sugar; ¼ cup honey; 2 tablespoons mirin (Japanese sweet wine); 1 teaspoon ground ginger; 2 cloves garlic, minced; 1 pinch red pepper flakes; 1 ½ pounds chicken drumsticks; 2 tablespoons cold water; 1 tablespoon potato starch",
  "directions": "1. Combine soy sauce, 1/2 cup water, brown sugar, honey, mirin, ginger, garlic, and red pepper flakes in a large bowl to make the sauce. 2. Place drumsticks into a multi-functional pressure cooker (such as Instant Pot®) and pour sauce on top. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 15 minutes. Allow 10 to 15 minutes for pressure to build. 3. Release pressure using the natural-release method according to manufacturer's instructions, 10 to 20 minutes. Remove drumsticks and set aside. 4. Switch to Saute function and bring sauce to a boil. Mix 2 tablespoons cold water and potato starch in a small bowl to make a thick slurry. Quickly stir mixture into the sauce and continue stirring until sauce has thickened to your preferred consistency. Serve drumsticks with sauce.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "302"
},
{
  "url": "https://www.allrecipes.com/recipe/204963/peruvian-arroz-con-pollo/",
  "name": "Peruvian Arroz con Pollo",
  "rating": "4.5",
  "ratingcount": "64",
  "ingredients": "¼ cup vegetable oil, divided; 6  chicken thighs, skinned and patted dry; 6  chicken drumsticks with skin, patted dry; salt and black pepper to taste; 1 ½ bunches fresh cilantro, leaves picked from stems; 6 cloves garlic, peeled and coarsely chopped; 1  aji (Peruvian) pepper, seeded and deveined; 1 tablespoon Worcestershire sauce; ½ cup orange juice; 2 cups uncooked white rice; 2  onions, chopped; ½ cup white wine; 3 ½ cups chicken broth; 1 teaspoon freshly ground black pepper; 1 large carrot, peeled and diced; 1  bell pepper, any color, sliced into rings; ¾ cup frozen peas",
  "directions": "1. Place two large skillets over medium heat, pour 2 tablespoons of vegetable oil into each, and heat the oil until it ripples. Season the chicken with salt and pepper, divide between the two skillets, and fry until golden brown and crisp, about 15 minutes. Use screens over the skillets, if needed, to control spattering. Remove the chicken from the skillets, and drain on paper towels. 2. Place the cilantro leaves, garlic, aji pepper, Worcestershire sauce, and orange juice into a blender, and blend until smooth. Pour the mixture into one of the skillets, bring to a simmer, and cook and stir over medium-low heat until the mixture turns from bright to dark green, about 5 minutes. 3. Place the chopped onions into the other skillet, and cook and stir over medium-low heat until the onions turn translucent, 5 to 7 minutes. Stir in the rice, and cook and stir until the rice starts to turn opaque, about 5 minutes. 4. Pour the white wine into the blender and pulse a few times to rinse off any extra cilantro mixture from the blender, and pour the wine into the skillet containing the cilantro mixture. Bring the mixture back to a simmer over medium heat, scrape the rice and onions into the cilantro mixture, stir in the chicken broth and black pepper, and bring to a boil. Place the browned chicken pieces and carrots into the skillet, stir to combine, and cover. Reduce heat, and cook until the rice is separate and the chicken is no longer pink in the center, about 30 minutes. 5. Remove the lid, place the pepper rings on the rice, and sprinkle with frozen peas. Cover and cook without stirring until the peppers and peas are tender, about 15 minutes. Uncover the skillet and allow the dish to rest for 5 minutes before serving.",
  "prep": "25 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 35 mins",
  "calories": "739"
},
{
  "url": "https://www.allrecipes.com/recipe/255262/garlic-lime-roasted-chicken-drumsticks/",
  "name": "Garlic-Lime Roasted Chicken Drumsticks",
  "rating": "4.3",
  "ratingcount": "56",
  "ingredients": "¼ cup olive oil; 1  large lime, juiced, or more to taste; 2 teaspoons garlic powder; 2 teaspoons onion powder; 1 teaspoon chili powder; 1 teaspoon dried oregano; 1 teaspoon dried parsley flakes; ½ teaspoon ground black pepper; 10  skinless chicken drumsticks",
  "directions": "1. Combine olive oil, lime juice, garlic powder, onion powder, chili powder, oregano, parsley, and pepper in a gallon-size resealable plastic bag. Add chicken drumsticks, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator at least 2 hours and preferably overnight. 2. Preheat the oven to 425 degrees F (220 degrees C). 3. Meanwhile, line a baking sheet with aluminum foil. Remove drumsticks from marinade, shake off excess, and arrange on the baking sheet. Discard remaining marinade. Let chicken come to room temperature until the oven has preheated. 4. Roast in the preheated oven until browned, about 25 minutes. Flip chicken and baste with juices; continue cooking until browned on the second side, 10 to 15 minutes more. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 5. Cover chicken with aluminum foil. Let stand before serving, about 5 minutes.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "3 hrs 15 mins",
  "calories": "194"
},
{
  "url": "https://www.allrecipes.com/recipe/109642/grandmas-favorite-chicken/",
  "name": "Grandma's Favorite Chicken",
  "rating": "4.2",
  "ratingcount": "105",
  "ingredients": "8  chicken legs; 5 large white potatoes; 1 (8 ounce) package baby carrots; 5 cloves garlic; 2  yellow squash, quartered lengthwise and cut crosswise into 1/2-inch slices; 1 large onion, peeled and sliced; 1 tablespoon dried parsley flakes; ½ tablespoon garlic powder; salt to taste; black pepper to taste; 4 tablespoons butter, divided; 2 cups water, or as needed",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Place the chicken legs in a 9x13 inch baking dish. Arrange potatoes, carrots, garlic, and squash around the chicken. Top with onion slices. Season with parsley, garlic powder, salt, and pepper. Place 1/2 tablespoon butter on each chicken leg. Pour water into pan to a level of about 1/2 inch. 3. Cover pan with foil and cook 1 hour in the preheated oven. Remove foil and continue cooking 20 minutes, until vegetables are tender and chicken juices run clear.",
  "prep": "15 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 35 mins",
  "calories": "520"
},
{
  "url": "https://www.allrecipes.com/recipe/9018/chutney-chicken/",
  "name": "Chutney Chicken",
  "rating": "4.3",
  "ratingcount": "122",
  "ingredients": "12  chicken thighs; 1 (12 ounce) jar hot chutney; 1 (1 ounce) package dry onion soup mix",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. In a medium bowl, combine chutney and dry soup mix. Mix together. Season chicken pieces with salt and pepper to taste. Place seasoned chicken pieces in a 9x13 inch baking dish and pour chutney mixture over chicken. 3. Bake in the preheated oven for 45 to 60 minutes, or until chutney sauce has turned brown and crunchy.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "495"
},
{
  "url": "https://www.allrecipes.com/recipe/276116/easy-grilled-chicken-drumsticks/",
  "name": "Easy Grilled Chicken Drumsticks",
  "rating": "4.0",
  "ratingcount": "2",
  "ingredients": "4  chicken drumsticks; olive oil as needed; 1 (1 ounce) package ranch dressing mix; 1 pinch cayenne pepper, or to taste; salt and ground black pepper to taste",
  "directions": "1. Place chicken drumsticks into a resealable bag; add olive oil to coat. Add ranch dressing mix, cayenne pepper, salt, and black pepper. Close the bag and mix until drumsticks are covered. Let marinate in the refrigerator, 30 minutes to 1 hour. 2. Preheat an outdoor grill for medium heat and lightly oil the grate. Remove chicken from the bag; discard marinade. 3. Cook on the preheated grill until an instant-read thermometer inserted into a drumstick reads at least 165 degrees F (74 degrees C), 20 to 25 minutes. Remove from the grill and let sit for 5 to 10 minutes before serving.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "199"
},
{
  "url": "https://www.allrecipes.com/recipe/8378238/baked-bbq-chicken-drumsticks/",
  "name": "Baked BBQ Chicken Drumsticks",
  "rating": "4.8",
  "ratingcount": "8",
  "ingredients": "1 ½ pounds chicken drumsticks; ¼ cup extra-virgin olive oil; 1 teaspoon salt; ½ teaspoon freshly ground black pepper; ½ teaspoon paprika; ¼ teaspoon garlic powder; ¼ teaspoon onion powder; ¼ teaspoon cayenne pepper; 1 ½ cups barbeque sauce (such as Sweet Baby Ray's®), or more to taste",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with foil. 2. Mix olive oil, salt, pepper, paprika, garlic powder, onion powder and cayenne together in a large bowl. Add drumsticks and toss to coat. Spread out on the prepared baking sheet. 3. Bake in the preheated oven for 20 minutes. Remove from oven and brush with barbeque sauce. Bake for 7 to 8 minutes. Flip drumsticks, brush with barbeque sauce, and bake an additional 7 to 8 minutes. 4. Set an oven rack about 6 inches from the heat source and turn on the oven's broiler. 5. Brush drumsticks with more barbeque sauce and broil for 3 to 4 minutes. Flip drumsticks, brush with barbeque sauce, and broil until chicken is no longer pink at the bone and the juices run clear, 3 to 4 more minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "725"
},
{
  "url": "https://www.allrecipes.com/recipe/25699/sweet-and-sour-drumettes/",
  "name": "Sweet and Sour Drumettes",
  "rating": "4.5",
  "ratingcount": "381",
  "ingredients": "8  chicken drumettes; 2  eggs, beaten; ¼ cup all-purpose flour for coating; 3 tablespoons soy sauce; 3 tablespoons water; 1 cup white sugar; ½ cup vinegar",
  "directions": "1. Dip chicken in egg beat, then flour. Fry in a large skillet until crispy, about 15 minutes. Drain and place in a 9x13 inch baking dish. 2. Preheat oven to 350 degrees F (175 degrees C). 3. To Make Sauce: In a small bowl combine the soy sauce, water, sugar and vinegar. Mix together and pour over chicken. 4. Bake in the preheated oven for 30 minutes, or until cooked through and juices run clear.",
  "prep": "40 mins",
  "cook": "30 mins",
  "total": "1 hr 10 mins",
  "calories": "487"
},
{
  "url": "https://www.allrecipes.com/recipe/8722/mexican-chicken-i/",
  "name": "Mexican Chicken I",
  "rating": "4.4",
  "ratingcount": "474",
  "ingredients": "6  skinless, boneless chicken breast halves; 1 (20 ounce) jar salsa; 1 large red bell pepper, chopped; 2 tablespoons ground cumin; 2 tablespoons lemon juice; 2 tablespoons chili powder; 3 cloves crushed garlic; 2 (15 ounce) cans black beans, rinsed and drained",
  "directions": "1. Preheat oven to 400 degrees F (205 degrees C). 2. Arrange the chicken pieces in a 3 quart casserole dish or a 9x13 inch baking dish. Combine the salsa, red bell pepper, cumin, lemon juice, chili powder and garlic. Pour the mixture over the chicken. Pour the black beans on top and cover. Bake in the preheated oven for 1 to 1 1/2 hours. Serve with rice if desired.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "301"
},
{
  "url": "https://www.allrecipes.com/recipe/204815/bacon-roasted-chicken-with-potatoes/",
  "name": "Bacon-Roasted Chicken with Potatoes",
  "rating": "4.4",
  "ratingcount": "456",
  "ingredients": "6  chicken thighs; 6  chicken drumsticks; 12 slices center-cut bacon; salt and black pepper to taste; 1  onion, coarsely chopped; 1 ½ pounds baby Dutch yellow potatoes; 2 tablespoons dried chives; 2 tablespoons dried basil; 1 tablespoon garlic powder; 1 tablespoon adobo seasoning; 1 tablespoon ground black pepper; 1 teaspoon salt, or to taste",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). 2. Wrap each chicken piece in a slice of bacon, trying to cover as much chicken as possible. Place wrapped chicken pieces in a 9x13-inch baking dish, season with salt and pepper and sprinkle onion over chicken. Push potatoes down into the spaces between chicken pieces and around the edge of the dish. 3. Combine chives, basil, garlic powder, adobo seasoning, and black pepper in a small bowl and sprinkle seasoning to taste over chicken and potatoes. 4. Bake in the preheated oven for 1 hour, until bacon is crisp and brown and potatoes are tender. Sprinkle with salt, if desired, and serve hot.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "548"
},
{
  "url": "https://www.allrecipes.com/recipe/46165/oven-fried-chicken-iv/",
  "name": "Oven Fried Chicken IV",
  "rating": "3.8",
  "ratingcount": "228",
  "ingredients": "2 cups low fat sour cream; 4 cloves garlic, minced; 6  chicken drumsticks; 6  bone-in chicken breast halves, with skin; 4 cups crushed cornflakes cereal; 4 tablespoons crushed dried rosemary; 3 teaspoons dried sage; 3 tablespoons garlic powder; salt and pepper to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Place a cooling rack on top of a large cookie sheet. Spray the rack with vegetable cooking spray. 2. In a medium bowl, mix together sour cream and minced garlic. In another bowl, stir together the cornflake crumbs, rosemary, sage, garlic powder, salt and pepper. Coat the chicken with the sour cream mixture, then roll in the cornflake mixture. Arrange chicken pieces on top of the cooling rack. 3. Bake for 1 hour in the preheated oven, until meat is no longer pink, and juices run clear.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "540"
},
{
  "url": "https://www.allrecipes.com/recipe/284481/classic-southern-fried-chicken/",
  "name": "Classic Southern Fried Chicken",
  "rating": "3.8",
  "ratingcount": "4",
  "ingredients": "4 pounds bone-in chicken drumsticks and thighs, with skin; 4 cups buttermilk; 2 tablespoons hot pepper sauce (such as Crystal ®); 1 tablespoon kosher salt; 3 teaspoons ground black pepper, divided; 3 cups all-purpose flour; 2 teaspoons kosher salt; 1 ½ teaspoons onion powder; 1 teaspoon garlic powder; 1 teaspoon ground paprika; ½ teaspoon cayenne pepper; 1 quart vegetable oil for frying, or as needed",
  "directions": "1. Combine chicken, buttermilk, hot sauce, 1 tablespoon salt, and 2 teaspoons pepper in a large, non-reactive bowl. Stir until chicken is well coated. Cover and refrigerate at least 4 hours, or overnight. 2. Combine flour, 2 teaspoons salt, onion powder, garlic powder, paprika, remaining 1 teaspoon pepper, and cayenne in a large bowl; whisk until well combined. 3. Remove chicken from the refrigerator. Working with one piece at a time, remove from the marinade and allow excess to drip off. Coat evenly in the flour mixture, and set on a wire rack set inside a rimmed baking sheet. 4. Pour oil into a large Dutch oven to a depth of 1 inch. Heat over medium-high heat until it reaches 350 degrees F (175 degrees C). 5. Add a few chicken pieces to the hot oil and cook, turning once or twice, until golden brown on the outside, no longer pink at the bone, and the juices run clear, 10 to 15 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Maintain the oil temperature around 320 degrees F (160 degrees C) during cooking. Remove chicken to a clean wire rack set over a paper towel-lined baking sheet. Return oil to 350 degrees F (175 degrees C) and repeat to fry remaining chicken. 6. Serve immediately.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "5 hrs",
  "calories": "695"
},
{
  "url": "https://www.allrecipes.com/recipe/60617/five-spice-chicken-wings/",
  "name": "Five-Spice Chicken Wings",
  "rating": "4.2",
  "ratingcount": "43",
  "ingredients": "4 cloves garlic, minced; 3  green onions, chopped; 1 tablespoon sugar; 1 tablespoon Chinese five-spice powder; 2 tablespoons fish sauce; 2 tablespoons soy sauce; 2 tablespoons sweet chili sauce; 1 pinch salt to taste; 16  chicken wings; 2  limes, quartered",
  "directions": "1. Whisk together the garlic, green onion, sugar, five-spice powder, fish sauce, soy sauce, chili sauce, and salt in a bowl. Arrange the chicken pieces in a shallow, non-metallic dish. Spoon the sauce mixture over the chicken to evenly coat. Cover the dish with plastic wrap and refrigerate 8 hours or overnight. 2. Preheat oven to 425 degrees F (220 degrees C). Lightly grease a baking sheet. 3. Arrange the marinated chicken on the prepared baking sheet. 4. Bake in the preheated oven until crispy, about 45 minutes. Serve with lime wedges on the side.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "9 hrs 5 mins",
  "calories": "323"
},
{
  "url": "https://www.allrecipes.com/recipe/8431795/baked-chicken-leg-quarters/",
  "name": "Baked Chicken Leg Quarters",
  "rating": "4.9",
  "ratingcount": "15",
  "ingredients": "2 teaspoons smoked paprika; 2 teaspoons granulated garlic; ½ teaspoon onion powder; 1 teaspoon salt; 1 teaspoon freshly ground black pepper; 5 (8 ounce) chicken leg quarters; ⅓ cup melted unsalted butter",
  "directions": "1. Preheat the oven to 425 degrees F (218 degrees C). Line a sheet pan with aluminum foil. 2. Stir together smoked paprika, granulated garlic, onion powder, salt, and pepper in a small bowl. 3. Pat chicken leg quarters dry with paper towels. Gently lift the skin and sprinkle in 1/4 to 1/2 teaspoon of the seasoning blend, using a fingertip to spread the seasoning around under the skin. Brush both sides of each leg quarter with melted butter. 4. Evenly sprinkle remaining spice mixture on both sides of each quarter and set cut side up onto the prepared sheet pan. 5. Bake in the center of the preheated oven for 20 minutes. Turn the quarters cut side down using tongs and continue baking until chicken is no longer pink at the bone and the juices run clear, about 20 more minutes. An instant-read thermometer inserted near the bone should read 160 degrees F (71 degrees C). 6. Turn on the broiler and broil each side of the chicken leg quarters until skin is nicely browned, 3 to 4 minutes per side. Test for a final internal temperature with an instant-read thermometer of 165 degrees F (74 degrees C). 7. Transfer chicken leg quarters to a serving plate. Tent with foil and let rest for 5 minutes before serving.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "540"
},
{
  "url": "https://www.allrecipes.com/recipe/216618/fricase-de-pollo/",
  "name": "Fricase de Pollo",
  "rating": "4.4",
  "ratingcount": "16",
  "ingredients": "1 tablespoon extra-virgin olive oil; ½ large red bell pepper, diced; ½  red onion, diced; 4 cloves garlic, smashed; 2 tablespoons tomato paste; 2 cups water, or as needed; 6  skinless chicken leg quarters, separated into thighs and drumsticks; salt to taste",
  "directions": "1. Heat olive oil in a pressure cooker over medium heat. Stir in red bell pepper and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add garlic and cook until golden. 2. Dissolve tomato paste in 1 cup water and pour it into the pressure cooker. Place chicken thighs and drumsticks in the pan so the pieces are evenly spaced. Add enough water so that the chicken is nearly covered. 3. Seal the pressure cooker and bring up to pressure over high heat. Reduce the heat to low, maintaining full pressure; cook for 15 minutes. Turn off the heat and allow the pressure to drop naturally, about 20 minutes. Season chicken with salt to taste.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "1 hr",
  "calories": "454"
},
{
  "url": "https://www.allrecipes.com/recipe/215154/grilled-teriyaki-beer-chicken/",
  "name": "Grilled Teriyaki Beer Chicken",
  "rating": "4.5",
  "ratingcount": "23",
  "ingredients": "1 (12 fluid ounce) can or bottle beer; ¼ cup brown sugar; ¼ cup kosher salt; ¼ cup paprika; 2 tablespoons ground black pepper; ¼ teaspoon cayenne pepper; 1 cup teriyaki marinade; ¼ cup vegetable oil; 10  chicken legs, rinsed and patted dry",
  "directions": "1. Stir the beer, brown sugar, kosher salt, paprika, black pepper, cayenne pepper, and teriyaki marinade together in a bowl. 2. Rub the chicken legs thoroughly with the vegetable oil. Poke several holes in the flesh of the chicken legs with a fork; arrange in a single layer in a glass dish. Pour the marinade over the chicken legs; marinate in refrigerator for 1 hour. 3. Preheat an outdoor grill for medium heat, and lightly oil the grate. 4. Remove the chicken from the marinade and shake off any excess liquid. Discard remaining marinade. 5. Grill the chicken legs on the preheated grill until no longer pink at the bone and the juices run clear, turning one-quarter turn every 5 minutes, 20 to 25 minutes total. An instant-read thermometer inserted into the thickest part of the leg, near the bone should read 180 degrees F (82 degrees C).",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "1 hr 35 mins",
  "calories": "412"
},
{
  "url": "https://www.allrecipes.com/recipe/212950/guinataan-chicken-adobo/",
  "name": "Guinataan Chicken Adobo",
  "rating": "4.1",
  "ratingcount": "36",
  "ingredients": "4 ½ pounds chicken leg quarters; ¾ cup white vinegar; ¾ cup water; 1 teaspoon white sugar; ¼ cup soy sauce; 2  bay leaves; 1 teaspoon whole black peppercorns, crushed; 1  onion, chopped; 2 cloves garlic, crushed; salt to taste; 1 (14 ounce) can coconut milk",
  "directions": "1. Combine the chicken, vinegar, water, sugar, soy sauce, bay leaves, crushed peppercorns, onion, and garlic in a large pot; stir and bring the mixture to a boil for 2 minutes. Reduce heat to medium-low and cook at a simmer for 30 minutes. 2. Remove the chicken to a large serving platter and set aside. Increase the heat under the pot to medium and cook until the liquid reduces by about one-quarter, about 10 minutes. Season with salt; stir the coconut milk into the mixture. Cover and cook until the coconut milk appears oily, about 10 minutes. Pour the mixture over the chicken to serve.",
  "prep": "10 mins",
  "cook": "55 mins",
  "total": "1 hr 5 mins",
  "calories": "657"
},
{
  "url": "https://www.allrecipes.com/recipe/8344126/slow-cooker-bbq-chicken-drumsticks/",
  "name": "Slow Cooker BBQ Chicken Drumsticks",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "¾ cup ketchup; ½ cup finely chopped onion; 2 tablespoons brown sugar; 2 tablespoons minced garlic, or to taste; 2 tablespoons vegetable oil; 2 tablespoons white vinegar; 2 tablespoons Worcestershire sauce; 1 tablespoon liquid smoke; 2 teaspoons salt; 1 teaspoon ground black pepper; 12 (4 ounce) bone-in chicken drumsticks, with skin",
  "directions": "1. Mix ketchup, onion, brown sugar, garlic, vegetable oil, Worcestershire sauce, liquid smoke, salt, and pepper together in a bowl. 2. Place chicken drumsticks in a slow cooker and drizzle sauce over top. Cook on High for 3 hours. 3. When the 3 hours are almost up, preheat the oven to 400 degrees F (200 degrees C). 4. Transfer chicken and sauce to a 9x13-inch baking dish. 5. Cook in the preheated oven until no longer pink at the bone, the juices run clear, and the skin is browned, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "3 hrs 30 mins",
  "total": "3 hrs 40 mins",
  "calories": "485"
},
{
  "url": "https://www.allrecipes.com/recipe/8733/italian-chicken-with-garlic-and-lemon/",
  "name": "Italian Chicken with Garlic and Lemon",
  "rating": "4.1",
  "ratingcount": "181",
  "ingredients": "15  chicken thighs; 8 large potatoes, peeled and quartered; 1 cup vegetable oil, or as needed; ½ cup wine vinegar; 5  lemons, juiced; 10 cloves crushed garlic; 2 tablespoons dried oregano; 2 tablespoons dried parsley; 1  onion, minced; salt and pepper to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Arrange the chicken pieces in a 10x15-inch enameled roasting pan. In a large skillet over medium high heat, fry the potatoes in 1/2-inch-deep oil until golden brown, then put them in the pan with the chicken. 3. Combine the vinegar, lemon juice, garlic, oregano, parsley, onion, salt and pepper with the 1/2 cup reserved frying oil and pour this mixture over the chicken and potatoes. 4. Bake in the preheated oven for 1 1/4 hours, basting the chicken and potatoes with the sauce mixture. Let rest for 5 minutes and serve hot.",
  "prep": "15 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 30 mins",
  "calories": "275"
},
{
  "url": "https://www.allrecipes.com/recipe/275258/cajun-chicken-drumsticks/",
  "name": "Cajun Chicken Drumsticks",
  "rating": "4.4",
  "ratingcount": "7",
  "ingredients": "aluminum foil; 6  chicken drumsticks; 3 tablespoons butter, melted; ½ teaspoon baking powder; ½ teaspoon salt; ½ teaspoon ground black pepper; ½ teaspoon paprika; ¼ teaspoon garlic powder; ¼ teaspoon onion powder; ¼ teaspoon dried basil; ¼ teaspoon ground thyme; ¼ teaspoon dried oregano; ¼ teaspoon ground cumin; ¼ teaspoon cayenne pepper",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Line a baking pan with aluminum foil. 2. Pat drumsticks with paper towels until dry. 3. Combine baking powder, salt, black pepper, paprika, garlic powder, onion powder, basil, thyme, oregano, cumin and cayenne pepper in a medium bowl. Add melted butter and stir until combined. Add drumsticks and toss until fully coated. Place drumsticks into the prepared baking pan. 4. Bake in the preheated oven until drumsticks are no longer pink at the bone and the juices run clear, 20 to 25 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "573"
},
{
  "url": "https://www.allrecipes.com/recipe/8596/mediterranean-lemon-chicken/",
  "name": "Mediterranean Lemon Chicken",
  "rating": "4.2",
  "ratingcount": "478",
  "ingredients": "1  lemon; 2 teaspoons dried oregano; 3 cloves garlic, minced; 1 tablespoon olive oil; ¼ teaspoon salt; ¼ teaspoon ground black pepper; 6  chicken legs",
  "directions": "1. Preheat oven to 425 degrees F (220 degrees C). 2. In a 9x13 inch baking dish, grate the peel from 1/2 the lemon, squeeze out the juice (about 1/4 cup) and add to peel with the oregano, garlic, oil, salt and pepper. Stir until mixed. 3. Remove skin from chicken pieces and discard. Coat chicken pieces with the lemon mixture and arrange, bone-side up, in the baking dish. Cover dish and bake for 20 minutes. Turn and baste chicken. 4. Reduce heat to 400 degrees F (205 degrees C) and bake uncovered, basting every 10 minutes, for about 30 more minutes. Serve chicken with pan juices.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "241"
},
{
  "url": "https://www.allrecipes.com/recipe/276117/grilled-chicken-drumsticks/",
  "name": "Grilled Chicken Drumsticks",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "1  yellow onion, chopped; ½  white onion, chopped; 5 cloves garlic, sliced; 16  chicken drumsticks; 3 tablespoons chopped fresh cilantro; 2 teaspoons dried oregano; 2 teaspoons ground cumin; 2 teaspoons ground thyme; 1 teaspoon garlic powder; salt and ground black pepper to taste; 2 large lemons",
  "directions": "1. Mix yellow onion, white onion, and garlic together in a bowl. 2. Season chicken drumsticks with cilantro, oregano, cumin, thyme, garlic powder, salt, and pepper. Place chicken into the bowl with onion mixture. Squeeze lemon juice over the chicken, slice the rinds, and place into the same bowl. Cover and let sit in a refrigerator, 20 to 24 hours. 3. Preheat an outdoor grill for medium heat and lightly oil the grate. 4. Cook on the preheated grill until an instant-read thermometer inserted into a drumstick reads at least 180 degrees F (82 degrees C), 30 to 45 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "20 hrs 45 mins",
  "calories": "162"
},
{
  "url": "https://www.allrecipes.com/recipe/8980/coq-au-vin-alla-italiana/",
  "name": "Coq au Vin alla Italiana",
  "rating": "4.6",
  "ratingcount": "256",
  "ingredients": "4 pounds dark meat chicken pieces; 1 tablespoon vegetable oil; 5 cloves crushed garlic; ½ cup all-purpose flour; 1 teaspoon poultry seasoning; 3 (4 ounce) links sweet Italian sausage, sliced; 1 cup chopped onion; 3  carrots, sliced; ½ pound fresh mushrooms, sliced; ½ teaspoon dried rosemary; 1 cup red wine; 1 (14.5 ounce) can whole peeled tomatoes; salt and pepper to taste",
  "directions": "1. In a large skillet, heat oil. Add 1/2 of the garlic. Season flour with poultry seasoning. Dredge chicken parts in flour, then brown in the skillet for 4 or 5 minutes. Add the sausage, and saute for a few minutes. Add the onion, carrots, mushrooms, rosemary and the remaining garlic. Stir all together. 2. Add the wine and tomatoes; stir. Cover and let simmer over low heat for 25 minutes. Season with salt and pepper to taste and let simmer for another 10 minutes. Let cool covered for 10 minutes, then serve.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "617"
}]