[{
  "url": "https://www.allrecipes.com/recipe/187822/baked-chicken-wings/",
  "name": "Baked Chicken Wings",
  "rating": "4.7",
  "ratingcount": "899",
  "ingredients": "3 tablespoons olive oil; 3 cloves garlic, pressed; 2 teaspoons chili powder; 1 teaspoon garlic powder; salt and ground black pepper to taste; 10  chicken wings",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Combine olive oil, garlic, chili powder, garlic powder, salt, and pepper in a large, resealable bag; seal and shake to combine. Add chicken wings; reseal and shake to coat. Arrange chicken wings on a baking sheet. 3. Cook chicken wings in the preheated oven until crisp and cooked through, about 1 hour.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "532"
},
{
  "url": "https://www.allrecipes.com/recipe/232943/easy-restaurant-style-buffalo-chicken-wings/",
  "name": "Easy Restaurant-Style Buffalo Chicken Wings",
  "rating": "4.4",
  "ratingcount": "12",
  "ingredients": "12  skinless chicken wings; ¾ cup all-purpose flour; 1 tablespoon salt; 1 tablespoon ground black pepper; 1 tablespoon garlic powder; 1 quart vegetable oil for frying; ¾ cup hot pepper sauce (such as Frank's RedHot®); 1 tablespoon butter",
  "directions": "1. Rinse chicken wings in cold water; drain and pat dry with paper towels. 2. Mix flour, salt, pepper, and garlic powder together in a 1-gallon resealable bag; add chicken wings. Seal bag and shake to evenly coat chicken. 3. Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). 4. Remove chicken from bag and shake off any excess coating; fry in the preheated oil until chicken is no longer pink in the center, about 7 minutes. Remove chicken with a slotted spoon and drain on a paper towel-lined plate. 5. Combine hot sauce and butter in saucepan over medium heat; cook until heated through, about 5 minutes. Coat cooked chicken wings with sauce.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "311"
},
{
  "url": "https://www.allrecipes.com/recipe/219107/sweet-hot-mustard-chicken-wings/",
  "name": "Sweet Hot Mustard Chicken Wings",
  "rating": "4.6",
  "ratingcount": "123",
  "ingredients": "2 pounds chicken wings, separated at joints, tips discarded; salt to taste; 2 tablespoons Dijon mustard; 2 tablespoons prepared yellow mustard; 3 tablespoons honey; 2 teaspoons cider vinegar; salt and ground black pepper to taste; 1 teaspoon hot pepper sauce",
  "directions": "1. Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil; coat the aluminum foil with cooking spray. 2. Arrange the wings on the prepared baking sheet so they do not touch; season with salt. 3. Bake in the preheated oven until browned and crispy on top, about 20 minutes. Flip the wings with tongs and cook until no longer pink in the center and the juices run clear, about 20 minutes more. 4. Stir together the Dijon mustard, yellow mustard, honey, cider vinegar, salt, pepper, and hot sauce in large mixing bowl. Add the wings to the bowl and toss with a spatula to coat evenly. Allow to sit for about five minutes and toss again to re-coat. Transfer to a plate to serve.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "177"
},
{
  "url": "https://www.allrecipes.com/recipe/24087/restaurant-style-buffalo-chicken-wings/",
  "name": "Restaurant-Style Buffalo Chicken Wings",
  "rating": "4.8",
  "ratingcount": "3",
  "ingredients": "½ cup all-purpose flour; ¼ teaspoon ground paprika; ¼ teaspoon cayenne pepper; ¼ teaspoon salt; 10  chicken wings; 2 cups vegetable oil for frying, or as needed; ¼ cup butter; ¼ cup hot sauce; 1 pinch ground black pepper; 1 pinch garlic powder",
  "directions": "1. Whisk together flour, paprika, cayenne pepper, and salt in a large bowl. 2. Place chicken wings in the bowl with flour mixture and toss until evenly coated. Transfer wings to a 9x13-inch glass baking dish and arrange in a single layer. Cover and refrigerate for 1 to 1 1/2 hours. 3. Add about 1 inch oil to a deep, heavy skillet; heat to 375 degrees F (190 degrees C). (The oil should be just enough to cover wings entirely.) 4. Meanwhile, combine butter, hot sauce, pepper, and garlic powder in a separate small saucepan over low heat. Cook and stir until butter is melted and mixture is thoroughly blended. Remove from the heat and reserve for serving. 5. Fry coated wings in the hot oil for 10 to 15 minutes, or until they begin to crisp and turn brown. Maintain the oil temperature while cooking. Remove cooked wings from hot oil and let drain on paper towels or a wire rack. 6. Transfer wings to a platter and drizzle hot sauce over top; or mix wings and hot sauce in a bowl until coated.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "1 hr 20 mins",
  "calories": "908"
},
{
  "url": "https://www.allrecipes.com/recipe/241152/fried-chicken-wings/",
  "name": "Fried Chicken Wings",
  "rating": "4.7",
  "ratingcount": "64",
  "ingredients": "12  small chicken wings; ¼ teaspoon seasoned salt, or to taste; 1 cup all-purpose flour; 1 teaspoon coarse salt; ½ teaspoon ground black pepper; ¼ teaspoon cayenne pepper; ¼ teaspoon ground paprika; 2 quarts vegetable oil for frying; 1 (12 fluid ounce) bottle Buffalo wing sauce (such as Frank's®), or to taste",
  "directions": "1. Season chicken wings lightly with seasoned salt. 2. Mix flour, salt, black pepper, cayenne pepper, and paprika together in a wide, shallow bowl. Press wings into flour mixture to coat and arrange in a single layer on a large plate. Refrigerate coated wings for 15 to 30 minutes. 3. Dredge wings again in flour mixture and return to the plate. Refrigerate wings once more for 15 to 30 minutes. 4. Heat oil in a deep fryer or large saucepan to 375 degrees F (190 degrees C). 5. Fry chicken wings in hot oil until crisp and juices run clear, 10 to 12 minutes. An instant-read thermometer inserted into the thickest part of the meat, near the bone, should read 165 degrees F (74 degrees C). 6. Transfer fried wings to a large bowl. Drizzle sauce over wings and toss to coat.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "50 mins",
  "calories": "531"
},
{
  "url": "https://www.allrecipes.com/recipe/8529778/air-fryer-gochujang-wings/",
  "name": "Air Fryer Gochujang Wings",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "½ cup pineapple juice; 2 tablespoons gochujang (Korean hot pepper paste), or more to taste; 2 tablespoons soy sauce; 5 cloves garlic, minced; 1 tablespoon sesame oil; 1 tablespoon brown sugar; 1 ½ teaspoons freshly grated ginger; 2 pounds chicken wings, separated at joints, tips discarded; 1 ½ teaspoons toasted sesame seeds; 1 teaspoon black sesame seeds",
  "directions": "1. Combine pineapple juice, gochujang, soy sauce, garlic, sesame oil, brown sugar, and fresh ginger in a gallon size resealable bag. Add the wings and mix to coat; marinate overnight 2. Heat the air fryer to 200 degrees F (95 degrees C) for 5 minutes. 3. Drain wings from marinade and set inside the air fryer basket. 4. Cook wings for 20 minutes flipping at the 15 minute mark. 5. Increase temperature to 400 degrees F (200 degrees C) and cook for 10 more minutes. Carefully remove wings and sprinkle with sesame seeds. Serve immediately.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "8 hrs 40 mins",
  "calories": "301"
},
{
  "url": "https://www.allrecipes.com/recipe/236418/easy-lemon-pepper-chicken-wings/",
  "name": "Easy Lemon-Pepper Chicken Wings",
  "rating": "4.7",
  "ratingcount": "103",
  "ingredients": "2 cups oil, or as needed; 2 tablespoons extra-virgin olive oil; 1 tablespoon lemon-pepper seasoning; 12  chicken wings",
  "directions": "1. Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). 2. Stir olive oil and lemon-pepper seasoning together in a bowl; set aside. 3. Fry wings in hot oil until no longer pink at the bone and the juices run clear, about 8 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 4. Toss hot wings with lemon-pepper mixture to coat.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "1181"
},
{
  "url": "https://www.allrecipes.com/recipe/270201/honey-sriracha-air-fryer-wings/",
  "name": "Honey-Sriracha Air Fryer Wings",
  "rating": "4.4",
  "ratingcount": "12",
  "ingredients": "12  fresh chicken wing drumettes; ½ teaspoon salt; ½ teaspoon garlic powder; 1 tablespoon butter; ¼ cup honey; 2 teaspoons rice vinegar; 1 tablespoon sriracha sauce",
  "directions": "1. Preheat an air fryer to 360 degrees F (182 degrees C). 2. Place chicken wings in a bowl and sprinkle with salt and garlic powder, tossing to coat. 3. Place wings in the air fryer basket. Set timer for 25 minutes and cook wings, shaking basket every 7 to 8 minutes. When timer ends, turn air fryer off and let wings stand in the basket for 5 minutes more. 4. Meanwhile, melt butter in a small saucepan over medium heat. Whisk honey, rice vinegar, and sriracha sauce into butter and bring to a boil. Reduce heat and simmer sauce over medium-low heat for 8 to 10 minutes, whisking occasionally. Turn off heat and set aside; sauce will thicken as it cools. 5. Toss cooked wings and sauce together in a bowl. Reserve extra sauce to serve alongside wings.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "586"
},
{
  "url": "https://www.allrecipes.com/recipe/142120/detroit-hot-honey-wings/",
  "name": "Detroit Hot Honey Wings",
  "rating": "4.7",
  "ratingcount": "395",
  "ingredients": "2 pounds chicken wings, tips discarded; 1 teaspoon cayenne pepper (add more if you can stand it); salt and ground black pepper to taste; 1 cup honey, divided; ½ cup butter, melted; ½ cup hot sauce",
  "directions": "1. Preheat an outdoor grill to medium heat and lightly oil the grate. 2. Wash wings well and pat dry with paper towels. Season wings with cayenne, salt, and pepper. 3. Cook chicken wings on the preheated grill, brushing wings liberally with 1/2 cup honey while cooking, until cooked through and juices run clear, 20 to 30 minutes. 4. Pour melted butter into a large bowl; mix in hot sauce and remaining 1/2 cup honey. 5. Remove wings from the grill and immediately toss them in hot honey butter sauce to coat. Serve wings wet or return them to the grill for 1 minute per side to set sauce.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "420"
},
{
  "url": "https://www.allrecipes.com/recipe/166638/baked-buffalo-wings/",
  "name": "Baked Buffalo Wings",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "cooking spray; ¾ cup all-purpose flour; ½ teaspoon cayenne pepper; ½ teaspoon garlic powder; ½ teaspoon salt; 20  chicken wings; ½ cup melted butter; ½ cup hot pepper sauce (such as Frank's RedHot®)",
  "directions": "1. Line a baking sheet with aluminum foil, and lightly grease with cooking spray. 2. Place flour, cayenne pepper, garlic powder, and salt into a resealable plastic bag, and shake to mix. Add chicken wings, seal the bag, and toss until well coated with the flour mixture. 3. Transfer wings to the prepared baking sheet and refrigerate for at least 1 hour. 4. Preheat the oven to 400 degrees F (200 degrees C). 5. While the oven is preheating, whisk together melted butter and hot sauce in a small bowl. 6. Dip wings into butter mixture, and place back on the baking sheet. 7. Bake in the preheated oven for 20 minutes. Flip wings and continue to cook until crispy on the outside and no longer pink in the center, about 25 more minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "2 hrs",
  "calories": "125"
},
{
  "url": "https://www.allrecipes.com/recipe/272428/dry-rub-air-fried-chicken-wings/",
  "name": "Dry-Rub Air-Fried Chicken Wings",
  "rating": "4.6",
  "ratingcount": "36",
  "ingredients": "1 tablespoon dark brown sugar; 1 tablespoon sweet paprika; ½ tablespoon kosher salt; 1 teaspoon garlic powder; 1 teaspoon onion powder; 1 teaspoon poultry seasoning; ½ teaspoon mustard powder; ½ teaspoon freshly ground black pepper; 8  chicken wings, or more as needed",
  "directions": "1. Preheat the air fryer to 350 degrees F (175 degrees C). 2. Whisk together brown sugar, paprika, salt, garlic powder, onion powder, poultry seasoning, mustard powder, and pepper in a large bowl. 3. Toss in chicken wings and rub seasonings into chicken with your hands until fully coated. 4. Arrange wings in the air fryer basket, standing them up on their ends and leaning against each other and the wall of the basket. 5. Cook in the preheated air fryer until wings are tender inside and golden brown and crisp on the outside, about 35 minutes. Transfer wings to a plate and serve hot.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "318"
},
{
  "url": "https://www.allrecipes.com/recipe/88438/teriyaki-chicken-wings/",
  "name": "Teriyaki Chicken Wings",
  "rating": "4.6",
  "ratingcount": "206",
  "ingredients": "1 cup water; 1 cup soy sauce; 1 cup white sugar; ¼ cup pineapple juice; ¼ cup vegetable oil; 1 tablespoon minced fresh garlic; 1 tablespoon minced fresh ginger; 3 pounds chicken wings or drumettes",
  "directions": "1. Whisk water, soy sauce, sugar, pineapple juice, vegetable oil, garlic, and ginger together in a large glass or ceramic bowl until sugar has dissolved. Add chicken wings and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator for at least 1 hour. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease baking dishes and set them aside. 3. Remove chicken wings from marinade; shake off excess and place the chicken wings into the prepared baking dishes. Discard the remaining marinade. 4. Bake chicken wings in the preheated oven until chicken is cooked through and glaze is evenly browned, about 1 hour. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "202"
},
{
  "url": "https://www.allrecipes.com/recipe/218350/simple-marinated-chicken-wings/",
  "name": "Simple Marinated Chicken Wings",
  "rating": "4.6",
  "ratingcount": "22",
  "ingredients": "5 tablespoons soy sauce; ¼ cup brown sugar; 2 tablespoons dry sherry; 1 teaspoon prepared yellow mustard; ½ teaspoon garlic powder; 24  chicken wings",
  "directions": "1. Whisk soy sauce, brown sugar, sherry, mustard, and garlic powder together in a bowl until combined. 2. Arrange chicken wings in a 9x13-inch baking dish; pour marinade over chicken and cover with plastic wrap. Marinate in the refrigerator for at least 2 hours. 3. Preheat the oven to 375 degrees F (190 degrees C). Remove plastic wrap from the baking dish. 4. Bake in the preheated oven, basting occasionally, until chicken wings are no longer pink in the center, about 1 hour. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "3 hrs 5 mins",
  "calories": "303"
},
{
  "url": "https://www.allrecipes.com/recipe/241001/crispy-honey-sriracha-chicken-wings/",
  "name": "Crispy Honey Sriracha Chicken Wings",
  "rating": "4.7",
  "ratingcount": "341",
  "ingredients": "2 tablespoons baking powder; 1 tablespoon kosher salt; 1 teaspoon freshly ground black pepper; 1 teaspoon smoked paprika; 2 ½ pounds chicken wing sections; ⅓ cup honey; ⅓ cup sriracha sauce; 1 tablespoon seasoned rice vinegar; ¼ teaspoon sesame oil; 1 pinch sesame seeds, or as desired",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil and place an oven-proof wire rack over the foil. 2. Whisk baking powder, salt, black pepper, and paprika together in a small bowl. 3. Place chicken wings in a large bowl. Sprinkle 1/2 of the baking powder mixture over wings and toss to coat. Repeat with remaining baking powder mixture, tossing well to coat. 4. Arrange wings on the rack of the prepared baking sheet. 5. Bake in the preheated oven for 20 minutes. Turn wings and continue baking for 20 minutes. Turn wings again and bake until wings are browned and crispy, about 15 minutes more. Transfer wings to a large bowl. 6. For the glaze: Whisk honey, sriracha sauce, rice vinegar, and sesame oil together in a bowl until smooth. Drizzle glaze over wings and toss to coat completely. 7. Transfer wings to a serving platter and sprinkle sesame seeds over the top.",
  "prep": "5 mins",
  "cook": "55 mins",
  "total": "1 hr",
  "calories": "315"
},
{
  "url": "https://www.allrecipes.com/recipe/213068/grill-master-chicken-wings/",
  "name": "Grill Master Chicken Wings",
  "rating": "4.8",
  "ratingcount": "656",
  "ingredients": "3 pounds chicken wings, cut apart at joints, wing tips discarded; ½ cup soy sauce; ½ cup Italian-style salad dressing; ¼ cup butter; ¼ cup hot pepper sauce (such as Frank's RedHot), or to taste; 1 teaspoon soy sauce",
  "directions": "1. Prepare wings: Combine chicken wings, soy sauce, and Italian dressing in a large resealable plastic bag; coat chicken wings with marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator, 4 hours to overnight. 2. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 3. Prepare sauce: Melt butter in a small saucepan over low heat. Stir in hot pepper sauce and soy sauce until combined. Remove from heat and set aside. 4. Remove chicken wings from marinade and pat dry; discard any remaining marinade. 5. Cook on the preheated grill, turning occasionally, until chicken is browned and no longer pink, 25 to 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 6. Place grilled wings in a large bowl. Pour butter sauce over wings; toss until well-coated.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "181"
},
{
  "url": "https://www.allrecipes.com/recipe/274653/oven-baked-chicken-wings/",
  "name": "Oven-Baked Chicken Wings",
  "rating": "4.9",
  "ratingcount": "15",
  "ingredients": "cooking spray; 2 pounds chicken wings; ½ teaspoon salt, or more to taste; ⅓ cup all-purpose flour; 6 tablespoons unsalted butter; ½ cup hot sauce; ½ tablespoon red wine vinegar; ½ tablespoon Worcestershire sauce; ½ tablespoon honey; ½ teaspoon garlic powder; ¼ teaspoon cayenne pepper; 2 stalks celery, sliced, or to taste; 2  carrots, sliced, or to taste",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil and coat with cooking spray. 2. Pat dry chicken wings with paper towels. Season with salt. Place flour into a shallow dish. Dredge wings in flour to lightly coat, then place on the prepared baking sheet. 3. Bake in the preheated oven until golden and no longer pink in the centers, 40 to 45 minutes. 4. While wings are baking, melt butter over medium heat in a medium saucepan. Add hot sauce, red wine vinegar, Worcestershire, honey, garlic powder, and cayenne. Let sauce simmer on low heat until wings are done baking, about 40 minutes. 5. Place wings in a large serving bowl. Pour sauce over wings; toss until evenly coated. Serve with celery and carrots.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "259"
},
{
  "url": "https://www.allrecipes.com/recipe/214464/chinese-chicken-wings/",
  "name": "Chinese Chicken Wings",
  "rating": "4.5",
  "ratingcount": "83",
  "ingredients": "2 cups soy sauce; 2 cups brown sugar; 2 tablespoons garlic powder; 5 pounds chicken wings, split and tips discarded",
  "directions": "1. Stir together soy sauce, brown sugar, and garlic powder in a saucepan over medium heat. Cook and stir until sugar has dissolved. Remove from heat and allow to cool. 2. Place chicken wings in a large bowl. Pour soy sauce mixture over wings and toss to coat evenly. Cover the bowl with plastic wrap. Allow chicken to marinate in the refrigerator for 8 hours to overnight. 3. Preheat the oven to 350 degrees F (175 degrees C). 4. Pour chicken wings and marinade into a 9x13-inch baking dish. Cover the baking dish with aluminum foil. 5. Bake in the preheated oven until thoroughly hot, about 45 minutes. Remove foil and bake for 15 more minutes. Serve hot.",
  "prep": "5 mins",
  "cook": "1 hr 5 mins",
  "total": "9 hrs 10 mins",
  "calories": "256"
},
{
  "url": "https://www.allrecipes.com/recipe/230993/awesome-slow-cooker-buffalo-wings/",
  "name": "Awesome Slow Cooker Buffalo Wings",
  "rating": "4.5",
  "ratingcount": "186",
  "ingredients": "1 (12 ounce) bottle hot pepper sauce (such as Frank's RedHot®); ½ cup butter; 2 tablespoons Worcestershire sauce; 2 teaspoons dried oregano; 2 teaspoons onion powder; 2 teaspoons garlic powder; 1 (4 pound) frozen chicken wing sections, thawed; ½ cup butter; 1 (12 ounce) bottle hot pepper sauce (such as Frank's RedHot®)",
  "directions": "1. Combine 1 bottle hot pepper sauce, 1/2 cup butter, Worcestershire sauce, oregano, onion powder, and garlic powder in a saucepan over medium heat. Bring mixture to a boil, reduce heat to low, and simmer for 5 minutes. 2. Place chicken wings into slow cooker and pour sauce mixture over wings. 3. Cook on High for 1 hour. Reduce heat to Low; cook for 1 hour more. 4. Preheat the oven to 400 degrees F (200 degrees C). Grease several baking sheets. 5. Spread wings onto prepared baking sheets and bake in the preheated oven until wings are crisp and browned, about 30 minutes. 6. Meanwhile, melt 1/2 cup butter with 1 bottle hot sauce in a small saucepan and simmer until thickened, about 20 minutes. Brush sauce onto wings just before serving.",
  "prep": "10 mins",
  "cook": "2 hrs 40 mins",
  "total": "2 hrs 50 mins",
  "calories": "386"
},
{
  "url": "https://www.allrecipes.com/recipe/8768/sweet-spicy-wings/",
  "name": "Sweet Spicy Wings",
  "rating": "4.6",
  "ratingcount": "247",
  "ingredients": "6 pounds chicken wings, separated at joints, tips discarded; 1 ½ cups Louisiana-style hot sauce; 1 cup honey; ¾ cup butter; 1 teaspoon cayenne pepper, or to taste; 1 pinch garlic salt; 1 pinch ground black pepper",
  "directions": "1. Preheat an outdoor grill for high heat. Lightly oil the grill grate. 2. Grill chicken on the preheated grill until the juices run clear, 8 to 12 minutes per side. Remove chicken to a large roasting pan. 3. Mix together hot sauce, honey, butter, cayenne pepper, garlic salt, and black pepper in a saucepan over medium heat. Simmer until blended and heated through, about 10 minutes. 4. Pour hot sauce over chicken and stir to coat.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "356"
},
{
  "url": "https://www.allrecipes.com/recipe/230873/amazing-and-easy-chicken-wings/",
  "name": "Amazing and Easy Chicken Wings",
  "rating": "4.8",
  "ratingcount": "105",
  "ingredients": "2 cups brown sugar; 1 cup yellow mustard; ¼ cup soy sauce; 5 pounds chicken wings, cut into thirds and tips discarded",
  "directions": "1. Mix brown sugar, mustard, and soy sauce together in a bowl. Transfer 1/4 cup to a small bowl for basting; cover and refrigerate until needed. 2. Pour remaining marinade into a resealable bag. Add wings, coat with marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 2 hours, or overnight. 3. When ready to cook, preheat the oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil. 4. Remove wings from the marinade, shake off any excess, and transfer them to the prepared baking sheet. Discard the remaining marinade. 5. Bake in the preheated oven for 30 minutes. Baste wings with reserved marinade, then continue to cook, basting every 10 minutes, until chicken is no longer pink at the bone and the juices run clear, about 30 more minutes. An instant-read thermometer inserted near the bone should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "3 hrs 15 mins",
  "calories": "295"
},
{
  "url": "https://www.allrecipes.com/recipe/236115/deep-fried-hot-wings-and-drumettes/",
  "name": "Deep-Fried Hot Wings and Drumettes",
  "rating": "4.7",
  "ratingcount": "9",
  "ingredients": "3 cups peanut oil for frying, or as needed; 1 cup self-rising flour; 2 (5 ounce) bottles hot pepper sauce (such as Frank's RedHot®), divided; 3 large eggs; ⅓ cup water; 2 ½ pounds chicken wings and drummettes; ½ teaspoon garlic powder, or to taste; salt and ground black pepper to taste; ½ cup butter",
  "directions": "1. Heat oil in a deep-fryer or large saucepan to 400 degrees F (200 degrees C). Line a large bowl with paper towels. 2. Whisk one bottle hot sauce, eggs, and water together in a bowl until smooth. Place flour into another bowl. 3. Season chicken with garlic powder, salt, and pepper. Dip one piece into hot sauce mixture, then lift up so excess liquid drips back into the bowl. Toss in flour to coat on both sides, then place onto a plate. Repeat with remaining chicken. 4. Working in batches, fry chicken in hot oil until meat is no longer pink at the bone and skin is golden brown, about 5 minutes. Drain in the lined bowl and season again with salt. 5. Heat remaining hot sauce and butter in a saucepan over medium-high heat until butter melts. Whisk until smooth. 6. Remove paper towels from the bowl and pour butter sauce over chicken; toss to coat.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "501"
},
{
  "url": "https://www.allrecipes.com/recipe/68028/grilled-buffalo-wings/",
  "name": "Grilled Buffalo Wings",
  "rating": "4.7",
  "ratingcount": "277",
  "ingredients": "3 pounds chicken wings, separated at joints, tips discarded; 1 cup Louisiana-style hot sauce; 1 (12 fluid ounce) can or bottle cola-flavored carbonated beverage; ¼ teaspoon cayenne pepper, or to taste; ¼ teaspoon ground black pepper, or to taste; 1 tablespoon soy sauce",
  "directions": "1. Preheat a grill to medium heat. 2. Mix hot sauce, cola, cayenne pepper, black pepper and soy sauce together in a large pot; add wings to the sauce. Place the pot on one side of the preheated grill; bring to a simmer. 3. Use tongs to transfer wings out of sauce and place on the preheated grill; cook until lightly charred on both sides, about 8 to 10 minutes, then return wings to the sauce to continue cooking. Repeat this process until chicken is cooked and pulls easily off of the bone, and the sauce is hot and thickened, about 50 minutes. You can serve them as sloppy-style wings, or serve right off the grill for dryer wings.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "129"
},
{
  "url": "https://www.allrecipes.com/recipe/229774/oven-fried-chicken-wings/",
  "name": "Oven-Fried Chicken Wings",
  "rating": "4.4",
  "ratingcount": "104",
  "ingredients": "cooking spray; 1 cup grated Parmesan cheese (such as Kraft®); 1 cup seasoned bread crumbs; ⅛ teaspoon garlic powder; ⅛ teaspoon onion powder; ⅛ teaspoon ground black pepper; 1 pinch salt; 5 pounds chicken wings, tips discarded; ½ cup melted butter",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil and generously spray with cooking spray. 2. Mix Parmesan cheese, bread crumbs, garlic powder, onion powder, black pepper, and salt in a bowl. 3. Dip chicken wings in melted butter; press into bread crumb mixture until well-coated. Arrange wings on the prepared baking dish. 4. Bake in preheated oven until golden brown, about 20 minutes. Flip chicken wings and continue baking until evenly browned and no longer pink in the center, about 10 minutes more. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "163"
},
{
  "url": "https://www.allrecipes.com/recipe/23312/japanese-chicken-wings/",
  "name": "Japanese Chicken Wings",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 large egg, lightly beaten; 1 cup all-purpose flour for coating; 3 pounds chicken wings; 1 cup butter; 1 cup white sugar; ½ cup white vinegar; 3 tablespoons soy sauce; 3 tablespoons water; 1 teaspoon salt; ½ teaspoon garlic powder, or to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Place beaten egg in a small bowl. Place flour in a shallow bowl. 3. Cut wings in half. Dip each piece in egg, then press in flour to coat. 4. Melt butter in a large, deep skillet over medium-high heat. Fry coated wings in hot butter until deep brown on both sides. Place in a shallow roasting pan. 5. Make sauce: Mix together sugar, vinegar, soy sauce, water, salt, and garlic powder in a medium bowl until combined. Pour over wings. 6. Bake in the preheated oven for 30 to 45 minutes, basting wings frequently with sauce in the roasting pan. An instant-read thermometer inserted into the centers of wings near the bone should read 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "675"
},
{
  "url": "https://www.allrecipes.com/recipe/236105/baked-blazing-hot-wings/",
  "name": "Baked Blazing Hot Wings",
  "rating": "4.9",
  "ratingcount": "45",
  "ingredients": "5 pounds frozen chicken wings; 2 cups hot pepper sauce (such as Frank's RedHot®); ½ cup butter; 2 tablespoons distilled white vinegar; 1 tablespoon all-purpose flour",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Arrange frozen chicken wings in a single layer in a shallow baking dish. 2. Bake in the preheated oven for 25 minutes. Flip wings over and continue to cook until skin is crispy and meat is no longer pink at the bone, about 20 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 3. Meanwhile, combine hot sauce, butter, and vinegar in a saucepan over medium heat; cook and stir until butter melts, about 5 minutes. Whisk in flour until sauce is smooth, then continue to cook and stir until sauce is thickened, about 5 minutes more. 4. Drain grease from chicken wings and let stand for 5 minutes. Transfer chicken to a large bowl and add sauce. Toss to coat.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "169"
},
{
  "url": "https://www.allrecipes.com/recipe/247276/smoked-chicken-hot-wings/",
  "name": "Smoked Chicken Hot Wings",
  "rating": "4.8",
  "ratingcount": "33",
  "ingredients": "1 tablespoon kosher salt; 1 ½ teaspoons ground black pepper; 1 ½ teaspoons Cajun seasoning; 2 ½ pounds chicken wings; ⅔ cup hot pepper sauce (such as Frank's RedHot®); ½ cup butter; 1 ½ tablespoons white vinegar; ½ teaspoon Worcestershire sauce; ⅛ teaspoon garlic powder; 1 pinch salt to taste",
  "directions": "1. Heat a smoker to 225 degrees F (110 degrees C) according to the manufacturer's directions. 2. To make the dry rub: Mix 1 tablespoon salt, pepper, and Cajun seasoning in a small bowl; sprinkle over chicken wings. 3. Place chicken wings, unstacked, onto wire racks. Place the racks into the smoker. Add wood chips according to the manufacturer's directions; smoke chicken wings in the preheated smoker for 1 hour. 4. To make the sauce: Combine hot pepper sauce, butter, vinegar, Worcestershire sauce, garlic powder, and salt in a small saucepan over low heat. Cook, stirring often, until butter is melted and sauce is smooth; set aside. 5. Preheat an outdoor grill for medium-high heat and lightly oil the grate. Transfer smoked wings to a large bowl; stir in 1/2 of the sauce until wings are evenly coated. 6. Cook wings on the preheated grill until skin is browned and crispy, about 4 to 5 minutes per side. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Transfer to a large bowl and stir in remaining sauce until wings are well coated.",
  "prep": "15 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 30 mins",
  "calories": "209"
},
{
  "url": "https://www.allrecipes.com/recipe/273764/air-fried-korean-chicken-wings/",
  "name": "Air-Fried Korean Chicken Wings",
  "rating": "4.8",
  "ratingcount": "23",
  "ingredients": "¼ cup hot honey (such as Mike's Hot Honey®); 3 tablespoons gochujang (Korean hot pepper paste); 1 tablespoon brown sugar; 1 tablespoon soy sauce; 1 teaspoon lemon juice; 2 teaspoons minced garlic; 1 teaspoon minced fresh ginger root; ½ teaspoon salt; ¼ teaspoon black pepper; ¼ cup finely chopped green onions (green part only); 2 pounds chicken wings; 1 teaspoon salt; 1 teaspoon garlic powder; 1 teaspoon onion powder; ½ teaspoon black pepper; ½ cup cornstarch; 2 tablespoons chopped green onions; 1 teaspoon sesame seeds",
  "directions": "1. Combine hot honey, gochujang, brown sugar, soy sauce, lemon juice, garlic, ginger, salt, and black pepper in a saucepan. Bring sauce to a boil over medium heat, reduce heat, and simmer for 5 minutes. Add green onions and stir. 2. Preheat air fryer to 400 degrees F (200 degrees C). 3. Place wings in a large bowl and toss with salt, garlic powder, onion powder and black pepper. 4. Add cornstarch and toss wings until fully coated. 5. Shake each wing and place in the air fryer basket, making sure they are not touching; cook in batches if necessary. 6. Fry in the preheated air fryer for 10 minutes, shake basket, and fry an additional 10 minutes. Flip wings over and fry until chicken is cooked through and juices run clear, 7 to 8 more minutes. 7. Toss wings in the sauce and garnish with chopped green onions and sesame seeds. Serve with remaining sauce on the side.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "347"
},
{
  "url": "https://www.allrecipes.com/recipe/274731/air-fryer-old-bay-chicken-wings/",
  "name": "Air Fryer Old Bay® Chicken Wings",
  "rating": "4.7",
  "ratingcount": "26",
  "ingredients": "2 pounds chicken wings; 2 tablespoons seafood seasoning (such as Old Bay®); ¼ teaspoon freshly cracked black pepper; ½ cup cornstarch; 4 tablespoons butter; 1 teaspoon seafood seasoning (such as Old Bay®)",
  "directions": "1. Preheat the air fryer to 400 degrees F (200 degrees C). 2. Place chicken wings in a large bowl and toss with 2 tablespoons Old Bay® seasoning and black pepper. Add cornstarch and toss wings until fully coated. Shake each wing and place in the air fryer basket, making sure they are not touching; cook in batches if necessary. 3. Fry in the preheated air fryer for 10 minutes, shake the basket, and fry an additional 8 minutes. Flip wings over and fry until chicken is cooked through and juices run clear, 5 to 6 more minutes. 4. Meanwhile, combine butter and 1 teaspoon Old Bay® seasoning for sauce in a small saucepan. Bring to a boil over medium heat, stirring constantly. 5. Dip each wing in the sauce. Serve with remaining sauce on the side.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "335"
},
{
  "url": "https://www.allrecipes.com/recipe/14535/malaysian-barbecue-chicken-wings/",
  "name": "Malaysian Barbecue Chicken Wings",
  "rating": "4.4",
  "ratingcount": "69",
  "ingredients": "12  chicken wings; 4 tablespoons soy sauce; 2 tablespoons dark soy sauce; 1 tablespoon sesame oil; 2 tablespoons oyster sauce; ½ tablespoon garlic powder; ½ teaspoon onion powder; ground black pepper to taste; 1 tablespoon dried basil",
  "directions": "1. In a shallow glass bowl combine the soy sauce, dark soy sauce, sesame oil, oyster sauce, garlic powder, onion powder, ground black pepper and dried basil. Mix together. Add chicken wings, cover and refrigerate overnight. Stir together again the next day. 2. Lightly oil grill and preheat to high heat. 3. Remove wings from marinade and discard remaining marinade. Grill chicken wings over preheated grill for 8 to 12 minutes each side, or until cooked through and juices run clear.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "755"
},
{
  "url": "https://www.allrecipes.com/recipe/182107/kristas-sticky-honey-garlic-wings/",
  "name": "Krista's Sticky Honey Garlic Wings",
  "rating": "4.4",
  "ratingcount": "275",
  "ingredients": "24  chicken wings, split and tips discarded; ¾ cup packed brown sugar; 5 cloves garlic, minced; 1 teaspoon minced fresh ginger root; 2 ½ cups water; 5 tablespoons honey; ¼ cup reduced-sodium soy sauce; 3 tablespoons cornstarch; ¾ cup water",
  "directions": "1. Preheat an oven to 375 degrees F (190 degrees C). 2. Arrange the chicken wings on a baking sheet; bake until crisp, 35 to 45 minutes. Transfer the wings to a baking dish. 3. Mix together the brown sugar, garlic, ginger, 2 1/2 cups water, honey, and soy sauce in a saucepan over medium-high heat; bring to a boil. Whisk together the cornstarch and 3/4 cup water in a small bowl; stir into the sauce mixture until thickened; pour over the chicken wings to coat. 4. Return wings to oven and bake until the sauce is bubbling and the chicken is no longer pink at the bone and the juices run clear, 15 to 20 minutes.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "337"
},
{
  "url": "https://www.allrecipes.com/recipe/8947/buffalo-chicken-wings-i/",
  "name": "Buffalo Chicken Wings I",
  "rating": "4.7",
  "ratingcount": "417",
  "ingredients": "1 quart vegetable oil for deep frying; 24  chicken wings, tips removed and wings cut in half at joint; 4 tablespoons butter; 1 tablespoon distilled white vinegar; 5 tablespoons hot pepper sauce; salt and pepper to taste",
  "directions": "1. Heat the oil in a large skillet or deep fryer to 375 degrees F (190 degrees C). Deep fry chicken wings in oil until done, about 10 minutes. Remove chicken from skillet or deep fryer and drain on paper towels. 2. Melt the butter in a large skillet. Stir in the, vinegar and hot pepper sauce. Season with salt and pepper to taste. Add cooked chicken to sauce and stir over low heat to coat. The longer the wings simmer in the sauce, the hotter they will be. Serve warm.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "256"
},
{
  "url": "https://www.allrecipes.com/recipe/231008/garlic-and-parmesan-chicken-wings/",
  "name": "Garlic and Parmesan Chicken Wings",
  "rating": "4.8",
  "ratingcount": "332",
  "ingredients": "cooking spray; 3 quarts cold water; ⅓ cup balsamic vinegar; ¼ cup salt; 1  bay leaf; 1 teaspoon dried thyme; 1 teaspoon dried oregano; 1 teaspoon dried rosemary; 8 cloves garlic, minced; 1 pinch salt; 3 tablespoons olive oil, or as needed; 1 tablespoon freshly ground black pepper; 2 teaspoons red pepper flakes, or to taste; 4 pounds chicken wings, separated at joints, tips discarded; 2 tablespoons fine bread crumbs; 1 cup finely grated Parmigiano-Reggiano cheese, divided",
  "directions": "1. Preheat an oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil and coat foil with cooking spray. 2. Combine water, vinegar, 1/4 cup salt, bay leaf, thyme, oregano, and rosemary in a large stockpot and bring to a boil. Add chicken wings, return to a boil, and cook for 15 minutes. Remove chicken wings with a slotted spoon to a cooling rack and allow to dry for 15 minutes. 3. Mash garlic and a pinch of salt together in a mortar and pestle until smooth. 4. Combine mashed garlic, olive oil, black pepper, and red pepper flakes in a large bowl. 5. Add chicken wings and bread crumbs; toss to coat. Sprinkle with 1/2 cup Parmigiano-Reggiano cheese. 6. Transfer to the prepared baking sheet and sprinkle with remaining 1/2 cup Parmigiano-Reggiano cheese. 7. Bake in the preheated oven until browned, 20 to 25 minutes. 8. Serve hot and enjoy!",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "1 hr 10 mins",
  "calories": "276"
},
{
  "url": "https://www.allrecipes.com/recipe/261293/mango-habanero-chicken-wings/",
  "name": "Mango Habanero Chicken Wings",
  "rating": "4.5",
  "ratingcount": "21",
  "ingredients": "30  chicken wing sections; 1 (12 ounce) can mango nectar; ¼ cup brown sugar; 6  habanero peppers, stemmed; 2 tablespoons soy sauce; 1 tablespoon Sriracha sauce; 1 tablespoon rice vinegar; ½ cup butter; 3 cloves garlic, minced; 2 tablespoons honey; 1 cup cornstarch; 2 cups vegetable oil for frying",
  "directions": "1. Rinse chicken wings and pat dry with paper towels. Place onto a baking sheet, cover, and refrigerate until sauce is finished. 2. Purée mango nectar, brown sugar, habanero peppers, soy sauce, Sriracha, and vinegar in a food processor (habanero seeds will still be visible). Remove the food processor lid carefully as the pepper fumes can be strong. 3. Melt butter in a saucepan over medium heat. Add garlic and cook until fragrant, about 30 seconds. Immediately add mango-habanero mixture and bring to a simmer, stirring frequently. Reduce the heat to medium-low and stir in honey. Simmer, stirring frequently, until sauce is reduced by 75% and thickened to a glaze, 45 minutes to 1 hour. 4. While the sauce is cooking, place a rimmed baking sheet in the oven and preheat to 200 degrees F (95 degrees C). Heat oil in a deep-fryer to 350 degrees F (175 degrees C). Place cornstarch in a resealable plastic bag. 5. Remove wings from the refrigerator and toss in small batches in cornstarch to lightly coat. Place in a single layer onto a plate. 6. Fry 5 to 6 wings at a time in hot oil until golden brown and crispy, about 8 minutes. Drain on paper towels, then place on the baking sheet in the preheated oven to keep warm while you fry remaining batches. 7. Remove wings from the oven and place into a large bowl. Pour 1/2 of the hot sauce over top and mix to coat. Continue adding sauce until wings are coated to your liking.",
  "prep": "30 mins",
  "cook": "1 hr 55 mins",
  "total": "2 hrs 25 mins",
  "calories": "450"
},
{
  "url": "https://www.allrecipes.com/recipe/232335/honey-garlic-chicken-wings/",
  "name": "Honey Garlic Chicken Wings",
  "rating": "4.5",
  "ratingcount": "91",
  "ingredients": "1 large white onion, chopped; ½ cup honey; ½ cup brown sugar; ¼ cup soy sauce; ¼ cup butter; 2 teaspoons mustard powder; 1 ½ teaspoons garlic, minced; 5 pounds chicken wings",
  "directions": "1. Stir onion, honey, brown sugar, soy sauce, butter, mustard powder, and garlic together in a saucepan over medium heat; cook until hot, about 5 minutes. 2. Spread chicken wings in an even layer into a shallow baking dish; pour sauce over the wings. 3. Marinate wings in refrigerate 1 hour to overnight. 4. Preheat oven to 350 degrees F (175 degrees C). 5. Bake the chicken wings, turning occasionally, until no longer pink at the bone and the juices run clear, about 90 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "1 hr 35 mins",
  "total": "1 hr 45 mins",
  "calories": "437"
},
{
  "url": "https://www.allrecipes.com/recipe/256752/awesome-crispy-baked-chicken-wings/",
  "name": "Awesome Crispy Baked Chicken Wings",
  "rating": "4.6",
  "ratingcount": "251",
  "ingredients": "4 pounds chicken wings; ½ cup butter; 2 cloves garlic, minced; 1 cup grated Parmesan cheese; 1 tablespoon dried parsley; 1 tablespoon dried oregano; 2 teaspoons ground paprika; 1 teaspoon salt; ½ teaspoon ground black pepper",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a shallow baking dish with aluminum foil and grease lightly. 2. Cut tips from chicken wings and discard. Cut between the joint to separate each wing into 2 pieces. 3. Combine butter and garlic in a small saucepan over low heat; heat until butter is melted and garlic is fragrant, 3 to 5 minutes. 4. Mix Parmesan cheese, parsley, oregano, paprika, salt, and pepper together in a shallow bowl. 5. Dip chicken wing pieces in melted butter mixture; coat with Parmesan cheese mixture in the bowl. Arrange in the prepared baking dish. Drizzle any remaining butter on top. 6. Bake in the preheated oven until skin is browned and juices run clear, about 1 hour.",
  "prep": "25 mins",
  "cook": "1 hr 3 mins",
  "total": "1 hr 28 mins",
  "calories": "233"
},
{
  "url": "https://www.allrecipes.com/recipe/268027/instant-pot-buffalo-wings/",
  "name": "Instant Pot® Buffalo Wings",
  "rating": "4.7",
  "ratingcount": "20",
  "ingredients": "1 cup water; 2 pounds chicken wings; ¾ cup buffalo wing sauce; 2 teaspoons dry ranch dressing mix",
  "directions": "1. Pour water into a multi-functional pressure cooker (such as Instant Pot®). Set trivet inside and place wings on top. Secure the lid, seal, and select Manual setting. Cook on high pressure according to manufacturer's instructions; set timer for 10 minutes. Allow 10 to 15 minutes for pressure to build. 2. Mix wing sauce and ranch dressing mix in a large bowl. Line a baking sheet with aluminum foil. 3. Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid carefully. Transfer wings to the bowl of sauce using tongs. Toss to coat. 4. Place a wire baking rack over the foil-lined baking sheet and arrange wings on top. 5. Set an oven rack about 6 inches from the heat source and preheat the oven's broiler to high. Broil wings for 5 minutes. Flip wings and cook until crispy, about 5 minutes more. Toss with any remaining sauce if desired.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "95"
},
{
  "url": "https://www.allrecipes.com/recipe/281637/spicy-air-fryer-wings/",
  "name": "Spicy Air Fryer Wings",
  "rating": "4.7",
  "ratingcount": "7",
  "ingredients": "1 ½ pounds chicken wings and drummettes; 2 teaspoons olive oil; 1 tablespoon smoked paprika; 1 tablespoon chili powder; 1 ½ teaspoons ground cumin; 1 ½ teaspoons onion powder; 1 ½ teaspoons garlic powder; 1 ½ teaspoons ground black pepper; 1 ½ teaspoons kosher salt; 1 teaspoon cayenne pepper, or more to taste",
  "directions": "1. Rinse chicken and pat dry. Place in a large bowl, drizzle with oil, and toss to coat. 2. Combine paprika, chili powder, cumin, onion powder, garlic powder, black pepper, salt, and cayenne in a small bowl. Sprinkle over chicken and toss until evenly covered. 3. Preheat an air fryer to 375 degrees F (190 degrees C) according to manufacturer's instructions. 4. Arrange chicken in the basket of the preheated air fryer in a single layer, not touching. Cook until no longer pink at the bone and the juices run clear, about 12 minutes, turning halfway through. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). For crispier wings, increase temperature to 400 degrees F (200 degrees C) and cook for 2 to 3 minutes more. 5. Let rest for a few minutes before serving.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "336"
},
{
  "url": "https://www.allrecipes.com/recipe/256355/3-ingredient-baked-bbq-chicken-wings/",
  "name": "3-Ingredient Baked BBQ Chicken Wings",
  "rating": "4.6",
  "ratingcount": "25",
  "ingredients": "5 pounds frozen chicken wings, thawed; 10 fluid ounces barbeque sauce (such as Kraft® Original); 2 tablespoons maple-flavored syrup (such as Mrs. Butterworth's®)",
  "directions": "1. Gather all ingredients. Place wings in a large bowl. 2. Preheat oven to 425 degrees F (220 degrees C). 3. Mix barbecue sauce and syrup together, then pour over wings and toss to coat. Arrange coated wings on a baking tray. 4. Bake in the preheated oven, flipping every 15 to 20 minutes, for 1 hour. Turn on oven's broiler and broil wings until golden brown, about 5 minutes per side. An instant-read thermometer inserted near the bone should read at least 165 degrees F (74 degrees C). 5. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 20 mins",
  "calories": "173"
},
{
  "url": "https://www.allrecipes.com/recipe/270194/air-fryer-buffalo-chicken-wings/",
  "name": "Air Fryer Chicken Wings",
  "rating": "4.8",
  "ratingcount": "19",
  "ingredients": "2 ½ pounds chicken wings; 1 tablespoon olive oil; ⅔ cup cayenne pepper sauce; ½ cup butter; 2 tablespoons vinegar; 1 teaspoon garlic powder; ¼ teaspoon cayenne pepper",
  "directions": "1. Preheat an air fryer to 360 degrees F (180 degrees C). 2. Place wings in a large bowl; drizzle oil over wings and massage until chicken is evenly coated. Arrange 1/2 of the wings in a single layer in the air fryer basket. 3. Cook in the preheated air fryer for 25 minutes. Use tongs to flip wings and cook until golden brown and crisp on the outside, 5 minutes more. Transfer cooked wings to a large bowl; cover to keep warm. Repeat with remaining wings. 4. While the second batch is cooking, combine hot pepper sauce, butter, vinegar, garlic powder, and cayenne pepper in a small saucepan over medium heat. Stir and keep warm until wings are cooked. 5. Pour sauce over cooked wings and toss to coat.",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 5 mins",
  "calories": "453"
},
{
  "url": "https://www.allrecipes.com/recipe/268473/actifried-chicken-wings/",
  "name": "ActiFried Chicken Wings",
  "rating": "3.0",
  "ratingcount": "1",
  "ingredients": "1 kg chicken wings; Salt and pepper to taste",
  "directions": "1. Put the chicken wings in the ActiFry. Close the lid. 2. Leave to cook for 12 minutes. Add salt and pepper to taste. 3. If you wish to add a sauce (barbecue) or spices (paprika, Cajun, etc), add 1 or 2 ActiFry spoons 5 minutes before the end of cooking time.",
  "prep": "5 mins",
  "cook": "12 mins",
  "total": "17 mins",
  "calories": "252"
},
{
  "url": "https://www.allrecipes.com/recipe/219106/garlic-ginger-chicken-wings/",
  "name": "Garlic-Ginger Chicken Wings",
  "rating": "4.7",
  "ratingcount": "323",
  "ingredients": "cooking spray; 5 pounds chicken wings, separated at joints, tips discarded; salt and ground black pepper to taste; 3 tablespoons hot sauce (such as Frank's Red Hot ®); 2 tablespoons vegetable oil; 1 cup all-purpose flour; 3  crushed garlic cloves; 2 tablespoons minced fresh ginger root; 1 tablespoon Asian chile pepper sauce; ½ cup rice vinegar; ½ cup packed brown sugar; 1 tablespoon soy sauce",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Line 2 baking sheets with aluminum foil; grease the foil with cooking spray. 2. Place the chicken in a large mixing bowl. Season with salt, pepper, and hot sauce. Add the vegetable oil; toss to coat. 3. Place the flour and wings in a large, food-safe plastic bag. Hold the bag closed tightly, and shake to coat the wings entirely with the flour; no wet spots should remain. Arrange the wings on the prepared baking sheets, making sure none of the pieces are touching one another. Spray wings with additional cooking spray 4. Bake in the preheated oven for 30 minutes, turn all the wings, and return to the oven to cook until crispy and no longer pink in the center, about 30 minutes more. 5. Whisk together the garlic, ginger, chili paste, rice vinegar, brown sugar, and soy sauce in a saucepan. Bring the mixture to a boil and immediately remove from heat. 6. Put about half the wings in a large mixing bowl. Pour about half the sauce over the wings. Toss the wings with tongs to coat evenly; transfer to a tray and allow to sit about 5 minutes to allow the sauce to soak into the wings before serving. Repeat with remaining wings and sauce.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "230"
},
{
  "url": "https://www.allrecipes.com/recipe/217092/caramelized-chicken-wings/",
  "name": "Caramelized Chicken Wings",
  "rating": "4.7",
  "ratingcount": "313",
  "ingredients": "1 cup water; ½ cup white sugar; ⅓ cup soy sauce; 2 tablespoons peanut butter; 1 tablespoon honey; 2 teaspoons wine vinegar; 1 tablespoon minced garlic; 12  large chicken wings, tips removed and wings cut in half at joint; 1 teaspoon sesame seeds, or to taste (Optional)",
  "directions": "1. In an electric skillet or a large skillet over medium heat, mix together the water, sugar, soy sauce, peanut butter, honey, wine vinegar, and garlic until smooth and the sugar has dissolved. Place the wings into the sauce, cover, and simmer for 30 minutes. Uncover and simmer until the wings are tender and the sauce has thickened, about 30 more minutes, spooning sauce over wings occasionally. Sprinkle with sesame seeds.",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 5 mins",
  "calories": "529"
},
{
  "url": "https://www.allrecipes.com/recipe/247275/smoked-chicken-wings/",
  "name": "Smoked Chicken Wings",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "16  chicken wings, tips discarded; ¼ cup olive oil; ¼ cup dry rub for chicken (such as McCormick® Grill Mates®); 1 pound mesquite wood chips, soaked in water; 1 (8 ounce) bottle blue cheese salad dressing",
  "directions": "1. Place chicken wings in a large bowl. Pour in olive oil; toss with hands until coated. Coat wings evenly with dry rub. 2. Light charcoal and heat smoker to 170 to 200 degrees F (77 to 93 degrees C) according to manufacturer's instructions. 3. Drain wood chips and place half of them directly on the charcoal. Spread wings evenly on the cooking grate skin-side down. 4. Smoke wings until fragrant, about 1 hour. 5. Flip wings. Add remaining wood chips to the charcoal. Continue smoking until an instant-read thermometer inserted near the bone reads 165 degrees F (74 degrees C), about 1 hour more. 6. Serve chicken wings with blue cheese dressing.",
  "prep": "10 mins",
  "cook": "2 hrs",
  "total": "2 hrs 10 mins",
  "calories": "295"
},
{
  "url": "https://www.allrecipes.com/recipe/272390/indian-masala-chicken-wings/",
  "name": "Indian Masala Chicken Wings",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "2 teaspoons ground coriander; 2 teaspoons ground cumin; ½ teaspoon ground cardamom; ½ teaspoon hot chile powder; ½ teaspoon ground black pepper; ¼ teaspoon ground cloves; 1 tablespoon vegetable oil; 1 tablespoon water; 1 teaspoon salt, or more as needed; 5 large chicken wings, cut in 2, tips discarded",
  "directions": "1. Combine coriander, cumin, cardamom, chile powder, pepper, and cloves in a dry pan over low heat. Stir until fragrant. Remove from heat, add oil and water, and stir until combined. Set spice paste aside. 2. Rub salt over wings in a shallow dish, then rub spice paste all over. Cover and refrigerate, 4 hours to overnight. 3. Preheat an outdoor grill for high heat and lightly oil the grate. Add wings and cook, turning halfway, until well browned, 15 to 20 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "4 hrs 25 mins",
  "calories": "77"
},
{
  "url": "https://www.allrecipes.com/recipe/220399/half-time-hoisin-chicken-wings/",
  "name": "Half Time Hoisin Chicken Wings",
  "rating": "4.7",
  "ratingcount": "57",
  "ingredients": "cooking spray; ½ cup hoisin sauce; ⅓ cup low sodium teriyaki sauce; ¼ cup brown sugar; 2 cloves garlic, minced; 1 tablespoon grated fresh ginger; 1 tablespoon chile-garlic sauce, or to taste; 3 pounds chicken wings, cut apart at joints, wing tips discarded",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Spray a baking sheet with cooking spray. 3. Whisk together hoisin sauce, teriyaki sauce, brown sugar, garlic, ginger, and chili-garlic sauce in a bowl. 4. Arrange chicken wing pieces on the prepared baking sheet. 5. Brush chicken with hoisin sauce mixture. 6. Bake in the preheated oven until chicken wings are no longer pink in the center, 20 to 25 minutes on each side, basting every 15 minutes.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "194"
},
{
  "url": "https://www.allrecipes.com/recipe/19917/bbq-chicken-wings/",
  "name": "BBQ Chicken Wings",
  "rating": "4.7",
  "ratingcount": "88",
  "ingredients": "½ cup teriyaki sauce; 1 cup oyster sauce; ¼ cup soy sauce; ¼ cup ketchup; 2 tablespoons garlic powder; ¼ cup gin; 2 dashes liquid smoke flavoring; ½ cup white sugar; 1 ½ pounds chicken wings, separated at joints, tips discarded; ¼ cup honey",
  "directions": "1. In a large bowl, mix the teriyaki sauce, oyster sauce, soy sauce, ketchup, garlic powder, gin, liquid smoke, and sugar. Place the chicken wings in the bowl, cover, and marinate in the refrigerator 8 hours or overnight. 2. Preheat the grill for low heat. 3. Lightly oil the grill grate. Arrange chicken on the grill, and discard the marinade. Grill the chicken wings on one side for 20 minutes, then turn and brush with honey. Continue grilling 25 minutes, or until juices run clear.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "9 hrs",
  "calories": "402"
},
{
  "url": "https://www.allrecipes.com/recipe/8558/wings-in-cola/",
  "name": "Wings In Cola",
  "rating": "4.2",
  "ratingcount": "153",
  "ingredients": "4 pounds chicken wings, tips discarded; 1 teaspoon garlic salt; 1 teaspoon onion powder; 1 (12 fluid ounce) can cola-flavored carbonated beverage; 1 cup packed light brown sugar; 2 tablespoons soy sauce",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Place chicken wings in a shallow casserole dish. Season with garlic salt and onion salt. Mix cola, sugar, and soy sauce; pour mixture over chicken wings. 3. Bake, covered, at 325 degrees F (165 degrees C) for 2 hours. Turn wings over every 30 minutes. Uncover, and bake for an additional 1 to 2 hours. Turn wings every 30 minutes or so.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "315"
},
{
  "url": "https://www.allrecipes.com/recipe/24791/easy-slow-cooker-chicken-wings/",
  "name": "Easy Slow Cooker Chicken Wings",
  "rating": "3.7",
  "ratingcount": "142",
  "ingredients": "5 ½ pounds chicken wings, split and tips discarded; 1 (12 fluid ounce) can or bottle chile sauce; ¼ cup fresh lemon juice; ¼ cup molasses; 2 tablespoons Worcestershire sauce; 3 drops hot pepper sauce; 1 tablespoon salsa; 2 ½ teaspoons chili powder; 1 teaspoon garlic powder; 2 teaspoons salt",
  "directions": "1. Place chicken in slow cooker. In a medium bowl combine the chile sauce, lemon juice, molasses, Worcestershire sauce, hot pepper sauce, salsa, chili powder, garlic powder and salt. Mix together and pour mixture over chicken. 2. Cook in slow cooker on Medium Low setting for 5 hours.",
  "prep": "5 mins",
  "cook": "5 hrs",
  "total": "5 hrs 5 mins",
  "calories": "284"
},
{
  "url": "https://www.allrecipes.com/recipe/256641/sweet-and-spicy-bbq-chicken-wings/",
  "name": "Sweet and Spicy BBQ Chicken Wings",
  "rating": "4.5",
  "ratingcount": "10",
  "ingredients": "2 pounds frozen, ready-to-cook chicken wings; ⅔ cup ketchup; ½ cup red wine vinegar; ¼ cup dark brown sugar; 2 teaspoons smoked paprika; ½ teaspoon salt; ½ teaspoon freshly cracked black pepper; ½ teaspoon red pepper flakes",
  "directions": "1. Arrange chicken wings on a grill pan. Cook in the Panasonic Countertop Induction Oven on \"Auto Cook\" setting 1 until browned, about 18 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 2. Make barbeque sauce by whisking ketchup, vinegar, brown sugar, paprika, salt, pepper, and red pepper flakes together in a small sauce pan until well combined. Simmer for 5 minutes, stirring occasionally. 3. Place cooked wings in a large bowl; pour desired amount of sauce over top and toss to coat well.",
  "prep": "10 mins",
  "cook": "23 mins",
  "total": "33 mins",
  "calories": "269"
}]