[{
  "url": "https://www.allrecipes.com/recipe/223091/cafe-style-grilled-chicken-sandwiches/",
  "name": "Grilled Chicken Sandwiches",
  "rating": "4.8",
  "ratingcount": "36",
  "ingredients": "2  skinless, boneless chicken breast halves; ¼ cup olive oil; 2 tablespoons white wine vinegar; 1  lemon, juiced; 4 sprigs fresh dill, chopped; 1 tablespoon garlic and herb seasoning blend (such as Mrs. Dash); 1 teaspoon ground black pepper; 2 tablespoons butter; 2 tablespoons olive oil; ⅛ teaspoon garlic powder; ⅛ teaspoon salt; 8 thick slices French bread; 2 tablespoons mayonnaise, or to taste; 4 slices tomato; 4  lettuce leaves",
  "directions": "1. Preheat the grill to medium-high heat. 2. Prick chicken breasts all over with a fork, then place in a large bowl. Add 1/4 cup olive oil, white wine vinegar, lemon juice, dill, garlic and herb seasoning, and black pepper to the bowl. Stir to coat chicken breasts thoroughly. Let stand for 10 minutes. 3. Remove chicken breasts from marinade; discard marinade. 4. Cook chicken on the preheated grill until no longer pink in the center and juices run clear, 10 to 15 minutes per side. An instant-read thermometer inserted into the center of a breast should read at least 165 degrees F (74 degrees C). Transfer chicken to a cutting board; let stand for 5 minutes, then cut chicken breasts in half. 5. Melt butter and 2 tablespoons olive oil in a skillet over medium-high heat. Sprinkle garlic powder and salt over butter and oil. Add French bread slices to the skillet; toast until golden brown on one side, about 3 minutes; remove from the pan. 6. For sandwich assembly, place 1 French bread slice, toasted-side down, onto a serving plate. Spread mayonnaise on bread; top with a tomato slice, then season with salt and pepper. Cover with a grilled chicken breast half and lettuce leaf. Spread untoasted side of another French bread slice with mayonnaise and place on top to make a sandwich.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "55 mins",
  "calories": "553"
},
{
  "url": "https://www.allrecipes.com/recipe/19619/chicken-on-a-stick/",
  "name": "Chicken on a Stick",
  "rating": "4.5",
  "ratingcount": "36",
  "ingredients": "4  skinless, boneless chicken breast halves; 1 teaspoon meat tenderizer; ½ cup Italian-style salad dressing",
  "directions": "1. Place chicken breasts in a resealable plastic bag; sprinkle with meat tenderizer. Pour in dressing and turn chicken to coat thoroughly; squeeze out excess air and seal the bag. Marinate in the refrigerator for 30 minutes to 1 hour. 2. Preheat an outdoor grill for medium heat and lightly oil the grate. 3. Place chicken onto skewers and cook on the preheated grill until no longer pink in the center and the juices run clear, about 5 to 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "218"
},
{
  "url": "https://www.allrecipes.com/recipe/8512622/chicken-salad-souffle-casserole/",
  "name": "Chicken Salad Souffle Casserole",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "8 slices white bread, cut into 1/2-inch cubes, divided; 3 cups cooked, cubed chicken breast meat; ½ cup mayonnaise; ½ cup chopped bell pepper (any color); ½ cup chopped celery; ½ cup chopped onion; 1 cup frozen peas; salt and freshly-ground black pepper, to taste; 1 ½ cups milk; 2 large eggs, lightly beaten; 1 (10.75 ounce) can  condensed cream of mushroom soup; 1 cup shredded Cheddar cheese",
  "directions": "1. Spread half of the bread cubes into the bottom of a greased 13x9-inch casserole dish. 2. Stir chicken, mayonnaise, bell pepper, celery, onion, and peas together in a large bowl; season with salt and pepper. Spread chicken mixture on top of bread cubes. Top with remaining bread cubes. 3. Whisk milk and eggs together, and pour over casserole. Cover and refrigerate overnight. 4. Preheat the oven to 325 degrees F (165 degrees C). Remove casserole from the refrigerator, uncover, and spread condensed soup evenly over the top. 5. Bake in the preheated oven for 40 minutes. 6. Sprinkle cheese over top, and continue baking until golden brown and heated through, 20 to 25 minutes more.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "328"
},
{
  "url": "https://www.allrecipes.com/recipe/8453628/garlic-chicken-rigatoni/",
  "name": "Garlic Chicken Rigatoni",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "1 (8 ounce) package rigatoni pasta; 1 tablespoon salt; 1 pound skinless, boneless chicken breasts, cut into bite-sized pieces; 1 tablespoon herb-infused olive oil; ¼ cup tapioca starch; 1 teaspoon Italian seasoning; ¼ teaspoon salt; ⅛ teaspoon freshly ground black pepper; ¾ cup water; ⅓ cup sliced fresh mushrooms; ¼ cup chopped marinated artichoke hearts; 2 tablespoons chopped oil-packed sun-dried tomatoes; 3 cloves minced garlic; ⅓ cup Chardonnay wine; ¼ cup heavy whipping cream; 2 ounces shredded aged Cheddar cheese",
  "directions": "1. Bring a large pot with water and 1 tablespoon salt to a boil. Cook rigatoni in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 minutes. Drain and reserve pasta water. 2. Meanwhile, combine tapioca starch, Italian seasoning, salt, and black pepper in a bowl. Add chicken pieces and toss to coat. 3. Heat olive oil in a skillet until it shimmers. Add chicken pieces and cook until browned, about 5 minutes. You might be tempted to add more olive oil or butter, don't do this. 4. Pour in reserved pasta water and add mushrooms, artichoke hearts, sun-dried tomatoes, and garlic. Cook about 5 minutes. 5. Mix in white wine, cream and Cheddar cheese. Whisk until sauce is slightly thickened. Add rigatoni and toss to combine. 6. Add rigatoni and toss to combine. Serve immediately.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "425"
},
{
  "url": "https://www.allrecipes.com/recipe/88817/grilled-lemon-chicken/",
  "name": "Grilled Lemon Chicken",
  "rating": "4.5",
  "ratingcount": "583",
  "ingredients": "⅓ cup lemon juice; ¼ cup olive oil; 1 tablespoon Dijon mustard; 2 large cloves garlic, finely chopped; 2 tablespoons finely chopped red bell pepper; ½ teaspoon salt; ¼ teaspoon ground black pepper; 4  skinless, boneless chicken breast halves",
  "directions": "1. Combine lemon juice, olive oil, Dijon mustard, garlic, red bell pepper, salt, and pepper together in a bowl. Set aside 1/4 cup of the marinade to use for basting. Place chicken breasts in the bowl and stir to coat. Marinate at least 20 minutes in the refrigerator. 2. Preheat an outdoor grill for high heat and lightly oil the grate. 3. Remove chicken from marinade and shake off excess; discard the remaining marinade in the bowl. Cook chicken on the preheated grill until no longer pink in the center, about 6 to 8 minutes per side, basting occasionally with the reserved marinade. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "264"
},
{
  "url": "https://www.allrecipes.com/recipe/17904/kabobs/",
  "name": "Kabobs",
  "rating": "4.6",
  "ratingcount": "290",
  "ingredients": "½ cup teriyaki sauce; ½ cup honey; ½ teaspoon garlic powder; ½ pinch ground ginger; 1 ½ pounds skinless, boneless chicken breast halves - cut into cubes; 1 pound beef sirloin, cut into 1 inch cubes; 2  red bell peppers, cut into 2 inch pieces; 1 large sweet onion, peeled and cut into wedges; 1 ½ cups whole fresh mushrooms; skewers",
  "directions": "1. Mix teriyaki sauce, honey, garlic powder, and ginger in a large resealable plastic bag. Place chicken, beef, red bell peppers, onion wedges, and mushrooms in the bag, coat with the marinade, squeeze out excess air, and seal the bag. Refrigerate for 4 hours to overnight. 2. Preheat the grill to medium-high heat. Lightly oil the grill grate. 3. Discard marinade. Thread meat and vegetables onto skewers, leaving a small space between each item. 4. Grill skewers, turning as needed, until meat is cooked through and vegetables are tender, about 10 minutes.",
  "prep": "30 mins",
  "cook": "10 mins",
  "total": "4 hrs 40 mins",
  "calories": "304"
},
{
  "url": "https://www.allrecipes.com/recipe/8479616/chicken-bacon-ranch-pasta/",
  "name": "Chicken Bacon Ranch Pasta",
  "rating": "4.8",
  "ratingcount": "12",
  "ingredients": "3 ¾ cups uncooked rotini pasta; 4  thick-cut bacon slices; 1 pound skinless, boneless chicken breasts, cut into bite-sized pieces; 1 tablespoon dry ranch dressing mix; 2 tablespoons butter; 2 tablespoons flour; 1 ½ cups 2% milk; ½ cup reserved pasta water (Optional); 1 (8 ounce) package cream cheese, softened; 5 teaspoons dry ranch dressing mix; 1 pinch salt; 1 tablespoon chopped fresh parsley (Optional)",
  "directions": "1. Bring a large pot of lightly salted water to a boil; cook rotini at a boil until tender yet firm to the bite, about 8 minutes. Drain rotini, saving 1/2 cup of pasta water. 2. Meanwhile, place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned and crispy, about 10 minutes. Remove bacon and drain on paper towels. Leave rendered bacon grease in the skillet. 3. Sprinkle chicken pieces with 1 tablespoon ranch seasoning. Add to the skillet with the bacon grease and cook until golden brown, 5 to 8 minutes. Remove cooked chicken from skillet and set aside. 4. Rinse out skillet. Melt down 2 tablespoon butter in the skillet over medium heat. Whisk in flour until smooth and thickened, about 2 minutes. Slowly add in milk, whisking until sauce is smooth. Add pasta water ,1 tablespoon at a time, if the sauce is too thick. 5. Stir softened cream cheese into sauce until well combined. Mix in remaining 5 teaspoons of ranch seasoning and season with salt. Mix until well combined. Add cooked pasta and chicken back into the skillet and mix until well coated with sauce. 6. Finely chop cooked bacon. Mix into pasta dish. Serve garnished with chopped parsley if desired.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "606"
},
{
  "url": "https://www.allrecipes.com/recipe/8465709/chicken-parm-sub/",
  "name": "Chicken Parm Sub",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "cooking spray; 4  frozen breaded chicken breast fillets; ½ cup freshly grated Parmesan cheese; 1 (16 ounce) package frozen garlic bread, thawed; 1 cup tomato sauce or marinara sauce; 4 slices provolone cheese; 12  fresh basil leaves, or to taste; aluminum foil",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Spray a baking pan with vegetable oil spray. 2. Place frozen chicken fillets on the prepared pan and bake for 10 to 12 minutes. Turn chicken, sprinkle 2 tablespoons Parmesan cheese on each fillet, and bake until crispy, an additional 10 to 12 minutes. 3. Slice garlic bread into 4 equal portions. Open each portion and place garlic side up on a baking sheet. Warm garlic bread in the oven about 5 minutes. 4. To assemble the sandwiches, place a chicken fillet on a piece of garlic bread, spoon 1/4 cup tomato sauce or marinara sauce on top of the chicken, and lay a slice of provolone on top of the sauce. Place 3 basil leaves, or more to taste, on each sandwich, and top with the other half. 5. Wrap each sandwich in foil and return to the oven until the cheese is melted, 5 to 8 minutes. Unwrap and serve warm.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "35 mins",
  "calories": "691"
},
{
  "url": "https://www.allrecipes.com/recipe/8469250/instant-pot-thai-chicken-soup/",
  "name": "Instant Pot Thai Chicken Soup",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "4  carrots, peeled and cut into matchstick-size pieces; 1 medium red bell pepper, cut into short thin strips; 2 ½ cups sliced shiitake mushrooms; 12 ounces boneless, skinless chicken breasts, halved horizontally; 2 tablespoons Thai red curry paste; 2 tablespoons sugar; 1 (32 ounce) carton Swanson® Chicken Broth (4 cups); 1 (14 ounce) can unsweetened coconut milk; 2 tablespoons lime juice; 1 tablespoon grated lime zest; 2 tablespoons chopped fresh cilantro",
  "directions": "1. Place the carrots, red pepper, mushrooms, chicken, curry paste, sugar, and Swanson® Chicken Broth into a 6-quart Instant Pot®. 2. Lock the lid and close the pressure release valve. Pressure cook on High pressure, setting the timer to 4 minutes (timer will begin counting down once pressure is reached- it takes about 15 minutes). When done, press Cancel and use the quick release method to release the pressure. 3. Remove the chicken from the pot and stir in the coconut milk. Shred the chicken and return to the pot. Select the Saute setting and cook for 2 minutes or until hot. Stir in the lime juice and lime zest just before serving. Serve sprinkled with the cilantro.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "266"
},
{
  "url": "https://www.allrecipes.com/recipe/8525243/southeast-asian-style-chicken-rice/",
  "name": "Southeast Asian Style Chicken Rice",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "1 large chicken breast, skin on; 1 teaspoon kosher salt, plus more as needed; 1 tablespoon vegetable oil; 1 tablespoon minced ginger; 2 cloves garlic, minced; ⅓ cup diced onions; ½ teaspoon turmeric; 1 cup plus 1 tablespoon jasmine rice; 1 ½ cups chicken broth; ½ cup thinly sliced red onion; ¼ cup sliced green onions; 1 small red Fresno chili, thinly sliced, or any other hot pepper; 2 tablespoons fresh lime juice, plus more to taste; 2 teaspoons soy sauce, or to taste; 1 teaspoon sambal hot chili sauce; 1 teaspoon sesame oil, or to taste; ¼ teaspoon freshly ground black pepper; salt to taste; ½ cup freshly torn mint leaves; ½ cup freshly torn cilantro leaves; lime wedges (Optional)",
  "directions": "1. Set chicken breast onto a cutting board and make 5 or 6 shallow cuts through the skin. Season generously on both sides with salt. 2. Heat vegetable oil in a skillet over medium high heat and sear chicken breast, skin-side down, until the skin is golden brown and fat has rendered out, about 5 minutes. Flip breast over, and keep cooking until chicken is cooked through, about 5 minutes more. If oil starts to smoke before the chicken is cooked, reduce heat to medium or medium-low. 3. Turn off the heat and transfer chicken to a plate to rest until cool enough to handle. Peel off the skin and finely chop. Refrigerate chicken breast. 4. Add minced chicken skin back into the skillet over and medium heat. Cook and stir until the skin browns and starts getting crisp, 3 to 5 minutes. Add ginger, garlic, and onions and cook, stirring, until onions start to turn translucent, about 5 minutes. Add turmeric and rice; cook and stir until rice is well coated with oil, 2 to 3 minutes. 5. Stir in broth, turn heat to high, and bring to a boil. Cover, reduce heat to low, and simmer undisturbed for 20 minutes. Turn off the heat and set a timer for 10 minutes to allow rice to rest. 6. Meanwhile, shred the chicken meat using your hands or cut into small pieces. Place into a bowl. Add red onion, green onions, Fresno chili, lime juice, soy sauce, hot sauce, sesame oil, salt, pepper, fresh mint and cilantro. Toss until well combined. Taste and adjust with more lime juice, salt, and/or spice as needed. 7. After the 10 minute rice timer is up, remove cover, and fluff rice with a fork. Taste and adjust seasoning if necessary. Serve rice topped with the chicken herb salad mixture and lime wedges.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "820"
},
{
  "url": "https://www.allrecipes.com/recipe/8469279/one-pan-tomato-spinach-chicken-pasta/",
  "name": "One-Pan Tomato & Spinach Chicken Pasta",
  "rating": "4.4",
  "ratingcount": "11",
  "ingredients": "10 ounces boneless skinless chicken breasts, cut into 1 inch pieces; 1 tablespoon olive oil; 1 medium onion, chopped; ¼ cup red wine; 1 (14.5 ounce) can diced tomatoes with basil, garlic, and oregano, undrained; 1 cup Swanson® Chicken Broth; 4 ounces uncooked penne pasta; ¾ cup water; 4 cups baby spinach",
  "directions": "1. Season the chicken as desired. Heat the oil in a 12-inch skillet over medium-high heat. Add the chicken and cook until well browned, stirring often. Remove the chicken from the skillet. 2. Add the onion to the skillet and cook until tender-crisp, stirring occasionally. Add the wine and heat to a boil, stirring to scrape up any browned bits from the bottom of the skillet. 3. Stir in the tomatoes, Swanson Chicken Broth, penne, and water; heat to a boil. Reduce the heat to medium. Cook for 10 minutes or until the penne is tender, stirring occasionally. Return the chicken to the skillet. Cook for 2 minutes or until the chicken is cooked through. Stir in the spinach and cook for 1 minute or until the spinach is wilted.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "525"
},
{
  "url": "https://www.allrecipes.com/recipe/279283/spicy-chicken-jerky-in-the-air-fryer/",
  "name": "Spicy Chicken Jerky in the Air Fryer",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "2 (5 ounce) boneless chicken breasts, cut into strips; ½ cup mojo criollo marinade (such as Goya®); 2 teaspoons Cajun seasoning; 6  wooden skewers",
  "directions": "1. Combine chicken strips, marinade, and Cajun seasoning in a resealable plastic bag. Refrigerate for 8 hours to overnight. 2. Measure skewers to fit across the air fryer basket, slightly overlapping the edge. Trim off excess length. 3. Preheat the air fryer to 180 degrees F (80 degrees C) for 10 minutes. 4. Thread chicken strips onto skewers, leaving room in between each strip, while the air fryer is preheating. 5. Air fry for 1 hour 15 minutes. Adjust cooking time as most air fryers have a maximum setting of 30 minutes. Rearrange the skewers during the reset time. 6. Increase temperature to 200 degrees F (95 degrees C) and air fry for an additional 15 minutes. 7. Remove strips to a paper towel-lined storage container. Seal. Allow to rest overnight before serving.",
  "prep": "10 mins",
  "cook": "1 hr 30 mins",
  "total": "17 hrs 40 mins",
  "calories": "54"
},
{
  "url": "https://www.allrecipes.com/recipe/8496389/firecracker-chicken/",
  "name": "Firecracker Chicken",
  "rating": "4.9",
  "ratingcount": "27",
  "ingredients": "⅔ cup cornstarch; 1 teaspoon ground ginger; ½ teaspoon freshly ground black pepper; 1 ½ teaspoons kosher salt, divided; 3 large eggs, beaten; 1 ½ pounds boneless skinless chicken breasts, cut into 1 inch pieces; ¼ cup canola or peanut oil; ¾ cup honey; ½ cup hot pepper sauce (such as Crystal®); 1 tablespoon rice vinegar; ½ teaspoon crushed red pepper (Optional); 4 cups cooked white rice; ½ cup thinly sliced scallions; toasted white sesame seeds, for garnish",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Place a rack in the center of the oven. 2. Combine cornstarch, ginger, pepper, and 1 teaspoon salt in a large bowl. Place beaten eggs in a separate large, shallow bowl. Add chicken to cornstarch mixture and toss to coat. 3. Heat 2 tablespoons oil in a large nonstick skillet over medium-high until shimmering. 4. While oil is heating, transfer 1/3 of the chicken to dish with eggs and toss to coat. 5. Use a slotted spoon to transfer chicken to the hot skillet and cook in hot oil, turning once, until chicken is golden on both sides, about 2 minutes per side (chicken will not be cooked through at this point). Transfer to a 9x13-inch baking dish. Repeat with remaining chicken, adding 1 tablespoon of oil to the skillet per new batch (3 batches total). 6. Stir together honey, hot sauce, vinegar, crushed red pepper, and remaining 1/2 teaspoon salt in a bowl. Pour over chicken in the baking dish and stir to coat. 7. Bake in the preheated oven until chicken is no longer pink in the center and the juices run clear, stirring halfway through, 25 to 30 minutes. An instant-read thermometer inserted into the center of the chicken should read 165 degrees F (74 degrees C). 8. Serve over rice and sprinkle with scallions and sesame seeds.",
  "prep": "25 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "854"
},
{
  "url": "https://www.allrecipes.com/recipe/269649/skillet-chicken-with-sun-dried-tomato-sauce/",
  "name": "Chicken with Creamy Sun-Dried Tomato Sauce",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "4 pounds boneless skinless chicken breasts; salt and pepper to taste; 10 tablespoons butter, divided; 6 cloves garlic, minced; 2 teaspoons Italian seasoning; ½ teaspoon red pepper flakes; 1 cup dry white wine (such as Chardonnay); 2 cups chicken broth; 1 ½ cups heavy whipping cream; 1 cup oil-packed sun-dried tomatoes, thinly sliced; 1 cup thinly sliced fresh basil",
  "directions": "1. Place chicken breasts in a resealable plastic bag and pound to an even thickness. If breasts are very large, cut them in half. Season lightly with salt and pepper. 2. Melt 4 tablespoons butter in a large nonstick skillet over medium heat and cook 1/2 of the chicken breasts until they are no longer pink in the center and the juices run clear, 5 to 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from skillet and set aside. Melt another 4 tablespoons butter and repeat with the remaining chicken breasts. Set aside. 3. Melt remaining 2 tablespoons butter in the same skillet and add garlic, Italian seasoning, and red pepper flakes. Cook, stirring constantly, for 1 minute. Pour in wine and bring to a boil. Reduce heat and simmer for 2 minutes. Pour in chicken broth, return to a boil, reduce heat, and simmer for 5 minutes. Stir in cream and sun-dried tomatoes. Simmer for 5 minutes. 4. Stir in basil and return chicken to the skillet. Cook until chicken is thoroughly heated and sauce has thickened, about 5 minutes.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "495"
},
{
  "url": "https://www.allrecipes.com/recipe/8457744/air-fryer-chicken-bites-with-parmesan-cheese/",
  "name": "Air Fryer Chicken Bites with Parmesan Cheese",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "2 teaspoons olive oil; 2 teaspoons Worcestershire sauce; 1 teaspoon dried Italian seasoning; ½ teaspoon garlic powder; ¼ teaspoon salt; ⅛ teaspoon freshly ground black pepper; 1 pound skinless, boneless chicken breast, cut into 1-inch cubes; 2 tablespoons all-purpose flour; cooking spray; ¼ cup shredded Parmesan cheese; 2 tablespoons chopped fresh parsley",
  "directions": "1. Whisk olive oil, Worcestershire, Italian seasoning, garlic powder, salt, and pepper together in a bowl. Add chicken cubes and stir to coat. 2. Preheat an air fryer to 370 degrees F (185 degrees C) for 10 minutes. 3. Add flour to the chicken mixture and stir to coat until all liquid is absorbed. 4. Place chicken in the basket of the air fryer and cook for 8 minutes. Using tongs, flip the pieces over. Spray tops with non-stick cooking spray and cook 8 minutes more. 5. Sprinkle Parmesan cheese and parsley over the chicken. Cook until cheese has started to melt, about 2 minutes more. Serve immediately.",
  "prep": "10 mins",
  "cook": "18 mins",
  "total": "28 mins",
  "calories": "187"
},
{
  "url": "https://www.allrecipes.com/recipe/242342/fiesta-slow-cooker-shredded-chicken-tacos/",
  "name": "Fiesta Slow Cooker Shredded Chicken Tacos",
  "rating": "4.5",
  "ratingcount": "163",
  "ingredients": "1 cup chicken broth; 3 tablespoons taco seasoning mix; 1 pound skinless, boneless chicken breasts",
  "directions": "1. Combine chicken broth and taco seasoning mix in a bowl. 2. Place chicken in a slow cooker. Pour chicken broth mixture over chicken. 3. Cook on Low for 6 to 8 hours. Shred chicken.",
  "prep": "10 mins",
  "cook": "6 hrs",
  "total": "6 hrs 10 mins",
  "calories": "71"
},
{
  "url": "https://www.allrecipes.com/recipe/26317/chicken-pot-pie-ix/",
  "name": "Chicken Pot Pie",
  "rating": "4.8",
  "ratingcount": "13",
  "ingredients": "1 pound skinless, boneless chicken breast halves - cubed; 1 cup sliced carrots; 1 cup frozen green peas; ½ cup sliced celery; ⅓ cup butter; ⅓ cup chopped onion; ⅓ cup all-purpose flour; ½ teaspoon salt; ¼ teaspoon black pepper; ¼ teaspoon celery seed; 1 ¾ cups chicken broth; ⅔ cup milk; 2 (9 inch)  unbaked pie crusts",
  "directions": "1. Gather all ingredients and preheat the oven to 425 degrees F (220 degrees C.) 2. Combine chicken, carrots, peas, and celery in a saucepan; add water to cover and bring to a boil. Boil for 15 minutes, then remove from the heat and drain. 3. While the chicken is cooking, melt butter in another saucepan over medium heat. Add onion and cook until soft and translucent, 5 to 7 minutes. Stir in flour, salt, pepper, and celery seed 4. Slowly stir in chicken broth and milk. 5. Reduce heat to medium-low and simmer until thick, 5 to 10 minutes. Remove from heat and set aside. 6. Place chicken and vegetables in the bottom pie crust. Pour hot liquid mixture over top. 7. Cover with top crust, seal the edges, and cut away any excess dough. Make several small slits in the top crust to allow steam to escape. 8. Bake in the preheated oven until pastry is golden brown and filling is bubbly, 30 to 35 minutes. Cool for 10 minutes before serving. 9. Serve immediately and enjoy!",
  "prep": "20 mins",
  "cook": "50 mins",
  "total": "1 hr 20 mins",
  "calories": "412"
},
{
  "url": "https://www.allrecipes.com/recipe/8778/cajun-chicken-pasta/",
  "name": "Cajun Chicken Pasta",
  "rating": "4.7",
  "ratingcount": "2",
  "ingredients": "4 ounces linguine pasta; 2  skinless, boneless chicken breast halves; 2 teaspoons Cajun seasoning; 2 tablespoons butter; 1  red bell pepper, sliced; 1  green bell pepper, sliced; 4  fresh mushrooms, sliced; 1  green onion, chopped; 1 cup heavy cream; ¼ teaspoon dried basil; ¼ teaspoon lemon pepper; ¼ teaspoon salt; ⅛ teaspoon garlic powder; ⅛ teaspoon ground black pepper; ¼ cup grated Parmesan cheese",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add pasta and cook until al dente, 8 to 10 minutes. Drain. 2. Cut chicken breast into strips. Place chicken and Cajun seasoning in a plastic bag. Shake to coat. 3. Melt butter in a large skillet over medium heat. Add chicken and cook, stirring, until browned and almost cooked through, 5 to 7 minutes. 4. Add bell peppers, mushrooms, and green onion. Cook, stirring, 2 to 3 minutes. 5. Reduce the heat and stir in cream, basil, lemon pepper, salt, garlic powder, and black pepper. Heat through. Add cooked linguine, toss, and heat through. 6. Sprinkle with Parmesan and serve.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "935"
},
{
  "url": "https://www.allrecipes.com/recipe/9027/kung-pao-chicken/",
  "name": "Kung Pao Chicken",
  "rating": "4.3",
  "ratingcount": "1",
  "ingredients": "2 tablespoons cornstarch, dissolved in 2 tablespoons water; 2 tablespoons white wine, divided; 2 tablespoons soy sauce, divided; 2 tablespoons sesame oil, divided; 1 pound skinless, boneless chicken breast halves - cut into chunks; 1 ounce hot chili paste; 2 teaspoons brown sugar; 1 teaspoon distilled white vinegar; 1 (8 ounce) can water chestnuts; 4 ounces chopped peanuts; 4  green onions, chopped; 1 tablespoon chopped garlic",
  "directions": "1. Combine water and cornstarch in a cup; set aside. 2. Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon sesame oil, and 1 tablespoon cornstarch/water mixture in a large glass bowl. Add chicken pieces and toss to coat. Cover the dish and refrigerate for about 30 minutes. 3. Combine remaining 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon sesame oil, and remaining cornstarch/water mixture in a medium bowl. Whisk in chili paste, brown sugar, and vinegar. Add water chestnuts, peanuts, green onions, and garlic and toss to coat. 4. Transfer water chestnut mixture to a medium skillet. Heat slowly over medium heat until aromatic. 5. Meanwhile, transfer chicken from marinade into a large skillet; cook over medium-high heat, stirring, until chicken is cooked through and juices run clear. 6. Combine water chestnut mixture and sautéed chicken together in one skillet. Adjust heat and simmer together until sauce thickens.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr 30 mins",
  "calories": "437"
},
{
  "url": "https://www.allrecipes.com/recipe/216902/poppy-seed-chicken-casserole/",
  "name": "Poppy Seed Chicken Casserole",
  "rating": "4.7",
  "ratingcount": "283",
  "ingredients": "4  skinless, boneless chicken breast halves; 1 sleeve buttery round crackers (such as Ritz®), crushed; ½ cup butter, melted; 1 teaspoon poppy seeds, or more if desired; 1 (10.75 ounce) can  condensed cream of chicken soup; 1 (8 ounce) container sour cream; 2 cups shredded Cheddar cheese",
  "directions": "1. Place chicken breasts into a large pot; cover with water and bring to a boil over high heat. Reduce heat to medium, cover, and simmer until chicken is no longer pink in the center, about 20 minutes. Drain; shred chicken with two forks. 2. Preheat the oven to 350 degrees F (175 degrees C). Mix crackers, melted butter, and poppy seeds together in a large bowl until combined; set aside. 3. Stir condensed soup and sour cream together in a medium bowl; pour 1/2 of the mixture into a 9-nch square baking dish. Add shredded chicken in an even layer; top with remaining soup mixture. Sprinkle with Cheddar cheese, then top with cracker mixture. 4. Bake in the preheated oven until cheese has melted and the sauce is bubbly, 25 to 30 minutes.",
  "prep": "20 mins",
  "cook": "50 mins",
  "total": "1 hr 10 mins",
  "calories": "593"
},
{
  "url": "https://www.allrecipes.com/recipe/8479625/sheet-pan-chicken-fajita-quesadillas/",
  "name": "Sheet Pan Chicken Fajita Quesadillas",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 tablespoon olive oil; 1  onion, chopped; 1  green bell pepper, chopped; 1  red bell pepper, chopped; 1 pound skinless, boneless chicken breast, chopped; 2 tablespoons water; 1 (1.12 ounce) package fajita seasoning mix; 8  flour tortillas; 2 cups shredded Mexican cheese blend; 4 tablespoons sour cream, for serving; 4 tablespoons pico de gallo, or to taste; 2 tablespoons chopped fresh cilantro, for garnish",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Heat olive oil in a large skillet over medium heat. Add onion and bell peppers and cook until they are just beginning to soften, about 3 minutes. Remove from skillet with a slotted spoon and set aside. 3. Add chicken to the same skillet and cook until no longer pink on the outside, about 5 minutes. Return onion and bell peppers to the skillet. Stir in water and fajita seasoning. Cook and stir until the chicken has cooked completely, about 3 minutes. 4. On a half sheet pan, place 6 tortillas around the edges of the pan so that about half of each tortilla hangs over the side. Place another tortilla in the center to cover the pan completely. 5. Using a slotted spoon, top with the chicken, onion, and pepper mixture in an even layer (being careful not to add too much liquid from the skillet). Finally, sprinkle cheese evenly over the chicken mixture. 6. Place another tortilla in the center on top of all fillings, then fold each tortilla over the toppings towards the center. Place a second half baking sheet on top of tortillas (this will help the quesadilla hold its shape). 7. Bake in the pre-heated oven for 10 minutes. Remove the top baking sheet and continue baking until the tortillas are golden and crispy, 8 to 12 more minutes. 8. Slice into rectangles and serve topped with sour cream, pico de gallo, and cilantro, if desired.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "407"
},
{
  "url": "https://www.allrecipes.com/recipe/223042/chicken-parmesan/",
  "name": "Chicken Parmesan",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "4  skinless, boneless chicken breast halves; salt and freshly ground black pepper to taste; 2 large eggs; 1 cup panko bread crumbs, or more as needed; ¾ cup grated Parmesan cheese, divided; 2 tablespoons all-purpose flour, or more if needed; ½ cup olive oil for frying, or as needed; ½ cup prepared tomato sauce; ¼ cup fresh mozzarella, cut into small cubes; ¼ cup chopped fresh basil; ½ cup grated provolone cheese; 2 teaspoons olive oil",
  "directions": "1. Preheat an oven to 450 degrees F (230 degrees C). 2. Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. 3. Season chicken thoroughly with salt and pepper. Using a sifter or strainer; sprinkle flour over chicken breasts, evenly coating both sides 4. Beat eggs in a shallow bowl and set aside. 5. Mix bread crumbs and 1/2 cup Parmesan cheese in a separate bowl, set aside. 6. Dip a flour-coated chicken breast in beaten eggs. Transfer breast to the bread crumb mixture, pressing crumbs into both sides. Repeat for each breast. Let chicken rest for 10 to 15 minutes. 7. Heat 1/2 inch olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken in the hot oil until golden, about 2 minutes per side. The chicken will finish cooking in the oven. 8. Transfer chicken to a baking dish. Top each breast with 2 tablespoons tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle remaining Parmesan over top and drizzle each with 1/2 teaspoon olive oil. 9. Bake in the preheated oven until cheese is browned and bubbly and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "471"
},
{
  "url": "https://www.allrecipes.com/recipe/231939/honey-glazed-chicken/",
  "name": "Honey Glazed Chicken",
  "rating": "4.4",
  "ratingcount": "536",
  "ingredients": "¼ cup honey; 2 tablespoons soy sauce; ⅛ teaspoon red pepper flakes; 1 ½ tablespoons olive oil; 2  skinless, boneless chicken breast halves, cut into bite-size pieces",
  "directions": "1. Gather all ingredients. 2. Whisk honey, soy sauce, and red pepper flakes in a bowl; set aside. 3. Heat olive oil in a skillet over medium heat; cook and stir chicken in hot oil until lightly brown, about 5 minutes. 4. Pour honey mixture into the skillet; continue to cook and stir until chicken is no longer pink in the center and sauce is thickened, about 5 minutes more. 5. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "179"
},
{
  "url": "https://www.allrecipes.com/recipe/79538/coronation-chicken/",
  "name": "Coronation Chicken",
  "rating": "4.7",
  "ratingcount": "38",
  "ingredients": "6  skinless, boneless chicken breast halves; ⅓ cup sultana raisins; 1 (1 pound) large mango, peeled, thinly sliced; ⅔ cup mayonnaise; 1 teaspoon mild curry powder; 1 tablespoon mango chutney; 1 teaspoon fresh lemon juice; 1 pinch salt and ground black pepper; ¾ cup toasted cashews (Optional)",
  "directions": "1. Poach chicken in lightly salted boiling water until no longer pink and cooked through, 20 minutes. Drain, cool, and cut into 1/2-inch strips. 2. Combine chicken strips, raisins, and 1/2 of the mango in a large bowl. 3. Mix mayonnaise, curry powder, chutney, and lemon juice together in a medium bowl; season with salt and pepper, then toss gently with chicken mixture. Stir in 1/2 of the cashews. Transfer to a platter, and garnish with remaining mango strips and cashews.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "2 hrs",
  "calories": "476"
},
{
  "url": "https://www.allrecipes.com/recipe/280212/baked-lemon-chicken-breasts/",
  "name": "Baked Lemon Chicken Breasts",
  "rating": "4.4",
  "ratingcount": "19",
  "ingredients": "½ cup unsalted butter, melted; 2  lemons, juiced; 1 tablespoon paprika; 1 tablespoon dried oregano; 1 teaspoon garlic salt; salt and ground black pepper to taste; 4 (6 ounce) skin-on, bone-in chicken breasts, split",
  "directions": "1. Mix butter, lemon juice, paprika, oregano, garlic salt, salt, and pepper together in a bowl and pour into a resealable plastic bag. Add chicken breasts, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 3 to 4 hours. 2. Preheat the oven to 325 degrees F (165 degrees C). Transfer chicken to a baking dish, skin-side up. Pour marinade around the chicken. 3. Bake, uncovered, in the preheated oven until chicken is no longer pink at the bone and the juices run clear, about 45 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "3 hrs 55 mins",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/212721/indian-chicken-curry-murgh-kari/",
  "name": "Indian Chicken Curry (Murgh Kari)",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "2 pounds skinless, boneless chicken breast halves; 2 teaspoons salt; ½ cup cooking oil; 1 ½ cups chopped onion; 1 tablespoon minced garlic; 1 ½ teaspoons minced fresh ginger root; 1 tablespoon curry powder; 1 teaspoon ground cumin; 1 teaspoon ground turmeric; 1 teaspoon ground coriander; 1 teaspoon cayenne pepper; 1 tablespoon water; 1 (15 ounce) can crushed tomatoes; 1 cup plain yogurt; 1 tablespoon chopped fresh cilantro; 1 teaspoon salt; ½ cup water; 1 teaspoon garam masala; 1 tablespoon chopped fresh cilantro; 1 tablespoon fresh lemon juice",
  "directions": "1. Gather all ingredients. 2. Sprinkle the chicken breasts with 2 teaspoons salt. 3. Heat oil in a large skillet over high heat; partially cook the chicken in the hot oil in batches until completely browned on all sides. Transfer browned chicken breasts to a plate and set aside. 4. Reduce the heat to medium and add onion, garlic, and ginger to the oil remaining in the skillet. Cook and stir until onion turns soft and translucent, 5 to 8 minutes. Stir curry powder, cumin, turmeric, coriander, cayenne, and 1 tablespoon of water into the onion mixture; allow to heat together for about 1 minute while stirring. 5. Add tomatoes, yogurt, 1 tablespoon chopped cilantro, and 1 teaspoon salt to the mixture; stir to combine. 6. Return chicken breast to the skillet along with any juices on the plate. Pour in 1/2 cup water and bring to a boil, turning the chicken to coat with the sauce. Sprinkle garam masala and 1 tablespoon cilantro over the chicken. 7. Cover the skillet and simmer until chicken breasts are no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Drizzle with lemon juice to serve.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "427"
},
{
  "url": "https://www.allrecipes.com/recipe/8618/easy-chicken-pot-pie/",
  "name": "Easy Chicken Pot Pie",
  "rating": "4.6",
  "ratingcount": "424",
  "ingredients": "2 cups cooked, diced chicken breast; 1 (15 ounce) can mixed vegetables, drained; 1 (10.5 ounce) can condensed cream of chicken soup; ½ cup milk; 2 (9 inch)  deep-dish frozen pie crusts, thawed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine chicken, mixed vegetables, condensed soup, and milk in a bowl. 3. Pour the mixture into the bottom pie crust. 4. Cover with second crust. Seal the edges and poke holes in top crust. 5. Bake in the preheated oven until crust is golden brown, about 30 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "463"
},
{
  "url": "https://www.allrecipes.com/recipe/72068/chicken-katsu/",
  "name": "Chicken Katsu",
  "rating": "4.7",
  "ratingcount": "877",
  "ingredients": "4  skinless, boneless chicken breast halves - pounded to 1/2 inch thickness; salt and pepper to taste; 2 tablespoons all-purpose flour; 1  egg, beaten; 1 cup panko bread crumbs; 1 cup oil for frying, or as needed",
  "directions": "1. Season chicken breasts on both sides with salt and pepper. Place flour, beaten egg, and panko crumbs into separate shallow dishes. Coat chicken breasts in flour, shaking off any excess; dip into egg, and then press into panko crumbs until well coated on both sides. 2. Heat oil in a large skillet over medium-high heat. Place chicken in the hot oil, and fry until golden brown, 3 or 4 minutes per side. Transfer to a paper towel-lined plate to drain.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/236703/chef-johns-chicken-kiev/",
  "name": "Chef John's Chicken Kiev",
  "rating": "4.8",
  "ratingcount": "260",
  "ingredients": "2 cloves garlic, minced; 1 pinch salt; 2 tablespoons chopped fresh flat-leaf parsley; 6 tablespoons unsalted butter; 4 (8 ounce) skinless, boneless chicken breast halves, pounded to 1/4-inch thickness; salt and pepper to taste; 1 cup all-purpose flour; 2 teaspoons salt; 2  eggs, beaten; 2 cups panko bread crumbs; 1 pinch cayenne pepper; 2 cups vegetable oil for frying, or as needed",
  "directions": "1. Grind garlic and pinch of salt together in a mortar and pestle until smooth; add parsley and mix well. Pound butter into garlic mixture with the pestle until well combined. Wrap butter mixture in plastic wrap; refrigerate until cold, at least 15 minutes. 2. Season chicken breasts with salt and pepper. Place 1/4 of the butter mixture in the center of the wider end of each chicken breast. Fold the narrower end of each chicken breast up over the butter to form a tight pocket around the butter; gather the sides of each chicken breast to the center to form a round ball. The top of each chicken ball will be smooth and the bottom will be gathered. Tightly wrap each chicken ball in plastic wrap; transfer to a plate and chill in the freezer until the gathered bottoms hold together and are slightly firm, about 30 minutes. 3. Whisk flour and 2 teaspoons salt together in a shallow bowl. Whisk eggs together in another shallow bowl. Pour panko bread crumbs into a third bowl. 4. Remove chicken breast balls from plastic wrap. Gently press them into the flour mixture to coat; shake off any excess flour. Dip into beaten eggs, then press into bread crumbs. Place breaded chicken on a plate; cover with plastic wrap, and return to the freezer to chill until firm, about 15 minutes. 5. Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil. 6. Working in batches, place chicken, gathered-side down, in the hot oil and cook until lightly golden, about 1 minute per side. Transfer chicken to the prepared baking sheet; sprinkle salt and cayenne pepper over the top. 7. Bake in the preheated oven until you can hear the butter start to sizzle on the baking sheet, 15 to 17 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Let rest for a few minutes before serving.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "1 hr 50 mins",
  "calories": "790"
},
{
  "url": "https://www.allrecipes.com/recipe/46822/indian-chicken-curry-ii/",
  "name": "Indian Chicken Curry",
  "rating": "4.3",
  "ratingcount": "1",
  "ingredients": "3 tablespoons olive oil; 1 small onion, chopped; 2 cloves garlic, minced; 3 tablespoons curry powder; 1 teaspoon ground cinnamon; 1 teaspoon paprika; 1  bay leaf; ½ teaspoon grated fresh ginger root; ½ teaspoon white sugar; salt to taste; 2  skinless, boneless chicken breast halves - cut into bite-size pieces; 1 tablespoon tomato paste; 1 cup plain yogurt; ¾ cup coconut milk; ½  lemon, juiced; ½ teaspoon cayenne pepper",
  "directions": "1. Heat olive oil in a skillet over medium heat. Sauté onion until lightly browned. 2. Stir in garlic, curry powder, cinnamon, paprika, bay leaf, ginger, sugar, and salt. Continue stirring for 2 minutes. 3. Add chicken pieces, tomato paste, yogurt, and coconut milk. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes. 4. Remove bay leaf, and stir in lemon juice and cayenne pepper. Simmer 5 more minutes. 5. Serve hot and enjoy!",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "313"
},
{
  "url": "https://www.allrecipes.com/recipe/240208/simple-baked-chicken-breasts/",
  "name": "Simple Baked Chicken Breasts",
  "rating": "4.7",
  "ratingcount": "480",
  "ingredients": "4 (5 ounce) skinless, boneless chicken breast halves; 2 tablespoons olive oil; ½ teaspoon coarse sea salt, or to taste; 1 pinch Creole seasoning (such as Tony Chachere's®), or more to taste; 1 tablespoon chicken broth, or more to taste",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 400 degrees F (200 degrees C). 3. Rub chicken breasts with olive oil and sprinkle both sides with salt and Creole seasoning. Place chicken in a broiler pan. 4. Bake in the preheated oven for 10 minutes. Flip chicken and cook until no longer pink in the center and the juices run clear, about 15 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 5. Remove chicken to a plate. 6. Pour chicken broth into the pan and scrape any browned bits off the bottom with a flat-edged wooden spatula. Add more broth if needed to dislodge the browned bits, but not too much or it will be watery. 7. To serve, drizzle the pan sauce over the chicken.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "191"
},
{
  "url": "https://www.allrecipes.com/recipe/8887/chicken-marsala/",
  "name": "Chicken Marsala",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "¼ cup all-purpose flour for coating; ½ teaspoon salt; ¼ teaspoon ground black pepper; ½ teaspoon dried oregano; 4 medium skinless, boneless chicken breast halves - pounded 1/4 inch thick; 4 tablespoons butter; 4 tablespoons olive oil; 1 cup sliced mushrooms; ½ cup Marsala wine; ¼ cup cooking sherry",
  "directions": "1. Gather all ingredients. 2. In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. 3. Coat chicken pieces in flour mixture. 4. In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown. 5. Turn over chicken pieces, and add mushrooms. Pour in wine and sherry. 6. Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear. 7. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/21659/chicken-quesadillas/",
  "name": "Chicken Quesadillas",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 pound skinless, boneless chicken breast, diced; 1 (1.27 ounce) packet fajita seasoning; 1 tablespoon vegetable oil; 2  green bell peppers, chopped; 2  red bell peppers, chopped; 1  onion, chopped; 10 (10 inch) flour tortillas; 1 (8 ounce) package shredded Cheddar cheese; 1 (8 ounce) package shredded Monterey Jack cheese; 1 tablespoon bacon bits",
  "directions": "1. Preheat the broiler. Lightly grease a baking sheet. 2. Toss chicken with fajita seasoning, then spread onto the prepared baking sheet. Place under the broiler and cook until chicken is cooked through and no longer pink in the center, about 5 minutes. 3. Preheat the oven to 350 degrees F (175 degrees C). 4. Heat oil in a large saucepan over medium heat. Stir in bell peppers, onion, and broiled chicken. Cook and stir until vegetables have softened, about 10 minutes. 5. Layer half of each tortilla with chicken and vegetable mixture, Cheddar cheese, Monterey Jack cheese, and bacon bits. Fold tortillas in half and place onto a baking sheet. 6. Bake quesadillas in the preheated oven until cheeses have melted, about 10 minutes. Cut each quesadilla into wedges and serve.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "472"
},
{
  "url": "https://www.allrecipes.com/recipe/233983/mamaws-chicken-and-rice-casserole/",
  "name": "Mamaw's Chicken and Rice Casserole",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "3  chicken breasts, cut into cubes; 2 cups water; 2 cups instant white rice; 1 (10.75 ounce) can  cream of chicken soup; 1 (10.75 ounce) can  cream of celery soup; 1 (10.75 ounce) can  cream of mushroom soup; salt and ground black pepper to taste; ½ cup butter, sliced into pats",
  "directions": "1. Gather all ingredients. 2. Preheat oven to 400 degrees F (200 degrees C). Grease sides and bottom of a casserole dish. 3. Stir chicken, water, rice, cream of chicken soup, cream of celery soup, and cream of mushroom soup together in the prepared casserole dish; season with salt and pepper. 4. Arrange butter evenly over the top of the chicken mixture. 5. Bake in preheated oven until the rice is tender and the chicken is cooked through, 1 hour to 75 minutes. Cool 10 to 15 minutes before serving.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "441"
},
{
  "url": "https://www.allrecipes.com/recipe/55860/baked-garlic-parmesan-chicken/",
  "name": "Baked Garlic Parmesan Chicken",
  "rating": "4.4",
  "ratingcount": "3",
  "ingredients": "2 tablespoons olive oil; 1 clove garlic, minced; 1 cup dry bread crumbs; ⅔ cup grated Parmesan cheese; 1 teaspoon dried basil leaves; ¼ teaspoon ground black pepper; 6  skinless, boneless chicken breast halves",
  "directions": "1. Gather all ingredients. 2. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. 3. In a bowl, blend the olive oil and garlic. 4. In a separate bowl, mix the bread crumbs, Parmesan cheese, basil, and pepper. 5. Dip each chicken breast in the oil mixture, then in the bread crumb mixture. Arrange the coated chicken breasts in the prepared baking dish, and top with any remaining bread crumb mixture. 6. Bake 30 minutes in the preheated oven, or until chicken is no longer pink and juices run clear. 7. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "281"
},
{
  "url": "https://www.allrecipes.com/recipe/159972/tender-pan-fried-chicken-breasts/",
  "name": "Tender Pan-Fried Chicken Breasts",
  "rating": "4.5",
  "ratingcount": "408",
  "ingredients": "2 cups flour; 2 tablespoons salt; 2 tablespoons ground black pepper; 1 tablespoon dried tarragon; 1 tablespoon ground ginger; 1 tablespoon dry mustard powder; 1 tablespoon dried thyme leaves; 1 teaspoon garlic powder; 1 teaspoon dried oregano; 1  egg; ¼ cup milk; 8 (6 ounce) skinless, boneless chicken breast halves; ½ cup vegetable oil",
  "directions": "1. Line 2 baking trays with aluminum foil; set aside. 2. Stir together flour, salt, pepper, tarragon, ginger, mustard powder, thyme, garlic powder, and oregano in a shallow bowl until well-blended. Beat together egg and milk in a separate bowl until smooth. 3. Dredge chicken breasts in flour mixture, shake off excess, then dip in egg, and again in flour. Place coated chicken breasts on one of the prepared baking trays; set aside to rest for 10 minutes. 4. Preheat the oven to 350 degrees F (175 degrees C). 5. Dredge chicken breasts in flour once more; shake off excess. 6. Heat vegetable oil in a skillet over medium-high heat. Cook chicken breasts in hot oil until golden brown, 2 to 3 minutes per side. Place fried chicken breasts on the second prepared baking tray. 7. Bake in the preheated oven until no longer pink in the center and the juices run clear, about 20 to 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 8. Serve hot and enjoy!",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "55 mins",
  "calories": "453"
},
{
  "url": "https://www.allrecipes.com/recipe/8495/chicken-cordon-bleu-i/",
  "name": "Chicken Cordon Bleu",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "nonstick cooking spray; 4  skinless, boneless chicken breast halves; ¼ teaspoon salt; ⅛ teaspoon ground black pepper; 6 slices Swiss cheese; 4 slices cooked ham; ½ cup seasoned bread crumbs",
  "directions": "1. Gather all ingredients. 2. Preheat oven to 350 degrees F (175 degrees C). Coat a 7x11-inch baking dish with nonstick cooking spray. 3. Pound chicken breasts to 1/4 inch thickness. 4. Sprinkle each piece of chicken on both sides with salt and pepper. Place 1 Swiss cheese slice and 1 ham slice on top of each breast. 5. Roll up each breast and secure with toothpicks. 6. Place in the prepared baking dish and sprinkle chicken evenly with bread crumbs. 7. Bake in the preheated oven until chicken is no longer pink, 30 to 35 minutes. 8. Remove from the oven, and place 1/2 Swiss cheese slice on top of each breast. 9. Return to the oven until cheese has melted, 3 to 5 minutes. Remove toothpicks and serve immediately.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "419"
},
{
  "url": "https://www.allrecipes.com/recipe/8941/slow-cooker-chicken-and-dumplings/",
  "name": "Slow Cooker Chicken and Dumplings",
  "rating": "4.4",
  "ratingcount": "9",
  "ingredients": "4  skinless, boneless chicken breast halves; 2 tablespoons butter; 2 (10.5 ounce) cans condensed cream of chicken soup; 1 medium onion, finely diced; 1 (10 ounce) package refrigerated biscuit dough; 2 cups water, or as needed to cover",
  "directions": "1. Place chicken, condensed soup, onion, and butter in a slow cooker. Add enough water to cover; stir well. Cover and cook on High for 5 to 6 hours. 2. About 30 minutes before serving, tear biscuit dough into pieces. Place dough in the slow cooker. Cook until dough is no longer raw in the center. 3. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "5 hrs",
  "total": "5 hrs 10 mins",
  "calories": "385"
},
{
  "url": "https://www.allrecipes.com/recipe/223382/chicken-stir-fry/",
  "name": "Chicken Stir-Fry",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "4 cups water; 2 cups white rice; ⅔ cup soy sauce; ¼ cup brown sugar; 1 tablespoon cornstarch; 1 tablespoon minced fresh ginger; 1 tablespoon minced garlic; ¼ teaspoon red pepper flakes; 3  skinless, boneless chicken breast halves, thinly sliced; 2 tablespoons sesame oil, divided; 1 head broccoli, broken into florets; 1  onion, cut into large chunks; 1 cup sliced carrots; 1 (8 ounce) can sliced water chestnuts, drained; 1  green bell pepper, cut into matchsticks",
  "directions": "1. Bring water and rice to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until rice is tender, and liquid has been absorbed, 20 to 25 minutes. 2. Meanwhile, combine soy sauce, brown sugar, and cornstarch in a medium glass or ceramic bowl; stir until smooth. Stir in ginger, garlic, and red pepper flakes; add chicken and stir to coat. Cover and marinate in the refrigerator for at least 15 minutes. 3. Heat 1 tablespoon sesame oil in a wok or large skillet over medium-high heat. Add broccoli, onion, carrots, water chestnuts, and bell pepper; cook and stir until just tender, about 5 minutes. Transfer vegetables into a dish; set aside. 4. Heat remaining 1 tablespoon sesame oil in the same wok or skillet over medium-high heat. Add chicken, reserving marinade, and cook until just browned, about 2 minutes per side; stir in vegetables and reserved marinade. Bring to a boil; cook and stir until chicken is no longer pink in the center and vegetables are tender, 5 to 7 minutes. Serve over rice.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "700"
},
{
  "url": "https://www.allrecipes.com/recipe/31848/jambalaya/",
  "name": "Best Jambalaya",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "2 tablespoons peanut oil, divided; 1 tablespoon Cajun seasoning; 10 ounces andouille sausage, sliced into rounds; 1 pound boneless skinless chicken breasts, cut into 1 inch pieces; 1  onion, diced; 1 small green bell pepper, diced; 2 stalks celery, diced; 3 cloves garlic, minced; 1 (16 ounce) can crushed Italian tomatoes; ½ teaspoon red pepper flakes; ½ teaspoon ground black pepper; 1 teaspoon salt; ½ teaspoon hot pepper sauce; 2 teaspoons Worcestershire sauce; 1 teaspoon file powder; 1 ¼ cups uncooked white rice; 2 ½ cups chicken broth",
  "directions": "1. Gather all ingredients. 2. Heat 1 tablespoon of peanut oil in a large heavy Dutch oven over medium heat. Season the sausage and chicken pieces with Cajun seasoning. Sauté sausage until browned. Remove with slotted spoon, and set aside. 3. Add 1 tablespoon peanut oil, and sauté chicken pieces until lightly browned on all sides. Remove with a slotted spoon, and set aside. 4. In the same pot, saute onion, bell pepper, celery, and garlic until tender. 5. Stir in crushed tomatoes, and season with red pepper, black pepper, salt, hot pepper sauce, Worcestershire sauce, and filé powder. 6. Stir in chicken and sausage. Cook for 10 minutes, stirring occasionally. 7. Stir in the rice and chicken broth. 8. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes, or until liquid is absorbed.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "465"
},
{
  "url": "https://www.allrecipes.com/recipe/84137/easy-paella/",
  "name": "Easy Paella",
  "rating": "4.6",
  "ratingcount": "630",
  "ingredients": "2 tablespoons olive oil; 1 tablespoon ground paprika; 2 teaspoons dried oregano; salt and ground black pepper to taste; 2 pounds skinless, boneless chicken breasts, cut into 2 inch pieces; 2 tablespoons olive oil, divided; 3 cloves garlic, crushed; 1 teaspoon crushed red pepper flakes; 2 cups uncooked short-grain white rice; 1 pinch saffron threads; 1 large bay leaf; ½ bunch Italian flat leaf parsley, chopped; 1 quart chicken stock; 2 medium lemons, zested; 2 tablespoons olive oil; 1 medium Spanish onion, chopped; 1 medium red bell pepper, coarsely chopped; 1 pound shrimp, peeled and deveined; 1 pound chorizo sausage, casings removed and crumbled",
  "directions": "1. Mix olive oil, paprika, oregano, salt, and pepper for marinade in a glass bowl. 2. Begin paella: Add chicken and stir to coat. Cover and refrigerate until needed. 3. Heat 2 tablespoons olive oil in a large skillet or paella pan over medium heat. Stir in garlic and pepper flakes, then stir in rice. Cook and stir until rice is coated with oil, about 3 minutes. 4. Add saffron threads, bay leaf, parsley, chicken stock, and lemon zest. Stir until well combined and bring to a boil. Reduce heat to medium-low, cover, and simmer for 20 minutes. 5. While the rice is cooking, heat olive oil in a separate skillet over medium heat. Stir in marinated chicken and cook for 3 minutes. Add onion and cook until translucent, about 5 minutes. 6. Add bell pepper and sausage; cook and stir, breaking sausage up with a spatula, for 5 minutes. Add shrimp; cook and stir until shrimp are bright pink on the outside and the meat is opaque, about 2 minutes. 7. Spread rice mixture onto a serving tray. Top with meat and seafood mixture.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "736"
},
{
  "url": "https://www.allrecipes.com/recipe/187342/banh-mi/",
  "name": "Banh Mi",
  "rating": "4.7",
  "ratingcount": "90",
  "ingredients": "½ cup rice vinegar; ¼ cup white sugar; ¼ cup water; ¼ cup matchstick-cut carrots; ¼ cup peeled and matchstick-cut daikon radish; ¼ cup thinly sliced white onion; 1  skinless, boneless chicken breast half; 1 pinch garlic salt, or to taste; ground black pepper to taste; 1 (12 inch) French baguette; 4 tablespoons mayonnaise; ¼ cup thinly sliced cucumber; 1 tablespoon fresh cilantro leaves; 1 small jalapeno pepper, cut into 1/16-inch-thick matchsticks; 1 wedge lime",
  "directions": "1. Combine rice vinegar, sugar, and water in a saucepan. Bring to a boil over medium heat, stirring until sugar has dissolved, about 1 minute. Allow the mixture to cool. 2. Place carrot, radish, and onion in a bowl. Pour in cooled vinegar mixture and let marinate at least 30 minutes. 3. While vegetables marinate, set an oven rack about 6 inches from the heat source and preheat the broiler. Lightly oil a slotted broiler pan. 4. Sprinkle chicken breast with garlic salt and pepper. 5. Place chicken on the prepared pan and broil, turning once, until browned and no longer pink in the center, about 6 minutes per side. 6. Place chicken on a cutting board. Cut into bite-sized pieces. 7. Slice baguette in half lengthwise. Pull out the soft center of the bread, leaving a cavity for the fillings. 8. Lightly toast baguette under the broiler, 2 to 3 minutes. 9. Drain off excess vinegar mixture after vegetables have marinated. 10. To assemble the sandwich, spread each half of toasted baguette with mayonnaise. Layer chicken on the bottom half of the bread. Top with cucumber, drained pickled vegetables, cilantro, and jalapeno. Squeeze lime wedge over fillings and cover with top half of baguette. 11. Cut into two 6-inch sandwiches to serve.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "657"
},
{
  "url": "https://www.allrecipes.com/recipe/61024/asian-orange-chicken/",
  "name": "Asian Orange Chicken",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "1 ½ cups water; ⅓ cup rice vinegar; ¼ cup lemon juice; 2 ½ tablespoons soy sauce; 2 tablespoons orange juice; 1 cup packed brown sugar; 2 tablespoons chopped green onion; 1 tablespoon grated orange zest; ½ teaspoon minced fresh ginger root; ½ teaspoon minced garlic; ¼ teaspoon red pepper flakes; 3 tablespoons cornstarch; 2 tablespoons water; 2 large skinless, boneless chicken breasts, cut into 1/2-inch cubes; 1 cup all-purpose flour; ¼ teaspoon salt; ¼ teaspoon pepper; 3 tablespoons olive oil",
  "directions": "1. Gather all ingredients. 2. Combine water, rice vinegar, lemon juice, soy sauce, and orange juice for sauce into a saucepan over medium-high heat. Stir in brown sugar, green onion, orange zest, ginger, garlic, and pepper flakes; bring to a boil. Remove from heat, and cool for 10 to 15 minutes. 3. Place chicken in a resealable plastic bag. Pour in 1 cup cooled sauce. Seal the bag, and refrigerate for at least 2 hours. Reserve the remaining sauce. 4. Mix flour, salt, and pepper in another resealable plastic bag. 5. Remove chicken from the marinade and place into the bag of seasoned flour. Seal the bag and shake to coat. 6. Heat the olive oil in a large skillet over medium heat. Cook chicken in the hot skillet until browned on both sides. 7. Remove to a paper towel-lined plate and cover with aluminum foil. Wipe out the skillet. 8. Pour reserved sauce into the skillet and bring to a boil over medium-high heat. 9. Mix together cornstarch and water until completely smooth. Stir into the boiling sauce. 10. Reduce heat to medium-low, add the chicken, and simmer, stirring occasionally, until cooked through, about 5 minutes. 11. Serve over rice and enjoy!",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "2 hrs 50 mins",
  "calories": "445"
},
{
  "url": "https://www.allrecipes.com/recipe/17745/easy-italian-chicken-ii/",
  "name": "Easy Italian Chicken",
  "rating": "4.4",
  "ratingcount": "300",
  "ingredients": "1 (16 ounce) bottle Italian-style salad dressing; 6  skinless, boneless chicken breast halves",
  "directions": "1. Pour salad dressing into a large resealable plastic bag. Add chicken breasts, seal bag, and shake to coat. Marinate in the refrigerator for at least 1 hour or overnight (the longer you marinate, the more flavor the chicken will absorb). 2. Preheat the oven to 350 degrees F (175 degrees C). 3. Remove chicken from marinade and place in a lightly greased 9x13-inch baking dish; discard remaining marinade. 4. Bake in the preheated oven, turning chicken occasionally, until cooked through and juices run clear, about 1 hour. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "2 hrs 5 mins",
  "calories": "344"
},
{
  "url": "https://www.allrecipes.com/recipe/8626/yummy-honey-chicken-kabobs/",
  "name": "Yummy Honey Chicken Kabobs",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "⅓ cup honey; ⅓ cup soy sauce; ¼ cup vegetable oil; ¼ teaspoon ground black pepper; 8  skinless, boneless chicken breast halves - cut into 1 inch cubes; 5 small onion, cut into 2-inch pieces; 2 medium red bell peppers, cut into 2-inch pieces; 2 cloves garlic; 12  bamboo skewers, or as needed, soaked in water for 30 minutes",
  "directions": "1. Make the marinade: Whisk honey, soy sauce, oil, and black pepper together in a large glass bowl. 2. Remove 1/4 cup of the marinade to a small jar; seal and set aside to use while cooking. 3. Add chicken, onions, bell peppers, and garlic to the marinade in the large bowl. Cover and marinate in the refrigerator for 2 hours or overnight. 4. When ready to cook, preheat an outdoor grill for high heat and lightly oil the grate. 5. Drain marinade from chicken and vegetables; discard marinade. Thread chicken and vegetables alternately onto skewers. 6. Place kabobs on the preheated grill. Cook, turning frequently and brushing with reserved marinade, until nicely browned on all sides and chicken is no longer pink in the center, about 12 to 15 minutes. 7. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "2 hrs 30 mins",
  "calories": "179"
},
{
  "url": "https://www.allrecipes.com/recipe/8849/baked-chicken-nuggets/",
  "name": "Homemade Chicken Nuggets",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "3  skinless, boneless chicken breasts; 1 cup Italian seasoned bread crumbs; ½ cup grated Parmesan cheese; 1 tablespoon dried basil; 1 teaspoon dried thyme; 1 teaspoon salt; ½ cup butter, melted",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Cut chicken breasts into 1 1/2-inch pieces. Mix the bread crumbs, Parmesan, basil, thyme, and salt together well in a medium bowl. Put melted butter in a bowl or dish for dipping. 3. Dip chicken pieces into the melted butter first, then coat with the bread crumb mixture. Place the well-coated chicken nuggets on a lightly greased cookie sheet in a single layer. 4. Bake nuggets in the preheated oven until browned and chicken is cooked through, about 20 minutes.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "308"
},
{
  "url": "https://www.allrecipes.com/recipe/11864/chicken-noodle-casserole-i/",
  "name": "Chicken Noodle Casserole",
  "rating": "4.4",
  "ratingcount": "2",
  "ingredients": "4  skinless, boneless chicken breast halves; 6 ounces egg noodles; 1 (10.5 ounce) can condensed cream of mushroom soup; 1 (10.5 ounce) can condensed cream of chicken soup; 1 cup sour cream; salt to taste; ground black pepper to taste; ½ cup butter; 1 cup crumbled buttery round crackers",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Fill a large pot with water and bring to a simmer over medium heat. Add chicken; poach in simmering water until no longer pink in center, about 12 minutes. Use a slotted spoon to remove chicken from pot and set aside. Leave water in the pot. 3. Bring chicken cooking water to a boil. Stir in egg noodles and cook until tender with a slight bite, about 10 minutes. Drain. 4. Transfer noodles to a large bowl. Cut chicken into bite-size pieces and mix with noodles. 5. Mix together both condensed soups and sour cream in a separate bowl. Season with salt and pepper. Add soup mixture to chicken mixture and gently stir until combined. Transfer to a 2-quart baking dish. 6. Melt butter in a small saucepan over low heat and remove from heat. Stir in crumbled crackers. Sprinkle mixture over top of casserole. 7. Bake in the preheated oven until heated through and browned on top, about 30 minutes.",
  "prep": "30 mins",
  "cook": "55 mins",
  "total": "1 hr 25 mins",
  "calories": "542"
},
{
  "url": "https://www.allrecipes.com/recipe/46982/pesto-pasta-with-chicken/",
  "name": "Pesto Pasta with Chicken",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "1 (16 ounce) package bow tie pasta; 1 teaspoon olive oil; 2 cloves garlic, minced; 2  skinless, boneless chicken breasts, cut into bite-sized pieces; 1 pinch crushed red pepper flakes, or to taste; ½ cup pesto sauce; ⅓ cup oil-packed sun-dried tomatoes, drained and cut into strips",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add pasta and cook until al dente, 8 to 10 minutes; drain. 2. Heat oil in a large skillet over medium heat. Sauté garlic until tender, then stir in chicken and season with red pepper flakes. Cook until chicken is golden and cooked through. 3. Combine pasta, chicken, pesto, and sun-dried tomatoes in a large bowl; toss to coat evenly.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "328"
},
{
  "url": "https://www.allrecipes.com/recipe/8571/blackened-chicken/",
  "name": "Blackened Chicken",
  "rating": "4.4",
  "ratingcount": "1",
  "ingredients": "½ teaspoon paprika; ¼ teaspoon cayenne pepper; ¼ teaspoon ground cumin; ¼ teaspoon dried thyme; ⅛ teaspoon onion powder; ⅛ teaspoon ground white pepper; ⅛ teaspoon salt; 2  skinless, boneless chicken breast halves; cooking spray",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Spray a baking sheet with cooking spray. 2. Heat a cast-iron skillet over high heat until it is smoking hot, about 5 minutes. 3. While the skillet is heating, mix together paprika, cayenne, cumin, thyme, onion powder, white pepper, and salt in a small bowl. Spray chicken breasts on both sides with cooking spray, then coat evenly with spice mixture. 4. Place chicken in the hot pan and cook for 1 minute. Turn, and cook 1 minute on other side. Transfer chicken to the prepared baking sheet. 5. Bake in the preheated oven until chicken is no longer pink in the center and the juices run clear, about 5 minutes.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "135"
},
{
  "url": "https://www.allrecipes.com/recipe/141169/easy-indian-butter-chicken/",
  "name": "Easy Indian Butter Chicken",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 cup butter, divided; 1  onion, minced; 1 tablespoon minced garlic; 1 (15 ounce) can tomato sauce; 3 cups heavy cream; 2 teaspoons salt; 1 teaspoon cayenne pepper; 1 teaspoon garam masala; 1 ½ pounds skinless, boneless chicken breast, cut into bite-sized chunks; 2 tablespoons vegetable oil; 2 tablespoons tandoori masala",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Melt 2 tablespoons butter in a skillet over medium heat. Stir in onion and garlic, and cook slowly until the onion caramelizes to a dark brown, about 15 minutes. 3. Meanwhile, combine cream, tomato sauce, remaining butter, salt, cayenne pepper, and garam masala in a saucepan over medium-high heat; bring to a simmer. Reduce heat to medium-low, cover, and simmer, stirring occasionally, for 30 minutes. Stir in caramelized onions. 4. While the sauce is simmering, toss chicken with vegetable oil until coated. Season with tandoori masala and spread out onto a baking sheet. 5. Bake chicken in the preheated oven until no longer pink in the center, about 12 minutes. 6. Add cooked chicken to the sauce and simmer for 5 minutes before serving.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "880"
},
{
  "url": "https://www.allrecipes.com/recipe/246187/chicken-in-garlic-and-black-bean-sauce/",
  "name": "Chicken in Black Bean Sauce",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "1 tablespoon cornstarch; 1 tablespoon water; 1 1/2 teaspoons light soy sauce; 1 ½ teaspoons white sugar; 1/2 teaspoon salt; 6  skinless, boneless chicken breast halves, sliced; 1 cup bean sprouts; 1/4 cup water; 2 teaspoons oyster sauce; 1 teaspoon white sugar; 1 tablespoon vegetable oil; 3 tablespoons black bean sauce with garlic; 1 tablespoon chopped garlic; 1  onion, finely sliced; ½ green bell pepper, chopped; 2 teaspoons cornstarch; 1 tablespoon water",
  "directions": "1. To make the marinade: Mix 1 tablespoon cornstarch with 1 tablespoon water in a bowl; stir in light soy sauce, sugar, and salt. Add chicken; toss to combine. Set aside to marinate for 20 minutes. 2. Bring water to a boil in a saucepan. Add bean sprouts; cook just until blanched, about 30 seconds; drain and set aside. 3. Combine 1/4 cup water, oyster sauce, and sugar together in a small bowl; set aside. 4. Heat vegetable oil in a skillet over high heat. Add black bean sauce and chopped garlic; cook and stir until fragrant, about 1 minute. Add onion; cook and stir until soft, 3 to 4 minutes. 5. Add chicken and marinade mixture; stir-fry until cooked through and no longer pink in the middle, about 4 to 5 minutes. Stir in oyster sauce mixture; cook until heated through. Cover and simmer until flavors blend, about 1 or 2 minutes. Stir in bell pepper; cover and cook until softened, 1 to 2 minutes more. 6. Dissolve 2 teaspoons cornstarch in 1 tablespoon water. Stir in bean sprouts and cornstarch mixture; cook until sauce is thickened, 2 to 3 minutes more.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "50 mins",
  "calories": "266"
},
{
  "url": "https://www.allrecipes.com/recipe/20974/chicken-kabobs/",
  "name": "Chicken Kabobs",
  "rating": "4.6",
  "ratingcount": "60",
  "ingredients": "cooking spray; 4  skinless, boneless chicken breast halves - cubed; 1 large green bell pepper, cut into 2 inch pieces; 1  onion, cut into wedges; 1 large red bell pepper, cut into 2 inch pieces; skewers; 1 cup barbeque sauce",
  "directions": "1. Preheat an outdoor grill for high heat and lightly oil the grate. 2. Thread chicken, green bell pepper, onion, and red bell pepper pieces onto skewers alternately. 3. Cook skewers on the preheated grill, turning and brushing frequently with barbeque sauce, until chicken is no longer pink in the center and the juices run clear, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "256"
},
{
  "url": "https://www.allrecipes.com/recipe/220326/sarahs-easy-shredded-chicken-taco-filling/",
  "name": "Sarah's Easy Shredded Chicken Taco Filling",
  "rating": "4.4",
  "ratingcount": "128",
  "ingredients": "1 pound skinless, boneless chicken breast halves; 2 teaspoons vegetable oil; 1 tablespoon minced onion; ¼ cup tomato sauce; 1 pinch ground cumin; 1 pinch chili powder",
  "directions": "1. Place chicken breasts in a saucepan and cover with water. Bring to a boil over medium heat, then simmer until no longer pink, 10 to 12 minutes. 2. Transfer chicken breasts to a bowl. Allow to cool briefly, then shred with 2 forks. 3. Heat vegetable oil in a saucepan over medium heat. Add onion and cook until translucent, 2 to 3 minutes. Stir in shredded chicken, tomato sauce, cumin, and chili powder. Bring to a boil, then reduce heat to low and simmer until chicken is hot and flavors have blended, about 3 minutes.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "213"
}]