[{
  "url": "https://www.allrecipes.com/recipe/8495600/creamy-chicken-ramen-soup-with-dill/",
  "name": "Creamy Chicken Ramen Soup with Dill",
  "rating": "3.8",
  "ratingcount": "4",
  "ingredients": "1 ¾ cups water; 1 (3 ounce) package chicken flavored ramen noodles; 1 (5 ounce) can canned chicken, drained; 2 tablespoons sour cream; 2 teaspoons dried dill weed; green onions for garnish (optional)",
  "directions": "1. Bring water to a boil in a saucepan. Break up noodles and toss into boiling water. Cook until tender, about 3 minutes. Stir in chicken, sour cream, seasoning packet, and dill. Simmer until heated through. Serve garnished with green onions.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "589"
},
{
  "url": "https://www.allrecipes.com/recipe/8814/homemade-chicken-soup/",
  "name": "Homemade Chicken Soup",
  "rating": "4.5",
  "ratingcount": "297",
  "ingredients": "1 (3 pound) whole chicken; 4  carrots, halved; 4 stalks celery, halved; 1 large onion, halved; water to cover; salt and pepper to taste; 1 teaspoon chicken bouillon granules (Optional)",
  "directions": "1. Place chicken, carrots, celery, and onion in a large soup pot; add enough cold water to cover. Bring to a boil over medium heat; reduce heat to low and simmer, uncovered, until meat falls off of the bone, about 90 minutes. Skim off foam every so often, as needed. 2. Remove chicken from the pot and let sit until cool enough to handle; chop meat into pieces, and discard skin and bones. 3. Strain out vegetables, reserving the stock; rinse the soup pot and return the stock to the pot. Chop vegetables into smaller pieces; return chopped chicken and vegetables to the pot. 4. Warm soup until heated through; season with salt, pepper, and chicken bouillon to taste.",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "152"
},
{
  "url": "https://www.allrecipes.com/recipe/68461/buffalo-chicken-dip/",
  "name": "Buffalo Chicken Dip",
  "rating": "4.7",
  "ratingcount": "5",
  "ingredients": "2 (10 ounce) cans chunk chicken, drained; ¾ cup hot pepper sauce (such as Frank's RedHot®); 2 (8 ounce) packages cream cheese, softened; 1 cup ranch dressing; 1 ½ cups shredded Cheddar cheese; 1 bunch celery, cut into 4-inch pieces; 1 (8 ounce) box chicken-flavored crackers",
  "directions": "1. Gather all ingredients. 2. Heat chicken and hot pepper sauce in a skillet over medium heat until heated through, 3 to 5 minutes. Stir in cream cheese and ranch dressing. Cook and stir until well blended and warm, 3 to 5 minutes. 3. Mix in 1/2 of the Cheddar cheese, and transfer the mixture to a slow cooker. Sprinkle the remaining cheese over top. 4. Cover and cook on Low until dip is hot and bubbly, about 35 minutes. 5. Serve with celery sticks and crackers.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "284"
},
{
  "url": "https://www.allrecipes.com/recipe/8461551/cast-iron-roast-chicken-and-potatoes/",
  "name": "Cast Iron Roast Chicken and Potatoes",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 (4 pound) whole chicken; 1 tablespoon avocado oil; 1 tablespoon olive oil; salt and freshly ground black pepper to taste; cooking twine; 4 ½ cups peeled, sliced potatoes, about 1/8 inch thick; 1 tablespoon olive oil; 1 teaspoon minced fresh rosemary; rosemary sprigs for garnish (optional)",
  "directions": "1. Place a 10 inch cast iron skillet on the center rack of a cold oven. 2. Preheat oven and skillet to 425 degrees F (220 degrees C). 3. While the oven is heating, remove any giblets from the chicken, and discard or reserve for stock. Pat chicken dry with paper towels. inside and out. 4. Season the inside of the chicken with salt and pepper. Fold the tips of the wings under the neck area of the chicken, and tie the legs together with cooking twine. 5. Combine avocado oil and olive oil in a small bowl and brush the outside of the chicken with the combined oils. Reserve any unused oil. Season the outside of the chicken with salt and pepper. 6. Carefully place the hot skillet on a heat-safe surface (e.g. your stove) and brush the inside of the skillet with the remaining reserved oils. 7. Place the chicken on its side in the skillet, with the leg quarter coming in contact with the hot skilled. Return the skillet to the oven and roast for 25 to 30 minutes. 8. Combine sliced potatoes, 1 tablespoon olive oil, minced rosemary, salt, and pepper in a bowl and mix well. 9. After the chicken has roasted on one side, place hot skillet on a cutting board, turn the chicken to the other side, and add potato mixture to half of the skillet. Roast for 25 to 30 minutes. 10. Carefully pull skillet out of the oven and return to the cutting board. Lift chicken slightly and spread the potatoes over the whole skillet. Place chicken, breast side up, on top of the potatoes. Roast until the chicken is no longer pink at the bone and the juiced run clear, 25 to 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C). 11. Turn off the oven and allow the chicken to rest inside the oven about 5 to 10 minutes. This will keep the skin nice and crispy. 12. Garnish with fresh rosemary sprigs, carve the chicken, and serve the chicken and potatoes from the skillet.",
  "prep": "10 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 40 mins",
  "calories": "150"
},
{
  "url": "https://www.allrecipes.com/recipe/8499612/pretzel-crusted-chicken-tenders/",
  "name": "Pretzel-Crusted Chicken Tenders",
  "rating": "5.0",
  "ratingcount": "7",
  "ingredients": "¼ cup mayonnaise; 1 tablespoon honey; 1 tablespoon Dijon mustard; ⅛ teaspoon garlic powder; ½ teaspoon ground paprika; ½ teaspoon garlic powder; ½ teaspoon onion powder; ½ teaspoon salt; ¼ teaspoon freshly ground black pepper; 1 pound chicken tenders; 2 cups miniature pretzels; 1 large egg; 1 tablespoon water; ½ cup all-purpose flour; cooking spray",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper. 2. Combine mayonnaise, honey, mustard, and garlic powder for the dipping sauce in a small bowl and set aside. 3. Combine paprika, garlic powder, onion powder, salt, and pepper in a small dish. Sprinkle evenly on both sides of the chicken tenders. 4. Pulse pretzels in a small food processor or blender jar until evenly crushed, but not powdery. Place pretzel crumbs into a shallow dish. Lightly whisk egg and water In a second dish. Add flour to a third dish. Place dishes in the following order: flour, egg mixture, pretzels. 5. Dip each tender into flour, shaking off any excess. Next, dip into egg mixture, letting any excess drip off. Coat chicken in pretzel crumbs last and place on the prepared baking sheet. Spray liberally with cooking spray. 6. Bake in the preheated oven until chicken is no longer pink in the center and the juices run clear, 13 to 15 minutes. Turn tenders over halfway through cooking, and spray with additional cooking spray. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Serve with the dipping sauce.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "482"
},
{
  "url": "https://www.allrecipes.com/recipe/83557/juicy-roasted-chicken/",
  "name": "Juicy Roasted Chicken",
  "rating": "4.7",
  "ratingcount": "4",
  "ingredients": "1 (3 pound) whole chicken, giblets removed; salt and black pepper to taste; 1 tablespoon onion powder, or to taste; ½ cup butter or margarine; 1 stalk celery, leaves removed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Place chicken in a roasting pan; season generously inside and out with onion powder, salt, and pepper. Place 3 tablespoons of butter in chicken cavity; arrange dollops of remaining butter on the outside of chicken. Cut celery into 3 or 4 pieces; place in the chicken cavity. 3. Bake chicken uncovered in the preheated oven until no longer pink at the bone and the juices run clear, about 1 hour and 15 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C). 4. Remove from the oven and baste with drippings. Cover with aluminum foil and allow to rest for about 30 minutes before serving.",
  "prep": "15 mins",
  "cook": "1 hr 15 mins",
  "total": "2 hrs",
  "calories": "423"
},
{
  "url": "https://www.allrecipes.com/recipe/8506346/chef-johns-chicken-fricassee/",
  "name": "Chef John's Chicken Fricassee",
  "rating": "5.0",
  "ratingcount": "10",
  "ingredients": "6  bone-in, skin-on chicken thighs; 2 teaspoons kosher salt, plus more to taste; 1 tablespoon vegetable oil; 2 cups thickly sliced fresh mushrooms; 1 cup diced yellow onion; ½ cup sliced shallots (Optional); 2 cloves garlic, minced; ½ teaspoon freshly ground black pepper; 1 pinch cayenne; 2 teaspoons all-purpose flour; 1 ½ cups white wine; 6 sprigs thyme; 1 cup chicken broth; ½ cup heavy cream",
  "directions": "1. Season chicken thighs with salt on both sides. 2. Heat vegetable oil in a skillet over medium-high heat and place chicken skin-side-down into the hot oil. Cook until there is a good sear and fat is rendered, about 5 minutes. Flip and cook the other side until seared as well, about 2 minutes. Set aside. 3. Leave 2 tablespoons of the rendered fat in the pan and add sliced mushrooms. Cook until browned, 5 to 8 minutes. Add onion, shallots, and garlic and cook, stirring occasionally, until onions are soft and translucent, about 5 minutes. Season with pepper and cayenne and stir in flour to thicken the mixture, about 1 minute. 4. Pour in white wine and cook, stirring, until alcohol has evaporated. Raise the heat to high and keep cooking until sauce has reduced to half, 3 to 5 minutes. 5. Add chicken broth, thyme, and bay leaf and bring to a boil over high heat. Reduce heat to medium-lo and add chicken and any accumulated juices back into the skillet, skin side up. Cover and simmer gently for 45 minutes, turning over thighs halfway through. 6. Remove lid and turn thighs back to skin side up. Continue to simmer uncovered, basting occasionally, until chicken is tender and sauce reduces even more. If the pan gets dry before the chicken is tender, add some more water or broth. 7. Add cream and simmer until sauce reaches desired thickness. Heat can be raised to medium to reduce cream faster if chicken is already tender. Sauce can be served thin and runny, or reduced to a thick sauce. Sprinkle with fresh thyme and serve.",
  "prep": "30 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 50 mins",
  "calories": "407"
},
{
  "url": "https://www.allrecipes.com/recipe/26317/chicken-pot-pie-ix/",
  "name": "Chicken Pot Pie",
  "rating": "4.8",
  "ratingcount": "13",
  "ingredients": "1 pound skinless, boneless chicken breast halves - cubed; 1 cup sliced carrots; 1 cup frozen green peas; ½ cup sliced celery; ⅓ cup butter; ⅓ cup chopped onion; ⅓ cup all-purpose flour; ½ teaspoon salt; ¼ teaspoon black pepper; ¼ teaspoon celery seed; 1 ¾ cups chicken broth; ⅔ cup milk; 2 (9 inch)  unbaked pie crusts",
  "directions": "1. Gather all ingredients and preheat the oven to 425 degrees F (220 degrees C.) 2. Combine chicken, carrots, peas, and celery in a saucepan; add water to cover and bring to a boil. Boil for 15 minutes, then remove from the heat and drain. 3. While the chicken is cooking, melt butter in another saucepan over medium heat. Add onion and cook until soft and translucent, 5 to 7 minutes. Stir in flour, salt, pepper, and celery seed 4. Slowly stir in chicken broth and milk. 5. Reduce heat to medium-low and simmer until thick, 5 to 10 minutes. Remove from heat and set aside. 6. Place chicken and vegetables in the bottom pie crust. Pour hot liquid mixture over top. 7. Cover with top crust, seal the edges, and cut away any excess dough. Make several small slits in the top crust to allow steam to escape. 8. Bake in the preheated oven until pastry is golden brown and filling is bubbly, 30 to 35 minutes. Cool for 10 minutes before serving. 9. Serve immediately and enjoy!",
  "prep": "20 mins",
  "cook": "50 mins",
  "total": "1 hr 20 mins",
  "calories": "412"
},
{
  "url": "https://www.allrecipes.com/recipe/233983/mamaws-chicken-and-rice-casserole/",
  "name": "Mamaw's Chicken and Rice Casserole",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "3  chicken breasts, cut into cubes; 2 cups water; 2 cups instant white rice; 1 (10.75 ounce) can  cream of chicken soup; 1 (10.75 ounce) can  cream of celery soup; 1 (10.75 ounce) can  cream of mushroom soup; salt and ground black pepper to taste; ½ cup butter, sliced into pats",
  "directions": "1. Gather all ingredients. 2. Preheat oven to 400 degrees F (200 degrees C). Grease sides and bottom of a casserole dish. 3. Stir chicken, water, rice, cream of chicken soup, cream of celery soup, and cream of mushroom soup together in the prepared casserole dish; season with salt and pepper. 4. Arrange butter evenly over the top of the chicken mixture. 5. Bake in preheated oven until the rice is tender and the chicken is cooked through, 1 hour to 75 minutes. Cool 10 to 15 minutes before serving.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "441"
},
{
  "url": "https://www.allrecipes.com/recipe/212721/indian-chicken-curry-murgh-kari/",
  "name": "Indian Chicken Curry (Murgh Kari)",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "2 pounds skinless, boneless chicken breast halves; 2 teaspoons salt; ½ cup cooking oil; 1 ½ cups chopped onion; 1 tablespoon minced garlic; 1 ½ teaspoons minced fresh ginger root; 1 tablespoon curry powder; 1 teaspoon ground cumin; 1 teaspoon ground turmeric; 1 teaspoon ground coriander; 1 teaspoon cayenne pepper; 1 tablespoon water; 1 (15 ounce) can crushed tomatoes; 1 cup plain yogurt; 1 tablespoon chopped fresh cilantro; 1 teaspoon salt; ½ cup water; 1 teaspoon garam masala; 1 tablespoon chopped fresh cilantro; 1 tablespoon fresh lemon juice",
  "directions": "1. Gather all ingredients. 2. Sprinkle the chicken breasts with 2 teaspoons salt. 3. Heat oil in a large skillet over high heat; partially cook the chicken in the hot oil in batches until completely browned on all sides. Transfer browned chicken breasts to a plate and set aside. 4. Reduce the heat to medium and add onion, garlic, and ginger to the oil remaining in the skillet. Cook and stir until onion turns soft and translucent, 5 to 8 minutes. Stir curry powder, cumin, turmeric, coriander, cayenne, and 1 tablespoon of water into the onion mixture; allow to heat together for about 1 minute while stirring. 5. Add tomatoes, yogurt, 1 tablespoon chopped cilantro, and 1 teaspoon salt to the mixture; stir to combine. 6. Return chicken breast to the skillet along with any juices on the plate. Pour in 1/2 cup water and bring to a boil, turning the chicken to coat with the sauce. Sprinkle garam masala and 1 tablespoon cilantro over the chicken. 7. Cover the skillet and simmer until chicken breasts are no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Drizzle with lemon juice to serve.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "427"
},
{
  "url": "https://www.allrecipes.com/recipe/223042/chicken-parmesan/",
  "name": "Chicken Parmesan",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "4  skinless, boneless chicken breast halves; salt and freshly ground black pepper to taste; 2 large eggs; 1 cup panko bread crumbs, or more as needed; ¾ cup grated Parmesan cheese, divided; 2 tablespoons all-purpose flour, or more if needed; ½ cup olive oil for frying, or as needed; ½ cup prepared tomato sauce; ¼ cup fresh mozzarella, cut into small cubes; ¼ cup chopped fresh basil; ½ cup grated provolone cheese; 2 teaspoons olive oil",
  "directions": "1. Preheat an oven to 450 degrees F (230 degrees C). 2. Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. 3. Season chicken thoroughly with salt and pepper. Using a sifter or strainer; sprinkle flour over chicken breasts, evenly coating both sides 4. Beat eggs in a shallow bowl and set aside. 5. Mix bread crumbs and 1/2 cup Parmesan cheese in a separate bowl, set aside. 6. Dip a flour-coated chicken breast in beaten eggs. Transfer breast to the bread crumb mixture, pressing crumbs into both sides. Repeat for each breast. Let chicken rest for 10 to 15 minutes. 7. Heat 1/2 inch olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken in the hot oil until golden, about 2 minutes per side. The chicken will finish cooking in the oven. 8. Transfer chicken to a baking dish. Top each breast with 2 tablespoons tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle remaining Parmesan over top and drizzle each with 1/2 teaspoon olive oil. 9. Bake in the preheated oven until cheese is browned and bubbly and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "471"
},
{
  "url": "https://www.allrecipes.com/recipe/17904/kabobs/",
  "name": "Kabobs",
  "rating": "4.6",
  "ratingcount": "290",
  "ingredients": "½ cup teriyaki sauce; ½ cup honey; ½ teaspoon garlic powder; ½ pinch ground ginger; 1 ½ pounds skinless, boneless chicken breast halves - cut into cubes; 1 pound beef sirloin, cut into 1 inch cubes; 2  red bell peppers, cut into 2 inch pieces; 1 large sweet onion, peeled and cut into wedges; 1 ½ cups whole fresh mushrooms; skewers",
  "directions": "1. Mix teriyaki sauce, honey, garlic powder, and ginger in a large resealable plastic bag. Place chicken, beef, red bell peppers, onion wedges, and mushrooms in the bag, coat with the marinade, squeeze out excess air, and seal the bag. Refrigerate for 4 hours to overnight. 2. Preheat the grill to medium-high heat. Lightly oil the grill grate. 3. Discard marinade. Thread meat and vegetables onto skewers, leaving a small space between each item. 4. Grill skewers, turning as needed, until meat is cooked through and vegetables are tender, about 10 minutes.",
  "prep": "30 mins",
  "cook": "10 mins",
  "total": "4 hrs 40 mins",
  "calories": "304"
},
{
  "url": "https://www.allrecipes.com/recipe/26460/quick-and-easy-chicken-noodle-soup/",
  "name": "Quick and Easy Chicken Noodle Soup",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1 tablespoon butter; ½ cup chopped onion; ½ cup chopped celery; 4 (14.5 ounce) cans chicken broth; 1 (14.5 ounce) can vegetable broth; ½ pound chopped cooked chicken breast; 1 ½ cups egg noodles; 1 cup sliced carrots; ½ teaspoon dried basil; ½ teaspoon dried oregano; salt and ground black pepper to taste",
  "directions": "1. Melt butter in a large pot over medium heat. Add onion and celery and cook until just tender, about 5 minutes. 2. Add chicken broth, vegetable broth, chicken, egg noodles, carrots, basil, oregano, salt, and pepper. Stir to combine and bring to a boil. 3. Reduce heat and simmer for 20 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "162"
},
{
  "url": "https://www.allrecipes.com/recipe/79538/coronation-chicken/",
  "name": "Coronation Chicken",
  "rating": "4.7",
  "ratingcount": "38",
  "ingredients": "6  skinless, boneless chicken breast halves; ⅓ cup sultana raisins; 1 (1 pound) large mango, peeled, thinly sliced; ⅔ cup mayonnaise; 1 teaspoon mild curry powder; 1 tablespoon mango chutney; 1 teaspoon fresh lemon juice; 1 pinch salt and ground black pepper; ¾ cup toasted cashews (Optional)",
  "directions": "1. Poach chicken in lightly salted boiling water until no longer pink and cooked through, 20 minutes. Drain, cool, and cut into 1/2-inch strips. 2. Combine chicken strips, raisins, and 1/2 of the mango in a large bowl. 3. Mix mayonnaise, curry powder, chutney, and lemon juice together in a medium bowl; season with salt and pepper, then toss gently with chicken mixture. Stir in 1/2 of the cashews. Transfer to a platter, and garnish with remaining mango strips and cashews.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "2 hrs",
  "calories": "476"
},
{
  "url": "https://www.allrecipes.com/recipe/257938/spicy-thai-basil-chicken-pad-krapow-gai/",
  "name": "Spicy Thai Basil Chicken (Pad Krapow Gai)",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "⅓ cup chicken broth; 1 tablespoon oyster sauce; 1 tablespoon soy sauce, or as needed; 2 teaspoons fish sauce; 1 teaspoon white sugar; 1 teaspoon brown sugar; 2 tablespoons vegetable oil; 1 pound skinless, boneless chicken thighs, coarsely chopped; ¼ cup sliced shallots; 4 cloves garlic, minced; 2 tablespoons minced Thai chilies, Serrano, or other hot pepper; 1 cup very thinly sliced fresh basil leaves; 2 cups hot cooked rice",
  "directions": "1. Gather ingredients. 2. Whisk chicken broth, oyster sauce, soy sauce, fish sauce, white sugar, and brown sugar together in a bowl until well blended. 3. Heat large skillet over high heat. Drizzle in oil. Add chicken and stir fry until it loses its raw color, 2 to 3 minutes. 4. Stir in shallots, garlic, and sliced chilies. Continue cooking on high heat until some of the juices start to caramelize in the bottom of the pan, about 2 or 3 more minutes. 5. Add about a tablespoon of the sauce mixture to the skillet; cook and stir until sauce begins to caramelize, about 1 minute. 6. Pour in the rest of the sauce. Cook and stir until sauce has deglazed the bottom of the pan. Continue to cook until sauce glazes onto the meat, 1 or 2 more minutes. Remove from heat. 7. Stir in basil. Cook and stir until basil is wilted, about 20 seconds. Serve with rice. 8. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "715"
},
{
  "url": "https://www.allrecipes.com/recipe/223382/chicken-stir-fry/",
  "name": "Chicken Stir-Fry",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "4 cups water; 2 cups white rice; ⅔ cup soy sauce; ¼ cup brown sugar; 1 tablespoon cornstarch; 1 tablespoon minced fresh ginger; 1 tablespoon minced garlic; ¼ teaspoon red pepper flakes; 3  skinless, boneless chicken breast halves, thinly sliced; 2 tablespoons sesame oil, divided; 1 head broccoli, broken into florets; 1  onion, cut into large chunks; 1 cup sliced carrots; 1 (8 ounce) can sliced water chestnuts, drained; 1  green bell pepper, cut into matchsticks",
  "directions": "1. Bring water and rice to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until rice is tender, and liquid has been absorbed, 20 to 25 minutes. 2. Meanwhile, combine soy sauce, brown sugar, and cornstarch in a medium glass or ceramic bowl; stir until smooth. Stir in ginger, garlic, and red pepper flakes; add chicken and stir to coat. Cover and marinate in the refrigerator for at least 15 minutes. 3. Heat 1 tablespoon sesame oil in a wok or large skillet over medium-high heat. Add broccoli, onion, carrots, water chestnuts, and bell pepper; cook and stir until just tender, about 5 minutes. Transfer vegetables into a dish; set aside. 4. Heat remaining 1 tablespoon sesame oil in the same wok or skillet over medium-high heat. Add chicken, reserving marinade, and cook until just browned, about 2 minutes per side; stir in vegetables and reserved marinade. Bring to a boil; cook and stir until chicken is no longer pink in the center and vegetables are tender, 5 to 7 minutes. Serve over rice.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "700"
},
{
  "url": "https://www.allrecipes.com/recipe/187822/baked-chicken-wings/",
  "name": "Baked Chicken Wings",
  "rating": "4.7",
  "ratingcount": "899",
  "ingredients": "3 tablespoons olive oil; 3 cloves garlic, pressed; 2 teaspoons chili powder; 1 teaspoon garlic powder; salt and ground black pepper to taste; 10  chicken wings",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Combine olive oil, garlic, chili powder, garlic powder, salt, and pepper in a large, resealable bag; seal and shake to combine. Add chicken wings; reseal and shake to coat. Arrange chicken wings on a baking sheet. 3. Cook chicken wings in the preheated oven until crisp and cooked through, about 1 hour.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "532"
},
{
  "url": "https://www.allrecipes.com/recipe/72068/chicken-katsu/",
  "name": "Chicken Katsu",
  "rating": "4.7",
  "ratingcount": "877",
  "ingredients": "4  skinless, boneless chicken breast halves - pounded to 1/2 inch thickness; salt and pepper to taste; 2 tablespoons all-purpose flour; 1  egg, beaten; 1 cup panko bread crumbs; 1 cup oil for frying, or as needed",
  "directions": "1. Season chicken breasts on both sides with salt and pepper. Place flour, beaten egg, and panko crumbs into separate shallow dishes. Coat chicken breasts in flour, shaking off any excess; dip into egg, and then press into panko crumbs until well coated on both sides. 2. Heat oil in a large skillet over medium-high heat. Place chicken in the hot oil, and fry until golden brown, 3 or 4 minutes per side. Transfer to a paper towel-lined plate to drain.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/213068/grill-master-chicken-wings/",
  "name": "Grill Master Chicken Wings",
  "rating": "4.8",
  "ratingcount": "656",
  "ingredients": "3 pounds chicken wings, cut apart at joints, wing tips discarded; ½ cup soy sauce; ½ cup Italian-style salad dressing; ¼ cup butter; ¼ cup hot pepper sauce (such as Frank's RedHot), or to taste; 1 teaspoon soy sauce",
  "directions": "1. Prepare wings: Combine chicken wings, soy sauce, and Italian dressing in a large resealable plastic bag; coat chicken wings with marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator, 4 hours to overnight. 2. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 3. Prepare sauce: Melt butter in a small saucepan over low heat. Stir in hot pepper sauce and soy sauce until combined. Remove from heat and set aside. 4. Remove chicken wings from marinade and pat dry; discard any remaining marinade. 5. Cook on the preheated grill, turning occasionally, until chicken is browned and no longer pink, 25 to 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 6. Place grilled wings in a large bowl. Pour butter sauce over wings; toss until well-coated.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "181"
},
{
  "url": "https://www.allrecipes.com/recipe/8541/carols-arroz-con-pollo/",
  "name": "Arroz Con Pollo (Chicken and Rice)",
  "rating": "4.4",
  "ratingcount": "366",
  "ingredients": "4 skinless, boneless chicken breast halves, cut into 1-inch pieces; ½ teaspoon salt, divided; ½ teaspoon ground black pepper, divided; ½ teaspoon paprika, divided; 3 tablespoons vegetable oil; 1  green bell pepper, chopped; ¾ cup chopped onion; 1 ½ teaspoons minced garlic; 1 cup long-grain white rice; 1 (14.5 ounce) can chicken broth; 1 (14.5 ounce) can stewed tomatoes; ½ cup white wine; ⅛ teaspoon saffron; 1 tablespoon chopped fresh parsley",
  "directions": "1. Season chicken with a 1/4 teaspoon of salt, 1/4 teaspoon pepper, and 1/4 teaspoon paprika. 2. Heat oil in a large skillet over medium heat. Add seasoned chicken; cook and stir until no longer pink in the center and golden brown on all sides, about 10 minutes. Transfer chicken onto a plate; set aside. 3. Add green pepper, onions, and garlic to the same skillet; cook and stir for 5 minutes. Add rice; cook and stir until rice is opaque, 1 to 2 minutes. Stir in broth, tomatoes, white wine, and saffron. Stir in remaining 1/4 teaspoon salt, 1/4 teaspoon pepper, and 1/4 teaspoon paprika; bring to a boil, cover, and simmer for 20 minutes. 4. Add chicken and stir until heated through. Stir in parsley and serve.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "471"
},
{
  "url": "https://www.allrecipes.com/recipe/236609/honey-garlic-slow-cooker-chicken-thighs/",
  "name": "Honey-Garlic Slow Cooker Chicken Thighs",
  "rating": "4.0",
  "ratingcount": "3",
  "ingredients": "4  skinless, boneless chicken thighs; ½ cup soy sauce; ½ cup ketchup; ⅓ cup honey; 3 cloves garlic, minced; 1 teaspoon dried basil",
  "directions": "1. Arrange chicken thighs in a single layer in the bottom of a 4-quart slow cooker. 2. Whisk soy sauce, ketchup, honey, garlic, and basil together in a bowl; pour over chicken thighs. 3. Cover and cook on Low for 6 hours or High for 3 to 4 hours.",
  "prep": "10 mins",
  "cook": "3 hrs",
  "total": "3 hrs 10 mins",
  "calories": "325"
},
{
  "url": "https://www.allrecipes.com/recipe/269649/skillet-chicken-with-sun-dried-tomato-sauce/",
  "name": "Chicken with Creamy Sun-Dried Tomato Sauce",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "4 pounds boneless skinless chicken breasts; salt and pepper to taste; 10 tablespoons butter, divided; 6 cloves garlic, minced; 2 teaspoons Italian seasoning; ½ teaspoon red pepper flakes; 1 cup dry white wine (such as Chardonnay); 2 cups chicken broth; 1 ½ cups heavy whipping cream; 1 cup oil-packed sun-dried tomatoes, thinly sliced; 1 cup thinly sliced fresh basil",
  "directions": "1. Place chicken breasts in a resealable plastic bag and pound to an even thickness. If breasts are very large, cut them in half. Season lightly with salt and pepper. 2. Melt 4 tablespoons butter in a large nonstick skillet over medium heat and cook 1/2 of the chicken breasts until they are no longer pink in the center and the juices run clear, 5 to 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from skillet and set aside. Melt another 4 tablespoons butter and repeat with the remaining chicken breasts. Set aside. 3. Melt remaining 2 tablespoons butter in the same skillet and add garlic, Italian seasoning, and red pepper flakes. Cook, stirring constantly, for 1 minute. Pour in wine and bring to a boil. Reduce heat and simmer for 2 minutes. Pour in chicken broth, return to a boil, reduce heat, and simmer for 5 minutes. Stir in cream and sun-dried tomatoes. Simmer for 5 minutes. 4. Stir in basil and return chicken to the skillet. Cook until chicken is thoroughly heated and sauce has thickened, about 5 minutes.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "495"
},
{
  "url": "https://www.allrecipes.com/recipe/231449/baked-split-chicken-breast/",
  "name": "Baked Split Chicken Breast",
  "rating": "4.7",
  "ratingcount": "528",
  "ingredients": "2  large bone-in chicken breast halves with skin; ¼ cup extra-virgin olive oil; ½ teaspoon garlic, minced; ½ teaspoon coarse sea salt; ½ teaspoon cracked black pepper; ¼ teaspoon dried rosemary; ¼ teaspoon dried basil",
  "directions": "1. Gather all ingredients. 2. Rub chicken breasts with olive oil and garlic; sprinkle with salt, black pepper, rosemary, and basil. Arrange chicken in a large baking dish. 3. Refrigerate for at least 45 minutes. Meanwhile, preheat the oven to 375 degrees F (190 degrees C). 4. Bake in the preheated oven until chicken meat is no longer pink at the bone and the juices run clear, 45 to 60 minutes. An instant-read thermometer inserted in the thickest part of the breast meat should read 165 degrees F (75 degrees C). 5. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "1 hr 40 mins",
  "calories": "615"
},
{
  "url": "https://www.allrecipes.com/recipe/31848/jambalaya/",
  "name": "Best Jambalaya",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "2 tablespoons peanut oil, divided; 1 tablespoon Cajun seasoning; 10 ounces andouille sausage, sliced into rounds; 1 pound boneless skinless chicken breasts, cut into 1 inch pieces; 1  onion, diced; 1 small green bell pepper, diced; 2 stalks celery, diced; 3 cloves garlic, minced; 1 (16 ounce) can crushed Italian tomatoes; ½ teaspoon red pepper flakes; ½ teaspoon ground black pepper; 1 teaspoon salt; ½ teaspoon hot pepper sauce; 2 teaspoons Worcestershire sauce; 1 teaspoon file powder; 1 ¼ cups uncooked white rice; 2 ½ cups chicken broth",
  "directions": "1. Gather all ingredients. 2. Heat 1 tablespoon of peanut oil in a large heavy Dutch oven over medium heat. Season the sausage and chicken pieces with Cajun seasoning. Sauté sausage until browned. Remove with slotted spoon, and set aside. 3. Add 1 tablespoon peanut oil, and sauté chicken pieces until lightly browned on all sides. Remove with a slotted spoon, and set aside. 4. In the same pot, saute onion, bell pepper, celery, and garlic until tender. 5. Stir in crushed tomatoes, and season with red pepper, black pepper, salt, hot pepper sauce, Worcestershire sauce, and filé powder. 6. Stir in chicken and sausage. Cook for 10 minutes, stirring occasionally. 7. Stir in the rice and chicken broth. 8. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes, or until liquid is absorbed.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "465"
},
{
  "url": "https://www.allrecipes.com/recipe/221090/grilled-lemon-yogurt-chicken/",
  "name": "Grilled Greek Yogurt-Marinated Chicken",
  "rating": "4.6",
  "ratingcount": "218",
  "ingredients": "½ cup plain low-fat Greek yogurt; 4 cloves garlic, crushed; ½  lemon, juiced; 1 tablespoon lemon zest; 1 tablespoon olive oil; 1 tablespoon paprika; 1 teaspoon herbes de Provence; 1 teaspoon salt; 1 teaspoon ground black pepper; 1 (5 pound) whole chicken, cut into 8 pieces; 1 pinch salt; ½ cup plain low-fat Greek yogurt; 1 tablespoon lemon juice; 1 teaspoon harissa",
  "directions": "1. Whisk together yogurt, garlic, lemon juice and zest, olive oil, paprika, herbes de Provence, salt, and black pepper in a medium bowl. Pour into a large resealable plastic bag. Add chicken; stir to coat. Squeeze out excess air and seal the bag. Marinate in the refrigerator for at least 3 hours. 2. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 3. Make sauce: Stir together yogurt, lemon juice, and harissa in a small bowl until combined. Set aside. 4. Remove chicken to a plate or baking sheet lined with paper towels; discard marinade. Pat chicken dry with more paper towels. Season with a pinch of salt. 5. Grill chicken, skin-side down, on the preheated grill for 2 minutes. Turn over each piece and move to indirect heat. Continue grilling, turning often, with the lid down until well browned and meat is no longer pink in the center, 30 to 35 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C). 6. Serve chicken with sauce on the side.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "3 hrs 50 mins",
  "calories": "523"
},
{
  "url": "https://www.allrecipes.com/recipe/240208/simple-baked-chicken-breasts/",
  "name": "Simple Baked Chicken Breasts",
  "rating": "4.7",
  "ratingcount": "480",
  "ingredients": "4 (5 ounce) skinless, boneless chicken breast halves; 2 tablespoons olive oil; ½ teaspoon coarse sea salt, or to taste; 1 pinch Creole seasoning (such as Tony Chachere's®), or more to taste; 1 tablespoon chicken broth, or more to taste",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 400 degrees F (200 degrees C). 3. Rub chicken breasts with olive oil and sprinkle both sides with salt and Creole seasoning. Place chicken in a broiler pan. 4. Bake in the preheated oven for 10 minutes. Flip chicken and cook until no longer pink in the center and the juices run clear, about 15 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 5. Remove chicken to a plate. 6. Pour chicken broth into the pan and scrape any browned bits off the bottom with a flat-edged wooden spatula. Add more broth if needed to dislodge the browned bits, but not too much or it will be watery. 7. To serve, drizzle the pan sauce over the chicken.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "191"
},
{
  "url": "https://www.allrecipes.com/recipe/8543753/creamy-chicken-and-mushroom-stroganoff/",
  "name": "Creamy Chicken and Mushroom Stroganoff",
  "rating": "5.0",
  "ratingcount": "6",
  "ingredients": "3 tablespoons butter; 1 medium onion, diced; 1 cup sliced mushrooms; 1 pound skinless, boneless chicken breasts, cut into thin strips; 1 teaspoon Greek seasoning; ½ teaspoon freshly ground black pepper; 1 (12 ounce) package egg noodles; ½ cup chicken broth; ½ cup milk; ½ teaspoon Worcestershire sauce; ½ cup sour cream; 2 tablespoons all-purpose flour; 1 tablespoon chopped fresh parsley, or to taste",
  "directions": "1. Melt butter in a heavy skillet over medium heat; stir in onion and mushrooms. Reduce heat; cook and stir until onions release their liquid and mushrooms soften, about 5 minutes. 2. Season chicken strips with Greek seasoning and black pepper. Place chicken in the skillet; cook and stir over medium heat until lightly browned on all sides, about 5 minutes. 3. Meanwhile, bring a large pot of lightly salted water to a boil. Cook noodles at a boil until tender yet firm to the bite, about 10 minutes; drain. 4. Pour chicken broth, milk, and Worcestershire sauce into skillet; slowly stir in sour cream, a tablespoonful at a time. Spoon out a small amount of sauce and whisk with flour in a small bowl until smooth. Stir flour mixture back into sauce; simmer until sauce thickens, about 5 minutes. Season with salt and ground black pepper. Serve over egg noodles; garnish with parsley.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "637"
},
{
  "url": "https://www.allrecipes.com/recipe/8543745/chicken-parmesan-meatballs/",
  "name": "Chicken Parmesan Meatballs",
  "rating": "5.0",
  "ratingcount": "9",
  "ingredients": "1 large egg, beaten; ¾ cup grated Parmesan cheese; 1 ¾ cups Italian-style panko bread crumbs, divided; 1 teaspoon garlic powder; 1 teaspoon Italian seasoning; ¾ teaspoon crushed red pepper flakes; ½ teaspoon salt; ½ teaspoon freshly ground black pepper; 1 ½ pounds ground chicken; 2 tablespoons olive oil, divided; 2 tablespoons unsalted butter, divided; 1 (28 ounce) jar marinara sauce; ½ cup shredded mozzarella cheese; 2 tablespoons snipped fresh parsley (Optional)",
  "directions": "1. Stir egg, grated Parmesan cheese, 3/4 cup panko crumbs, garlic powder, Italian herb seasoning blend, crushed red pepper, salt, and black pepper together in a large bowl. 2. Put on a pair of food-grade disposable gloves, add chicken to the bowl, and mix with your hands until all the ingredients are well combined. 3. Place remaining 1 cup panko crumbs on a plate. Using a 1-1/2-inch scoop, create about 24 meatballs. Gently roll each meatball in crumbs until lightly coated; set aside on a plate. 4. Preheat oven to 350 degrees F (175 degrees C). 5. Place 1 tablespoon olive oil and 1 tablespoon butter in a large, oven-proof skillet over medium heat. Add half the meatballs and brown each side, turning until all sides are browned. Set this batch on a plate, and wipe the skillet clean. 6. Repeat with reserved oil and butter, and cook the remaining meatballs in the same way. 7. Wipe out the skillet again, and pour in marinara sauce. Place browned meatballs in sauce. They will not be submerged. 8. Bake in the preheated oven for 25 minutes. Sprinkle on shredded mozzarella and return to the oven for an additional 5 minutes, or until the cheese is melted. Sprinkle with fresh parsley.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "836"
},
{
  "url": "https://www.allrecipes.com/recipe/8512622/chicken-salad-souffle-casserole/",
  "name": "Chicken Salad Souffle Casserole",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "8 slices white bread, cut into 1/2-inch cubes, divided; 3 cups cooked, cubed chicken breast meat; ½ cup mayonnaise; ½ cup chopped bell pepper (any color); ½ cup chopped celery; ½ cup chopped onion; 1 cup frozen peas; salt and freshly-ground black pepper, to taste; 1 ½ cups milk; 2 large eggs, lightly beaten; 1 (10.75 ounce) can  condensed cream of mushroom soup; 1 cup shredded Cheddar cheese",
  "directions": "1. Spread half of the bread cubes into the bottom of a greased 13x9-inch casserole dish. 2. Stir chicken, mayonnaise, bell pepper, celery, onion, and peas together in a large bowl; season with salt and pepper. Spread chicken mixture on top of bread cubes. Top with remaining bread cubes. 3. Whisk milk and eggs together, and pour over casserole. Cover and refrigerate overnight. 4. Preheat the oven to 325 degrees F (165 degrees C). Remove casserole from the refrigerator, uncover, and spread condensed soup evenly over the top. 5. Bake in the preheated oven for 40 minutes. 6. Sprinkle cheese over top, and continue baking until golden brown and heated through, 20 to 25 minutes more.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "328"
},
{
  "url": "https://www.allrecipes.com/recipe/8543040/chef-johns-chicken-meatballs/",
  "name": "Chef John's Chicken Meatballs",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "1 pound boneless, skinless chicken thighs, cut into 1-inch pieces; 3 ounces pork fat, or fatty bacon, diced; 3 ounces crumbled fresh French breadcrumbs; ⅓ cup sautéed onions (Optional); 1 large egg, beaten; 1 tablespoon white wine; 3 cloves garlic, finely minced; ¼ cup chopped parsley; 1 ½ teaspoons kosher salt; ½ teaspoon freshly ground black pepper; ¼ teaspoon chili flakes; ¼ teaspoon fennel seeds, crushed; 4 cups prepared tomato sauce (Optional); olive oil or cooking spray for greasing baking sheet",
  "directions": "1. Mix chicken and pork together on a plate or tray, and place in the freezer for about 15 minutes, or until firm and very cold. Partially frozen is okay. 2. Add breadcrumbs to the bowl of a food processor (this should be crumbled from the inside of a loaf of fresh or day old French bread – no crust!). Add sauteed onions, egg, white wine, garlic, parsley, salt, pepper, chili flakes, and crushed fennel seeds. Add chilled chicken mixture on top. 3. Pulse on and off in the food processor as shown until the mixture resembles ground meat. Stopping occasionally and scraping the bowl of food processor during the process is recommended. 4. Transfer mixture to fridge and chill for 1 hour before shaping. 5. Preheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with foil and lightly grease with olive oil. 6. Divide mixture into 12 portions, and place on the prepared baking sheet. Use damp hands to roll into smooth balls. 7. Bake in the preheated oven until meatballs are cooked through, about 18 minutes. For some additional browning, turn broiler to high, and broil meatballs for 1 to 2 minutes. 8. Meatballs can be served immediately, or transferred into tomato sauce set over low heat. Simmer gently for about 20 minutes to flavor sauce.",
  "prep": "40 mins",
  "cook": "20 mins",
  "total": "2 hrs 15 mins",
  "calories": "430"
},
{
  "url": "https://www.allrecipes.com/recipe/8516210/chicken-adovada/",
  "name": "Chicken Adovada",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "4  dried pasilla chiles, stemmed and seeded; 4  dried ancho chilies, stemmed and seeded; 2 (14.5 ounce) cans low-sodium chicken broth; ½ cup frozen orange juice concentrate; 1 tablespoon distilled white vinegar; 3  dried pitted dates; ¼ cup chipotle peppers in adobo sauce; 2  bay leaves; 1 tablespoon ground cumin; 2 teaspoons dried Mexican oregano; 3 pounds boneless, skinless chicken thighs, cut into large pieces; 1 tablespoon olive oil; 1 large onion, cut into 1/4-inch slices; 1 ½ tablespoons minced garlic; salt to taste; 8 (6 inch) corn tortillas; ¼ cup sliced red onion (Optional); ¼ cup chopped fresh cilantro (Optional); ¼ cup crumbled cotija cheese (Optional); 8  lime wedges, for garnish (Optional)",
  "directions": "1. Lightly toast peppers on the bare surface of a large Dutch oven over medium heat, stirring, until the peppers begin to have a toasted aroma, 2 to 5 minutes. Remove from heat immediately. 2. Add chicken stock, orange juice concentrate, vinegar, dates, and chipotle peppers. Bring to a boil, then reduce the heat and simmer, uncovered, for about 15 minutes. 3. Using a stick blender, puree the pepper mixture until smooth. 4. Add bay leaves, cumin, and oregano to pepper sauce; leave sauce on low simmer while preparing chicken. 5. Pat chicken dry with paper towels. Heat olive oil in a large non-stick skillet over medium heat. Add in chicken pieces all at once; allow to cook undisturbed until browned, about 8 minutes. Add browned chicken to the pepper sauce. 6. Cook onion slices in the same skillet until beginning to brown slightly, 3 to 4 minutes. Stir in garlic and cook until fragrant, about 30 seconds more. 7. Add skillet contents to the chicken and pepper sauce. Bring to a boil, then reduce heat to simmer. Cover partially with a tilted lid to allow some liquid to evaporate. Simmer, stirring occasionally, until chicken is fall-apart tender, about 1 hour. Season to taste with salt. 8. To serve, spoon into corn tortillas, and serve with sliced red onions, cilantro, cheese, and lime wedges.",
  "prep": "45 mins",
  "cook": "1 hr",
  "total": "1 hr 45 mins",
  "calories": "395"
},
{
  "url": "https://www.allrecipes.com/recipe/8525671/baked-buttermilk-chicken-tenders/",
  "name": "Baked Buttermilk Chicken Tenders",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1 pound chicken tenderloins; ½ cup buttermilk; ¼ teaspoon salt; ⅛ teaspoon cayenne pepper; ⅓ cup all-purpose flour; ¼ teaspoon paprika; salt to taste; 1 large egg; 2 tablespoons buttermilk; ¾ cup Italian-style panko bread crumbs; ⅓ cup freshly grated Parmesan cheese; ½ teaspoon seafood seasoning (such as Old Bay®); ½ teaspoon garlic powder; olive oil spray",
  "directions": "1. Combine chicken tenders, buttermilk, salt, and cayenne in a large resealable plastic bag. Refrigerate for at least 2 hours. 2. Preheat the oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil for easy cleanup. 3. Combine flour, paprika, and salt in a shallow bowl. Whisk egg and 2 tablespoons buttermilk in another bowl. Mix breadcrumbs, Parmesan cheese, seafood seasoning, and garlic powder in a third bowl. 4. Drain chicken and discard marinade. Dredge chicken in flour mixture, shaking off the excess. Dip into egg mixture, and turn in breadcrumb mixture, pressing down to make sure the breading adheres to the chicken tender. 5. Place the crumb-coated tenders on the prepared baking sheet, giving each side a good spray of olive oil. 6. Bake in the preheated oven until chicken is no longer pink in the center and the juices run clear, 15 to 18 minutes depending on thickness, flipping halfway through. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "2 hrs 30 mins",
  "calories": "316"
},
{
  "url": "https://www.allrecipes.com/recipe/8499/basic-chicken-salad/",
  "name": "Best Chicken Salad",
  "rating": "4.6",
  "ratingcount": "776",
  "ingredients": "½ cup blanched slivered almonds; ½ cup mayonnaise; 1 tablespoon lemon juice; ¼ teaspoon ground black pepper; 2 cups chopped, cooked chicken meat; 1 stalk celery, chopped",
  "directions": "1. Gather all ingredients. 2. Place almonds in a frying pan. Toast over medium-high heat, shaking frequently. Watch carefully, as they burn easily. 3. Mix together mayonnaise, lemon juice, and pepper in a medium bowl. 4. Toss with chicken, toasted almonds, and celery. 5. Enjoy!",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "779"
},
{
  "url": "https://www.allrecipes.com/recipe/8532992/lemon-pepper-chicken-drummies/",
  "name": "Lemon Pepper Chicken Drummies",
  "rating": "3.0",
  "ratingcount": "1",
  "ingredients": "1 pound chicken drummies; ¼ cup freshly squeezed lemon juice; all purpose seasoning to taste; 2 tablespoons vegetable oil, or as needed; 2 medium lemons, zested; freshly ground black pepper to taste; 1 tablespoon butter",
  "directions": "1. Clean pat dry chicken drummies with paper towels and set into a bowl. Pour lemon juice evenly over drummies and sprinkle with all purpose seasoning; toss until well combined. 2. Pour lemon juice over drummies evenly, sprinkle with all purpose seasoning and toss well. 3. Preheat the oven to 375 degrees F (190 degrees C). 4. Heat vegetable oil in a cast iron skillet over medium-high heat. Add drummies to hot oil and cook, turning occasionally, until chicken is cooked through, 5 to 10 minutes. Remove cooked drummies from the skillet and transfer into a bowl. 5. Melt butter in a microwave safe container. Mix in lemon zest and black pepper until well combined. Pour seasoned butter over chicken drummies and mix well. Spread out drummies on a non-stick baking sheet 6. Bake in the preheated oven until skin is crisp, about 5 minutes. Remove from oven and sprinkle with additional lemon zest and pepper to taste.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "282"
},
{
  "url": "https://www.allrecipes.com/recipe/8489220/chimichurri-chicken/",
  "name": "Chimichurri Chicken",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 cup packed fresh parsley leaves; 2 tablespoons fresh oregano leaves; 1 tablespoon minced garlic; ½ cup chopped green onion (including green tops); 1  jalapeño pepper, seeds and membranes removed, diced; 2 tablespoons white wine vinegar; 1 tablespoon fresh lemon juice; ½ cup olive oil; salt and freshly ground black pepper to taste; 3 pounds chicken tenders; 1 ½ teaspoons smoked paprika",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Line a 12x18-inch sheet pan with parchment or aluminum foil; set aside. 2. Combine parsley, oregano, garlic, green onions, and jalapeño in the bowl of a food processor. Pulse just a few times to break up the parsley and combine the ingredients. Place processed vegetables in a small bowl; stir in vinegar, lemon juice, and olive oil. Season with salt and black pepper. 3. Place chicken tenders in a single layer on the prepared pan. Lightly season with salt and pepper; sprinkle smoked paprika evenly over the tenders. Spoon half of the chimichurri evenly over the tenders. Reserve remaining half of chimichurri, covered, in the refrigerator to use later. 4. Bake in the preheated oven until chicken is no longer pink in the center and the juices run clear, about 18 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 5. Serve tenders with reserved chimichurri sauce.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "253"
},
{
  "url": "https://www.allrecipes.com/recipe/8469664/buffalo-chicken-grilled-cheese/",
  "name": "Buffalo Chicken Grilled Cheese",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "1 ½ tablespoons Buffalo wing sauce; ½ cup shredded cooked chicken; 2 slices white bread; 1 slice pepper Jack cheese; 3 tablespoons crumbled blue cheese; 1 tablespoon butter, softened",
  "directions": "1. Combine shredded chicken, buffalo wing sauce, and blue cheese in a small bowl. 2. Preheat a small skillet over medium heat. 3. Spread 1/2 tablespoon butter on one side of a slice of bread. Place bread butter-side-down onto the skillet bottom and place pepper Jack cheese on top. Top with chicken mixture. Butter a second slice of bread with remaining butter on one side and place on top of sandwich, butter-side-up. 4. Cook sandwich in skillet until lightly browned bread and flip over; about 2 1/2 minutes per side.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "531"
},
{
  "url": "https://www.allrecipes.com/recipe/8453628/garlic-chicken-rigatoni/",
  "name": "Garlic Chicken Rigatoni",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "1 (8 ounce) package rigatoni pasta; 1 tablespoon salt; 1 pound skinless, boneless chicken breasts, cut into bite-sized pieces; 1 tablespoon herb-infused olive oil; ¼ cup tapioca starch; 1 teaspoon Italian seasoning; ¼ teaspoon salt; ⅛ teaspoon freshly ground black pepper; ¾ cup water; ⅓ cup sliced fresh mushrooms; ¼ cup chopped marinated artichoke hearts; 2 tablespoons chopped oil-packed sun-dried tomatoes; 3 cloves minced garlic; ⅓ cup Chardonnay wine; ¼ cup heavy whipping cream; 2 ounces shredded aged Cheddar cheese",
  "directions": "1. Bring a large pot with water and 1 tablespoon salt to a boil. Cook rigatoni in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 minutes. Drain and reserve pasta water. 2. Meanwhile, combine tapioca starch, Italian seasoning, salt, and black pepper in a bowl. Add chicken pieces and toss to coat. 3. Heat olive oil in a skillet until it shimmers. Add chicken pieces and cook until browned, about 5 minutes. You might be tempted to add more olive oil or butter, don't do this. 4. Pour in reserved pasta water and add mushrooms, artichoke hearts, sun-dried tomatoes, and garlic. Cook about 5 minutes. 5. Mix in white wine, cream and Cheddar cheese. Whisk until sauce is slightly thickened. Add rigatoni and toss to combine. 6. Add rigatoni and toss to combine. Serve immediately.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "425"
},
{
  "url": "https://www.allrecipes.com/recipe/8521894/one-pot-lemon-chicken-orzo/",
  "name": "One Pot Lemon Chicken Orzo",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "2 tablespoons extra-virgin olive oil; 1 cup chopped yellow onion; 1 tablespoon chopped garlic; 1 cup (7 oz.) uncooked orzo; 2 cups heavy cream; 1 cup chicken broth; 2  lemons, zested and juiced; 2 cups shredded cooked chicken; 3 cups baby spinach; ½ cup shredded fontina cheese; ¼ cup freshly grated Parmesan cheese, plus more for garnish.; 2 tablespoons chopped fresh flat-leaf parsley, plus more for garnish; ¾ teaspoon black pepper; ½ teaspoon table salt",
  "directions": "1. Gather all ingredients. 2. Heat oil in a large Dutch oven over medium. Add onion and cook, stirring occasionally, until softened, 2 to 3 minutes. Add garlic and cook, stirring occasionally, until fragrant, about 30 seconds. Stir in orzo and cook, stirring constantly, until lightly toasted, about 1 minute. 3. Stir in heavy cream, broth, about 1 teaspoon lemon zest, and 3 tablespoons lemon juice; bring to a simmer over medium heat, stirring occasionally to prevent the bottom from sticking, about 3 minutes. Reduce heat to medium-low; simmer, stirring constantly, until orzo is tender and mixture is thickened, 8 to 10 minutes. 4. Stir in chicken and spinach until spinach wilts, about 1 minute. Remove from heat. Stir in fontina, Parmesan, parsley, pepper, and salt until creamy, about 30 seconds. 5. Serve immediately topped with additional Parmesan and parsley.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "891"
},
{
  "url": "https://www.allrecipes.com/recipe/8472782/frito-chicken-casserole/",
  "name": "Frito Chicken Casserole",
  "rating": "4.3",
  "ratingcount": "4",
  "ingredients": "1 tablespoon unsalted butter; 1 small onion, chopped; 4 cups cubed cooked chicken breast; 1 (15.25 ounce) can black beans, rinsed and drained; 1 (15.2 ounce) can corn, drained; 1 (10.5 ounce) can condensed cream of chicken soup; 1 (10 ounce) can diced tomatoes and green chiles (such as RO*TEL®), undrained; 1 (4 ounce) can chopped green chilies; 1 (4 ounce) package cream cheese; ⅓ cup chopped fresh cilantro; 2 cups shredded Cheddar cheese; 1 (10 ounce) bag chili and cheese flavored corn chips (such as Fritos® Chili Cheese® Corn Chips)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Melt butter in a large saucepan over medium heat. Add onion and cook until softened, about 5 minutes. 3. Add chicken, beans, corn, cream of chicken soup, tomatoes and chiles (with juice), green chiles, cream cheese, and cilantro. Cook until cream cheese has melted, about 5 minutes. 4. Spread out 1/3 of the chips on the bottom of a 9x13 inch rectangular casserole dish. Top with 1/2 of the chicken mixture. Top chicken mixture with 1/3 of shredded Cheddar cheese. Repeat the layer. Top the 2nd layer with remaining 1/3 of the chips and remaining 1/3 of Cheddar cheese. 5. Bake in the preheated oven until cheese has melted and is lightly browned, about 30 minutes. Remove from the oven, cover, and let sit for 30 minutes so it can set before cutting into squares.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "1 hr 20 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/8525243/southeast-asian-style-chicken-rice/",
  "name": "Southeast Asian Style Chicken Rice",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "1 large chicken breast, skin on; 1 teaspoon kosher salt, plus more as needed; 1 tablespoon vegetable oil; 1 tablespoon minced ginger; 2 cloves garlic, minced; ⅓ cup diced onions; ½ teaspoon turmeric; 1 cup plus 1 tablespoon jasmine rice; 1 ½ cups chicken broth; ½ cup thinly sliced red onion; ¼ cup sliced green onions; 1 small red Fresno chili, thinly sliced, or any other hot pepper; 2 tablespoons fresh lime juice, plus more to taste; 2 teaspoons soy sauce, or to taste; 1 teaspoon sambal hot chili sauce; 1 teaspoon sesame oil, or to taste; ¼ teaspoon freshly ground black pepper; salt to taste; ½ cup freshly torn mint leaves; ½ cup freshly torn cilantro leaves; lime wedges (Optional)",
  "directions": "1. Set chicken breast onto a cutting board and make 5 or 6 shallow cuts through the skin. Season generously on both sides with salt. 2. Heat vegetable oil in a skillet over medium high heat and sear chicken breast, skin-side down, until the skin is golden brown and fat has rendered out, about 5 minutes. Flip breast over, and keep cooking until chicken is cooked through, about 5 minutes more. If oil starts to smoke before the chicken is cooked, reduce heat to medium or medium-low. 3. Turn off the heat and transfer chicken to a plate to rest until cool enough to handle. Peel off the skin and finely chop. Refrigerate chicken breast. 4. Add minced chicken skin back into the skillet over and medium heat. Cook and stir until the skin browns and starts getting crisp, 3 to 5 minutes. Add ginger, garlic, and onions and cook, stirring, until onions start to turn translucent, about 5 minutes. Add turmeric and rice; cook and stir until rice is well coated with oil, 2 to 3 minutes. 5. Stir in broth, turn heat to high, and bring to a boil. Cover, reduce heat to low, and simmer undisturbed for 20 minutes. Turn off the heat and set a timer for 10 minutes to allow rice to rest. 6. Meanwhile, shred the chicken meat using your hands or cut into small pieces. Place into a bowl. Add red onion, green onions, Fresno chili, lime juice, soy sauce, hot sauce, sesame oil, salt, pepper, fresh mint and cilantro. Toss until well combined. Taste and adjust with more lime juice, salt, and/or spice as needed. 7. After the 10 minute rice timer is up, remove cover, and fluff rice with a fork. Taste and adjust seasoning if necessary. Serve rice topped with the chicken herb salad mixture and lime wedges.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "820"
},
{
  "url": "https://www.allrecipes.com/recipe/8513735/lemon-chicken-romano/",
  "name": "Lemon Chicken Romano",
  "rating": "4.7",
  "ratingcount": "24",
  "ingredients": "4  chicken cutlets, about 1/2-inch thick; salt and freshly ground black pepper to taste; ¼ cup all-purpose flour; 2 large eggs; 2 tablespoons water; ¾ cup Italian-style panko bread crumbs; ⅓ cup grated Romano cheese; 2 teaspoons lemon zest; ½ teaspoon dried oregano; ½ teaspoon garlic powder; salt and freshly ground black pepper to taste; ¼ cup olive oil; 1 tablespoon unsalted butter; ¾ cup shredded mozzarella cheese; 2 teaspoons chopped fresh parsley; 4 large lemon wedges",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Lightly season each side of the chicken with salt and pepper. Add flour to a shallow dish. Whisk eggs and water together in a second dish. Combine panko bread crumbs, Romano cheese, lemon zest, oregano, garlic powder, salt, and pepper in a third shallow dish.. 3. Pat chicken dry with paper towels, then dredge each chicken cutlet in the flour, shaking off excess. Dip cutlets into the egg wash, allowing excess to drip off, and, finally, dredge in the bread crumbs, pressing down on each side so breading sticks. 4. Heat olive oil and butter in a large skillet over medium heat. Add breaded chicken cutlets and cook, undisturbed, until the bottom is crispy and starts to turn golden brown, about 2 minutes. Flip cutlets, and cook for another 2 minutes. 5. Transfer cutlets to the baking sheet, and evenly sprinkle each with mozzarella cheese. 6. Bake in the preheated oven until chicken is no longer pink and the juices run clear, 6 to 8 minutes. An instant-read thermometer inserted into the center should read 165 degrees F (74 degrees C). Do not overcook. 7. Remove from the oven, garnish with parsley, and serve with lemon wedges for spritzing.",
  "prep": "15 mins",
  "cook": "12 mins",
  "total": "27 mins",
  "calories": "541"
},
{
  "url": "https://www.allrecipes.com/recipe/8489941/roast-chicken-with-grapefruit/",
  "name": "Roast Chicken with Grapefruit",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "3  ruby red grapefruit; 1 tablespoon kosher salt; 1 ½ teaspoons freshly ground black pepper; 1 (4 pound) whole chicken; fresh parsley sprigs; 3 slices thick-cut bacon; 1 tablespoon olive oil; 1 tablespoon Cognac or brandy; 2 tablespoons low-sodium chicken broth; 1 teaspoon half-and-half or cream",
  "directions": "1. Working over a bowl to collect juice, section grapefruits into suprêmes, cutting away all peel, pith, and membranes. Squeeze remaining skin and membranes into the bowl to extract as much juice as possible. 2. Preheat the oven to 375 degrees F (190 degrees C). 3. Stir together salt and pepper in a small bowl. Slip fingers beneath the skin of the chicken breast and thighs to loosen it from the meat. Rub salt mixture under skin, inside cavity, and over skin. Tuck half the suprêmes and a few parsley sprigs into chicken cavity. Transfer chicken, breast side up, to a rack in a baking dish or a cast-iron skillet. 4. Tie legs together with kitchen twine; fold wing tips back and tuck under chicken. Halve bacon; drape over breast in a herringbone pattern, overlapping as needed. Drizzle with oil, coating any uncovered skin. 5. Roast in the preheated oven for 40 minutes. Pour grapefruit juice over chicken. Continue roasting 35 to 40 minutes or until an instant-read thermometer inserted into thickest parts of thigh and breast registers 170°F. Tent with foil; let rest at least 15 minutes. Discard kitchen twine. Remove and reserve suprêmes from chicken cavity. 6. For sauce, warm cognac in a small stainless-steel or copper (not nonstick) skillet over medium heat for a few seconds until shimmering at the edges. Remove from heat. 7. Carefully ignite with a stick lighter or long match. Let burn for 1 minute. Add roasted grapefruit suprêmes, the broth, and half-and-half; heat through. Season to taste with salt and pepper. 8. Serve chicken on a platter with remaining fresh suprêmes (or extra grapefruit wedges) and parsley sprigs. Spoon warm sauce over carved chicken.",
  "prep": "20 mins",
  "cook": "",
  "total": "1 hr 50 mins",
  "calories": "226"
},
{
  "url": "https://www.allrecipes.com/recipe/25490/broccoli-rice-cheese-and-chicken-casserole/",
  "name": "Broccoli, Rice, Cheese, and Chicken Casserole",
  "rating": "4.3",
  "ratingcount": "1",
  "ingredients": "2 cups water; 2 cups uncooked instant rice; 2 (10 ounce) cans chunk chicken, drained; 1 (16 ounce) package frozen chopped broccoli; 1 pound processed cheese food, cubed; 1 (10.75 ounce) can  condensed cream of mushroom soup; 1 (10.75 ounce) can  condensed cream of chicken soup; 1 cup milk; ¼ cup butter, cubed; 1 small white onion, chopped",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Bring water to a boil in a medium saucepan; stir in instant rice, cover, and remove from heat. Let stand for 5 minutes. 3. Mix prepared rice, chicken, broccoli, processed cheese, condensed mushroom soup, condensed chicken soup, milk, butter, and onion in a 9x13-inch baking dish. 4. Bake in the preheated oven until cheese is melted, about 30 to 35 minutes. Stir halfway through cooking to help cheese melt evenly.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "756"
},
{
  "url": "https://www.allrecipes.com/recipe/272545/ranch-baked-chicken-thighs-with-bacon-brussels-sprouts-and-potatoes/",
  "name": "Chicken and Brussels Sprouts with Bacon and Potatoes",
  "rating": "4.3",
  "ratingcount": "42",
  "ingredients": "4  skin-on, bone-in chicken thighs; 1 pound red potatoes, halved or quartered if large; 1 pound Brussels sprouts, trimmed; 1 teaspoon minced garlic; 1 tablespoon olive oil, or as needed; cracked salt and freshly ground black pepper to taste; ½ teaspoon dried thyme; 1 (1 ounce) package ranch dressing mix; 6 slices bacon, chopped",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Place chicken thighs in a 9x13-inch baking dish. 2. Toss potatoes, Brussels sprouts, and garlic together with olive oil in a bowl until vegetables are lightly coated. Add vegetables around and between chicken thighs in the baking dish. Season with salt, pepper, and thyme. Evenly pour the entire packet of ranch seasoning over chicken and vegetables. Sprinkle chopped bacon on top. 3. Bake in the preheated oven until chicken is no longer pink at the bone and the juices run clear, 30 to 35 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 4. Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Place the baking dish under the broiler and cook until chicken skin becomes golden brown and a bit crisp, 2 to 3 minutes.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "429"
},
{
  "url": "https://www.allrecipes.com/recipe/61024/asian-orange-chicken/",
  "name": "Asian Orange Chicken",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "1 ½ cups water; ⅓ cup rice vinegar; ¼ cup lemon juice; 2 ½ tablespoons soy sauce; 2 tablespoons orange juice; 1 cup packed brown sugar; 2 tablespoons chopped green onion; 1 tablespoon grated orange zest; ½ teaspoon minced fresh ginger root; ½ teaspoon minced garlic; ¼ teaspoon red pepper flakes; 3 tablespoons cornstarch; 2 tablespoons water; 2 large skinless, boneless chicken breasts, cut into 1/2-inch cubes; 1 cup all-purpose flour; ¼ teaspoon salt; ¼ teaspoon pepper; 3 tablespoons olive oil",
  "directions": "1. Gather all ingredients. 2. Combine water, rice vinegar, lemon juice, soy sauce, and orange juice for sauce into a saucepan over medium-high heat. Stir in brown sugar, green onion, orange zest, ginger, garlic, and pepper flakes; bring to a boil. Remove from heat, and cool for 10 to 15 minutes. 3. Place chicken in a resealable plastic bag. Pour in 1 cup cooled sauce. Seal the bag, and refrigerate for at least 2 hours. Reserve the remaining sauce. 4. Mix flour, salt, and pepper in another resealable plastic bag. 5. Remove chicken from the marinade and place into the bag of seasoned flour. Seal the bag and shake to coat. 6. Heat the olive oil in a large skillet over medium heat. Cook chicken in the hot skillet until browned on both sides. 7. Remove to a paper towel-lined plate and cover with aluminum foil. Wipe out the skillet. 8. Pour reserved sauce into the skillet and bring to a boil over medium-high heat. 9. Mix together cornstarch and water until completely smooth. Stir into the boiling sauce. 10. Reduce heat to medium-low, add the chicken, and simmer, stirring occasionally, until cooked through, about 5 minutes. 11. Serve over rice and enjoy!",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "2 hrs 50 mins",
  "calories": "445"
},
{
  "url": "https://www.allrecipes.com/recipe/279283/spicy-chicken-jerky-in-the-air-fryer/",
  "name": "Spicy Chicken Jerky in the Air Fryer",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "2 (5 ounce) boneless chicken breasts, cut into strips; ½ cup mojo criollo marinade (such as Goya®); 2 teaspoons Cajun seasoning; 6  wooden skewers",
  "directions": "1. Combine chicken strips, marinade, and Cajun seasoning in a resealable plastic bag. Refrigerate for 8 hours to overnight. 2. Measure skewers to fit across the air fryer basket, slightly overlapping the edge. Trim off excess length. 3. Preheat the air fryer to 180 degrees F (80 degrees C) for 10 minutes. 4. Thread chicken strips onto skewers, leaving room in between each strip, while the air fryer is preheating. 5. Air fry for 1 hour 15 minutes. Adjust cooking time as most air fryers have a maximum setting of 30 minutes. Rearrange the skewers during the reset time. 6. Increase temperature to 200 degrees F (95 degrees C) and air fry for an additional 15 minutes. 7. Remove strips to a paper towel-lined storage container. Seal. Allow to rest overnight before serving.",
  "prep": "10 mins",
  "cook": "1 hr 30 mins",
  "total": "17 hrs 40 mins",
  "calories": "54"
},
{
  "url": "https://www.allrecipes.com/recipe/21659/chicken-quesadillas/",
  "name": "Chicken Quesadillas",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 pound skinless, boneless chicken breast, diced; 1 (1.27 ounce) packet fajita seasoning; 1 tablespoon vegetable oil; 2  green bell peppers, chopped; 2  red bell peppers, chopped; 1  onion, chopped; 10 (10 inch) flour tortillas; 1 (8 ounce) package shredded Cheddar cheese; 1 (8 ounce) package shredded Monterey Jack cheese; 1 tablespoon bacon bits",
  "directions": "1. Preheat the broiler. Lightly grease a baking sheet. 2. Toss chicken with fajita seasoning, then spread onto the prepared baking sheet. Place under the broiler and cook until chicken is cooked through and no longer pink in the center, about 5 minutes. 3. Preheat the oven to 350 degrees F (175 degrees C). 4. Heat oil in a large saucepan over medium heat. Stir in bell peppers, onion, and broiled chicken. Cook and stir until vegetables have softened, about 10 minutes. 5. Layer half of each tortilla with chicken and vegetable mixture, Cheddar cheese, Monterey Jack cheese, and bacon bits. Fold tortillas in half and place onto a baking sheet. 6. Bake quesadillas in the preheated oven until cheeses have melted, about 10 minutes. Cut each quesadilla into wedges and serve.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "472"
},
{
  "url": "https://www.allrecipes.com/recipe/55860/baked-garlic-parmesan-chicken/",
  "name": "Baked Garlic Parmesan Chicken",
  "rating": "4.4",
  "ratingcount": "3",
  "ingredients": "2 tablespoons olive oil; 1 clove garlic, minced; 1 cup dry bread crumbs; ⅔ cup grated Parmesan cheese; 1 teaspoon dried basil leaves; ¼ teaspoon ground black pepper; 6  skinless, boneless chicken breast halves",
  "directions": "1. Gather all ingredients. 2. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. 3. In a bowl, blend the olive oil and garlic. 4. In a separate bowl, mix the bread crumbs, Parmesan cheese, basil, and pepper. 5. Dip each chicken breast in the oil mixture, then in the bread crumb mixture. Arrange the coated chicken breasts in the prepared baking dish, and top with any remaining bread crumb mixture. 6. Bake 30 minutes in the preheated oven, or until chicken is no longer pink and juices run clear. 7. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "281"
},
{
  "url": "https://www.allrecipes.com/recipe/8887/chicken-marsala/",
  "name": "Chicken Marsala",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "¼ cup all-purpose flour for coating; ½ teaspoon salt; ¼ teaspoon ground black pepper; ½ teaspoon dried oregano; 4 medium skinless, boneless chicken breast halves - pounded 1/4 inch thick; 4 tablespoons butter; 4 tablespoons olive oil; 1 cup sliced mushrooms; ½ cup Marsala wine; ¼ cup cooking sherry",
  "directions": "1. Gather all ingredients. 2. In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. 3. Coat chicken pieces in flour mixture. 4. In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown. 5. Turn over chicken pieces, and add mushrooms. Pour in wine and sherry. 6. Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear. 7. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "448"
}]