[{
  "url": "https://www.allrecipes.com/recipe/255365/edible-cookie-dough/",
  "name": "Edible Cookie Dough",
  "rating": "4.4",
  "ratingcount": "277",
  "ingredients": "1 cup all-purpose flour; ¾ cup packed brown sugar; ½ cup butter; 1 teaspoon vanilla extract; ½ teaspoon salt; 2 tablespoons milk; ½ cup milk chocolate chips; ½ cup mini chocolate chips",
  "directions": "1. To heat-treat your flour so it is safe to use: Place flour in a microwave-safe dish and cook for 1 minute and 15 seconds, stirring it every 15 seconds. Set aside. 2. Beat sugar and butter with an electric mixer in a large bowl until creamy. Beat in vanilla extract and salt. Add heat-treated flour; mix until a crumbly dough forms. Stir in milk until dough is just combined; fold in milk chocolate chips and mini chocolate chips.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "348"
},
{
  "url": "https://www.allrecipes.com/recipe/10445/chocolate-coated-peanut-butter-crackers/",
  "name": "Chocolate Coated Peanut Butter Crackers",
  "rating": "4.8",
  "ratingcount": "128",
  "ingredients": "¾ cup creamy or chunky peanut butter; 2 pounds chocolate almond bark, broken into pieces; 80  buttery round crackers (such as Ritz®); 2 ¼ ounces colored candy sprinkles (Optional)",
  "directions": "1. Spread approximately 1 teaspoon peanut butter onto each cracker half. Press peanut butter sides together to form 40 peanut butter-filled sandwich cookies. 2. Melt almond bark in the top of a double boiler over hot, but not boiling, water. Reduce heat and keep melted chocolate in top of double boiler over simmering water. 3. Dip each sandwich cookie into the melted chocolate, allowing excess to drain back into pot. 4. Place coated cookies onto waxed paper and immediately sprinkle with candy sprinkles so they adhere to the melted chocolate. 5. Place cookies in the refrigerator until chocolate has set, about 15 minutes.",
  "prep": "30 mins",
  "cook": "5 mins",
  "total": "50 mins",
  "calories": "389"
},
{
  "url": "https://www.allrecipes.com/recipe/230482/banana-chocolate-chip-bread/",
  "name": "Banana Chocolate Chip Bread",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "2 cups all-purpose flour; 1 teaspoon baking powder; 1 teaspoon baking soda; 1 teaspoon salt; 3  ripe bananas, mashed; 1 tablespoon milk; 1 teaspoon ground cinnamon, or to taste; 1 cup white sugar; ½ cup butter, softened; 2 large eggs; 1 cup semisweet chocolate chips",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan, preferably glass. 2. Mix flour, baking powder, baking soda, and salt in a bowl. Stir bananas, milk, and cinnamon in another bowl. Beat sugar and butter together in a third bowl with an electric mixer until light and fluffy; add eggs one at a time, beating well after each addition. Stir banana mixture into butter mixture; mix in flour mixture until just blended. Fold in chocolate chips; pour batter into the prepared loaf pan. 3. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 70 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack before slicing.",
  "prep": "15 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 35 mins",
  "calories": "378"
},
{
  "url": "https://www.allrecipes.com/recipe/10549/best-brownies/",
  "name": "Best Brownies",
  "rating": "4.6",
  "ratingcount": "13",
  "ingredients": "½ cup butter; 1 cup white sugar; 2  eggs; 1 teaspoon vanilla extract; ⅓ cup unsweetened cocoa powder; ½ cup all-purpose flour; ¼ teaspoon salt; ¼ teaspoon baking powder; 3 tablespoons butter, softened; 3 tablespoons unsweetened cocoa powder; 1 tablespoon honey; 1 teaspoon vanilla extract; 1 cup confectioners' sugar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch square pan. 2. Melt 1/2 cup butter in a large saucepan. Remove from heat, and stir in sugar, eggs, and 1 teaspoon vanilla. Beat in 1/3 cup cocoa, flour, salt, and baking powder. Spread batter into prepared pan. 3. Bake in the preheated oven until top is dry and edges have started to pull away from the sides of the pan, about 25 to 30 minutes. Let cool briefly before frosting. 4. To make the frosting: Combine softened butter, confectioners' sugar, 3 tablespoons cocoa, honey, and 1 teaspoon vanilla extract in a bowl. Stir until smooth. Frost brownies while they are still warm.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "183"
},
{
  "url": "https://www.allrecipes.com/recipe/10813/best-chocolate-chip-cookies/",
  "name": "Best Chocolate Chip Cookies",
  "rating": "4.6",
  "ratingcount": "18",
  "ingredients": "1 cup butter, softened; 1 cup white sugar; 1 cup packed brown sugar; 2  eggs; 2 teaspoons vanilla extract; 1 teaspoon baking soda; 2 teaspoons hot water; ½ teaspoon salt; 3 cups all-purpose flour; 2 cups semisweet chocolate chips; 1 cup chopped walnuts",
  "directions": "1. Gather your ingredients, making sure your butter is softened, and your eggs are room temperature. 2. Preheat the oven to 350 degrees F (175 degrees C). 3. Beat butter, white sugar, and brown sugar with an electric mixer in a large bowl until smooth. 4. Beat in eggs, one at a time, then stir in vanilla. 5. Dissolve baking soda in hot water. Add to batter along with salt. 6. Stir in flour, chocolate chips, and walnuts. 7. Drop spoonfuls of dough 2 inches apart onto ungreased baking sheets. 8. Bake in the preheated oven until edges are nicely browned, about 10 minutes. 9. Cool on the baking sheets briefly before removing to a wire rack to cool completely. 10. Store in an airtight container or serve immediately and enjoy!",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "146"
},
{
  "url": "https://www.allrecipes.com/recipe/8490130/johns-creek-chocolate-cupcakes/",
  "name": "Johns Creek Chocolate Cupcakes",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "1 cup flour; ½ cup unsweetened cocoa powder; ¾ teaspoon baking powder; ½ teaspoon baking soda; ¼ teaspoon salt; ½ cup unsalted butter, softened; ¾ cup sugar; ¼ cup light brown sugar; 2 large eggs; 1 teaspoon vanilla extract; ¾ cup whole milk; 1 (8 ounce) package cream cheese, softened; ½ cup unsalted butter, softened; 4 cups powdered sugar; pomegranate seeds, for garnish",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line one 12-cup muffin pan with paper liners. 2. Stir together flour, cocoa powder, baking powder, baking soda, and salt in a bowl. 3. Beat together butter, white sugar, and brown sugar in a large bowl with an electric mixer a medium speed until light and fluffy, about 90 seconds. Add eggs, one at a time, beating until just combined after each addition. Beat in vanilla. 4. Beat in flour mixture one-third at a time, alternating with 1/4 cup milk, on low speed until just combined. Fill each prepared muffin cup with 1/4 cup batter 5. Bake until a toothpick inserted in centers comes out clean, about 20 minutes. Cool in pan on a wire rack 5 minutes. Transfer to wire rack to cool completely, about 20 minutes. 6. Meanwhile, beat together cream cheese and butter in a large bowl with an electric mixer at medium-high speed until light and fluffy, about 30 seconds. Reduce speed to low; add powdered sugar, 1 cup at a time, beating until frosting is smooth. 7. Fit a piping bag with a large star or round tip and fill with frosting. Pipe frosting onto cupcakes. Garnish with pomegranate arils. Serve immediately or store, chilled, in an airtight container up to 1 week.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "554"
},
{
  "url": "https://www.allrecipes.com/recipe/25037/best-big-fat-chewy-chocolate-chip-cookie/",
  "name": "Best Big, Fat, Chewy Chocolate Chip Cookie",
  "rating": "4.6",
  "ratingcount": "12",
  "ingredients": "2 cups all-purpose flour; ½ teaspoon baking soda; ½ teaspoon salt; 1 cup packed brown sugar; ¾ cup unsalted butter, melted; ½ cup white sugar; 1  egg; 1  egg yolk; 1 tablespoon vanilla extract; 2 cups semisweet chocolate chips",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets or line with parchment paper. 2. Sift flour, baking soda, and salt together; set aside. 3. Beat brown sugar, melted butter, and white sugar with an electric mixer in a large bowl until smooth. Beat in egg, egg yolk, and vanilla until light and creamy; add flour mixture and stir until dough is just combined. Stir in chocolate chips. 4. Drop spoonfuls of dough 3 inches apart onto the prepared baking sheets. 5. Bake in the preheated oven until edges are golden, about 15 to 17 minutes. Cool on the cookie sheets briefly before transferring them to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "285"
},
{
  "url": "https://www.allrecipes.com/recipe/24445/chewy-chocolate-chip-oatmeal-cookies/",
  "name": "Chewy Chocolate Chip Oatmeal Cookies",
  "rating": "4.5",
  "ratingcount": "5",
  "ingredients": "1 cup butter, softened; 1 cup packed light brown sugar; ½ cup white sugar; 2  eggs; 2 teaspoons vanilla extract; 1 ¼ cups all-purpose flour; ½ teaspoon baking soda; 1 teaspoon salt; 3 cups quick-cooking oats; 1 cup chopped walnuts; 1 cup semisweet chocolate chips",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Combine flour, baking soda, and salt in a medium bowl. Set aside. 3. Cream together butter, brown sugar, and white sugar in a large bowl until smooth. Beat in eggs one at a time, until well combined; stir in vanilla extract. 4. Stir flour mixture into egg mixture until just blended. Mix in quick oats, walnuts, and chocolate chips. Drop batter by heaping spoonfuls onto ungreased baking sheets. 5. Bake in the preheated oven for 12 minutes. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "12 mins",
  "total": "47 mins",
  "calories": "145"
},
{
  "url": "https://www.allrecipes.com/recipe/9368/fudge/",
  "name": "Fudge",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "3 cups semisweet chocolate chips; 1 (14 ounce) can sweetened condensed milk; ¼ cup unsalted butter, cut into pieces; 1 cup chopped walnuts (Optional)",
  "directions": "1. Combine chocolate chips, condensed milk, and butter in large microwave-safe bowl. Microwave on medium heat until chips are melted, 3 to 5 minutes, stirring once or twice during the cooking. 2. Meanwhile, generously grease an 8-inch square glass baking dish. 3. Remove chocolate mixture from the microwave and stir in nuts. Pour into the prepared dish. 4. Refrigerate until fudge is set, about 2 hours. 5. Cut into 16 squares.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "2 hrs 10 mins",
  "calories": "359"
},
{
  "url": "https://www.allrecipes.com/recipe/17981/one-bowl-chocolate-cake-iii/",
  "name": "One Bowl Chocolate Cake",
  "rating": "4.7",
  "ratingcount": "4",
  "ingredients": "2 cups white sugar; 1 ¾ cups all-purpose flour; ¾ cup unsweetened cocoa powder; 1 ½ teaspoons baking powder; 1 ½ teaspoons baking soda; 1 teaspoon salt; 2  eggs; 1 cup milk; ½ cup vegetable oil; 2 teaspoons vanilla extract; 1 cup boiling water",
  "directions": "1. Gather all ingredients. 2. Preheat oven to 350 degrees F (175 degrees C). Grease and flour two nine inch round pans. 3. In a large bowl, stir together the sugar, flour, cocoa, baking powder, baking soda and salt. 4. Add the eggs, milk, oil and vanilla, mix for 2 minutes on medium speed of mixer. 5. Stir in the boiling water last. Batter will be thin. 6. Pour evenly into the prepared pans. 7. Bake 30 to 35 minutes in the preheated oven, until the cake tests done with a toothpick. Cool in the pans for 10 minutes, then remove to a wire rack to cool completely. 8. Enjoy!",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "157"
},
{
  "url": "https://www.allrecipes.com/recipe/228782/the-original-fantasy-fudge/",
  "name": "The Original Fantasy Fudge",
  "rating": "4.5",
  "ratingcount": "421",
  "ingredients": "3 cups white sugar; ¾ cup margarine; ⅔ cup evaporated milk; 1 (12 ounce) bag semisweet chocolate chips; 1 (7 ounce) jar marshmallow cream; 1 cup chopped walnuts; 1 teaspoon vanilla extract",
  "directions": "1. Grease a 9x13-inch pan. 2. Mix sugar, margarine, and evaporated milk in a large, heavy saucepan over medium heat, stirring to dissolve sugar. Bring mixture to a full boil and cook for 5 minutes, stirring constantly. 3. Remove from the heat and add chocolate chips; stir until chocolate chips are melted and mixture is thoroughly combined. Stir in marshmallow cream until incorporated. Mix in walnuts and vanilla. 4. Transfer fudge to the prepared pan and use an offset spatula to spread out and flatten. Let cool for at least 1 hour before cutting into squares.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "1 hr 15 mins",
  "calories": "141"
},
{
  "url": "https://www.allrecipes.com/recipe/9832/no-bake-cookies-i/",
  "name": "No-Bake Cookies",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 ¾ cups white sugar; ½ cup butter; ½ cup milk; 4 tablespoons unsweetened cocoa powder; ½ cup crunchy peanut butter; 3 cups quick-cooking oats; 1 teaspoon vanilla extract; waxed paper",
  "directions": "1. Combine sugar, butter, milk, and cocoa in a medium saucepan; bring to a boil, stirring often. Boil for exactly 1 1/2 minutes. Remove from heat, and stir in peanut butter. Add oats and vanilla; stir until well combined. 2. Drop by teaspoonfuls onto waxed paper. Let cool until hardened.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "45 mins",
  "calories": "110"
},
{
  "url": "https://www.allrecipes.com/recipe/63959/magic-cookie-bars-from-eagle-brand/",
  "name": "Magic Cookie Bars from EAGLE BRAND",
  "rating": "4.7",
  "ratingcount": "936",
  "ingredients": "1 ½ cups graham cracker crumbs; ½ cup butter or margarine, melted; 1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk; 2 cups semisweet chocolate morsels; 1 ⅓ cups flaked coconut; 1 cup chopped nuts",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). If using a glass dish, preheat the oven to 325 degrees F (165 degrees C). Coat a 9x13-inch baking dish with cooking spray. 2. Mix graham cracker crumbs and butter in a bowl until well combined. Transfer the mixture to the prepared baking dish and press onto the bottom. 3. Pour sweetened condensed milk on graham cracker crust. Sprinkle with an even layer of chocolate chips, coconut, and nuts. Press toppings down firmly with the back of a fork. 4. Bake in the preheated oven until lightly browned, about 25 minutes. Cool completely, then cut into 36 bars or diamonds.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "167"
},
{
  "url": "https://www.allrecipes.com/recipe/21412/tiramisu-ii/",
  "name": "Tiramisu",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "6 large egg yolks; ¾ cup white sugar; ⅔ cup milk; 1 ¼ cups heavy cream; ½ teaspoon vanilla extract; 1 pound mascarpone cheese, at room temperature; ¼ cup strong brewed coffee, at room temperature; 2 tablespoons rum; 2 (3 ounce) packages ladyfinger cookies; 1 tablespoon unsweetened cocoa powder",
  "directions": "1. Whisk together egg yolks and sugar in a medium saucepan until well blended. 2. Whisk in milk and cook over medium heat, stirring constantly, until mixture comes to a boil. 3. Boil gently for 1 minute, then remove from the heat and allow to cool slightly. 4. Cover tightly and chill in the refrigerator for 1 hour. 5. Beat cream and vanilla in a medium bowl with an electric mixer until stiff peaks form. 6. Remove egg yolk mixture from the refrigerator; add mascarpone cheese and whisk until smooth. 7. Combine coffee and rum in a small bowl. Split ladyfingers in half lengthwise and drizzle with the coffee mixture. Arrange 1/2 of the soaked ladyfingers in the bottom of a 7x11-inch dish. 8. Spread 1/2 of the mascarpone mixture over the ladyfingers, then spread 1/2 of the whipped cream over top. Repeat layers once more. 9. Sprinkle cocoa powder over top. 10. Cover and refrigerate until set, 4 to 6 hours. 11. Enjoy!",
  "prep": "30 mins",
  "cook": "5 mins",
  "total": "5 hrs 35 mins",
  "calories": "387"
},
{
  "url": "https://www.allrecipes.com/recipe/174864/original-nestle-toll-house-chocolate-chip-cookies/",
  "name": "Original Nestle Toll House Chocolate Chip Cookies",
  "rating": "4.6",
  "ratingcount": "532",
  "ingredients": "2 ¼ cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon salt; 1 cup butter, softened; ¾ cup white sugar; ¾ cup packed brown sugar; 1 teaspoon vanilla extract; 2 large eggs; 2 cups semisweet chocolate chips (such as Nestlé Toll House); 1 cup chopped nuts",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Combine flour, baking soda and salt in small bowl. 3. Beat butter, white sugar, brown sugar and vanilla in a large mixing bowl until creamy. Add eggs, one at a time, beating well after each addition. Gradually beat in flour mixture. Stir in chocolate morsels and nuts. 4. Drop by rounded tablespoon onto ungreased baking sheets. 5. Bake in the preheated oven until golden brown, 9 to 11 minutes, switching racks halfway through. 6. Cool on the baking sheets for 2 minutes, then transfer to wire racks to cool completely.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "108"
},
{
  "url": "https://www.allrecipes.com/recipe/27114/chocolate-cake-shot/",
  "name": "Chocolate Cake Shot",
  "rating": "4.6",
  "ratingcount": "66",
  "ingredients": "1 fluid ounce hazelnut liqueur; ½ fluid ounce vodka; 1  lemon, cut into wedges; 1 teaspoon white sugar, or to taste",
  "directions": "1. Combine hazelnut liqueur and vodka in a shot glass. 2. Coat a wedge of lemon with sugar. 3. Suck lemon wedge, then with juice still in your mouth, drink shot.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/270598/quick-keto-chocolate-mousse/",
  "name": "Quick Keto Chocolate Mousse",
  "rating": "4.8",
  "ratingcount": "147",
  "ingredients": "3 ounces cream cheese, softened; ½ cup heavy cream; 1 teaspoon vanilla extract; ¼ cup powdered zero-calorie sweetener (such as Swerve®); 2 tablespoons cocoa powder; 1 pinch salt",
  "directions": "1. Beat cream cheese in a large bowl with an electric mixer until light and fluffy. 2. Turn mixer to low speed and slowly mix in heavy cream and vanilla. Mix in sweetener, cocoa powder and salt until well incorporated. Turn mixer to high and mix until light and fluffy, 1 to 2 minutes more. 3. Serve immediately, or refrigerate for later.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "373"
},
{
  "url": "https://www.allrecipes.com/recipe/223594/chocolate-pretzel-treats/",
  "name": "Chocolate Pretzel Treats",
  "rating": "4.5",
  "ratingcount": "87",
  "ingredients": "1 (15 ounce) package small pretzel twists; 1 (8 ounce) package milk chocolate candy kisses (such as Hershey's Kisses®), unwrapped; 1 (1.69 ounce) package candy-coated milk chocolate pieces (such as M&M's®)",
  "directions": "1. Preheat the oven to 175 degrees F (80 degrees C). 2. Arrange pretzels on a baking sheet in a single layer. Place a candy kiss on the center of each pretzel. 3. Warm pretzels in the preheated oven until candy kisses are shiny and slightly softened, about 2 minutes. 4. Place a candy-coated chocolate piece atop the candy kiss on each pretzel; press down. Chill in the refrigerator for 10 minutes.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "25 mins",
  "calories": "37"
},
{
  "url": "https://www.allrecipes.com/recipe/229544/chex-muddy-buddies/",
  "name": "Chex Muddy Buddies",
  "rating": "4.8",
  "ratingcount": "193",
  "ingredients": "3 cups Rice Chex® cereal; 3 cups Corn Chex® cereal; 3 cups Chocolate Chex® cereal; 1 cup semisweet chocolate chips; ½ cup peanut butter; ¼ cup butter or margarine; 1 teaspoon vanilla; 1 ½ cups powdered sugar",
  "directions": "1. Combine all cereals in a large bowl; set aside. 2. Place chocolate chips, peanut butter, and butter in a 1-quart microwave-safe bowl. Microwave, uncovered, on high for 1 minute, then stir. Continue warming mixture until smooth and combined, about 30 seconds longer. Stir in vanilla. 3. Pour chocolate mixture over cereal and stir until evenly coated. Transfer to a 2-gallon resealable plastic bag. 4. Add powdered sugar to the bag and seal; shake until well-coated. Evenly spread cereal out onto waxed paper to cool.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "206"
},
{
  "url": "https://www.allrecipes.com/recipe/19017/chocolate-trifle/",
  "name": "Chocolate Trifle",
  "rating": "4.7",
  "ratingcount": "2",
  "ingredients": "1 (18.25 ounce) package brownie mix; 1 large egg; ¾ cup water, divided; ¼ cup vegetable oil; 1 (14 ounce) can sweetened condensed milk; 1 (3.9 ounce) package instant chocolate pudding mix; 1 (8 ounce) container frozen whipped topping, thawed; 1 (12 ounce) container frozen whipped topping, thawed; 1 (1.5 ounce) bar chocolate candy",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch square glass baking pan. 3. Combine brownie mix, egg, 1/4 cup water, and vegetable oil in a large bowl. Stir until well-blended, about 50 strokes. Spread into the prepared pan. 4. Bake in the preheated oven until a toothpick inserted 1 inch in from the edges comes out clean, 25 to 30 minutes. Remove from the oven and let cool completely, about 30 mintues. 5. Cut cooled brownies into 1-inch squares and set aside. 6. Combine condensed milk, remaining 1/2 cup water, and pudding mix in a large bowl; mix until smooth. Fold in 8 ounces whipped topping until no streaks remain. 7. Place 1/2 of the brownies in a trifle bowl or glass serving dish. Top with 1/2 of the pudding mixture, then 1/2 of the 12-ounce container of whipped topping. Repeat layers. Shave chocolate on top for garnish. 8. Refrigerate 8 hours before serving.",
  "prep": "30 mins",
  "cook": "25 mins",
  "total": "9 hrs 25 mins",
  "calories": "488"
},
{
  "url": "https://www.allrecipes.com/recipe/17765/german-chocolate-cake-frosting/",
  "name": "German Chocolate Cake Frosting",
  "rating": "4.7",
  "ratingcount": "388",
  "ingredients": "1 cup evaporated milk; 1 cup brown sugar; ½ cup butter; 3  egg yolks; 1 teaspoon vanilla extract; 1 ⅓ cups flaked coconut; 1 cup chopped pecans",
  "directions": "1. Combine evaporated milk, brown sugar, butter, egg yolks, and vanilla in a saucepan over medium heat. Cook, stirring constantly, at a low boil until mixture turns a light caramel color and thickens, about 10 minutes. 2. Remove from heat and stir in coconut and pecans. Let cool to room temperature before spreading on cake.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "280"
},
{
  "url": "https://www.allrecipes.com/recipe/238654/brookies-brownie-cookies/",
  "name": "Brookies (Brownie Cookies)",
  "rating": "4.5",
  "ratingcount": "348",
  "ingredients": "1/2 cup butter, softened; 1/2 cup light brown sugar; 1/4 cup white sugar; 1/2 teaspoon vanilla extract; 1 large egg; 1 1/4 cups all-purpose flour; 1/2 teaspoon salt; 1/2 teaspoon baking soda; 1 cup semisweet chocolate chips; 1 cup white sugar; 1/2 cup butter, melted; 1 teaspoon vanilla extract; 2  eggs; 1/3 cup cocoa powder; 1/2 cup all-purpose flour; 1/4 teaspoon baking powder; 1/8 teaspoon salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 2. Prepare cookie layer: Beat 1/2 cup butter, 1/2 cup brown sugar, 1/4 cup white sugar, and 1/2 teaspoon vanilla in a large bowl until creamy. Add one egg; beat until light and creamy, about 2 minutes. 3. Whisk 1 1/4 cups flour, 1/2 teaspoon salt, and baking soda in a bowl. Gradually stir flour mixture into butter mixture until dough is combined. Stir chocolate chips into dough. Spread dough evenly into the prepared baking dish; set aside. 4. Prepare brownie layer: Stir 1 cup sugar, 1/2 cup melted butter, and 1 teaspoon vanilla in a bowl; add two eggs and beat well. Mix in cocoa powder until well-combined. Stir in 1/2 cup flour, baking powder, and 1/8 teaspoon salt until batter is combined. Pour over cookie layer and spread to cover completely. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes. Cool completely before cutting into 20 bars.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "246"
},
{
  "url": "https://www.allrecipes.com/recipe/235257/easy-pumpkin-chocolate-chip-bread/",
  "name": "Easy Pumpkin Chocolate Chip Bread",
  "rating": "4.8",
  "ratingcount": "41",
  "ingredients": "1 ⅔ cups all-purpose flour; 1 cup white sugar; 1 tablespoon ground cinnamon; 1 teaspoon baking soda; ¼ teaspoon baking powder; ¼ teaspoon salt; 1 pinch ground nutmeg; 1 cup pumpkin puree; ½ cup butter, melted; 2  eggs; 1 cup chocolate chips",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease and flour a loaf pan. 2. Stir flour, sugar, cinnamon, baking soda, baking powder, salt, and nutmeg together in a large bowl. 3. Whisk pumpkin, butter, and eggs together in a separate bowl. Stir in chocolate chips. Fold pumpkin mixture into flour mixture. Pour pumpkin batter into prepared loaf pan. 4. Bake in the preheated oven until a toothpick inserted in the center of the loaf comes out clean, 1 hour.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "338"
},
{
  "url": "https://www.allrecipes.com/recipe/13611/chocolate-pecan-pie-i/",
  "name": "Chocolate Pecan Pie",
  "rating": "4.4",
  "ratingcount": "105",
  "ingredients": "1 cup light corn syrup; ⅔ cup white sugar; ⅓ cup margarine, melted; 3 large eggs; ½ teaspoon salt; 1 ½ cups semisweet chocolate chips; 1 cup pecan halves; 1 (9 inch) unbaked pie crust",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Combine corn syrup, sugar, melted margarine, eggs, and salt in a mixing bowl; beat with an electric mixer until combined. Stir in chocolate chips and pecans. Pour mixture into pie crust. 3. Bake in the preheated oven until set, 40 to 50 minutes. 4. Cool completely before serving.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "736"
},
{
  "url": "https://www.allrecipes.com/recipe/33647/chocolate-ganache/",
  "name": "Chocolate Ganache",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "9 ounces bittersweet chocolate, roughly chopped; 1 cup heavy cream; 1 tablespoon dark rum (Optional)",
  "directions": "1. Gather all ingredients. 2. Place chocolate in a medium mixing bowl. 3. Heat cream in a small saucepan over medium heat. Bring just to a boil, watching very carefully because if it boils for even a few seconds, it will boil out of the pot. 4. As soon as the cream comes to a boil, pour it over the chocolate in the mixing bowl. Whisk until chocolate has melted and mixture is smooth, then stir in rum. 5. To use ganache as a cake glaze, cool slightly, 5 to 10 minutes. Start pouring glaze at the center of the cake and work outward. 6. For a fluffy frosting or chocolate filling, allow it to cool until thick (up to 1 hour in the refrigerator), and then whip until light and fluffy. Apply it with a spatula like a conventional frosting.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "142"
},
{
  "url": "https://www.allrecipes.com/recipe/211165/pumpkin-brownies/",
  "name": "Pumpkin Brownies",
  "rating": "4.6",
  "ratingcount": "467",
  "ingredients": "¾ cup all-purpose flour; ½ teaspoon baking powder; ½ teaspoon salt; ¾ cup butter, melted; 1 ½ cups white sugar; 2 teaspoons vanilla extract; 3 large eggs; ½ cup semi-sweet chocolate chips; ¼ cup cocoa powder; ½ cup pumpkin puree; ½ cup chopped walnuts; ¾ teaspoon ground cinnamon; ½ teaspoon ground cloves; ½ teaspoon ground nutmeg",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking pan. 2. Stir flour, baking powder, and salt together in a medium bowl. 3. Stir sugar, melted butter, and vanilla together in a large bowl. Add one egg and mix with a spoon until well incorporated. Repeat to add remaining 2 eggs, mixing well after each addition. Gradually add flour mixture and stir the batter until evenly moistened. Pour 1/2 of the batter back into the medium bowl that held the flour mixture. 4. Stir chocolate chips and cocoa into one bowl of batter. Stir pumpkin puree, walnuts, cinnamon, cloves, and nutmeg into the second bowl of batter. 5. Spread 1/2 of the chocolate batter into the bottom of the prepared baking pan, and follow with 1/2 of the pumpkin batter. Repeat the two layers once more. Drag a kitchen knife or small spatula gently through the layers in a swirling motion to create a marbled appearance. 6. Bake in the preheated oven until the brownies begin to pull away from the sides of the pan, and a toothpick inserted into the center comes out clean, 40 to 45 minutes. 7. Remove from the oven and let cool in the pan before cutting into 16 squares.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "241"
},
{
  "url": "https://www.allrecipes.com/recipe/9827/chocolate-chocolate-chip-cookies-i/",
  "name": "Chocolate Chocolate Chip Cookies",
  "rating": "4.7",
  "ratingcount": "4",
  "ingredients": "1 ½ cups white sugar; 1 cup butter, softened; 2  eggs; 2 teaspoons vanilla extract; 2 cups all-purpose flour; ⅔ cup cocoa powder; ¾ teaspoon baking soda; ¼ teaspoon salt; 2 cups semisweet chocolate chips; ½ cup chopped walnuts (Optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Beat sugar, butter, eggs, and vanilla in a large bowl until light and fluffy. 3. Combine flour, cocoa powder, baking soda, and salt in another bowl; stir into butter mixture until well blended. Mix in chocolate chips and walnuts. Drop spoonfuls of dough 2 inches apart onto ungreased cookie sheets. 4. Bake in the preheated oven just until set, 8 to 10 minutes. Cool slightly on the cookie sheets before transferring to wire racks to cool completely.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "125"
},
{
  "url": "https://www.allrecipes.com/recipe/10740/pumpkin-chocolate-chip-cookies-iii/",
  "name": "Pumpkin Chocolate Chip Cookies",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 cup canned pumpkin; 1 cup white sugar; ½ cup vegetable oil; 1 large egg; 1 teaspoon baking soda; 1 teaspoon milk; 2 cups all-purpose flour; 2 teaspoons baking powder; 2 teaspoons ground cinnamon; ½ teaspoon salt; 2 cups semisweet chocolate chips; ½ cup chopped walnuts (Optional); 1 tablespoon vanilla extract",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a baking sheet. 2. Combine pumpkin, sugar, oil, and egg in a large bowl. Dissolve baking soda into milk in a small bowl and stir in. 3. Stir together flour, baking powder, cinnamon, and salt in a separate bowl. Add flour mixture to pumpkin mixture and mix well. Add chocolate chips, walnuts, and vanilla; stir just to combine. 4. Drop by spoonful on the prepared cookie sheet and bake in the preheated oven until lightly brown and firm, approximately 10 minutes.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "202"
},
{
  "url": "https://www.allrecipes.com/recipe/241038/microwave-chocolate-mug-cake/",
  "name": "Easy Microwave Chocolate Mug Cake",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "¼ cup all-purpose flour; ¼ cup white sugar; 2 tablespoons unsweetened cocoa powder; ⅛ teaspoon baking soda; ⅛ teaspoon salt; 3 tablespoons milk; 2 tablespoons canola oil; 1 tablespoon water; ¼ teaspoon vanilla extract",
  "directions": "1. Mix flour, sugar, cocoa powder, baking soda, and salt together in a large microwave-safe mug; stir in milk, canola oil, water, and vanilla extract. 2. Cook in the microwave until cake is done in the middle, about 1 minute 45 seconds.",
  "prep": "5 mins",
  "cook": "2 mins",
  "total": "7 mins",
  "calories": "603"
},
{
  "url": "https://www.allrecipes.com/recipe/9420/old-fashioned-chocolate-fudge/",
  "name": "Old-Fashioned Chocolate Fudge",
  "rating": "4.3",
  "ratingcount": "715",
  "ingredients": "2 cups white sugar; ½ cup unsweetened cocoa powder; 1 cup whole milk; 4 tablespoons unsalted butter, sliced and softened; 1 teaspoon vanilla extract",
  "directions": "1. Gather ingredients. 2. Grease an 8-inch square baking pan. 3. Place sugar and cocoa powder in a medium saucepan; pour in milk and stir until blended. Set heat to medium-high and stir constantly until mixture comes to a boil. 4. Reduce heat to low and place a candy thermometer in the pan. Let the mixture simmer without stirring until the temperature reaches 238 degrees F (114 degrees C) when measured with a candy thermometer, about 10 minutes. 5. If you don't have a candy thermometer, drop a small amount of the mixture into cold water; if it forms a soft ball that flattens when removed from the water and placed on a flat surface, it's ready. 6. Remove from the heat. Allow to cool to 110 degrees F (43 degrees C), 50 to 70 minutes. Do not disturb fudge as it's cooling. 7. Add butter and vanilla to the fudge. Beat with a wooden spoon until well incorporated and fudge loses its sheen; do not under beat. 8. Pour fudge into prepared pan and press to flatten. Let cool at room temperature or in the refrigerator before cutting into 1-inch squares. 9. Enjoy!",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "1 hr 25 mins",
  "calories": "35"
},
{
  "url": "https://www.allrecipes.com/recipe/8271/raspberry-white-chocolate-mousse/",
  "name": "Raspberry White Chocolate Mousse",
  "rating": "4.4",
  "ratingcount": "156",
  "ingredients": "1 (10 ounce) package frozen raspberries, thawed; 2 tablespoons white sugar; 2 tablespoons orange liqueur; 1 ¾ cups heavy whipping cream, divided; 6 ounces white chocolate chips; 1 drop red food coloring",
  "directions": "1. Process berries in a blender or food processor until smooth. Strain mixture into a small bowl and discard seeds. Add sugar and liqueur; stir until sugar dissolves. Makes 1 cup raspberry sauce. 2. Warm 1/4 cup cream and white chocolate in a heavy saucepan over low heat, stirring constantly, until chocolate melts; let mixture cool until lukewarm. Stir in 1 tablespoon raspberry sauce and food coloring. Transfer to a large bowl. 3. Beat 1 1/2 cups cream in a chilled glass or metal bowl with an electric mixer until soft peaks form; fold into melted chocolate mixture, 1/3 at a time, until no streaks remain. 4. Layer into parfait dishes and serve with remaining raspberry sauce.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "180"
},
{
  "url": "https://www.allrecipes.com/recipe/7906/chocolate-chip-muffins/",
  "name": "Chocolate Chip Muffins",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "¾ cup milk; ⅓ cup vegetable oil; 1  egg; 2 cups all-purpose flour; ½ cup white sugar; 3 teaspoons baking powder; ½ teaspoon salt; ¾ cup mini semi-sweet chocolate chips; 3 tablespoons white sugar; 2 tablespoons brown sugar",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Grease a 12-cup muffin tin or line cups with paper liners. 2. Combine milk, oil, and egg in a small bowl until well blended. Combine flour, 1/2 cup sugar, baking powder, and salt together in a large bowl, making a well in the center. Pour milk mixture into well and stir until batter is just combined; fold in chocolate chips. 3. Spoon batter into the prepared muffin cups, filling each 2/3 full. Mix 3 tablespoons white sugar and brown sugar together in a small bowl; sprinkle on tops of muffins. 4. Bake in the preheated oven until tops spring back when lightly pressed, about 20 to 25 minutes. Cool in the tin briefly, then transfer to a wire rack. Serve warm or cool completely.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "249"
},
{
  "url": "https://www.allrecipes.com/recipe/9909/buckeyes-i/",
  "name": "Buckeyes",
  "rating": "4.5",
  "ratingcount": "797",
  "ingredients": "1 ½ cups peanut butter; 1 cup butter, softened; ½ teaspoon vanilla extract; 4 cups sifted confectioners' sugar, or more as needed; 4 cups semisweet chocolate chips; toothpicks",
  "directions": "1. Beat peanut butter, butter, and vanilla together in a large bowl until light and fluffy. Beat in 4 cups sifted confectioners' sugar until dough is stiff, firm, and dry with no lumps; you may need up to 2 cups more sifted confectioners' sugar. 2. Roll dough into about sixty 1-inch balls and place on wax-lined cookie sheets. Press a toothpick into the top of each ball and chill in the freezer until firm, about 30 minutes. 3. Place chocolate chips in a double boiler or in a bowl set over a pan of barely simmering water. Stir frequently until melted and smooth. 4. Hold the toothpicks and dip frozen peanut butter balls into the melted chocolate, leaving a small portion of peanut butter showing at the top. Return to the cookie sheet, remove and discard the toothpicks, and refrigerate until ready to serve.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "50 mins",
  "calories": "151"
},
{
  "url": "https://www.allrecipes.com/recipe/10281/chewy-chocolate-cookies-ii/",
  "name": "Chocolate Cookies",
  "rating": "4.4",
  "ratingcount": "636",
  "ingredients": "2 cups white sugar; 1 ¼ cups margarine, softened; 2 large eggs; 2 teaspoons vanilla extract; 2 cups all-purpose flour; ¾ cup unsweetened cocoa powder; 1 teaspoon baking soda; ⅛ teaspoon salt; 1 cup chopped walnuts",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Cream sugar and margarine in a large bowl until light and fluffy. Beat in eggs, one at a time, then stir in vanilla. 3. Combine flour, cocoa, baking soda, and salt in a separate bowl. Add to the creamed mixture and mix until just blended. Stir in walnuts. Drop spoonfuls of dough 2 inches apart onto ungreased cookie sheets. 4. Bake in the preheated oven until edges are set and centers are soft, 8 to 10 minutes. Let sit briefly before transferring to wire racks to cool completely.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "116"
},
{
  "url": "https://www.allrecipes.com/recipe/9861/chocolate-crinkles-ii/",
  "name": "Chocolate Crinkle Cookies",
  "rating": "4.7",
  "ratingcount": "2",
  "ingredients": "2 cups white sugar; 1 cup unsweetened cocoa powder; ½ cup vegetable oil; 4 large eggs; 2 teaspoons vanilla extract; 2 cups all-purpose flour; 2 teaspoons baking powder; ½ teaspoon salt; ½ cup confectioners' sugar",
  "directions": "1. Gather ingredients. 2. Mix sugar, cocoa, and oil together in a medium bowl. Beat in eggs, one at a time, until combined. Stir in vanilla. 3. Combine flour, baking powder, and salt in another bowl. Gradually stir dry ingredients into the wet ingredients until thoroughly mixed. Cover dough and refrigerator for at least 4 hours. 4. Preheat the oven to 350 degrees F (175 degrees C). Line two baking sheets with parchment paper. 5. Roll or scoop chilled dough into 1-inch balls. Coat each ball in confectioners' sugar and place 1 inch apart on the prepared cookie sheets. 6. Bake in the preheated oven for 10 to 12 minutes. Let stand on the cookie sheet for a few minutes before transferring to wire racks to cool. 7. Repeat Steps 4 and 5 to make remaining batches. 8. Enjoy!",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "5 hrs",
  "calories": "58"
},
{
  "url": "https://www.allrecipes.com/recipe/187298/southern-style-chocolate-gravy/",
  "name": "Southern-Style Chocolate Gravy",
  "rating": "4.7",
  "ratingcount": "277",
  "ingredients": "¾ cup white sugar; ¼ cup cocoa; 3 tablespoons all-purpose flour; 2 cups milk; 1 tablespoon butter, softened; 2 teaspoons vanilla",
  "directions": "1. Gather all ingredients. 2. Whisk sugar, cocoa, and flour in a medium bowl until no lumps remain. 3. Pour in milk and whisk until well combined. 4. Transfer mixture to a saucepan; cook and stir over medium heat until it thickens to a gravy consistency, 7 to 10 minutes. 5. Remove from heat; stir in butter and vanilla. 6. Serve warm.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "91"
},
{
  "url": "https://www.allrecipes.com/recipe/229415/oreo-cookie-balls/",
  "name": "Oreo Cookie Balls",
  "rating": "4.7",
  "ratingcount": "263",
  "ingredients": "36  OREO Cookies, finely crushed; 1 (8 ounce) package cream cheese, softened; waxed paper; 16 ounces semi-sweet baking chocolate, melted",
  "directions": "1. Mix crushed cookies and cream cheese in a large bowl until well-blended. 2. Use your hands to shape mixture into 48 (1-inch) balls; place on a tray and freeze until thoroughly chilled, about 10 minutes. 3. Line a shallow pan with waxed paper. Dip balls in melted chocolate; place in a single layer on the prepared pan. 4. Refrigerate for 1 hour or until firm. Store in a covered container in the refrigerator.",
  "prep": "30 mins",
  "cook": "",
  "total": "1 hr 40 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/10025/white-chocolate-macadamia-nut-cookies-iii/",
  "name": "White Chocolate Macadamia Nut Cookies",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "1 cup butter, softened; ¾ cup packed light brown sugar; ½ cup white sugar; 2  eggs; ½ teaspoon vanilla extract; ½ teaspoon almond extract; 2 ½ cups all-purpose flour; 1 teaspoon baking soda; ½ teaspoon salt; 1 cup coarsely chopped macadamia nuts; 1 cup coarsely chopped white chocolate",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Cream butter, brown sugar, and white sugar together in a large bowl until smooth. Beat in eggs one at a time, then stir in vanilla and almond extracts. 3. Combine flour, baking soda, and salt in another bowl. Gradually stir the dry ingredients into the butter mixture. Fold in macadamia nuts and white chocolate. 4. Drop dough by teaspoonfuls onto ungreased cookie sheets. 5. Bake in the preheated oven until golden brown, about 10 minutes.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "45 mins",
  "calories": "122"
},
{
  "url": "https://www.allrecipes.com/recipe/6732/chocolate-chip-pumpkin-bread/",
  "name": "Chocolate Chip Pumpkin Bread",
  "rating": "4.7",
  "ratingcount": "864",
  "ingredients": "3 cups white sugar; 1 (15 ounce) can pumpkin puree; 4 large eggs; 1 cup vegetable oil; ⅔ cup water; 3 ½ cups all-purpose flour; 1 tablespoon ground cinnamon, or to taste; 1 tablespoon ground nutmeg, or to taste; 2 teaspoons baking soda; 1 ½ teaspoons salt; 1 cup miniature semisweet chocolate chips; ½ cup chopped walnuts",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour three 9x5-inch loaf pans (or three empty 16-ounce coffee tins). 2. Gather all ingredients. 3. Combine sugar, pumpkin, eggs, oil, and water in a large bowl. Beat with an electric mixer until smooth. Blend in flour, cinnamon, nutmeg, baking soda, and salt. 4. Fold in chocolate chips and nuts. 5. Evenly divide batter between the prepared pans; they should be 1/2 to 3/4 full. 6. Bake in the preheated oven until a knife inserted into the center comes out clean, about 1 hour. 7. Remove from the oven and let cool on wire racks before removing from the pans. 8. Enjoy!",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "251"
},
{
  "url": "https://www.allrecipes.com/recipe/21712/chocolate-covered-strawberries/",
  "name": "Chocolate-Covered Strawberries",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "16 ounces milk chocolate chips; 2 tablespoons shortening; toothpicks; 1 pound fresh strawberries with leaves",
  "directions": "1. Melt chocolate and shortening in a double boiler, stirring occasionally until smooth. 2. Insert toothpicks into tops (stem ends) of strawberries. Hold a strawberry by the toothpick and dip it into the chocolate mixture. 3. Turn the strawberry upside down and insert the toothpick into a Styrofoam block or place strawberry on a sheet of waxed paper; allow chocolate coating to cool. Repeat with remaining strawberries.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "20 mins",
  "calories": "115"
},
{
  "url": "https://www.allrecipes.com/recipe/228553/moist-chocolate-muffins/",
  "name": "Moist Chocolate Muffins",
  "rating": "4.4",
  "ratingcount": "659",
  "ingredients": "2 cups all-purpose flour; 1 cup white sugar; 1 cup semisweet chocolate chips, divided; ½ cup unsweetened cocoa powder; 1 teaspoon baking soda; 1 cup plain yogurt; ½ cup milk; ½ cup vegetable oil; 1 large egg; 1 teaspoon vanilla extract",
  "directions": "1. Gather ingredients 2. Preheat the oven to 400 degrees F (200 degrees C). Line 12 muffin cups with paper muffin liners. 3. Combine flour, sugar, 3/4 cup chocolate chips, cocoa powder, and baking soda in a large bowl. 4. Whisk yogurt, milk, oil, egg, and vanilla in separate bowl until smooth. 5. Pour yogurt mixture into the chocolate mixture and stir until batter is just blended. 6. Fill prepared muffin cups 3/4 full and sprinkle with remaining 1/4 cup chocolate chips. 7. Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "322"
},
{
  "url": "https://www.allrecipes.com/recipe/228740/pumpkin-oatmeal-chocolate-chip-cookies/",
  "name": "Pumpkin Oatmeal Chocolate Chip Cookies",
  "rating": "4.7",
  "ratingcount": "199",
  "ingredients": "1 ½ cups butter, softened; 2 cups packed brown sugar; 1 cup white sugar; 1 (15 ounce) can pumpkin puree; 1  egg; 1 teaspoon vanilla extract; 4 cups all-purpose flour; 2 cups quick-cooking oats; 2 teaspoons ground cinnamon; 2 teaspoons baking soda; 1 teaspoon baking powder; 1 teaspoon salt; 2 cups miniature chocolate chips",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Beat butter, brown sugar, and white sugar together in a bowl until creamy. Add pumpkin, egg, and vanilla extract; beat until smooth. 3. Mix flour, oats, cinnamon, baking soda, baking powder, and salt in a separate bowl; stir into creamed butter until combined. Fold chocolate chips into batter. Drop 1 to 2 tablespoons batter for each cookie onto a baking sheet. 4. Bake in the preheated oven until the edges of each cookie are lightly browned, 10 to 12 minutes.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "128"
},
{
  "url": "https://www.allrecipes.com/recipe/8095/black-forest-cake-i/",
  "name": "Black Forest Cake",
  "rating": "4.5",
  "ratingcount": "486",
  "ingredients": "2 ⅛ cups all-purpose flour; 2 cups white sugar; ¾ cup unsweetened cocoa powder; 1 ½ teaspoons baking powder; ¾ teaspoon baking soda; ¾ teaspoon salt; 3  eggs; 1 cup milk; ½ cup vegetable oil; 1 tablespoon vanilla extract; 2 (20 ounce) cans pitted sour cherries; 1 cup white sugar; ¼ cup cornstarch; 1 teaspoon vanilla extract; 3 cups heavy whipping cream; ⅓ cup confectioners' sugar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round cake pans; line bottoms with parchment paper. Place a medium bowl in the refrigerator to chill. 2. Whisk flour, sugar, cocoa, baking powder, baking soda, and salt together in a large bowl. Add eggs, milk, oil, and vanilla; beat until combined. Pour cake batter into the prepared pans. 3. Bake in the preheated oven until a toothpick inserted in the centers comes out clean, about 35 minutes. Cool layers in pans on wire racks for 10 minutes. Run a paring knife around edges to loosen and invert carefully onto racks to cool completely, 1 to 2 hours. 4. While cake layers bake, drain cherries for topping, reserving 1/2 cup juice. Combine reserved juice, cherries, sugar, and cornstarch in a 2-quart saucepan. Cook, stirring constantly, over low heat until thickened. Stir in vanilla. Let cool at room temperature for 30 minutes. Transfer to the refrigerator to cool completely before assembling cake. 5. Combine whipping cream and confectioners' sugar for frosting in the chilled medium bowl. Beat with an electric mixer at high speed until stiff peaks form. 6. Split each cake layer in half horizontally using a long serrated knife. Tear one layer into crumbs; set aside. Gently brush loose crumbs off top and sides of remaining layers using a pastry brush or your hands. Reserve 1 1/2 cups frosting for piping decorations on cake; set aside. 7. To assemble, place one cake layer on a cake plate. Spread with 1 cup frosting; top with 3/4 cup cherry topping. Top with second cake layer; repeat layers of frosting and cherry topping. Top with third cake layer and frost sides of cake. 8. Pat reserved cake crumbs onto sides of cake. Spoon reserved 1 1/2 cups frosting into a pastry bag fitted with a star decorator tip. Pipe around top and bottom edges of cake. Spoon remaining cherry topping on top of cake. 9. Store covered in the refrigerator until ready to serve.",
  "prep": "50 mins",
  "cook": "35 mins",
  "total": "2 hrs 55 mins",
  "calories": "662"
},
{
  "url": "https://www.allrecipes.com/recipe/127491/easy-oreo-truffles/",
  "name": "Easy Oreo Truffles",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "2 (8 ounce) packages semisweet baking chocolate; 16 ounces cream-filled chocolate sandwich cookies (such as Oreo®), divided; 1 (8 ounce) package cream cheese, softened",
  "directions": "1. Melt chocolate in a saucepan over low heat, stirring occasionally, 4 to 6 minutes. 2. While the chocolate is melting, place 9 cream-filled sandwich cookies in a food processor and blend until finely crushed. Transfer crumbs to a bowl and reserve for decorating. 3. Add remaining cookies to the food processor and blend until finely crushed. Transfer crumbs to a large bowl and stir in cream cheese; mix until well-blended. Roll mixture into 42 balls, about 1-inch in diameter. 4. Place each ball in melted chocolate and use two forks to roll it until fully coated. Lift the ball with both forks and allow excess chocolate to drip off. Place coated truffle on a wax paper-lined baking sheet and sprinkle with reserved cookie crumbs to decorate. Repeat to make remaining truffles. 5. Refrigerate truffles until firm, at least 1 hour. Keep in the refrigerator until just before serving.",
  "prep": "35 mins",
  "cook": "5 mins",
  "total": "1 hr 40 mins",
  "calories": "122"
},
{
  "url": "https://www.allrecipes.com/recipe/11376/saltine-toffee-cookies/",
  "name": "Saltine Toffee Cookies",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "4 ounces saltine crackers; 1 cup butter; 1 cup dark brown sugar; 2 cups semisweet chocolate chips; ¾ cup chopped pecans",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Line a rimmed baking sheet with saltine crackers in single layer. 3. Combine butter and sugar in a saucepan. Bring to a boil; boil for 3 minutes. Immediately pour over saltines and spread to cover crackers completely. 4. Bake in the preheated oven for 5 to 6 minutes. 5. Remove from the oven and sprinkle chocolate chips over top. Let sit 5 minutes. 6. Spread softened chocolate evenly. Sprinkle with pecans. Allow to cool completely, about 25 minutes. 7. Break toffee into pieces.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "55 mins",
  "calories": "150"
},
{
  "url": "https://www.allrecipes.com/recipe/7167/chocolate-zucchini-muffins/",
  "name": "Chocolate Zucchini Muffins",
  "rating": "4.5",
  "ratingcount": "260",
  "ingredients": "3  eggs; 2 cups white sugar; 1 cup vegetable oil; ⅓ cup unsweetened cocoa powder; 1 ½ teaspoons vanilla extract; 2 cups grated zucchini; 3 cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon salt; ½ teaspoon baking powder; ¼ teaspoon ground cinnamon; ¼ teaspoon ground nutmeg; ¼ teaspoon ground cloves; ¼ teaspoon ground cardamom",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease two 12-cup muffin tins or line cups with paper liners. 2. Whisk eggs in a large bowl until smooth. Add sugar, oil, cocoa, and vanilla; whisk until well blended. Stir in zucchini. Add flour, baking soda, salt, baking powder, cinnamon, nutmeg, cloves, and cardamom; mix until just moist. 3. Spoon batter into the prepared muffin cups, filling each 2/3 full. Bake in the preheated oven until tops spring back when lightly pressed, about 20 to 25 minutes. Transfer to a wire rack to cool completely; store loosely covered.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "217"
},
{
  "url": "https://www.allrecipes.com/recipe/17377/chocolate-cupcakes/",
  "name": "Chocolate Cupcakes",
  "rating": "4.1",
  "ratingcount": "1",
  "ingredients": "1 ⅓ cups all-purpose flour; ¾ cup unsweetened cocoa powder; 2 teaspoons baking powder; ¼ teaspoon baking soda; ⅛ teaspoon salt; 1 ½ cups white sugar; 3 tablespoons butter, softened; 2 large eggs; ¾ teaspoon vanilla extract; 1 cup milk",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a muffin pan with paper or foil liners. 2. Sift together flour, cocoa, baking powder, baking soda, and salt. 3. Cream together sugar and butter in a large bowl until light and fluffy. 4. Add eggs, one at a time, beating well after each addition. Stir in the vanilla. Add flour mixture in two batches, alternating with milk; beat well. 5. Spoon batter into the prepared muffin cups, filling each 3/4 full. 6. Bake in the preheated oven until a toothpick inserted into the centers comes out clean, 15 to 17 minutes. Remove from the oven and let cool before serving or frosting.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "158"
},
{
  "url": "https://www.allrecipes.com/recipe/25095/nanaimo-bars-iii/",
  "name": "Nanaimo Bars",
  "rating": "4.6",
  "ratingcount": "362",
  "ingredients": "1 cup butter, softened, divided; 5 tablespoons unsweetened cocoa powder; ¼ cup white sugar; 1  egg, beaten; 1 ¾ cups graham cracker crumbs; 1 cup flaked coconut; ½ cup finely chopped almonds (Optional); 3 tablespoons heavy cream; 2 tablespoons custard powder; 2 cups confectioners' sugar; 4 (1 ounce) squares semisweet baking chocolate; 2 teaspoons butter",
  "directions": "1. In the top of a double boiler, combine 1/2 cup softened butter, cocoa powder, and sugar. Stir occasionally until melted and smooth. Beat in egg and stir until thick, 2 to 3 minutes. 2. Remove from the heat and mix in graham cracker crumbs, coconut, and almonds. Press into the bottom of an ungreased 8x8-inch pan. 3. For the middle layer, beat remaining 1/2 cup softened butter, heavy cream, and custard powder until light and fluffy. Mix in confectioners' sugar until smooth. Spread over the bottom layer in the pan. Chill to set. 4. While the second layer is chilling, melt semisweet chocolate and 2 teaspoons butter together in the microwave or over low heat. 5. Spread melted chocolate mixture over chilled bars. Let the chocolate set before cutting into squares.",
  "prep": "30 mins",
  "cook": "",
  "total": "30 mins",
  "calories": "311"
},
{
  "url": "https://www.allrecipes.com/recipe/17345/buche-de-noel/",
  "name": "Buche de Noel",
  "rating": "4.7",
  "ratingcount": "429",
  "ingredients": "2 cups heavy cream; ½ cup confectioners' sugar; ½ cup unsweetened cocoa powder; 1 teaspoon vanilla extract; 6  egg yolks; ½ cup white sugar; ⅓ cup unsweetened cocoa powder; 1 ½ teaspoons vanilla extract; ⅛ teaspoon salt; 6  egg whites; ¼ cup white sugar; confectioners' sugar for dusting",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Line a 10x15 inch jellyroll pan with parchment paper. In a large bowl, whip cream, 1/2 cup confectioners' sugar, 1/2 cup cocoa, and 1 teaspoon vanilla until thick and stiff. Refrigerate. 2. In a large bowl, use an electric mixer to beat egg yolks with 1/2 cup sugar until pale in color, light and frothy. Blend in 1/3 cup cocoa, 1 1/2 teaspoons vanilla, and salt. 3. In large glass bowl, using clean beaters, whip egg whites to soft peaks. Gradually add 1/4 cup sugar, and beat until whites form stiff peaks. 4. Immediately fold the yolk mixture into the whites. 5. Spread the batter evenly into the prepared pan. 6. Bake for 12 to 15 minutes in the preheated oven, or until the cake springs back when lightly touched. 7. Dust a clean dishtowel with confectioners' sugar. Run a knife around the edge of the pan, and turn the warm cake out onto the towel. Remove and discard parchment paper. 8. Starting at the short edge of the cake, roll the cake up with the towel. Cool for 30 minutes. 9. Unroll the cake, and spread the filling to within 1 inch of the edge. 10. Roll the cake up with the filling inside. Place seam side down onto a serving plate, and refrigerate until serving. 11. Enjoy!",
  "prep": "45 mins",
  "cook": "15 mins",
  "total": "1 hr 30 mins",
  "calories": "276"
},
{
  "url": "https://www.allrecipes.com/recipe/73412/best-toffee-ever-super-easy/",
  "name": "Best Toffee Ever - Super Easy",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "2 cups unsalted butter; 2 cups white sugar; ¼ teaspoon salt; 2 cups semisweet chocolate chips; 1 cup finely chopped almonds",
  "directions": "1. Combine butter, sugar, and salt in a large, heavy-bottomed saucepan over medium heat; stir constantly in one direction until butter is melted, about 5 minutes. 2. Meanwhile, line a 9x13-inch baking dish with a sheet of parchment paper, letting it overhang two sides of the dish. 3. Once the butter has melted, stop stirring and bring mixture to a boil. Once boiling, cook, stirring only 2 to 3 times, until it turns a dark amber color and the temperature reaches 285 degrees F (137 degrees C) on a candy thermometer, 20 to 30 minutes. 4. Immediately pour toffee into the prepared baking dish. Sprinkle chocolate chips on top and let sit until they soften, 1 to 2 minutes. Use a spatula to spread softened chocolate into a thin, even layer. Sprinkle nuts over the chocolate and press down slightly; wearing a plastic bag over your hand will minimize the mess. 5. Place toffee in the refrigerator until set, about 1 hour. 6. Lift hardened toffee out of the baking dish with the parchment paper. Break into pieces and store in an airtight container.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "1 hr 40 mins",
  "calories": "226"
},
{
  "url": "https://www.allrecipes.com/recipe/222601/zucchini-chocolate-chip-muffins/",
  "name": "Zucchini-Chocolate Chip Muffins",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "1 ½ cups all-purpose flour; ¾ cup white sugar; 1 teaspoon baking soda; 1 teaspoon ground cinnamon; ½ teaspoon salt; 1  egg, lightly beaten; ½ cup vegetable oil; ¼ cup milk; 1 tablespoon lemon juice; 1 teaspoon vanilla extract; 1 cup shredded zucchini; ½ cup miniature semisweet chocolate chips; ½ cup chopped walnuts",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease 12 muffin cups, or line with paper muffin liners. 2. Combine flour, sugar, baking soda, cinnamon, and salt in a large bowl. Mix egg, oil, milk, lemon juice, and vanilla extract in a bowl. Stir wet ingredients into dry ingredients until just moistened. Fold in zucchini, chocolate chips, and walnuts. 3. Fill prepared muffin cups 2/3 full with batter. 4. Bake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, 20 to 25 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "265"
},
{
  "url": "https://www.allrecipes.com/recipe/239969/no-bake-energy-bites/",
  "name": "No-Bake Energy Bites",
  "rating": "4.8",
  "ratingcount": "682",
  "ingredients": "1 cup rolled oats; ½ cup miniature semisweet chocolate chips; ½ cup ground flax seed; ½ cup crunchy peanut butter; ⅓ cup honey; 1 teaspoon vanilla extract",
  "directions": "1. Stir oats, chocolate chips, flax seed, peanut butter, honey, and vanilla extract together in a bowl. 2. Roll dough into 24 balls with your hands. Arrange balls on a baking sheet and freeze until set, about 1 hour.",
  "prep": "15 mins",
  "cook": "",
  "total": "1 hr 15 mins",
  "calories": "94"
},
{
  "url": "https://www.allrecipes.com/recipe/212429/red-velvet-cupcakes/",
  "name": "Red Velvet Cupcakes",
  "rating": "4.4",
  "ratingcount": "1",
  "ingredients": "2 ½ cups flour; ½ cup unsweetened cocoa powder; 1 teaspoon baking soda; ½ teaspoon salt; 2 cups sugar; 1 cup butter, softened; 4 large eggs; 1 cup sour cream; ½ cup milk; 1 (1 ounce) bottle McCormick® Red Food Color; 2 teaspoons McCormick® Pure Vanilla Extract; 1 (8 ounce) package cream cheese, softened; ¼ cup butter, softened; 2 tablespoons sour cream; 2 teaspoons McCormick® Pure Vanilla Extract; 1 (16 ounce) box confectioners' sugar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line 30 muffin cups with paper liners. 2. Make cake: Mix together flour, cocoa powder, baking soda, and salt in a medium bowl; set aside. 3. Beat sugar and butter in a large bowl with an electric mixer on medium speed until light and fluffy, about 5 minutes. Beat in eggs, one at a time. Mix in sour cream, milk, food color, and vanilla. Gradually beat in flour mixture on low speed until just blended; do not overbeat. Spoon batter into the prepared muffin cups, filling each 2/3 full. 4. Bake in the preheated oven until a toothpick inserted into a cupcake comes out clean, about 20 minutes. Cool in the pans on a wire rack for 5 minutes. Remove cupcakes from the pans; cool completely. 5. While cupcakes are cooling, make frosting: Beat cream cheese, butter, sour cream, and vanilla extract in a large bowl until light and fluffy. Gradually beat in confectioners' sugar until smooth. 6. Spread or pipe frosting onto cooled cupcakes.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "277"
},
{
  "url": "https://www.allrecipes.com/recipe/233985/chocolate-protein-balls/",
  "name": "Chocolate Protein Balls",
  "rating": "4.9",
  "ratingcount": "170",
  "ingredients": "1 cup rolled oats; ½ cup natural peanut butter; ⅓ cup honey; ¼ cup chopped dark chocolate; 2 tablespoons flax seeds; 2 tablespoons chia seeds; 1 tablespoon chocolate-flavored protein powder, or to taste",
  "directions": "1. Stir oats, peanut butter, honey, chocolate, flax seeds, chia seeds, and protein powder together in a bowl until evenly mixed. Cover bowl with plastic wrap and refrigerate for 30 minutes. 2. Scoop chilled mixture into balls. Keep cold until serving. 3. Enjoy!",
  "prep": "10 mins",
  "cook": "",
  "total": "40 mins",
  "calories": "188"
},
{
  "url": "https://www.allrecipes.com/recipe/9996/chewy-peanut-butter-chocolate-chip-cookies/",
  "name": "Chewy Peanut Butter Chocolate Chip Cookies",
  "rating": "4.4",
  "ratingcount": "1",
  "ingredients": "1 cup packed brown sugar; ½ cup white sugar; ½ cup butter, softened; ½ cup peanut butter; 2  eggs; 2 tablespoons light corn syrup; 2 tablespoons water; 2 teaspoons vanilla extract; 2 ½ cups all-purpose flour; 1 teaspoon baking soda; ½ teaspoon salt; 2 cups chopped semisweet chocolate",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Cream sugars, butter, and peanut butter in a large bowl until smooth. Beat in eggs one at a time, then stir in corn syrup, water, and vanilla. Combine flour, baking soda, and salt in a separate bowl; stir into peanut butter mixture. Fold in chocolate chunks. 3. Scoop 1/4-cup portions of dough 3-inches apart onto ungreased baking sheets. 4. Bake in the preheated oven until edges are golden, 12 to 14 minutes. Allow cookies to cool for 1 minute before transferring to wire racks.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "246"
},
{
  "url": "https://www.allrecipes.com/recipe/262841/no-egg-chocolate-mug-cake/",
  "name": "No Egg Chocolate Mug Cake",
  "rating": "3.8",
  "ratingcount": "65",
  "ingredients": "4 tablespoons all-purpose flour; 4 tablespoons white sugar; 3 tablespoons milk; 2 tablespoons unsweetened cocoa powder; ½ tablespoon olive oil; 1 pinch baking powder; 1 tablespoon semisweet chocolate chips; 1 tablespoon sliced almonds",
  "directions": "1. Gather all ingredients. 2. Mix flour, sugar, milk, cocoa powder, olive oil, and baking powder in a large mug until well combined. Stir in chocolate chips and almonds. 3. Place mug in the microwave and cook until cake has risen by 50 percent, 30 seconds to 2 minutes.",
  "prep": "5 mins",
  "cook": "2 mins",
  "total": "7 mins",
  "calories": "586"
},
{
  "url": "https://www.allrecipes.com/recipe/235797/cannoli-dip/",
  "name": "Cannoli Dip",
  "rating": "4.8",
  "ratingcount": "264",
  "ingredients": "2 cups ricotta cheese; 1 (8 ounce) package cream cheese, at room temperature; 1 ½ cups confectioners' sugar; 1 teaspoon vanilla extract; 1 cup miniature semisweet chocolate chips",
  "directions": "1. Beat ricotta cheese and cream cheese together in a bowl until smooth; add sugar and vanilla. Continue to stir mixture until sugar is completely incorporated. Fold in chocolate chips until well-blended. 2. Cover bowl with plastic wrap and place in the refrigerator until chilled, at least 10 minutes.",
  "prep": "10 mins",
  "cook": "",
  "total": "20 mins",
  "calories": "295"
}]