[{
  "url": "https://www.allrecipes.com/recipe/230038/5-cup-salad/",
  "name": "5 Cup Salad",
  "rating": "4.7",
  "ratingcount": "54",
  "ingredients": "1 cup mini marshmallows; 1 cup shredded coconut; 1 cup drained mandarin oranges; 1 cup drained pineapple chunks; 1 cup sour cream",
  "directions": "1. Mix marshmallows, coconut, oranges, pineapple, and sour cream together in a bowl. Cover and refrigerate until flavors blend, 5 to 6 hours.",
  "prep": "10 mins",
  "cook": "5 hrs",
  "total": "5 hrs 10 mins",
  "calories": "157"
},
{
  "url": "https://www.allrecipes.com/recipe/222325/mango-bread/",
  "name": "Mango Bread",
  "rating": "4.8",
  "ratingcount": "80",
  "ingredients": "2 cups all-purpose flour; 2 teaspoons baking soda; 2 teaspoons ground cinnamon; ½ teaspoon salt; 3  eggs; ¾ cup softened butter; 1 ¼ cups white sugar; 1 teaspoon vanilla extract; 2 cups chopped mango; ½ cup shredded coconut; ¼ cup chopped walnuts",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 loaf pans. 2. Sift flour, baking soda, cinnamon, and salt together in a large bowl; make a well in the center. 3. Whisk eggs, butter, sugar, and vanilla extract together in a separate bowl. Fold mango, coconut, and walnuts into the egg mixture; pour resulting mixture into the well in the center of the flour and mix well. Pour batter into prepared loaf pans and let sit at room temperature for 20 minutes. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "245"
},
{
  "url": "https://www.allrecipes.com/recipe/269034/chewy-coconut-bibingka-filipino-rice-cake/",
  "name": "Chewy Coconut Bibingka (Filipino Rice Cake)",
  "rating": "4.5",
  "ratingcount": "6",
  "ingredients": "1 (13.5 ounce) can coconut milk; 1 (14 ounce) can sweetened condensed milk; 1 stick butter, melted; 4  eggs; 2 (12 ounce) jars macapuno strings in heavy syrup; 2 ½ cups sweet rice flour (mochiko); 1 cup packed brown sugar; 1 tablespoon vanilla extract",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Butter a 12x17-inch rimmed baking sheet. 2. Beat condensed milk, coconut milk, and melted butter together in a large mixing bowl until combined. Add eggs, 1 at a time, and beat until combined. Add macapuno, 1 jar at a time, and beat until combined. Gradually beat in mochiko flour. Beat in brown sugar; beat in vanilla extract. Pour batter onto the prepared baking sheet. 3. Bake in the preheated oven until top is golden brown and sides are slightly dark brown, 45 to 50 minutes. 4. Allow to cool, about 20 minutes, before loosening the sides and cutting into squares.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 20 mins",
  "calories": "304"
},
{
  "url": "https://www.allrecipes.com/recipe/234371/creamy-coconut-milk-rice-pudding/",
  "name": "Creamy Coconut Milk Rice Pudding",
  "rating": "4.6",
  "ratingcount": "35",
  "ingredients": "3 cups water; 1 ½ cups basmati rice; 3 cups coconut milk; 1 ½ cups raw sugar; ½ teaspoon sea salt; 1 cup whole milk; 2  eggs, beaten; ¼ cup unsalted butter; 1 tablespoon vanilla extract; 2 teaspoons ground cinnamon; 1 teaspoon ground nutmeg; 1 (15 ounce) can sliced peaches, drained and chopped (Optional); 1 cup raisins, or more to taste (Optional)",
  "directions": "1. Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, about 20 minutes. 2. Combine rice, coconut milk, sugar, and salt in a large saucepan; bring to a boil. Reduce heat and simmer until pudding is thick and creamy, 18 to 20 minutes. Stir milk and eggs into pudding, stirring constantly to keep pudding from sticking, at least 2 minutes. 3. Remove pudding from heat and stir in butter, vanilla, cinnamon, and nutmeg until thoroughly mixed. Fold peaches and raisins into pudding; serve warm.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "55 mins",
  "calories": "487"
},
{
  "url": "https://www.allrecipes.com/recipe/245303/sweet-coconut-oatmeal/",
  "name": "Sweet Coconut Oatmeal",
  "rating": "4.7",
  "ratingcount": "15",
  "ingredients": "1 (14 ounce) can coconut milk; 1 cup rolled oats; 2 tablespoons honey; ¼ cup coconut flakes (Optional); 2 tablespoons brown sugar, or more to taste; 1 teaspoon ground cinnamon",
  "directions": "1. Bring coconut milk to a gentle boil in a small saucepan over medium-low heat. Stir in oats and honey; lower heat and simmer until milk has mostly been absorbed, about 15 minutes. 2. Sprinkle coconut flakes, brown sugar, and cinnamon into oatmeal. Cook until oats are creamy and flavors are combined, about 5 minutes.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "490"
},
{
  "url": "https://www.allrecipes.com/recipe/84857/ono-butter-mochi/",
  "name": "Ono Butter Mochi",
  "rating": "4.7",
  "ratingcount": "199",
  "ingredients": "1 pound mochiko (glutinous rice flour); 2 ½ cups white sugar; 1 teaspoon baking powder; ½ cup butter, melted; 3 cups whole milk; 5  eggs; 1 teaspoon vanilla extract; 1 cup sweetened, flaked coconut",
  "directions": "1. Gather ingredients. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish. 2. In a medium bowl, whisk together the eggs, vanilla and milk. In a separate larger bowl, stir together the rice flour, sugar, and baking powder. 3. Pour the wet ingredients into the dry ingredients, and stir to blend. Mix in melted butter and coconut. Pour into the prepared pan. 4. Bake for 1 hour in the preheated oven. Cool completely, then cut into squares to serve.",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 5 mins",
  "calories": "463"
},
{
  "url": "https://www.allrecipes.com/recipe/237023/coconut-coconut-milk-cake/",
  "name": "Coconut Coconut Milk Cake",
  "rating": "4.8",
  "ratingcount": "76",
  "ingredients": "2 cups white sugar; 1 cup butter, softened; 4  eggs, separated; 1 cup unsweetened shredded coconut; 2 cups all-purpose flour; 2 tablespoons baking powder; 1 teaspoon salt; 1 (14 ounce) can coconut milk",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch cake pan. 2. Beat sugar, butter, and egg yolks together in a bowl using an electric mixer until smooth and creamy; add shredded coconut. 3. Whisk flour, baking powder, and salt together in a bowl. Stir creamed butter mixture, alternating with coconut milk, into flour mixture until batter is just mixed. 4. Beat egg whites in a glass or metal bowl until until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak. Fold egg whites into batter. Pour batter into the prepared cake pan. 5. Bake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, about 45 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "241"
},
{
  "url": "https://www.allrecipes.com/recipe/71003/coconut-cream-pound-cake/",
  "name": "Coconut Cream Pound Cake",
  "rating": "4.4",
  "ratingcount": "421",
  "ingredients": "1 cup butter, softened; 1 (8 ounce) package cream cheese, softened; 3 cups white sugar; 6  eggs; 1 teaspoon coconut extract; 3 cups all-purpose flour; ½ teaspoon baking powder; 2 cups flaked coconut",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease and flour a 10-inch tube pan. 2. Beat butter and cream cheese together in a large bowl with an electric mixer until blended; add sugar and beat until light and fluffy. Blend in eggs one at a time, then stir in coconut extract. Mix in flour and baking powder until just moistened; stir in flaked coconut. Spoon batter into the prepared pan. 3. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour 20 minutes. Allow the cake to cool in the pan for 10 minutes; run a table knife around the edges to loosen, then invert carefully onto a serving plate or cooling rack. Let cool completely.",
  "prep": "15 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 45 mins",
  "calories": "451"
},
{
  "url": "https://www.allrecipes.com/recipe/219065/willard-family-german-chocolate-cake/",
  "name": "Willard Family German Chocolate Cake",
  "rating": "4.7",
  "ratingcount": "153",
  "ingredients": "1 (4 ounce) package sweet baking chocolate (such as Baker's German's Sweet Chocolate®) - broken into pieces; ½ cup boiling water; 1 cup margarine, softened; 2 cups white sugar; 4  eggs, separated; 1 teaspoon vanilla extract; 2 ½ cups sifted all purpose flour; 1 teaspoon baking soda; ½ teaspoon salt; 1 cup buttermilk; 1 cup evaporated milk; 1 cup white sugar; 3  egg yolks; ¼ cup margarine; 1 teaspoon vanilla extract; 1 ⅓ cups sweetened flake coconut; 1 cup chopped pecans",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 8-inch cake pans and line bottoms with parchment paper. 2. Place the chunks of chocolate into the boiling water and stir until the chocolate has melted; set aside to cool. In a large bowl, beat 1 cup of softened margarine with 2 cups of sugar with an electric mixer until light and fluffy. Stir in 4 egg yolks, one at a time, beating well after each addition. Beat in 1 teaspoon of vanilla extract and the chocolate-water mixture until thoroughly blended. 3. Sift the flour, baking soda, and salt into a bowl. Beat the flour mixture into the liquid ingredients, alternating with buttermilk, in 3 or 4 additions. Beat until batter is smooth, about 1 minute. 4. In a metal or glass bowl, beat the reserved egg whites until they hold stiff peaks when the beaters are lifted straight up. Gently fold the beaten egg whites into the batter, keeping as much volume as possible. Pour the batter into the prepared cake pans. 5. Bake in the preheated oven until the cakes have browned lightly and a toothpick inserted into the center of a cake comes out clean, 35 to 40 minutes. Allow the cakes to cool in pans before removing. 6. To make frosting, pour the evaporated milk into a large saucepan, and mix in 1 cup of sugar, 3 egg yolks, 1/4 cup of margarine, and 1 teaspoon of vanilla extract. Bring to a boil, reduce heat to medium, and cook until thickened, stirring constantly, about 12 minutes. Remove from heat, and mix in the coconut and pecans, beating the frosting until cooled and spreadable. Frost and fill the cake with the coconut frosting.",
  "prep": "30 mins",
  "cook": "50 mins",
  "total": "2 hrs 20 mins",
  "calories": "809"
},
{
  "url": "https://www.allrecipes.com/recipe/8535279/tom-cruise-cake/",
  "name": "Tom Cruise Cake",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "3 cups all-purpose flour, plus more for flouring the pan; 1/2 teaspoon salt; 1/2 teaspoons baking powder; 3 cups white sugar; 1 cup unsalted butter, softened; 6 large eggs, at room temperature; 1 teaspoon vanilla extract; 1 teaspoon coconut extract; 1 cup sour cream; 2 cups sweetened flaked coconut; 1 cup white chocolate chips; 4 ounces cream cheese, at room temperature; 1/4 cup unsalted butter, softened; 1 teaspoon vanilla extract; 1/8 teaspoon salt; 2  cups powdered sugar; 2 tablespoons heavy cream; 1 ½ cups sweetened flaked coconut",
  "directions": "1. To make the coconut cake: Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch Bundt pan. 2. Combine flour, salt, and baking powder in a large bowl; set aside. 3. Beat sugar and butter together in a large bowl with an electric mixer on medium until light and fluffy, about 5 minutes. Beat in whole eggs, 1 at a time, beating well after each addition. Add vanilla extracts, coconut extract, and sour cream: beat until combined. 4. Add flour mixture and mix until just combined; fold in flaked coconut and white chocolate chips. 5. Pour batter into the prepared pan and use the back of a spoon to spread batter evenly. 6. Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, about 1 hour 25 minutes. Allow cake to cool in the pan for 20 minutes before removing to a wire rack to cool completely, about 2 hours more. 7. To make the frosting: Add cream cheese, butter, vanilla, and salt to a medium bowl; beat with an electric mixer until smooth. Gradually add powdered sugar and slowly mix until incorporated. Add cream and beat until light and fluffy, about 1 or 2 minutes. 8. Frost the top and sides of the cake; lightly press coconut evenly around the outside.",
  "prep": "20 mins",
  "cook": "1 hr 25 mins",
  "total": "3 hrs 45 mins",
  "calories": "707"
},
{
  "url": "https://www.allrecipes.com/recipe/150106/swedish-chocolate-balls-or-coconut-balls/",
  "name": "Swedish Chocolate Balls (or Coconut Balls)",
  "rating": "4.6",
  "ratingcount": "63",
  "ingredients": "4 cups regular rolled oats; 1 ¼ cups white sugar; ½ cup unsweetened cocoa powder; 1 cup butter or margarine, softened; 2 tablespoons strong coffee; 1 teaspoon vanilla extract; 2 (1 ounce) squares unsweetened baking chocolate, melted; ⅓ cup coconut flakes",
  "directions": "1. Mix the oats, sugar, and cocoa together in a bowl. Add the butter, and use your hands to mix the ingredients together to make a thick dough. Mix in the coffee, vanilla, and chocolate until thoroughly blended. 2. Place the coconut flakes in a small bowl. Pinch off small amounts of dough and roll between your hands to make small balls, about 1-1/2 inches in diameter. Roll the balls in the coconut flakes. Balls are ready to eat, or may be refrigerated 2 hours to become firmer.",
  "prep": "20 mins",
  "cook": "",
  "total": "2 hrs 20 mins",
  "calories": "90"
},
{
  "url": "https://www.allrecipes.com/recipe/8533944/coconut-bundt-cake/",
  "name": "Coconut Bundt Cake",
  "rating": "3.3",
  "ratingcount": "4",
  "ingredients": "1 cup butter, softened; 1 cup sour cream; 3 cups white sugar; 6 large eggs; 1 teaspoon coconut extract; 1 teaspoon vanilla extract; 3 cups all-purpose flour; ½ teaspoon baking powder; 2 cups flaked coconut; 1 cup white chocolate chips; 1 (4 ounce) package cream cheese, softened; ¼ cup butter, softened; 1 teaspoon vanilla extract; 2 cups confectioners' sugar; ¾ cup flaked coconut, toasted",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease and flour a 10-inch tube pan. 2. Beat butter and sour cream together in a large bowl with an electric mixer until well combined. Add sugar and beat until light. Add in eggs, 1 at a time, beating well after each addition. Stir in coconut extract and vanilla extract. Mix in flour and baking powder, then fold in coconut flakes and white chocolate chips. Pour batter into the prepared pan 3. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour 30 minutes. Let stand for about 10 minutes, then run a knife along the edges and invert the pan onto a cooling rack. Allow to cool completely. 4. Beat together cream cheese, butter, and vanilla extract in a large bowl with an electric mixer until creamy. Gradually add confectioners' sugar until frosting is smooth. Frost the cake and top with toasted coconut flakes.",
  "prep": "30 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs 10 mins",
  "calories": "625"
},
{
  "url": "https://www.allrecipes.com/recipe/12632/no-crust-coconut-pie/",
  "name": "No Crust Coconut Pie",
  "rating": "4.3",
  "ratingcount": "61",
  "ingredients": "4  eggs, beaten; ¼ cup butter; ½ cup self-rising flour; 1 teaspoon vanilla extract; 1 ¾ cups white sugar; 2 cups milk; 7 ounces flaked coconut",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. In a large bowl, combine eggs, butter or margarine, flour, vanilla, sugar, milk and coconut. Mix well. 3. Pour into 10 inch deep dish pie plate. 4. Bake at 325 degrees F (165 degrees C) for 30 to 40 minutes. Crust will form on the bottom.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "429"
},
{
  "url": "https://www.allrecipes.com/recipe/274285/no-bake-chocolate-oatmeal-drop-cookies/",
  "name": "No-Bake Chocolate-Oatmeal Drop Cookies",
  "rating": "4.7",
  "ratingcount": "12",
  "ingredients": "½ cup milk; 2 cups white sugar; ½ cup butter; ½ cup cocoa powder; 3 cups quick oats; ½ cup shredded coconut; ½ cup peanut butter; 1 teaspoon vanilla extract",
  "directions": "1. Mix milk, sugar, butter, and cocoa powder in a large saucepan and bring to a rolling boil. Boil, stirring frequently, for about 1 minute. Remove from heat and add oats, coconut, peanut butter, and vanilla. Mix thoroughly. 2. Drop tablespoon-sized balls of cookie dough onto waxed paper and let cool in refrigerator for at least 1 hour.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "1 hr 10 mins",
  "calories": "222"
},
{
  "url": "https://www.allrecipes.com/recipe/235663/sweet-potato-crunch/",
  "name": "Sweet Potato Crunch",
  "rating": "4.7",
  "ratingcount": "20",
  "ingredients": "6  sweet potatoes; ⅓ cup butter; 2 tablespoons white sugar; ½ cup milk; 2 large eggs, beaten; 1 teaspoon vanilla extract; ¾ cup brown sugar; ¾ cup sweetened flaked coconut; ¾ cup chopped pecans; 3 tablespoons all-purpose flour; 3 tablespoons melted butter",
  "directions": "1. Place sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 20 to 30 minutes. Drain and peel. 2. Preheat the oven to 325 degrees F (165 degrees C). 3. Mash sweet potatoes, 1/3 cup butter, and white sugar together in a bowl. Beat milk, eggs, and vanilla into sweet potato mixture using an electric mixer until smooth; pour 1/2 of the mixture into a 9x13-inch casserole dish. 4. Make the topping: Mix brown sugar, coconut, pecans, and flour together in a bowl; stir in 3 tablespoons melted butter until evenly coated. Sprinkle 1/2 of the topping over sweet potato mixture in the baking dish. Pour remaining sweet potato mixture over topping and sprinkle with remaining topping. 5. Bake in the preheated oven until cooked through and topping is lightly browned, about 1 hour.",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "315"
},
{
  "url": "https://www.allrecipes.com/recipe/108362/flan-de-coco-coconut-flan/",
  "name": "Flan de Coco (Coconut Flan)",
  "rating": "4.7",
  "ratingcount": "122",
  "ingredients": "1 ½ cups white sugar, divided; 1 (14 ounce) can sweetened condensed milk; 1 (12 fluid ounce) can evaporated milk; 6 large eggs; ½ cup milk; ½ cup fresh shredded coconut",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Place 1 cup sugar in a small saucepan over medium heat. Cook gently without stirring, but shake occasionally until sugar is melted. Continue cooking until sugar turns golden brown, then pour into a large glass baking dish. Rotate and tilt the dish to spread caramel evenly over the bottom. Set aside for caramel to cool and harden, about 15 minutes. 3. Add condensed milk, evaporated milk, eggs, milk, coconut, and remaining 1/2 cup sugar to a blender. Blend until smooth, about 3 minutes. Pour over hardened caramel in the baking dish. 4. Bake in the preheated oven until custard is set, about 45 minutes. Allow flan to cool for 30 minutes at room temperature. Run a knife around the edges of the dish to separate the flan from the sides. Refrigerate until completely chilled, 8 hours to overnight. 5. To serve, carefully invert flan onto a rimmed serving plate; let caramel sauce flow over flan.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "9 hrs 55 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/12481/old-fashioned-coconut-cream-pie/",
  "name": "Old-Fashioned Coconut Cream Pie",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 cup sweetened flaked coconut; 3 cups half-and-half; ¾ cup white sugar; ½ cup all-purpose flour; 2 large eggs, beaten; ¼ teaspoon salt; 1 teaspoon vanilla extract; 1 (9 inch) pie shell, baked; 1 cup frozen whipped topping, thawed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Spread coconut on a baking sheet. 2. Bake in the preheated oven, stirring occasionally, until golden brown, about 5 minutes. 3. Combine half-and-half, sugar, flour, eggs, and salt in a medium pot. Bring to a boil over low heat, stirring constantly. Continue cooking and stirring for 2 minutes more. 4. Remove the pan from the heat and stir in 3/4 cup toasted coconut and vanilla; reserve remaining toasted coconut for garnishing the pie. 5. Pour custard into pie shell and chill until firm, about 4 hours. 6. Top with whipped topping and reserved toasted coconut.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "4 hrs 30 mins",
  "calories": "423"
},
{
  "url": "https://www.allrecipes.com/recipe/146035/the-best-thai-coconut-soup/",
  "name": "The Best Thai Coconut Soup",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 tablespoon vegetable oil; 2 tablespoons grated fresh ginger; 2 teaspoons red curry paste; 1 stalk lemon grass, minced; 4 cups chicken broth; 3 tablespoons fish sauce; 1 tablespoon light brown sugar; 3 (13.5 ounce) cans coconut milk; ½ pound fresh shiitake mushrooms, sliced; 1 pound medium shrimp - peeled and deveined; 2 tablespoons fresh lime juice; salt to taste; ¼ cup chopped fresh cilantro",
  "directions": "1. Heat oil in a large pot over medium heat. Add ginger, curry paste, and lemongrass; cook and stir in the hot oil for 1 minute. 2. Gradually stir in chicken broth, then stir in fish sauce and brown sugar; reduce heat to low and simmer for 15 minutes. 3. Add coconut milk and mushrooms; cook and stir until mushrooms are soft, about 5 minutes. 4. Add shrimp; cook until no longer translucent, about 5 minutes. Stir in lime juice; season with salt and garnish with cilantro.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "368"
},
{
  "url": "https://www.allrecipes.com/recipe/25095/nanaimo-bars-iii/",
  "name": "Nanaimo Bars",
  "rating": "4.6",
  "ratingcount": "362",
  "ingredients": "1 cup butter, softened, divided; 5 tablespoons unsweetened cocoa powder; ¼ cup white sugar; 1  egg, beaten; 1 ¾ cups graham cracker crumbs; 1 cup flaked coconut; ½ cup finely chopped almonds (Optional); 3 tablespoons heavy cream; 2 tablespoons custard powder; 2 cups confectioners' sugar; 4 (1 ounce) squares semisweet baking chocolate; 2 teaspoons butter",
  "directions": "1. In the top of a double boiler, combine 1/2 cup softened butter, cocoa powder, and sugar. Stir occasionally until melted and smooth. Beat in egg and stir until thick, 2 to 3 minutes. 2. Remove from the heat and mix in graham cracker crumbs, coconut, and almonds. Press into the bottom of an ungreased 8x8-inch pan. 3. For the middle layer, beat remaining 1/2 cup softened butter, heavy cream, and custard powder until light and fluffy. Mix in confectioners' sugar until smooth. Spread over the bottom layer in the pan. Chill to set. 4. While the second layer is chilling, melt semisweet chocolate and 2 teaspoons butter together in the microwave or over low heat. 5. Spread melted chocolate mixture over chilled bars. Let the chocolate set before cutting into squares.",
  "prep": "30 mins",
  "cook": "",
  "total": "30 mins",
  "calories": "311"
},
{
  "url": "https://www.allrecipes.com/recipe/17765/german-chocolate-cake-frosting/",
  "name": "German Chocolate Cake Frosting",
  "rating": "4.7",
  "ratingcount": "388",
  "ingredients": "1 cup evaporated milk; 1 cup brown sugar; ½ cup butter; 3  egg yolks; 1 teaspoon vanilla extract; 1 ⅓ cups flaked coconut; 1 cup chopped pecans",
  "directions": "1. Combine evaporated milk, brown sugar, butter, egg yolks, and vanilla in a saucepan over medium heat. Cook, stirring constantly, at a low boil until mixture turns a light caramel color and thickens, about 10 minutes. 2. Remove from heat and stir in coconut and pecans. Let cool to room temperature before spreading on cake.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "280"
},
{
  "url": "https://www.allrecipes.com/recipe/14439/frog-eye-salad/",
  "name": "Frog Eye Salad",
  "rating": "4.6",
  "ratingcount": "278",
  "ingredients": "1 ¾ cups unsweetened pineapple juice; 1 cup white sugar; 2  eggs, beaten; 2 tablespoons all-purpose flour; 2 ½ teaspoons salt, divided; 1 tablespoon lemon juice; 1 tablespoon vegetable oil; 1 (16 ounce) package acini di pepe pasta; 3 (11 ounce) cans mandarin oranges, drained; 2 (20 ounce) cans pineapple tidbits, drained; 1 (20 ounce) can crushed pineapple, drained; 1 (8 ounce) container frozen whipped topping, thawed; 1 cup miniature marshmallows; 1 cup shredded coconut",
  "directions": "1. Combine pineapple juice, sugar, eggs, flour, and 1/2 teaspoon salt in a saucepan. Stir and cook over medium heat until thickened. Remove from heat; stir in lemon juice. Let cool to room temperature, about 1 hour. 2. Bring a large pot of water to a boil; add oil and remaining 2 teaspoons salt. Add pasta and cook until al dente, 5 to 7 minutes. Drain and rinse under cold water. 3. Combine cooked pasta, cooled egg mixture, mandarin oranges, pineapple tidbits, crushed pineapple, and whipped topping in a large bowl; mix well. Refrigerate until chilled, 8 hours to overnight. 4. Before serving, add marshmallows and coconut; toss and serve.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "9 hrs 35 mins",
  "calories": "581"
},
{
  "url": "https://www.allrecipes.com/recipe/9889/seven-layer-bars/",
  "name": "Seven Layer Bars",
  "rating": "4.7",
  "ratingcount": "664",
  "ingredients": "½ cup unsalted butter; 1 ½ cups graham cracker crumbs; 1 cup semisweet chocolate chips; 1 cup butterscotch chips; 1 cup chopped walnuts; 1 (14 ounce) can sweetened condensed milk; 1 ⅓ cups shredded coconut",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Put butter in 13x9-inch baking pan and place in oven until melted. Swirl to coat bottom and sides with butter. 3. Spread graham cracker crumbs evenly over bottom of pan. Layer chocolate chips, butterscotch chips, and walnuts over crumbs. Pour condensed milk over walnuts and sprinkle with coconut. 4. Bake in preheated oven until edges are golden brown, about 25 minutes. 5. Cool and cut into 36 bars.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "1 hr",
  "calories": "155"
},
{
  "url": "https://www.allrecipes.com/recipe/237469/chia-coconut-pudding-with-coconut-milk/",
  "name": "Chia Coconut Pudding with Coconut Milk",
  "rating": "4.8",
  "ratingcount": "61",
  "ingredients": "2 cups sweetened coconut milk; 6 tablespoons unsweetened coconut milk; 1 tablespoon agave nectar, or more to taste; ½ teaspoon vanilla extract; ¼ teaspoon ground cinnamon; 1 pinch salt; ½ cup chia seeds; ½ cup diced fresh strawberries (Optional)",
  "directions": "1. Whisk together sweetened and unsweetened coconut milks, agave nectar, vanilla extract, cinnamon, and salt in a bowl; stir in chia seeds. Allow mixture to soak until thickened, at least 20 minutes, or cover the bowl with plastic wrap and refrigerate overnight. 2. Stir pudding and top with strawberries.",
  "prep": "10 mins",
  "cook": "",
  "total": "30 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/11102/gingerbread-cookie-frosting/",
  "name": "Gingerbread Cookie Frosting",
  "rating": "3.3",
  "ratingcount": "58",
  "ingredients": "1 cup confectioners' sugar; ¼ cup milk, or as needed; 10 drops food coloring",
  "directions": "1. Gather all ingredients. 2. Sift confectioners' sugar into a small bowl. 3. Stir in enough milk to make a smooth but not too runny consistency. 4. Divide mixture into small containers, depending on how many colors you want. Drop food coloring into each container, using as much food coloring as needed to create desired hues.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "126"
},
{
  "url": "https://www.allrecipes.com/recipe/7994/coconut-poke-cake/",
  "name": "Coconut Poke Cake",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 (18.25 ounce) package white cake mix; 1 (14 ounce) can cream of coconut; 1 (14 ounce) can sweetened condensed milk; 1 (16 ounce) package frozen whipped topping, thawed; 1 (8 ounce) package flaked coconut",
  "directions": "1. Prepare and bake white cake mix in a 9x13-inch dish according to package directions. 2. While cake is still hot, poke holes with a utility fork all over the top. 3. Mix cream of coconut and sweetened condensed milk together in a bowl. 4. Pour over the top of hot cake. Let cake cool completely. 5. Frost cake with whipped topping and cover with flaked coconut. Keep cake chilled in the refrigerator. 6. Enjoy!",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "2 hrs",
  "calories": "304"
},
{
  "url": "https://www.allrecipes.com/recipe/238693/tembleque-puerto-rican-coconut-pudding/",
  "name": "Tembleque Puerto Rican Coconut Pudding",
  "rating": "4.8",
  "ratingcount": "50",
  "ingredients": "2 (14 ounce) cans coconut milk; ¾ cup sugar; ¼ teaspoon kosher salt; ½ cup cornstarch; 1 pinch ground cinnamon",
  "directions": "1. Stir together coconut milk, sugar, and salt in a saucepan. Spoon 3 to 4 tablespoons coconut milk mixture into a small bowl and stir in cornstarch until dissolved; pour into the saucepan. Bring mixture to a boil while stirring constantly; cook until smooth and thick, about 5 minutes. 2. Pour into molds, cover each with plastic wrap, and refrigerate until cold and firm, 3 hours to 2 days. 3. Run a thin knife around the edges of each mold; invert onto serving plates. Garnish tops with cinnamon.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "3 hrs 15 mins",
  "calories": "395"
},
{
  "url": "https://www.allrecipes.com/recipe/230280/oatmeal-chocolate-coconut-macaroons/",
  "name": "Oatmeal Chocolate Coconut Macaroons",
  "rating": "4.2",
  "ratingcount": "84",
  "ingredients": "2 cups quick-cooking oats; 1 cup shredded coconut; ¼ cup unsweetened cocoa powder; 2 cups white sugar; ½ cup butter; ½ cup milk",
  "directions": "1. Mix together oats, coconut, and cocoa powder in a large bowl. 2. Bring sugar, butter, and milk to a boil in a saucepan, stirring occasionally; remove immediately from heat and stir into oat mixture until well combined. 3. Drop 15 spoonfuls of dough onto a sheet of waxed paper. Let cool completely at room temperature before serving.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "20 mins",
  "calories": "228"
},
{
  "url": "https://www.allrecipes.com/recipe/231731/no-bake-chocolate-coconut-cookies/",
  "name": "No-Bake Chocolate Coconut Cookies",
  "rating": "4.5",
  "ratingcount": "130",
  "ingredients": "3 cups quick cooking oats; 1 cup sweetened flaked coconut; 2 cups white sugar; ½ cup unsweetened cocoa powder; ½ cup milk; ½ cup margarine",
  "directions": "1. Line a baking sheet with waxed paper. 2. Mix oats and coconut in a large bowl until thoroughly combined. 3. Stir together sugar, cocoa powder, milk, and margarine in a saucepan over medium heat until smooth. Bring to a boil and cook, stirring constantly, for 2 minutes. Pour over oats and coconut; mix quickly to coat. 4. Drop tablespoonfuls onto the prepared baking sheet. Let cookies cool and harden, then store in an airtight container.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "157"
},
{
  "url": "https://www.allrecipes.com/recipe/17753/coconut-shrimp-i/",
  "name": "Coconut Shrimp",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "¾ cup all-purpose flour, divided; ⅔ cup beer; 1 large egg; 1 ½ teaspoons baking powder; 2 cups flaked coconut; 24  medium raw shrimp, shelled, deveined, with tails attached; 3 cups oil for frying",
  "directions": "1. Line a baking sheet with wax paper; set aside. 2. Whisk together 1/2 cup flour, beer, egg, and baking powder in a medium bowl until smooth. Place coconut and remaining 1/4 cup flour in 2 separate bowls. 3. One at a time, hold shrimp by the tail and dredge in flour, shaking off excess. Dip in beer batter; allow excess to drip off. Roll in coconut, then place on the prepared baking sheet. Refrigerate for 30 minutes. 4. Heat oil in a deep fryer or large skillet to 350 degrees F (175 degrees C). 5. Working in batches, fry shrimp in hot oil, turning once, until golden brown, 2 to 3 minutes. Use tongs to remove shrimp to paper towels to drain.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "55 mins",
  "calories": "1166"
},
{
  "url": "https://www.allrecipes.com/recipe/7871/incredibly-delicious-italian-cream-cake/",
  "name": "Incredibly Delicious Italian Cream Cake",
  "rating": "4.5",
  "ratingcount": "433",
  "ingredients": "1 cup buttermilk; 1 teaspoon baking soda; ½ cup butter; ½ cup shortening; 2 cups white sugar; 5 large eggs; 1 teaspoon vanilla extract; 1 cup flaked coconut; 1 teaspoon baking powder; 2 cups all-purpose flour; 8 ounces cream cheese; ½ cup butter; 1 teaspoon vanilla extract; 4 cups confectioners' sugar; 2 tablespoons light cream; ½ cup chopped walnuts; 1 cup flaked coconut",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease three 9-inch round cake pans. 2. Make the cake: Combine buttermilk and baking soda together in a small bowl; set aside. 3. Beat butter, shortening, and sugar together in a large bowl with an electric mixer until light and fluffy. Mix in eggs, buttermilk mixture, vanilla, coconut, baking powder, and flour; stir until just combined. Pour batter into the prepared pans. 4. Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 30 to 35 minutes. Cool in the pans for 5 minutes; transfer to a wire rack and let cool completely, 20 to 25 minutes. 5. Make the frosting (while cakes are cooling): Beat cream cheese, butter, vanilla, and confectioners' sugar in a medium bowl with an electric mixer until light and fluffy. Beat in cream, a little at a time, to attain the desired consistency. Stir in walnuts and coconut. Spread frosting between the cake layers and on the top and sides of cooled cake.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr 25 mins",
  "calories": "767"
},
{
  "url": "https://www.allrecipes.com/recipe/270712/air-fryer-coconut-shrimp/",
  "name": "Air Fryer Coconut Shrimp",
  "rating": "4.4",
  "ratingcount": "58",
  "ingredients": "½ cup all-purpose flour; 1 ½ teaspoons ground black pepper; 2 large eggs; ⅔ cup unsweetened flaked coconut; ⅓ cup panko bread crumbs; 12 ounces uncooked medium shrimp, peeled and deveined; cooking spray; ½ teaspoon kosher salt, divided; ¼ cup honey; ¼ cup lime juice; 1  serrano chile, thinly sliced; 2 teaspoons chopped fresh cilantro",
  "directions": "1. Stir together flour and pepper in a shallow dish. Lightly beat eggs in a second shallow dish. Stir together coconut and panko in a third shallow dish. 2. Working one at a time, dredge shrimp in flour mixture; shake off excess. Dip floured shrimp in egg; allow any excess to drip off. Finally, dredge in coconut mixture, pressing to adhere. Place shrimp on a plate. Coat shrimp well with cooking spray. 3. Preheat the air fryer to 400 degrees F (200 degrees C). Place 1/2 of the shrimp in the air fryer and cook about 3 minutes. Turn shrimp over and continue cooking until golden, about 3 minutes more. Season with 1/4 teaspoon salt. Repeat with remaining shrimp. 4. Meanwhile, whisk together honey, lime juice, and serrano chile in a small bowl. 5. Sprinkle fried shrimp with cilantro and serve with honey-lime dip.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "236"
},
{
  "url": "https://www.allrecipes.com/recipe/12580/coconut-custard-pie-i/",
  "name": "Coconut Custard Pie",
  "rating": "4.0",
  "ratingcount": "164",
  "ingredients": "1 ½ cups white sugar; ½ cup butter; 2 large eggs; 2 tablespoons all-purpose flour; 1 cup milk; 1 cup flaked coconut; 1 teaspoon vanilla extract; 1 (9 inch) unbaked pie crust; 1 tablespoon flaked coconut",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Beat together sugar, butter, and eggs in a large bowl with an electric mixer on low speed. Blend in flour. Mix in milk, 1/2 cup at a time. Add 1 cup coconut flakes and vanilla; mix well. 3. Pour filling into unbaked pie crust. Sprinkle top with 1 tablespoon coconut flakes. 4. Bake in the preheated oven until filling is set, 40 to 50 minutes.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "447"
},
{
  "url": "https://www.allrecipes.com/recipe/25553/moist-carrot-cake/",
  "name": "Moist Carrot Cake",
  "rating": "4.7",
  "ratingcount": "402",
  "ingredients": "2 cups all-purpose flour; 2 ½ teaspoons ground cinnamon; 2 teaspoons baking powder; 1 ½ teaspoons baking soda; 1 teaspoon salt; 2 cups white sugar; 1 ½ cups vegetable oil; 4 large eggs; 2 ¾ cups shredded carrots; 1 (8 ounce) can crushed pineapple, drained; 1 cup flaked coconut; ¾ cup chopped walnuts",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease and flour a 9x13-inch pan. 2. Combine flour, cinnamon, baking powder, baking soda, and salt together in a large bowl; set aside. 3. Mix sugar, oil, and eggs together in a separate bowl. Beat in flour mixture. Stir in carrots, pineapple, coconut, and walnuts. Pour cake batter into the prepared pan. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 35 to 40 minutes. Allow to cool.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "569"
},
{
  "url": "https://www.allrecipes.com/recipe/16520/irish-potato-candy/",
  "name": "Irish Potato Candy",
  "rating": "4.4",
  "ratingcount": "306",
  "ingredients": "4 ounces cream cheese, softened; ¼ cup butter, softened; 4 cups confectioners' sugar; 1 teaspoon vanilla extract; 2 ½ cups flaked coconut; 1 tablespoon ground cinnamon",
  "directions": "1. Beat cream cheese and butter together in a large bowl until smooth. Add confectioners' sugar and vanilla; beat until smooth. Mix in flaked coconut. 2. Roll mixture into balls or potato shapes; roll balls in cinnamon. Place onto a cookie sheet and chill to set, at least 10 minutes. If desired, roll potatoes in cinnamon again for a darker color.",
  "prep": "20 mins",
  "cook": "",
  "total": "30 mins",
  "calories": "59"
},
{
  "url": "https://www.allrecipes.com/recipe/12161/impossible-coconut-pie-i/",
  "name": "Impossible Coconut Pie",
  "rating": "4.5",
  "ratingcount": "155",
  "ingredients": "2 cups milk; ¾ cup white sugar; ½ cup baking mix; ¼ cup unsalted butter, softened; 4 large eggs; 1 ½ teaspoons vanilla extract; 1 cup flaked coconut (Optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch pie plate. 2. Combine milk, sugar, baking mix, butter, eggs, and vanilla in blender; blend on low speed for 3 minutes. Pour into the prepared pie plate and let stand for 5 minutes. Sprinkle coconut over top. 3. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 40 minutes. Serve warm.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "259"
},
{
  "url": "https://www.allrecipes.com/recipe/19205/chococonut-chip-cookies/",
  "name": "Chococonut Chip Cookies",
  "rating": "4.7",
  "ratingcount": "583",
  "ingredients": "1 cup butter; 1 cup white sugar; ½ cup light brown sugar; 2  eggs; 1 teaspoon vanilla extract; 2 ¼ cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon salt; 2 cups semisweet chocolate chips; 2 cups flaked coconut",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Beat butter, white sugar, and brown sugar together with an electric mixer in a large bowl until light and fluffy. Beat first egg into butter mixture. Beat second egg into mixture along with vanilla extract. 3. Combine flour, baking soda, and salt together in a separate bowl; stir into butter mixture until just combined. Fold in chocolate chips and coconut. Drop spoonfuls of dough 2 inches apart onto ungreased cookie sheets. 4. Bake in the preheated oven until edges are golden, about 8 to 10 minutes. Cool on the cookie sheets briefly before removing to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "85"
},
{
  "url": "https://www.allrecipes.com/recipe/8072/five-flavor-pound-cake-i/",
  "name": "Five Flavor Pound Cake",
  "rating": "4.8",
  "ratingcount": "235",
  "ingredients": "3 cups all-purpose flour; ½ teaspoon baking powder; 1 cup milk; 1 teaspoon coconut extract; 1 teaspoon rum flavored extract; 1 teaspoon butter flavored extract; 1 teaspoon lemon extract; 1 teaspoon vanilla extract; 3 cups white sugar; 1 cup butter, softened; ½ cup shortening; 5 large eggs, beaten; ½ cup white sugar; ¼ cup water; ½ teaspoon coconut extract; ½ teaspoon rum flavored extract; ½ teaspoon butter flavored extract; ½ teaspoon lemon extract; ½ teaspoon vanilla extract",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease a 10-inch tube pan. 2. Combine flour and baking powder in a medium bowl; set aside. Combine milk and extracts in a liquid measure; set aside. 3. Cream sugar, butter, and shortening in a large bowl with an electric mixer until light and fluffy. Add eggs one at a time, beating well after each addition. Beat in flour mixture alternately with milk mixture in batches, beginning and ending with flour mixture. Spoon mixture into the prepared pan. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 1 1/2 to 1 3/4 hours. Cool in the pan on a wire rack for 10 minutes. 5. While cake is cooling, make glaze: Combine sugar, water, and extracts in a saucepan. Bring to a boil, stirring until sugar is dissolved. 6. Turn cake out onto the wire rack. Place waxed paper under the rack to catch glaze drippings. Slowly spoon glaze over the top of hot cake. Cool completely.",
  "prep": "25 mins",
  "cook": "1 hr 35 mins",
  "total": "2 hrs 10 mins",
  "calories": "511"
},
{
  "url": "https://www.allrecipes.com/recipe/10245/oatmeal-chocolate-coconut-chewy/",
  "name": "Oatmeal Chocolate Coconut Chewy",
  "rating": "4.8",
  "ratingcount": "572",
  "ingredients": "1 ¼ cups packed brown sugar; 1 cup butter, softened; ½ cup white sugar; 2 large eggs; 2 tablespoons milk; 2 teaspoons vanilla extract; 1 ¾ cups all-purpose flour; 1 teaspoon baking soda; ½ teaspoon salt (Optional); 3 cups rolled oats; 2 cups semisweet chocolate chips; 1 cup chopped walnuts (Optional); 1 cup shredded coconut",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Cream together brown sugar, butter, and white sugar in a large bowl until smooth. Beat in eggs one at a time, then stir in milk and vanilla. 3. Combine flour, baking soda, and salt; stir into sugar mixture until well blended. Stir in oats, chocolate chips, walnuts, and coconut until evenly distributed. 4. Drop by rounded spoonfuls onto ungreased cookie sheets. 5. Bake in the preheated oven for 10 to 12 minutes for a chewy cookie or 14 minutes for a firmer cookie. 6. Cool for 1 minute on the cookie sheets and then remove to wire rack. Cool completely and then store in a tightly sealed container.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "256"
},
{
  "url": "https://www.allrecipes.com/recipe/44187/coquito/",
  "name": "Coquito",
  "rating": "4.8",
  "ratingcount": "374",
  "ingredients": "1 (12 fluid ounce) can evaporated milk; 2 large egg yolks, beaten; 1 (14 ounce) can cream of coconut; 1 (14 ounce) can sweetened condensed milk; ½ cup white rum; ½ cup water; 1 teaspoon vanilla extract; ½ teaspoon ground cinnamon; ¼ teaspoon ground cloves",
  "directions": "1. Gather all ingredients. 2. Combine evaporated milk and egg yolks in the top of a double boiler over simmering water. Cook over the simmering water, stirring constantly, until mixture is thick enough to coat the back of a spoon, and reaches a temperature of 160 degrees F (71 degrees C). 3. Transfer mixture to a blender. Add cream of coconut, sweetened condensed milk, rum, water, vanilla, cinnamon, and cloves; blend until combined, about 30 seconds. 4. Pour into glass bottles and chill 8 hours to overnight before serving.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "8 hrs 15 mins",
  "calories": "354"
},
{
  "url": "https://www.allrecipes.com/recipe/221333/maja-blanca/",
  "name": "Maja Blanca",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 cups thin coconut milk; 3 tablespoons white sugar; 2 cups thin coconut milk; ¾ cup cream-style corn; ½ cup cornstarch; ½ cup white sugar; 3 tablespoons corn kernels",
  "directions": "1. Make the latik: Bring coconut milk to a boil in a saucepan over medium heat. Cook, stirring constantly, until oil begins to separate from the milk, about 30 minutes. Skim and reserve oil in a bowl. 2. Reduce the heat to medium-low and add sugar; continue to cook and stir until milk becomes brown and crumbly, about 30 minutes. Remove from the heat and set aside to cool. 3. Grease an 8-inch mold or pie pan with reserved coconut oil. 4. Make the pudding: Heat coconut milk, cream-style corn, cornstarch, sugar, and corn kernels in a saucepan over medium heat, stirring constantly, until thickened, about 5 minutes. Pour corn mixture into the prepared mold. Cool for 30 minutes, then refrigerate until chilled, at least 1 hour. 5. Invert pudding carefully onto a serving plate and cut into 12 slices. Sprinkle latik over each slice.",
  "prep": "15 mins",
  "cook": "1 hr 10 mins",
  "total": "2 hrs 55 mins",
  "calories": "227"
},
{
  "url": "https://www.allrecipes.com/recipe/11259/hello-dollies-i/",
  "name": "Hello Dollies",
  "rating": "4.7",
  "ratingcount": "147",
  "ingredients": "2 cups graham cracker crumbs; ½ cup butter, melted; ¼ cup white sugar; 1 cup semisweet chocolate chips; 1 cup flaked coconut; 1 cup chopped pecans; 1 (14 ounce) can sweetened condensed milk",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Combine graham cracker crumbs, melted butter, and sugar. Press into the bottom of a 9x9-inch baking pan. Layer chocolate chips, coconut, and pecans over the crumbs. Pour sweetened condensed milk over the top. 3. Bake in the preheated oven for 25 to 30 minutes. Let cool and cut into squares.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "203"
},
{
  "url": "https://www.allrecipes.com/recipe/204821/ginataang-manok-chicken-cooked-in-coconut-milk/",
  "name": "Ginataang Manok (Chicken Cooked in Coconut Milk)",
  "rating": "4.3",
  "ratingcount": "43",
  "ingredients": "3 tablespoons canola oil; ½ cup sliced fresh ginger; 1 (5 pound) whole chicken, cut into pieces; salt and ground black pepper to taste; 2 (14 ounce) cans coconut milk; 1 (10 ounce) package frozen chopped spinach, thawed and drained",
  "directions": "1. Heat oil in a large skillet over medium heat and stir in ginger. Cook and stir until fragrant and lightly browned. Remove ginger and set aside. 2. Season chicken with salt and pepper. Place chicken in the same skillet over medium-high heat without crowding. Cook until chicken is lightly brown on all sides. 3. Return ginger to the skillet and add coconut milk. Bring to a boil, then cover with the lid tilted to allow steam to escape. Reduce heat to medium-low and simmer, stirring occasionally, until chicken is no longer pink at the bone, about 30 minutes. 4. Stir in spinach and simmer uncovered until spinach is warmed through, 8 to 12 minutes. Season with salt and pepper.",
  "prep": "5 mins",
  "cook": "50 mins",
  "total": "55 mins",
  "calories": "709"
},
{
  "url": "https://www.allrecipes.com/recipe/137346/cream-cheese-fruit-salad/",
  "name": "Cream Cheese Fruit Salad",
  "rating": "4.8",
  "ratingcount": "46",
  "ingredients": "1 (8 ounce) package cream cheese, softened; ¼ cup white sugar, or to taste; 1 (12 ounce) container frozen whipped topping, thawed; 1 (15.25 ounce) can crushed pineapple, drained; 1 (15.25 ounce) can fruit cocktail, drained; 3  bananas, peeled and sliced; 1 large Jonagold apple, peeled and chopped; ½ cup sweetened flaked coconut; ½ cup chopped pecans (Optional); ½ cup golden raisins (Optional); 1 (4 ounce) jar maraschino cherries, drained and halved (Optional)",
  "directions": "1. Beat cream cheese and sugar together in a large bowl with an electric mixer. Mix in whipped topping on high speed until incorporated. Fold in pineapple, fruit cocktail, bananas, apple, coconut, pecans, raisins, and cherries. Transfer to a serving bowl, cover, and chill for at least 1 hour before serving.",
  "prep": "15 mins",
  "cook": "",
  "total": "1 hr 15 mins",
  "calories": "486"
},
{
  "url": "https://www.allrecipes.com/recipe/241449/coconut-oil-popcorn/",
  "name": "Coconut Oil Popcorn",
  "rating": "4.9",
  "ratingcount": "31",
  "ingredients": "¼ cup unpopped popcorn; 2 tablespoons coconut oil; sea salt to taste",
  "directions": "1. Place popcorn and oil in a 3-quart pot over medium heat and cover the pot with a lid. 2. Shake the pot constantly as popcorn pops. When popping slows to a few seconds between pops, after about 3 to 5 minutes, remove pot from heat and pour popcorn into a large bowl. Season with sea salt.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "213"
},
{
  "url": "https://www.allrecipes.com/recipe/9891/haystacks-i/",
  "name": "Haystack Cookies",
  "rating": "4.4",
  "ratingcount": "79",
  "ingredients": "2 cups white sugar; ⅓ cup unsweetened cocoa powder; ½ cup milk; ½ cup butter; 3 ½ cups quick cooking oats; 1 cup flaked coconut; ½ cup chopped peanuts; 1 pinch salt",
  "directions": "1. Gather all ingredients. 2. Bring sugar, cocoa, milk, and butter to a boil in a saucepan. Remove from heat. 3. Stir in oats, coconut, nuts and salt. Drop quickly from teaspoon on wax paper. Let cool.",
  "prep": "25 mins",
  "cook": "",
  "total": "25 mins",
  "calories": "180"
},
{
  "url": "https://www.allrecipes.com/recipe/7900/thirty-day-friendship-cake/",
  "name": "Thirty-Day Friendship Cake",
  "rating": "4.6",
  "ratingcount": "71",
  "ingredients": "2 cups Friendship Fruit Starter; 1 (15 ounce) can sliced peaches with juice; 5 ½ cups white sugar, divided; 1 (15 ounce) can pineapple chunks with juice; 2 (10 ounce) jars maraschino cherries, drained; 1 tablespoon all-purpose flour for dusting; 2 (15.25 ounce) packages yellow cake mix; 8 large eggs; 1 ⅓ cups vegetable oil; 2 (3.4 ounce) packages instant vanilla pudding mix; 2 cups golden raisins; 2 cups chopped walnuts; 2 cups flaked coconut",
  "directions": "1. Day One: Place starter into a large glass jar or bowl. Strain peach juice over starter. Cut each peach slice into 4 pieces and add to starter-juice mixture. Stir in 2 1/2 cups sugar until combined. Cover the jar loosely with a clean dish towel. Let sit at room temperature for 10 days, stirring once each day. A pan of water underneath the jar will keep ants out. 2. Day Ten: Strain pineapple juice over starter mixture. Cut each pineapple in half and add to starter mixture. Stir in 1/2 cup sugar until combined. Let sit, loosely covered, at room temperature for 10 days, stirring once each day. The color should change and mixture should foam when stirred. 3. Day Twenty: Slice each maraschino cherry in half and add to starter mixture. Stir in remaining 2 1/2 cups sugar until combined. Let sit, loosely covered, at room temperature for the final 10 days, stirring once each day. The color will turn slightly pink from the cherries. 4. Day Thirty: Drain liquid from fruit and pour into 3 glass or ceramic pint jars — one for you to make your next cake and two for friends. Set aside fruit. 5. Preheat the oven to 325 degrees F (165 degrees C). Grease and flour two 9x13-inch baking dishes. 6. Beat together 1 box cake mix, 4 eggs, 2/3 cup oil, and 1 package instant pudding in a large bowl until well combined. Mix in 1/2 of the reserved fruit. Stir in 1 cup raisins, 1 cup nuts, and 1 cup coconut until incorporated; batter will be stiff. Pour into the prepared baking dish. Repeat this step for second cake. 7. Bake cakes in the preheated oven until a toothpick inserted into the centers comes out clean, 55 to 65 minutes.",
  "prep": "1 hr",
  "cook": "55 mins",
  "total": "30 days 1 hr 55 mins",
  "calories": "346"
},
{
  "url": "https://www.allrecipes.com/recipe/32599/malibu-bay-breeze/",
  "name": "Malibu Bay Breeze",
  "rating": "4.8",
  "ratingcount": "60",
  "ingredients": "ice cubes; 2 (1.5 fluid ounce) jiggers coconut flavored rum; 4 fluid ounces pineapple juice; 1 tablespoon cranberry juice",
  "directions": "1. Fill a tall glass with ice. 2. Pour, in this order, coconut rum, pineapple juice, and cranberry juice over ice.",
  "prep": "2 mins",
  "cook": "",
  "total": "2 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/8295/earthquake-cake-ii/",
  "name": "Earthquake Cake",
  "rating": "4.6",
  "ratingcount": "87",
  "ingredients": "1 cup flaked coconut; 1 cup chopped pecans; 1 (15.25 ounce) package German chocolate cake mix; 1 1/4 cups water; 1/2 cup vegetable oil; 3 large eggs; 1 (8 ounce) package cream cheese; ½ cup unsalted butter; 1 teaspoon vanilla extract; 4 cups confectioners' sugar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease the bottom and sides of a 9x13-inch baking pan. Layer coconut and pecans in the bottom of pan. 2. Mix cake mix, water, oil, and eggs in a large bowl with an electric mixer on medium speed until well combined. Pour over coconut and pecans. Clean the bowl and mixer attachments. 3. Beat cream cheese, butter, and vanilla in the bowl until combined. Gradually mix in confectioners' sugar until smooth. Pour over cake batter. 4. Bake in the preheated oven for 30 minutes; a toothpick will not come out clean.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "282"
},
{
  "url": "https://www.allrecipes.com/recipe/238184/coconut-jasmine-rice/",
  "name": "Coconut Jasmine Rice",
  "rating": "4.7",
  "ratingcount": "64",
  "ingredients": "1 (14 ounce) can coconut milk; 1 ¼ cups water; 1 teaspoon white sugar; 1 pinch salt; 1 ½ cups jasmine rice",
  "directions": "1. Stir coconut milk, water, sugar, and salt together in a saucepan over medium heat until sugar dissolves, 1 to 2 minutes. 2. Add rice and bring to a boil. Cover, reduce the heat to low, and simmer until rice is tender and liquid is absorbed, 18 to 20 minutes.",
  "prep": "",
  "cook": "25 mins",
  "total": "25 mins",
  "calories": "302"
},
{
  "url": "https://www.allrecipes.com/recipe/73059/umm-ali/",
  "name": "Umm Ali",
  "rating": "4.5",
  "ratingcount": "25",
  "ingredients": "1 sheet frozen puff pastry, thawed; ¼ cup raisins; ¼ cup slivered almonds; ¼ cup pine nuts; ¼ cup chopped pistachio nuts; ¼ cup sweetened, flaked coconut; 5 cups milk; 1 cup white sugar; 1 teaspoon vanilla extract",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Unroll 1 puff pastry sheet onto a lightly floured surface and roll out to about 17x12-inches. Place on a baking tray. 3. Bake in the preheated oven until puffed and golden brown, about 15 minutes. 4. Break puff pastry into pieces and place in a large bowl. Add raisins, almonds, pine nuts, pistachios, and coconut; toss until well combined. Spread evenly in a 9x13-inch glass baking dish. 5. Pour milk into a saucepan; stir in sugar and vanilla. Cook over medium-high heat, stirring occasionally, until hot but not quite boiling. Pour over puff pastry mixture in the baking dish. 6. Return to the oven and bake for 15 minutes. Turn on the broiler and continue baking until the top is browned, about 2 minutes. Let stand for 5 minutes before serving warm.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "605"
},
{
  "url": "https://www.allrecipes.com/recipe/223467/granola-bars/",
  "name": "Granola Bars",
  "rating": "4.3",
  "ratingcount": "117",
  "ingredients": "cooking spray; 2 cups rolled oats; ½ cup shredded coconut; ½ cup honey; 2 tablespoons creamy peanut butter; 1 teaspoon vanilla extract; ⅛ teaspoon salt",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease a 9-inch square baking dish. 2. Spread oats and coconut evenly across a baking sheet. 3. Toast oats and coconut in the preheated oven until browned, about 10 minutes; transfer to a large mixing bowl. 4. Mix honey, peanut butter, vanilla, and salt in a saucepan over medium-low heat. Cook and stir until smooth. Pour honey mixture over oats and coconut. Stir to coat. Spread mixture evenly into the prepared baking dish. 5. Bake in the preheated oven until beginning to dry, about 15 minutes for crunchy granola bars, less if you like them chewy. Cool completely before cutting.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "1 hr 40 mins",
  "calories": "188"
},
{
  "url": "https://www.allrecipes.com/recipe/266532/bionicos-mexican-fruit-bowls/",
  "name": "Bionicos (Mexican Fruit Bowls)",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "⅓ cup plain yogurt; ⅓ cup sweetened condensed milk; ⅓ cup Mexican crema; 1 teaspoon vanilla extract; 1 cup diced cantaloupe; 1 cup diced papaya; 1 cup diced red apple; 1 cup sliced banana; 1 cup sliced strawberries; ½ cup granola; ½ cup raisins; ½ cup shredded coconut",
  "directions": "1. Make the topping: Mix yogurt, condensed milk, Mexican crema, and vanilla together in a bowl until well combined. 2. Make the fruit salads: Divide cantaloupe, papaya, apple, and banana among 4 individual bowls, arranging each fruit in its own section. Place strawberries in the center of each bowl. Sprinkle granola, raisins, and coconut over the bowls, then drizzle with the topping.",
  "prep": "30 mins",
  "cook": "",
  "total": "30 mins",
  "calories": "426"
},
{
  "url": "https://www.allrecipes.com/recipe/7666/queen-elizabeth-cake-i/",
  "name": "Queen Elizabeth Cake I",
  "rating": "4.9",
  "ratingcount": "54",
  "ingredients": "1 cup boiling water; 1 cup dates, pitted and chopped; ¼ cup butter, softened; 1 cup white sugar; 1  egg; 1 teaspoon vanilla extract; 1 ½ cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon baking powder; ½ teaspoon salt; ½ cup chopped walnuts; 1 cup flaked coconut; ⅔ cup packed brown sugar; 6 tablespoons butter; ¼ cup cream",
  "directions": "1. Pour boiling water over dates in a small bowl, and let stand until cool. 2. Measure flour, baking powder, soda, salt, and nuts into a small bowl. Stir to mix. 3. Cream 1/4 cup butter or margarine and white sugar together in a mixing bowl; beat in egg and vanilla. Add flour mixture to creamed mixture in three parts alternately with date mixture in two parts, beginning and ending with dry mixture. Spread batter into a greased 9 x 13 inch pan. 4. Bake at 350 degrees F (175 degrees C) for 30 to 40 minutes, or until an inserted wooden pick comes out clean. 5. To Make Topping: Mix coconut, brown sugar, 6 tablespoons butter and cream in a small saucepan over medium heat. Boil for three minutes. Spread over warm cake, and brown under broiler.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 30 mins",
  "calories": "372"
},
{
  "url": "https://www.allrecipes.com/recipe/26014/coconut-pecan-frosting-ii/",
  "name": "Coconut Pecan Frosting",
  "rating": "4.9",
  "ratingcount": "92",
  "ingredients": "1 cup evaporated milk; 1 cup white sugar; 3 large egg yolks; ½ cup unsalted butter; 1 teaspoon vanilla extract; 1 ½ cups flaked coconut; 1 cup chopped pecans",
  "directions": "1. Combine milk, sugar, egg yolks, butter, and vanilla in a saucepan over medium heat. Cook, stirring frequently, until thickened, 10 to 15 minutes. 2. Remove from the heat and stir in coconut and pecans. Let stand, stirring occasionally, for 30 to 45 minutes before using.",
  "prep": "",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "160"
},
{
  "url": "https://www.allrecipes.com/recipe/17201/lamingtons/",
  "name": "Lamingtons",
  "rating": "4.2",
  "ratingcount": "72",
  "ingredients": "2 cups all-purpose flour; 4 teaspoons baking powder; ⅛ teaspoon salt; ¾ cup white sugar; ½ cup unsalted butter, at room temperature; 2 large eggs, room temperature; 1 teaspoon vanilla extract; ½ cup milk; 4 cups confectioners' sugar, sifted; ⅓ cup cocoa powder, sifted; ½ cup warm milk; 2 tablespoons unsalted butter, melted; 2 cups dessicated, unsweetened coconut, or as needed",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease and flour an 8x12-inch pan. 2. Make the cake: Sift flour, baking powder, and salt together into a bowl. 3. Beat sugar and butter in a large bowl with an electric mixer until light, fluffy, and noticeably lighter in color. Mix in one egg until fully incorporated; mix in remaining egg and vanilla. Add flour mixture in two batches, alternating with milk, beating until just incorporated after each addition. Pour into the prepared pan. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 40 minutes. Remove from the oven and let stand in the pan for 5 minutes, then turn out onto a wire rack and let cool completely, about 30 minutes. 5. Wrap cooled cake with plastic wrap. Place onto your counter at room temperature to let firm up, 8 hours to overnight. 6. When ready to finish the lamingtons, make the icing: Place confectioners' sugar and cocoa into a mixing bowl. Mix in warm milk and melted butter until icing is fluid but not too runny. 7. Unwrap the cake and cut into 24 squares. Cover a work surface with parchment or waxed paper, then set a wire rack over top. Pour coconut into a shallow bowl. 8. Using a fork, dip each cake square into icing, turn until all sides are coated, then roll in coconut. Place onto the rack to dry.",
  "prep": "40 mins",
  "cook": "30 mins",
  "total": "9 hrs 45 mins",
  "calories": "249"
},
{
  "url": "https://www.allrecipes.com/recipe/12506/coconut-pie/",
  "name": "Coconut Pie",
  "rating": "4.5",
  "ratingcount": "94",
  "ingredients": "1 cup white sugar; 2 tablespoons all-purpose flour; 3 large eggs; ½ cup butter, softened; 1 cup milk; 1 teaspoon vanilla extract; 1 cup flaked coconut; 1 (9 inch) unbaked pie crust",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Mix together sugar and flour in a large bowl. Beat in eggs and butter until well combined. Stir in milk and vanilla until incorporated. Fold in coconut. Pour into pie crust. 3. Bake in the preheated oven for 1 hour. Cool completely before slicing.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "405"
},
{
  "url": "https://www.allrecipes.com/recipe/202656/coconut-lime-rice/",
  "name": "Coconut Lime Rice",
  "rating": "4.6",
  "ratingcount": "208",
  "ingredients": "1 cup basmati rice; 1 tablespoon coconut oil; 1 teaspoon butter; ¼ cup flaked coconut; 1 lime, zested and juiced; 1 cup coconut milk; 1 cup chicken broth; salt to taste; ground black pepper to taste",
  "directions": "1. Rinse rice until the water runs clear; drain. 2. Heat coconut oil and butter in a large skillet over medium-high heat. Add rice and coconut flakes; cook and stir for 3 to 4 minutes. Stir in lime juice, then add coconut milk, chicken broth, lime zest, and salt. Bring to a low boil. 3. Reduce the heat to low, cover, and cook for 20 minutes. Remove from the heat and keep covered for 5 minutes. Fluff with a fork and season with pepper before serving.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "160"
},
{
  "url": "https://www.allrecipes.com/recipe/12110/coconut-cream-pie-i/",
  "name": "Easy Coconut Cream Pie",
  "rating": "4.7",
  "ratingcount": "383",
  "ingredients": "1 ½ cups milk; 1 (5 ounce) package instant vanilla pudding mix; 1 ½ cups flaked coconut, divided; 1 (8 ounce) container frozen whipped topping, thawed, divided; 1 (9 inch) pie shell, baked",
  "directions": "1. Whisk together milk and pudding mix in a large bowl until mixture starts to thicken, about 2 minutes. Fold in 1 cup coconut and 1/2 of the whipped topping until well combined. Pour filling into baked pie crust. 2. Spread remaining whipped topping over filling. Sprinkle with remaining 1/2 cup coconut. Refrigerate pie and serve chilled.",
  "prep": "15 mins",
  "cook": "",
  "total": "1 hr 15 mins",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/263511/instant-pot-coconut-curry-chicken/",
  "name": "Instant Pot Coconut Curry Chicken",
  "rating": "4.6",
  "ratingcount": "126",
  "ingredients": "1 tablespoon coconut oil; 1 medium onion, chopped; 3 tablespoons curry powder, or to taste, divided; 2 cloves garlic, chopped; 1 (14.5 ounce) can diced tomatoes, drained; 1 (8 ounce) can tomato sauce; ½ cup chicken broth; 2 tablespoons white sugar; 2 pounds chicken breasts; salt to taste; ground black pepper to taste; 1 (14 ounce) can coconut milk",
  "directions": "1. Turn on a multi-functional pressure cooker (such as Instant Pot) and select Sauté function. Add coconut oil; when hot, add onion and cook for 1 minute. Add 2 tablespoons curry powder and garlic. Mix well and cook for 2 minutes. Turn off Sauté function. Stir in diced tomatoes, tomato sauce, chicken broth, and sugar. 2. Poke holes into each chicken breast using a fork. Sprinkle with salt, pepper, and remaining curry powder. Add seasoned chicken to the pot. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 10 minutes. Allow 10 to 15 minutes for pressure to build. 3. Release pressure using the natural-release method according to manufacturer's instructions for 10 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. 4. Remove chicken; use 2 forks to shred the meat and return it to the pot. Turn on Sauté function; cook and stir until liquid is lightly boiling, 2 to 3 minutes. 5. Turn the pressure cooker to the Keep Warm setting. Add coconut milk and stir well; cook for 10 minutes more to allow flavors to come together.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr 5 mins",
  "calories": "563"
},
{
  "url": "https://www.allrecipes.com/recipe/237021/sweet-coconut-rice/",
  "name": "Sweet Coconut Rice",
  "rating": "4.5",
  "ratingcount": "34",
  "ingredients": "1 ½ cups long-grain white rice; 1 (14 ounce) can coconut milk; 1 ¼ cups water; 1 teaspoon white sugar, or more to taste; 1 tablespoon shredded coconut, or to taste (Optional)",
  "directions": "1. Stir rice, coconut milk, and water together in a saucepan. Dissolve sugar into the liquid. 2. Bring the mixture to a simmer then reduce heat to medium-low. Cover the saucepan and simmer until the majority of the liquid has been absorbed by the rice, 15 to 20 minutes. 3. Leaving the saucepan on the burner, turn the heat off and let rice steam until sticky, 5 to 10 minutes more. 4. Garnish with shredded coconut.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "456"
},
{
  "url": "https://www.allrecipes.com/recipe/25346/coconut-rice/",
  "name": "Coconut Rice",
  "rating": "4.1",
  "ratingcount": "170",
  "ingredients": "2 ½ cups Basmati rice; 4 (10 ounce) cans coconut milk; 1 pinch salt",
  "directions": "1. In a large saucepan over high heat, combine rice, coconut milk and salt; bring to a boil. 2. Reduce heat, cover and simmer for 20 to 25 minutes, or until liquid is absorbed and rice is tender.",
  "prep": "5 mins",
  "cook": "25 mins",
  "total": "30 mins",
  "calories": "535"
}]