[{
  "url": "https://www.allrecipes.com/recipe/284835/air-fryer-cornish-hen/",
  "name": "Air Fryer Cornish Hen",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 pounds Cornish hen, giblets removed; salt and freshly ground black pepper to taste; nonstick cooking spray",
  "directions": "1. Preheat an air fryer to 390 degrees F (200 degrees C). 2. Pat Cornish hen dry with paper towels and season with salt and pepper on all sides. 3. Place hen in the basket of the air fryer and cook for 15 minutes. Spray the top of the hen with nonstick cooking spray and cook for 15 minutes more. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 4. Transfer the hen to a cutting board and let rest for 10 minutes. Carve and serve.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "404"
},
{
  "url": "https://www.allrecipes.com/recipe/70117/cornish-hens-the-easy-way/",
  "name": "Cornish Hens the Easy Way",
  "rating": "4.0",
  "ratingcount": "61",
  "ingredients": "4  Cornish game hens; 2  limes, halved; 2 teaspoons olive oil; ¼ teaspoon chili powder; ¼ teaspoon ground cumin; kosher salt and ground black pepper to taste",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Rub each hen with a lime half. Drizzle with olive oil, then season with chili powder, cumin, kosher salt, and black pepper. Place hens on a rack in a shallow roasting pan. 3. Roast hens in the preheated oven for 15 minutes. 4. Reduce oven temperature to 350 degrees F (175 degrees C). 5. Continue roasting until no longer pink at the bone and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C). Remove from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing.",
  "prep": "5 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "332"
},
{
  "url": "https://www.allrecipes.com/recipe/40453/seasoned-cornish-hens/",
  "name": "Seasoned Cornish Hens",
  "rating": "4.5",
  "ratingcount": "169",
  "ingredients": "½ cup soy sauce; 2 tablespoons oyster sauce; 3 cloves garlic, peeled and crushed; ground black pepper to taste; 2 large Cornish game hens; 2 tablespoons butter",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. In a large bowl, mix soy sauce, oyster sauce, garlic, and pepper. Place Cornish game hens in the mixture, and marinate 10 minutes. 3. Transfer hens to a medium baking dish, and cover with the marinade mixture. Cover dish with foil and bake 30 minutes in the preheated oven. 4. Remove cover from dish, and place 1 tablespoon butter on each hen. Increase oven temperature to 350 degrees F (175 degrees C). Basting frequently with the marinade mixture, continue baking 30 minutes, or until exterior of the hens is lightly browned and crisp, the interior is no longer pink, and juices run clear.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "579"
},
{
  "url": "https://www.allrecipes.com/recipe/231187/orange-glazed-cornish-hen/",
  "name": "Orange Glazed Cornish Hen",
  "rating": "4.4",
  "ratingcount": "14",
  "ingredients": "2 tablespoons olive oil; 1 tablespoon Dijon mustard; 1  lemon, zested and juiced; 1  orange, zested and juiced; 3 cloves garlic, chopped; 1 teaspoon kosher salt; freshly ground black pepper to taste; 2  Cornish game hens; 2 cups orange juice; ½ cup soy sauce; ½ cup honey; ¼ cup Dijon mustard; ¼ cup finely diced onion; 2 teaspoons ground ginger; freshly ground black pepper to taste",
  "directions": "1. Mix olive oil, 1 tablespoon Dijon mustard, lemon zest and juice, orange zest and juice, garlic, salt, and black pepper together in a large resealable bag. Add hens, seal bag, and coat hens with marinade. Refrigerate for at least 1 hour, flipping the bag 1 or 2 times to redistribute marinade. 2. Preheat oven to 450 degrees F (230 degrees C). 3. Mix orange juice, soy sauce, honey, 1/4 cup Dijon mustard, onion, ginger, and black pepper together in a bowl. 4. Remove hens from marinade and transfer to a roasting pan, discarding leftover marinade. 5. Roast hens in the preheated oven for 50 minutes. Brush hens with orange glaze and roast for 5 more minutes. Flip hens, brush with more glaze, and roast until meat is no longer pink in the center, about 5 more minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "2 hrs 15 mins",
  "calories": "1235"
},
{
  "url": "https://www.allrecipes.com/recipe/12930/cornish-hen-soup/",
  "name": "Cornish Hen Soup",
  "rating": "4.4",
  "ratingcount": "22",
  "ingredients": "1  Rock Cornish hens; 2 tablespoons vegetable oil; 5 stalks celery, chopped; 3 large carrots, diced; 1  onion, chopped; 6 cloves garlic, minced; 3  potatoes, peeled and cubed; 1 (48 fluid ounce) can chicken broth",
  "directions": "1. Remove the gizzards, and wash the hen thoroughly. Cut hen into several pieces. 2. Heat oil in a large pot. Add hen pieces, and brown on all sides. Add carrots, celery, onions, garlic, and potatoes; cook until onion is tender. 3. Pour in chicken broth. Use more or less broth to your taste, but make sure to cover all the ingredients in the pot. Bring to a boil, and then reduce heat. Simmer until vegetables are tender and hen is cooked through. 4. Remove hen from pot, and remove meat from the bones. Discard bones. and return meat to soup. Serve.",
  "prep": "25 mins",
  "cook": "1 hr",
  "total": "1 hr 25 mins",
  "calories": "214"
},
{
  "url": "https://www.allrecipes.com/recipe/30501/grilled-cornish-game-hens/",
  "name": "Grilled Cornish Game Hens",
  "rating": "4.5",
  "ratingcount": "86",
  "ingredients": "1 cup lemon juice; ½ cup olive oil; ½ medium onion, chopped; 2 cloves garlic, peeled and chopped; 1 tablespoon white wine; 1 tablespoon pepper; 1 teaspoon Worcestershire sauce; 1 teaspoon hot pepper sauce; 1 teaspoon celery salt; 1 teaspoon salt; 4 (1 1/2 pound) Cornish game hens",
  "directions": "1. Whisk lemon juice, oil, onion, garlic, wine, pepper, Worcestershire sauce, hot pepper sauce, celery salt, and salt together in a large glass or ceramic bowl. Add game hens and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator for at least 4 hours. 2. When ready to cook, preheat an outdoor grill for medium heat and lightly oil the grate. 3. Remove hens from marinade and shake off excess. Save remaining marinade for basting. 4. Cook hens on the preheated grill, brushing occasionally with remaining marinade, until no longer pink and the juices run clear, about 1 hour. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C). Discard any unused marinade.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "5 hrs 15 mins",
  "calories": "871"
},
{
  "url": "https://www.allrecipes.com/recipe/229874/slow-cooker-cornish-hens/",
  "name": "Slow Cooker Cornish Hens",
  "rating": "4.3",
  "ratingcount": "47",
  "ingredients": "2  Cornish game hens; 1 (10.75 ounce) can  golden mushroom soup (such as Campbell's®), divided; 2 cups chopped baby portobello mushrooms; 1 (7 ounce) jar pimento-stuffed green olives, drained and chopped; 1 large zucchini, chopped; 1 teaspoon garlic salt",
  "directions": "1. Coat the hens with about 1/4 of mushroom soup. 2. Mix remaining mushroom soup with mushrooms, olives, zucchini, and garlic salt in a bowl. Stuff mixture inside the hens. Arrange hens, breast sides up, in the slow cooker. Spoon any remaining soup mixture over hens. 3. Cook hens in the slow cooker on High for 4 hours.",
  "prep": "20 mins",
  "cook": "4 hrs",
  "total": "4 hrs 20 mins",
  "calories": "851"
},
{
  "url": "https://www.allrecipes.com/recipe/285552/apricot-glazed-cornish-hens/",
  "name": "Apricot-Glazed Cornish Hens",
  "rating": "4.0",
  "ratingcount": "3",
  "ingredients": "cooking spray; 1 cup apricot preserves; 1 tablespoon Sriracha sauce; 1 tablespoon Worcestershire sauce; 1 tablespoon butter; 2 (1 1/4 pound) Cornish game hens; 1 tablespoon grapeseed oil; mango-habanero seasoning to taste; 4 sprigs fresh basil, or to taste",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Spray a cookie sheet generously with cooking spray. 2. Combine apricot preserves, Sriracha, Worcestershire, and butter in a small pot and melt over medium heat. Stir constantly to prevent from sticking. 3. Clean hens and pat dry with paper towels. Coat outsides and insides with oil. Season with mango-habanero seasoning; insert sprigs of basil inside of the hens. 4. Place hens on the prepared cookie sheet and cover with foil. 5. Cook in the preheated oven for 45 minutes. Remove foil and baste with apricot glaze. Put back in the oven and cook until no longer pink in the centers, about 15 minutes more. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 25 mins",
  "calories": "386"
},
{
  "url": "https://www.allrecipes.com/recipe/215982/heathers-rosemary-citrus-cornish-hens/",
  "name": "Heather's Rosemary Citrus Cornish Hens",
  "rating": "4.3",
  "ratingcount": "17",
  "ingredients": "4 ½ cups vegetable broth; 4 ½ cups water; 1 tablespoon whole allspice berries; 1 tablespoon whole black peppercorns; 1 cup kosher salt; 4  Cornish game hens; 1  grapefruit, cut into quarters; 1  juicy orange, cut into quarters; 1  lemon, cut into quarters; 1  lime, cut into quarters; 1 sprig fresh rosemary, or to taste, chopped; 1 sprig fresh thyme, or to taste, chopped; ¼ cup water; ¼ cup olive oil; salt and ground black pepper to taste",
  "directions": "1. Bring the vegetable broth, 4 1/2 cups of water, the allspice berries, black peppercorns, and kosher salt to a boil in a large pot, stirring to dissolve the salt. Remove the brine from the heat, and set aside to cool. When the brine is cool, place the Cornish hens into the brine and refrigerate for 2 to 3 hours. 2. Preheat oven to 350 degrees F (175 degrees C). Remove the game hens from the brine, and pat dry. Discard the brine. 3. Place the cut-up grapefruit, orange, lemon, lime, rosemary, and thyme into a microwave-safe bowl, and microwave on High for 2 minutes; with tongs, stuff the fruit and herbs into the cavities of the Cornish hens. Slather each hen with olive oil, and sprinkle with salt and black pepper. Place the stuffed hens into a roasting dish, breast sides up. 4. Roast in the preheated oven until no longer pink at the bone and the juices run clear, about 1 hour and 45 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). For extra-crispy skin, turn the oven heat up to 400 degrees F (205 degrees C) for the last 15 minutes of cooking. Allow the hens to rest for 10 minutes before serving.",
  "prep": "20 mins",
  "cook": "1 hr 50 mins",
  "total": "5 hrs 20 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/235567/chef-johns-calabrian-chicken/",
  "name": "Chef John's Calabrian Chicken",
  "rating": "4.7",
  "ratingcount": "24",
  "ingredients": "2  Cornish game hens; 1 cup white wine vinegar; ½ cup vegetable oil; 2 tablespoons fresh rosemary leaves; 2 tablespoons fresh orange juice; 4 cloves garlic, peeled; 1  egg; 1 tablespoon Calabrian hot chili sauce, or more to taste; 2 teaspoons grated orange zest; 1 ½ teaspoons kosher salt; 1  anchovy fillet",
  "directions": "1. Lay a game hen breast side-down on a work surface; use kitchen shears or a sharp knife to cut the backbone out of the game hen, cutting through each side of the bone from top to bottom. Remove the backbone. Use a sharp knife to slice through the cartilage of the breastbone. Flip game hen breast side-up, flatten bird lightly with your hands, and twist the wing tips underneath the wings. Repeat for remaining game hen. 2. Place white wine vinegar, vegetable oil, rosemary, orange juice, garlic, egg, Calabrian chili sauce, orange zest, kosher salt, and anchovy fillet into a blender. Pulse several times to combine; blend until marinade is smooth and creamy. 3. Place game hens into a resealable heavy plastic bag and pour in marinade. Squeeze out air, seal bag, and refrigerate at least 4 hours but preferably 8 hours to overnight. 4. Preheat grill for medium heat and lightly oil the grate. 5. Remove game hens from marinade, reserving marinade. Dry birds on paper towels. Season breast sides with salt. 6. Place game hens with breast sides down onto the preheated grill and cook until skin shows browned grill marks, about 5 minutes; rotate hens 45 degrees and grill 5 more minutes to make crosshatch grill marks. 7. Flip game hens onto their backs, brush with reserved marinade, and grill with the lid on for 5 minutes. Brush hens with more marinade. Repeat, cooking 5 minutes, then brushing with more marinade, until game hens are deep golden brown and an instant-read meat thermometer inserted into the thickest part of a thigh reads 160 degrees F, about 35 more minutes. Flip hens breast sides down, brush once more with marinade, and cook with lid closed until marinade has glazed onto chicken, about 5 more minutes. 8. Transfer hens to a serving platter, let rest for about 5 minutes, and serve.",
  "prep": "25 mins",
  "cook": "40 mins",
  "total": "5 hrs 10 mins",
  "calories": "698"
},
{
  "url": "https://www.allrecipes.com/recipe/212670/game-hen-stuffed-with-wild-rice-and-mushrooms/",
  "name": "Game Hen Stuffed with Wild Rice and Mushrooms",
  "rating": "4.4",
  "ratingcount": "35",
  "ingredients": "½ cup uncooked wild rice; 1 ½ cups water; 1 pinch salt; 10  fresh mushrooms, sliced; 2 tablespoons butter; 1  Cornish game hen, thawed; 1 tablespoon poultry seasoning, or to taste; ½ teaspoon dried crushed rosemary; salt and pepper to taste; 2 tablespoons butter",
  "directions": "1. Bring the rice, a pinch of salt, and water to a boil in a saucepan with a lid. Reduce the heat, cover with a lid, and simmer the wild rice until the kernels burst open, 45 to 50 minutes. Replenish the water if necessary. Fluff the rice with a fork, and let stand for 5 to 10 minutes to absorb water. 2. Preheat oven to 425 degrees F (220 degrees C). Grease a baking dish large enough to hold the game hen. 3. Heat 2 tablespoons of butter in a skillet, and cook and stir the mushrooms over medium heat until they are partially cooked and starting to give their juice, 5 to 8 minutes. Stir the mushrooms and butter into the cooked rice. 4. Sprinkle the game hen, inside and out, with poultry seasoning, rosemary, and salt and pepper. Lightly stuff the Cornish hen with the wild rice mixture, and tie the legs together with cooking twine to hold in the stuffing. Slice 2 tablespoons of butter into small pats, and dot them around the bird. 5. Bake the bird in the preheated oven until no longer pink at the bone and the juices run clear, 40 to 50 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Remove the game hen from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing.",
  "prep": "10 mins",
  "cook": "1 hr 50 mins",
  "total": "2 hrs",
  "calories": "522"
},
{
  "url": "https://www.allrecipes.com/recipe/24876/baked-cornish-game-hens/",
  "name": "Baked Cornish Game Hens",
  "rating": "4.3",
  "ratingcount": "139",
  "ingredients": "2  Cornish game hens; ½ cup melted butter; ½  onion, chopped; ½ stalk celery, chopped; ¼  green bell pepper, chopped; 1 (4.5 ounce) can mushrooms, drained and chopped; 2 cloves garlic, minced; 1 tablespoon dried basil; 1 teaspoon dried oregano; 1 tablespoon chopped fresh parsley; ¼ cup melted butter",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. In a small bowl combine the 1/2 cup melted butter, onion, celery, bell pepper, mushrooms, garlic, basil, oregano and parsley. 3. Season hens inside and out with salt and pepper to taste, then stuff with equal amounts butter/vegetable mixture. Place stuffed birds in a 9x13 inch baking dish, breast side up. Drizzle with 1/4 cup melted butter. 4. Cover dish and bake in the preheated oven for 1 1/2 hours. Remove cover and brown at 500 degrees F (260 degrees C).",
  "prep": "30 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs",
  "calories": "476"
},
{
  "url": "https://www.allrecipes.com/recipe/269154/sheet-pan-thanksgiving-cornish-hen-dinner/",
  "name": "Sheet Pan Thanksgiving Cornish Hen Dinner",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "cooking spray; 3 pounds potatoes, peeled and sliced into rounds; 2  carrots, cut into large chunks; 1  onion, cut into large slices; 1 tablespoon olive oil; 2 tablespoons Italian seasoning, divided; 2 tablespoons butter, softened; 2 (2 pound) Cornish game hens; salt and ground black pepper to taste; ½ wedge lemon; ½ cup chicken broth; ½ tablespoon all purpose flour, or more as needed; 2 tablespoons water, or more as needed",
  "directions": "1. Preheat the oven to 500 degrees F (260 degrees C). Spray a large sheet pan with cooking spray. 2. Arrange potatoes, carrots, and onion on the sheet pan in a single layer. Drizzle with olive oil and sprinkle 1 tablespoon Italian seasoning on top. 3. Mix butter and 1 teaspoon Italian seasoning together until well blended. 4. Rinse hens well, inside and out, under cool running water. Remove bag from inside the cavity. Pat the hens dry with paper towels. Season the cavity with salt and pepper. Make a pocket between the skin and the meat with your fingers, being careful not to rip the skin. 5. Divide butter mixture between the hens and place it between the breast meat and skin. Place hens on top of the potato and onion mixture. Season the outsides with salt, pepper, and remaining Italian seasoning. Place lemon inside the cavity of the hen. Pour chicken broth into the bottom of the sheet pan. 6. Roast in the preheated oven until hens are nicely browned, 35 to 45 minutes. Tent the hens with foil during the last few minutes of cooking to prevent overbrowning, if needed. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C). Remove from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing. 7. Meanwhile, drain about 1/2 cup of the pan drippings from beneath the vegetables into a small saucepan to start the gravy. Bring to a boil. Mix flour and cold water together and add to the pan drippings, whisking until desired consistency is reached. Serve gravy alongside Cornish hens.",
  "prep": "25 mins",
  "cook": "40 mins",
  "total": "1 hr 15 mins",
  "calories": "591"
},
{
  "url": "https://www.allrecipes.com/recipe/234282/grilled-game-hens-with-blood-orange-and-rosemary/",
  "name": "Grilled Game Hens with Blood Orange and Rosemary",
  "rating": "4.1",
  "ratingcount": "9",
  "ingredients": "2  Cornish game hens; 2 tablespoons olive oil; 1  blood orange, juiced; 1 teaspoon chopped fresh rosemary; 6 sprigs fresh rosemary; 1 tablespoon Asian chili garlic sauce; salt and freshly ground black pepper to taste",
  "directions": "1. Place game hens in a large bowl; drizzle hens with olive oil and blood orange juice. Sprinkle with chopped rosemary and rosemary sprigs. Add Asian chili paste to hens; season with salt and pepper. Stir chickens in the seasonings and juice to coat. Use your fingers to loosen the skin over the breasts and spread a little of the marinade under the skin. 2. Refrigerate with breast sides down for 2 hours to marinate. 3. Preheat outdoor grill (preferably charcoal) for medium heat (one layer of coals). Drain chickens and discard marinade. 4. Place chickens with breast sides down onto grill and cover with grill lid with the vents open. Cook until breast sides are evenly browned, 7 to 10 minutes. Flip chickens and cook on their backs with cover (vents open) until the juices run clear, hip joints move easily, and meat is no longer pink inside. An instant-read meat thermometer inserted into the thickest part of a thigh reads at least 160 degrees F (70 degrees C), 30 to 35 more minutes. 5. Close the grill vents on the lid halfway. Flip chickens back onto breasts, close lid, and cook for 2 to 3 more minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "3 hrs",
  "calories": "383"
},
{
  "url": "https://www.allrecipes.com/recipe/74858/apricot-ginger-game-hens/",
  "name": "Apricot Ginger Game Hens",
  "rating": "4.3",
  "ratingcount": "28",
  "ingredients": "½ cup soy sauce; ¼ cup apricot preserves; ¾ teaspoon grated fresh ginger root; 1 teaspoon crushed garlic; ½ cup white wine; ½ teaspoon white sugar; 2  Cornish game hens, halved lengthwise",
  "directions": "1. In shallow dish, mix the soy sauce, apricot preserves, ginger, garlic, wine, and sugar. Place the hens in the dish, and coat with the marinade. Cover, and allow to marinate in the refrigerator 8 hours, or overnight. 2. Preheat oven to 325 degrees F (165 degrees C). 3. Arrange the hen halves in a baking dish. Pour remaining marinade over the hens. Bake uncovered 1 hour and 15 minutes in the preheated oven, basting frequently with the marinade, until hen juices run clear.",
  "prep": "15 mins",
  "cook": "1 hr 15 mins",
  "total": "9 hrs 30 mins",
  "calories": "348"
},
{
  "url": "https://www.allrecipes.com/recipe/284831/greek-inspired-air-fryer-cornish-hen/",
  "name": "Greek-Inspired Air Fryer Cornish Hen",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "1 tablespoon olive oil; ¼ teaspoon dried oregano; ⅛ teaspoon dried dill weed; ⅛ teaspoon garlic powder; ⅛ teaspoon onion powder; ⅛ teaspoon dried rosemary; ⅛ teaspoon paprika; 1 (2 pound) Chicken, cornish game hens, meat and skin, raw",
  "directions": "1. Preheat the air fryer to 390 degrees F (200 degrees C). 2. Whisk together olive oil, oregano, dill, garlic powder, onion powder, rosemary, and paprika together. Brush mixture on all sides of the hen, paying particular attention the the wings and legs. 3. Place hen in the basket of the air fryer and cook for 30 minutes. Transfer to a cutting board and let rest 10 minutes before serving.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "467"
},
{
  "url": "https://www.allrecipes.com/recipe/229872/easy-cornish-hens/",
  "name": "Easy Cornish Hens",
  "rating": "4.3",
  "ratingcount": "49",
  "ingredients": "⅓ cup lemon juice; ¼ cup margarine, melted; ½ teaspoon dried thyme; ¼ teaspoon garlic powder; ⅛ teaspoon ground cumin; ⅛ teaspoon red pepper flakes; 2  Cornish game hens; ½ teaspoon ground thyme; ⅛ teaspoon salt; ⅛ teaspoon ground black pepper; 1 cup chicken broth; ⅓ cup lemon juice; ¼ cup chilled margarine, cut into cubes",
  "directions": "1. Mix 1/3 cup lemon juice, melted margarine, 1/2 teaspoon thyme, garlic powder, cumin, and red pepper flakes in a bowl. Pour and rub lemon juice mixture over Cornish hens. Mix 1/2 teaspoon thyme, salt, and black pepper in a bowl; sprinkle over Cornish hens. 2. Pour chicken broth and 1/3 cup lemon juice into a slow cooker. 3. Place about 1 tablespoon chilled margarine in the cavity of each hen; place hens in the slow cooker. Arrange the remaining margarine cubes in the chicken broth mixture. 4. Cook hens in the slow cooker on High for 4 hours or Low for 8 hours.",
  "prep": "10 mins",
  "cook": "4 hrs",
  "total": "4 hrs 10 mins",
  "calories": "516"
},
{
  "url": "https://www.allrecipes.com/recipe/223555/cornish-hen-with-tart-cherry-sauce/",
  "name": "Cornish Hen with Tart Cherry Sauce",
  "rating": "3.8",
  "ratingcount": "9",
  "ingredients": "1 teaspoon sea salt; 1 teaspoon ground black pepper; ½ teaspoon dried thyme; ½ teaspoon garlic powder; ¼ teaspoon dried rosemary; ⅛ teaspoon paprika; 5 tablespoons unsalted butter, melted; 2  Cornish game hens; ½ cup white wine; 1 (15 ounce) can tart cherries, drained; 1 ½ cups red wine; ¼ cup pulp-free orange juice; 1 tablespoon packed brown sugar; 2 tablespoons unsalted butter; 1 tablespoon all-purpose flour, or as needed",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Combine sea salt, black pepper, thyme, garlic powder, rosemary, and paprika in a bowl. Place hens on a baking sheet and evenly brush with 5 tablespoons butter. Rub hens with spice mixture. 3. Bake hens in preheated oven until no longer pink at the bone and the juices run clear, about 1 1/2 hours, basting every 1/2 hour with white wine. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). 4. Mix cherries, red wine, orange juice, and brown sugar in a saucepan; bring to a boil for 2 to 3 minutes. Reduce heat to medium-low, stir in 2 tablespoons butter, and cook until sugar is dissolved and butter is melted, about 10 minutes. Sprinkle flour into the sauce; whisk until thickened, 2 to 3 minutes. Drizzle cherry sauce over cooked hens.",
  "prep": "20 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 50 mins",
  "calories": "646"
},
{
  "url": "https://www.allrecipes.com/recipe/230470/honey-orange-cornish-hens/",
  "name": "Honey Orange Cornish Hens",
  "rating": "4.1",
  "ratingcount": "30",
  "ingredients": "1  Cornish game hens, halved lengthwise; ¼ cup orange juice; 2 tablespoons honey; 2 tablespoons soy sauce; 1 tablespoon white vinegar",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). 2. Place game hen halves with skin sides up into a 9x13-inch roasting pan. 3. Roast hens in the preheated oven for 35 minutes. 4. Stir orange juice, honey, soy sauce, and vinegar together in a small bowl; brush mixture over hens. 5. Roast hens for 5 more minutes and baste again with orange juice mixture. Roast until skin is browned and meat is no longer pink inside, about 10 more minutes.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "193"
},
{
  "url": "https://www.allrecipes.com/recipe/268544/roasted-orange-tarragon-cornish-hens/",
  "name": "Roasted Orange-Tarragon Cornish Hens",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "2  Cornish hens, thawed; 1  orange, zested and juiced; 1 teaspoon dried tarragon; 1 clove garlic, minced; ½ teaspoon Dijon mustard; ¼ teaspoon salt; ⅛ teaspoon ground black pepper; 2 tablespoons olive oil; kitchen twine",
  "directions": "1. Remove and discard giblet, if any. Rinse hens inside and out and pat dry. Loosen skin from the breasts and place hens in a large resealable plastic bag. 2. Whisk orange juice, orange zest, tarragon, garlic, mustard, salt, and pepper together in a small bowl. Whisking continually, slowly drizzle in olive oil until combined. Pour marinade over the hens in the bag, making sure to get some under the skin. Seal bag and refrigerate at least 1 hour. 3. Preheat the oven to 450 degrees F (230 degrees C). 4. Remove hens from the bag, letting excess marinade drip off; pour remaining marinade into a small saucepan and set aside. Place hens in a small roasting pan and season with salt and pepper. Tie legs together with kitchen twine and tuck wing tips underneath. 5. Roast in the preheated oven for 20 minutes. Reduce heat to 350 degrees F (175 degrees C). Continue cooking, basting with pan juices every 10 to 15 minutes, until hens are golden brown and internal temperature reaches 165 degrees F (74 degrees C), 25 to 30 minutes more. 6. Transfer hens to a serving plate, pouring any cavity juices back into the roasting pan. Tent with aluminum foil and keep warm. 7. Scrape pan juices and pour through a strainer into the saucepan with the reserved marinade. Bring to a boil and simmer 5 minutes, whisking occasionally. Season sauce with salt and pepper, if necessary. 8. Serve Cornish hens whole or cut in half. Spoon pan sauce over hens to serve.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "2 hrs 20 mins",
  "calories": "838"
},
{
  "url": "https://www.allrecipes.com/recipe/8938/cornish-game-hens-with-garlic-and-rosemary/",
  "name": "Cornish Game Hens with Garlic and Rosemary",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "4  Cornish game hens; 3 tablespoons olive oil, divided; salt and pepper to taste; 1  lemon, quartered; 8 sprigs fresh rosemary, divided; 24 cloves garlic; ⅓ cup white wine; ⅓ cup low-sodium chicken broth",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). Rub hens with 1 tablespoon olive oil; lightly season with salt and pepper. Stuff 1 lemon quarter and 1 rosemary sprig into each cavity. Place hens in a large, heavy roasting pan and arrange garlic cloves around them. 2. Roast in the preheated oven for 25 minutes. Meanwhile, whisk wine, chicken broth, and remaining 2 tablespoons olive oil together in a small bowl. 3. Remove hens from the oven; reduce the oven temperature to 350 degrees F (175 degrees C). Pour wine mixture over the hens and continue roasting, basting with pan juices every 10 minutes, until hens are golden brown and juices run clear, about 25 more minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 4. Transfer hens to a platter, pouring any cavity juices into the roasting pan; discard lemons and rosemary. Tent hens with aluminum foil to keep warm. 5. Transfer pan juices and garlic cloves to a medium saucepan; boil until reduced to a sauce consistency, about 6 minutes. 6. Cut hens in half lengthwise and arrange two halves on each plate. Spoon sauce and roasted garlic on top. Garnish with remaining rosemary sprigs and serve.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "814"
}]