[{
  "url": "https://www.allrecipes.com/recipe/221985/pablitos-chicken-tacos/",
  "name": "Pablito's Chicken Tacos",
  "rating": "4.7",
  "ratingcount": "23",
  "ingredients": "½ cup sour cream; ½ bunch fresh sorrel, chopped; 1  lime, juiced; 1 teaspoon salt; 1 teaspoon white sugar; 2 cups all-purpose flour; 2 cups masa harina; 2 teaspoons baking powder; 2 teaspoons salt; 1 ¾ cups water; 2 ounces butter, melted; ½ teaspoon vegetable oil; ¼ cup vegetable oil; 1 cup cubed skinless, boneless chicken breast meat; ½ bunch kale, stems removed and leaves coarsely chopped; ½  onion, sliced; 1 teaspoon salt; 1 teaspoon ground black pepper",
  "directions": "1. Stir sour cream, sorrel, lime juice, 1 teaspoon salt, and sugar in a bowl until well combined. Refrigerate until ready to use. 2. Mix flour, masa harina, baking powder, and 2 teaspoons salt in the bowl of a stand mixer. Gradually pour butter and water into flour mixture while mixing at lowest speed; mix until a dough just starts to come together. 3. Turn dough out onto a clean, flat surface and knead 3 to 4 times. Separate dough into 1 1/2 ounce balls, cover, and let rest for 1 hour. 4. Press each dough ball in a tortilla press lined with parchment paper or plastic wrap; transfer each tortilla to a baking sheet. 5. Lightly coat a cast-iron pan with 1/2 teaspoon vegetable oil and heat over medium-high heat. Place a tortilla in the pan and cook until lightly golden, about 1 minute per side. Repeat with remaining tortillas. 6. Heat 1/4 cup vegetable oil in a skillet over high heat. Stir in chicken; cook until browned around the edges, 4 to 6 minutes. Stir in onion, kale, 1 teaspoon salt, and pepper; reduce heat to medium-high. Cook, stirring often, until kale is wilted, 3 to 5 minutes. Remove from heat. 7. Spoon chicken-kale mixture into each tortilla, top with sorrel sour cream, and serve.",
  "prep": "45 mins",
  "cook": "30 mins",
  "total": "1 hr 15 mins",
  "calories": "537"
},
{
  "url": "https://www.allrecipes.com/recipe/257222/simple-hot-and-sour-soup/",
  "name": "Simple Hot and Sour Soup",
  "rating": "3.3",
  "ratingcount": "3",
  "ingredients": "1 ¾ ounces dried shiitake mushrooms; 1 ounce dried cloud ear mushrooms; ½ (12 ounce) package silken tofu, cut into 1/2-inch cubes; 1 (8 ounce) can bamboo shoots, cut into thin matchstick-size pieces; 2 teaspoons vinegar; 1 teaspoon ground white pepper; 10 fluid ounces chicken stock; 2 ounces cooked ham, thinly sliced; 1 teaspoon soy sauce; 1 teaspoon Shaoxing cooking wine; salt to taste; 2 teaspoons corn flour; 2 teaspoons water; 2  eggs, beaten; 1 teaspoon sesame oil",
  "directions": "1. Place shiitake mushrooms and cloud ear mushrooms in a bowl of water; soak until softened, about 30 minutes. Drain and finely chop the mushrooms. 2. Bring a pot of water to a boil; add tofu and cook for 1 minute. Remove using a slotted spoon and place in a bowl. Bring water back to a boil and add bamboo shoots; cook for 1 minute. Drain and set bamboo shoots aside. 3. Mix vinegar and white pepper together in a bowl. 4. Bring chicken stock to a boil in a large saucepan. Add bamboo shoots, mushrooms, and ham; return to a boil. Add tofu, soy sauce, Shaoxing wine, and salt; bring back to a boil. 5. Mix corn flour and water together in a bowl until dissolved; stir into chicken stock mixture until soup starts to thicken. Drizzle beaten eggs into soup, stirring gently to form cooked egg clumps, 2 to 3 minutes. 6. Stir vinegar-pepper mixture into soup and drizzle in sesame oil.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "185"
},
{
  "url": "https://www.allrecipes.com/recipe/22985/cornmeal-cake/",
  "name": "Cornmeal Cake",
  "rating": "3.5",
  "ratingcount": "4",
  "ingredients": "¼ cup butter, softened; ½ cup corn flour; ⅓ cup water; 1 (10 ounce) package frozen corn kernels, thawed; ½ cup white sugar; ¼ cup cornmeal; ⅛ cup heavy cream; ⅓ teaspoon baking powder; ¼ cup chopped fresh parsley; ¼ cup chili powder",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). Grease an 8 x 8 inch pan. 2. In a large bowl beat butter until smooth. Stir in flour and beat on low, adding water. 3. Chop corn in food processor or blender. Stir into butter mixture. 4. In a medium bowl combine sugar, cornmeal, cream, baking powder, parsley and chili powder; add to butter mixture. Pour batter into prepared pan. 5. Bake in preheated oven for 1 hour. Let stand 15 minutes before cutting.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "202"
},
{
  "url": "https://www.allrecipes.com/recipe/284361/grandmas-gorditas/",
  "name": "Grandma's Gorditas",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 ¼ cups instant corn masa flour (such as Maseca®); ½ teaspoon baking soda; 1 pinch salt; ½ cup water, or as needed; 2 tablespoons vegetable oil, or as needed",
  "directions": "1. Combine corn masa flour, baking soda, and salt in a bowl. Add a little water at a time until a firm dough forms. Divide dough into equal pieces and roll between your hands to form small balls. Press dough into 1/4-inch circles. 2. Heat a griddle or comal over medium heat. Add dough circles to the hot griddle and cook until light brown, slightly inflated, and cooked on the outsides, about 3 minutes per side. 3. Heat oil in a skillet over medium heat. Pan-fry gorditas in batches, if necessary, until golden brown, 1 to 2 minutes per side. Drain on paper towels and serve hot.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "135"
},
{
  "url": "https://www.allrecipes.com/recipe/261686/bean-tamales-tameles-de-frijoles/",
  "name": "Tamales de Frijoles (Bean Tamales)",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "24  dried corn husks; 1 (16 ounce) can refried beans; 1 tablespoon vegetable oil; 1 cup lard, softened; 2 pounds masa harina flour; 1 (4 ounce) can canned jalapenos, sliced; 6  dried ancho chile peppers, seeded; 3 cloves garlic; 1 pinch ground cumin; salt and freshly ground black pepper to taste; 1 tablespoon water, or as needed",
  "directions": "1. Start the tamales: Place corn husks into a bowl, cover with boiling water, and soak for about 3 hours. Drain, place on a work surface, and cover with a clean, damp towel. 2. Make the salsa: Place ancho chiles into a saucepan, cover with water, and bring to a boil over medium heat; cook until soft, about 10 minutes. Drain. 3. Combine ancho chiles, garlic, cumin, salt, and pepper in a blender. Add water and blend until smooth. Strain through a sieve. 4. Finish the tamales: Heat oil in a large skillet over medium heat. Add 1/2 of the salsa and cook for 3 to 5 minutes. Stir in refried beans until well combined; cook until most of the liquid has evaporated, about 5 minutes. Remove from the heat. 5. Beat lard with an electric mixer in a large bowl until fluffy. Gradually add masa flour and beat until well combined. Add remaining salsa and continue beating until dough is uniformly red in color. 6. Select one wide corn husk. Starting 2 inches from the bottom of the husk, spread about 2 tablespoons masa mixture over the surface, ending about 1/4 inch from the top. Place 1 tablespoon beans and 1 jalapeño slice in the center of masa mixture. Fold the sides of the husk together, one over the other. Fold the bottom of the husk over the seam of the two folded sides. Repeat to make remaining tamales. 7. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add tamales with the open side up; cook until filling is heated through and separates from the husk, about 1 hour. 8. Let tamales rest for 15 minutes before serving.",
  "prep": "1 hr",
  "cook": "1 hr 30 mins",
  "total": "5 hrs 45 mins",
  "calories": "165"
},
{
  "url": "https://www.allrecipes.com/recipe/262970/tacros-croissant-tacos/",
  "name": "Tacros (Croissant Tacos)",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 ½ cups masa harina; ½ cup boiling water; 12 ounces bread flour; 1 tablespoon vital wheat gluten; 1 tablespoon white sugar; 2 teaspoons salt; 1 (.25 ounce) package instant yeast; 12 ounces milk; 2 ounces lard; 10 ounces butter, room temperature",
  "directions": "1. Combine masa harina and boiling water in the bowl of a stand mixer. Mix until crumbly and set aside to soften for a few minutes. Combine bread flour, gluten, sugar, salt, and yeast in a small bowl. 2. Pour milk into the bowl with the masa; add flour mixture and lard. Mix on low speed with the dough hook until dough is well combined and clears the sides of the bowl, about 2 minutes. Scrape dough down and mix for 5 minutes more to develop the gluten; dough will be very stiff. 3. Transfer dough to a lightly oiled bowl and cover with plastic wrap. Let rise at room temperature, about 1 1/2 hours. Place butter in the same mixing bowl and use the paddle attachment on low speed to break it up. Mix just until smooth. 4. Scrape butter onto a piece of parchment or waxed paper. Form into a 7-inch square. Cover with another piece of parchment and smooth the top with a rolling pin. Re-form the edges of your square if necessary; a little fussing now will save you some trouble later on as you roll out the dough. Place butter square in the refrigerator to chill. 5. Transfer dough onto a floured work surface. Pat it into a square, transfer to a parchment-lined baking sheet, cover with plastic wrap, and refrigerate for 1 to 24 hours. 6. Remove butter square from the refrigerator about 20 minutes before you plan to roll the dough; it needs to be cool and pliable. 7. Transfer dough onto a floured work surface. Roll it into a square a little larger than the butter square. Leaving a 7-inch square platform in the center for the butter, roll each of the 4 corners of dough out into elongated flaps that can wrap around the butter like a present. 8. Place butter square in the center of the dough, fold up the flaps, and pinch together to seal. Roll dough out into a rectangle. Fold in thirds, like a business letter. Wrap in plastic wrap and refrigerate for 30 minutes. 9. Return dough to the work surface; dust with flour if needed. Roll dough out into a longer rectangle; you're going to do a 4-fold, also called the \"book fold.\" Fold the left edge of the dough into the center of the rectangle; fold the right side in to meet it. Then fold it in half again, like a wallet. Return dough to the parchment-lined baking pan, cover with plastic wrap, and refrigerate for 30 minutes. 10. Place dough on the work surface, roll out into a rectangle again, and make the final turn: another 3-fold, like a business letter. Cover and return to the refrigerator for 30 minutes; the dough can also be frozen at this point. 11. Slice dough in half and return 1 piece to the refrigerator to stay cool. Roll dough out to 1/4-inch thickness. Use a cutter to create 5-inch circles. Transfer circles to a parchment-lined baking sheet and let rise for 1 hour. Shape dough scraps into \"tacro cups\" and place in the cups of a muffin tin; let rise. Repeat both steps with remaining dough. 12. Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Gently fold a dough circle in half to form a taco shell shape; holding it with tongs, lower it into the oil. Hold it closed for about 10 seconds. Fry 2 shells at a time until golden, turning once, about 3 minutes total. Repeat with remaining dough circles, maintaining the oil heat between 350 and 375 degrees F (190 degrees C). Drain tacro shells on paper towels. 13. Preheat the oven to 375 degrees F (190 degrees C). 14. Bake tacro cups in the muffin tin until golden, 15 to 18 minutes. Fill cups and shells with your favorite taco fillings.",
  "prep": "1 hr 30 mins",
  "cook": "20 mins",
  "total": "9 hrs 20 mins",
  "calories": "465"
},
{
  "url": "https://www.allrecipes.com/recipe/235513/leftover-turkey-tamales/",
  "name": "Leftover Turkey Tamales",
  "rating": "4.8",
  "ratingcount": "17",
  "ingredients": "1 5-ounce package cornhusks; 3 cups masa harina; 1 tablespoon paprika; 1 tablespoon chili powder; 1 tablespoon garlic powder; 1 teaspoon ground cumin; 1 teaspoon salt; 1 cup corn oil; 1 quart turkey broth, divided; 1 tablespoon olive oil; 1  onion, finely chopped; 2 cloves garlic, minced; 3 ½ cups finely chopped cooked turkey; 1 teaspoon paprika; 1 teaspoon dried oregano; 1 teaspoon ground cumin; 1 teaspoon chili powder; 1 teaspoon salt; ¼ teaspoon ground black pepper; ¼ teaspoon cayenne pepper, or to taste",
  "directions": "1. Soak corn husks in a bowl of warm water until softened, about 1 hour; drain. 2. Mix masa, 1 tablespoon paprika, 1 tablespoon chili powder, garlic powder, 1 teaspoon cumin, and 1 teaspoon salt together in a bowl. Stir corn oil into masa mixture. Measure 1/2 cup turkey broth and set aside. Add remaining broth, 1 cup at a time, to masa mixture until dough is smooth and the consistency of thick peanut butter. 3. Heat olive oil in a skillet over medium heat; saute onion and garlic until softened and translucent, 5 to 10 minutes. Remove skillet from heat and add turkey, 1 teaspoon paprika, oregano, 1 teaspoon cumin, 1 teaspoon chili powder, 1 teaspoon salt, black pepper, and cayenne pepper. Stir reserved 1/2 cup turkey broth into filling until moistened. 4. Spoon 1 heaping tablespoon dough in the center of each corn husk. Top filling with 1 heaping tablespoon filling. Roll husk around dough and filling, tucking bottom of husk into tamale. Tie a corn husk strip or string around each tamale to secure. 5. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Stand tamales upright in steamer, cover, and steam until cooked through, about 1 hour. Add more water as needed.",
  "prep": "45 mins",
  "cook": "1 hr 5 mins",
  "total": "2 hrs 50 mins",
  "calories": "442"
},
{
  "url": "https://www.allrecipes.com/recipe/21690/pork-empanadas/",
  "name": "Pork Empanadas",
  "rating": "4.0",
  "ratingcount": "43",
  "ingredients": "2 pounds pork butt roast; 1  onion, quartered; 2 cloves garlic; ½ teaspoon salt; 1 teaspoon dried oregano; 1 teaspoon ground cumin; 2  bay leaves; 1 ½ cups all-purpose flour; ¾ cup masa harina; 1 teaspoon baking powder; ¼ teaspoon salt; ½ cup lard; 1  egg, beaten; ½ cup milk; 1 cup chipotle salsa",
  "directions": "1. To make the filling: Place pork in a large pot and cover with water. Add onion, garlic, salt, oregano, cumin, and bay leaves. Bring to a boil, reduce heat and simmer for 1 1/2 hours. While pork is cooking, prepare dough. 2. To make the dough: Sift together flour, masa harina, baking powder, and salt. Add shortening to dry ingredients and mix well. In a separate bowl, beat together egg and 1/2 cup milk. Make a well in the center of dry ingredients. Add egg mixture and stir with a fork until dough comes together in a ball. Divide dough into 16 even pieces and roll each piece into a ball. Place in a container, cover, and refrigerate. 3. Preheat the oven to 375 degrees F (190 degrees C). 4. After pork has simmered for 1 1/2 hours, remove from liquid. Place pork in a baking dish and bake for 1 hour or until meat shreds easily with a fork. Remove from the oven (keep the oven turned on) and shred into small pieces. Add salsa to shredded pork. 5. Lightly grease a baking sheet. 6. On a lightly floured surface, flatten a piece of dough with the palm of your hand. With a rolling pin, roll out the dough to make a 5-inch circle about 1/8-inch thick. Place 2 to 3 tablespoons of filling in the center of the dough circle. Brush edges of dough with milk. Fold dough over filling. Pinch edges together. Crimp with a fork to seal. 7. Place on the prepared baking sheet and repeat with remaining empanada dough. Leftover filling can be frozen or used in tacos, tamales, or burritos. 8. Bake in the preheated oven until golden, about 20 minutes. Remove to rack and cool for about 5 minutes. Serve warm.",
  "prep": "20 mins",
  "cook": "2 hrs 50 mins",
  "total": "3 hrs 15 mins",
  "calories": "209"
},
{
  "url": "https://www.allrecipes.com/recipe/212977/lumpia-sauce-for-fresh-filipino-lumpia/",
  "name": "Lumpia Sauce for Fresh Filipino Lumpia",
  "rating": "2.0",
  "ratingcount": "1",
  "ingredients": "1 tablespoon olive oil; 3 cloves garlic, crushed; 2 cups water; 2 tablespoons creamy or crunchy peanut butter; 2 tablespoons brown sugar; 2 tablespoons corn flour; 1 tablespoon soy sauce",
  "directions": "1. Heat olive oil in a saucepan over medium heat. Add garlic; cook and stir until fragrant, about 2 minutes. 2. Mix water, peanut butter, brown sugar, corn flour, and soy sauce together in a separate small saucepan until well blended and no lumps remain. Bring to a boil. Cook and stir until mixture is thick, 6 to 10 minutes. Add the cooked garlic and mix well.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "31"
},
{
  "url": "https://www.allrecipes.com/recipe/25116/perfect-cashew-and-peanut-butter-gluten-free-cookies/",
  "name": "Perfect Cashew and Peanut Butter Gluten-free Cookies",
  "rating": "4.6",
  "ratingcount": "20",
  "ingredients": "½ cup brown sugar; ½ cup white sugar; 1  egg; ¼ cup salted natural peanut butter; ¼ cup cashew butter; ½ cup gluten free, casein free margarine; ½ teaspoon baking soda; ½ cup corn flour; ½ cup tapioca flour; ¼ cup potato flour",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. In a medium bowl, mix together the margarine, brown sugar, white sugar and egg until smooth. Stir in the peanut butter and cashew butter. Combine the baking soda, corn flour, tapioca flour, and potato flour; stir into the batter to form a dough. Roll the dough into teaspoon sized balls and place them 2 inches apart onto an ungreased cookie sheet. 3. Bake for 8 to 10 minutes in the preheated oven. Let cool on baking sheets for a few minutes before removing to wire racks to cool completely.",
  "prep": "10 mins",
  "cook": "8 mins",
  "total": "20 mins",
  "calories": "122"
},
{
  "url": "https://www.allrecipes.com/recipe/223055/cuban-tamales/",
  "name": "Cuban Tamales",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "¼ cup olive oil, divided; 1 ½ pounds boneless country-style pork ribs, cut into small pieces; 1 cup dry white wine, divided; 2 cups water; 10 cloves garlic, minced, divided; 2 tablespoons tomato paste, divided; 2 cubes beef bouillon (such as Knorr®); 2  bay leaves; 1 teaspoon ground cumin; 1 teaspoon dried oregano; ½ teaspoon ground black pepper; 2 links Spanish chorizo sausage (such as Goya®), thinly sliced; 1  yellow onion, diced; 1 small green bell pepper, chopped; ½ cup pimento-stuffed green olives; 4 cups frozen corn, thawed; 1 ½ cups masa harina; 2 tablespoons white sugar; 1 tablespoon white vinegar; 1 teaspoon salt, or to taste; 1 (8 ounce) package dried corn husks, soaked in warm water; kitchen twine, cut into 12-inch lengths",
  "directions": "1. Heat 2 tablespoons olive oil in large saucepan or Dutch oven over medium-high heat. Cook and stir pork in hot oil until lightly browned, 5 to 7 minutes. 2. Pour 1/2 cup white wine into saucepan and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. 3. Stir 2 cups water, 5 cloves garlic, 1 tablespoon tomato paste, 1 beef bouillon cube, bay leaves, cumin, oregano, and black pepper to pork mixture. Bring mixture to a boil, reduce heat to low, partially cover the saucepan with a lid, and simmer until pork is very tender, 1 to 2 hours. Transfer pork to a bowl and reserve cooking liquid. 4. Heat remaining olive oil in a deep pot over medium-high heat. Cook and stir chorizo and cooked pork in hot oil until lightly browned, 3 to 5 minutes. 5. Stir onion, green pepper, and remaining minced garlic into chorizo mixture; saute until vegetables soften and onion is translucent, about 5 minutes. Add remaining white wine, olives, 1 tablespoon tomato paste, and remaining bouillon cube; cook, stirring frequently, until flavors combine, about 5 minutes more. 6. Pulse corn and 1 1/2 cups reserved pork broth together in a blender or food processor until mixture has a thick and chunky consistency. Stir corn mixture into pork-chorizo mixture. 7. Reduce heat to medium and stir masa harina, sugar, vinegar, and salt into pork mixture; cook, stirring occasionally, until mixture has a hearty cornmeal porridge-consistency. Season with salt and remove from heat. 8. Make a pocket out of one corn husk and fill 3/4 full with pork mixture, leaving a top flap. Wrap another husk around the filled pocket. Fold top flap over the pocket. Tie twine length- and width-wise around the tamale several times so that packet is secure, but has room for filling to expand during cooking. Repeat with remaining husks and filling. 9. Fill a pot with 2-inches of water; bring to a simmer. Place tamales upright in simmering water, cover the pot, and cook, adding water as necessary, until filling is hot and set, about 40 minutes. Cool tamales until completely set, at least 3 hours.",
  "prep": "1 hr 30 mins",
  "cook": "2 hrs 10 mins",
  "total": "6 hrs 40 mins",
  "calories": "284"
},
{
  "url": "https://www.allrecipes.com/recipe/230546/tomalito-sweet-corn-pudding-or-cake/",
  "name": "Tomalito - Sweet Corn Pudding or Cake",
  "rating": "4.7",
  "ratingcount": "11",
  "ingredients": "½ cup butter, softened; ⅓ cup masa harina; ¼ cup water; 2 cups frozen corn, thawed, divided; ¼ cup cornmeal; ⅓ cup white sugar; 2 tablespoons heavy whipping cream; ½ teaspoon baking powder; ¼ teaspoon salt",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Beat butter in a medium bowl with an electric mixer until creamy. Beat masa harina and water into creamed butter until smooth. 3. Place 1 cup corn in a blender; blend until smooth. Stir blended corn, remaining 1 cup corn, and cornmeal into masa harina mixture. 4. Mix sugar, cream, baking powder, and salt together in a separate bowl. Pour sugar mixture into corn mixture; stir to combine. Spoon corn batter into an ungreased 8-inch square baking dish. Smooth the top of the batter with a spatula. Cover dish with aluminum foil. 5. Fill a 9x13-inch casserole dish 1/3 full of hot water. Place the covered 8-inch square dish into the water. 6. Bake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 50 to 60 minutes. Remove 8x8-inch dish from water bath and let cool for 10 minutes.",
  "prep": "30 mins",
  "cook": "50 mins",
  "total": "1 hr 30 mins",
  "calories": "216"
},
{
  "url": "https://www.allrecipes.com/recipe/26382/chicken-enchilada-soup-iii/",
  "name": "Chicken Enchilada Soup",
  "rating": "4.6",
  "ratingcount": "504",
  "ingredients": "1 tablespoon vegetable oil; 1 pound skinless, boneless chicken breast halves; ½ cup diced onion; 1 clove garlic, minced; 1 quart chicken broth; 3 cups water; 1 cup masa harina; 2 cups shredded Cheddar cheese; 1 cup enchilada sauce; 1 teaspoon salt; 1 teaspoon chili powder; ½ teaspoon ground cumin",
  "directions": "1. Heat oil in a large pot over medium heat. Cook chicken breasts in hot oil until well browned on all sides. Remove and set aside. 2. Cook and stir onion and garlic in drippings in the same pot until onions are translucent. Pour in chicken broth. 3. Whisk together 2 cups water and masa harina in a medium bowl until well blended; pour into the pot. Stir in Cheddar cheese, enchilada sauce, remaining 1 cup water, salt, chili powder, and cumin. Bring to a boil. 4. Shred cooked chicken and add it to the pot. Reduce heat and simmer until thickened, 30 to 40 minutes.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "290"
},
{
  "url": "https://www.allrecipes.com/recipe/85930/quick-and-spicy-chili/",
  "name": "Quick and Spicy Chili",
  "rating": "4.8",
  "ratingcount": "102",
  "ingredients": "2 pounds lean ground beef; 2 (15 ounce) cans kidney beans, drained and rinsed; 1 (11 ounce) can whole kernel corn, drained; 1 (15 ounce) can tomato sauce; 1 (6 ounce) can tomato paste; 2 cups water; 2  jalapeno peppers; 1  habanero pepper (Optional); ½  red onion; 2 large cloves garlic; 3 tablespoons masa harina flour; 1 tablespoon ground cayenne pepper; 4 tablespoons chili powder; 1 ½ teaspoons salt; 1 teaspoon ground black pepper; 2 teaspoons white sugar (Optional)",
  "directions": "1. Place the beef in a skillet over medium heat, and cook until evenly brown. Drain grease. 2. In a large pot, mix the beans, corn, tomato sauce, tomato paste, and water. Bring to a boil, and reduce heat to low. In a food processor, finely chop the jalapenos, habanero, onion, and garlic. Mix into the pot. Mix in the cooked beef. Stir in masa flour. Season with cayenne pepper, chili powder, salt, black pepper, and sugar. Cook 45 minutes to 1 hour, stirring occasionally.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "201"
},
{
  "url": "https://www.allrecipes.com/recipe/202168/pulique-chicken-in-guatemalan-pulique-sauce/",
  "name": "Pulique (Chicken in Guatemalan Pulique Sauce)",
  "rating": "4.2",
  "ratingcount": "5",
  "ingredients": "1 pound chicken thighs; 3  zucchini, thickly sliced; 4  potatoes, cut into chunks; 2  carrots, sliced; 5 cups chicken broth; 1 teaspoon salt; ¼ cup masa harina flour; 2 tablespoons water; 6  tomatoes, cored and cut into chunks; 6 large fresh tomatillos, husks removed; 2 cloves garlic, cut in half; 1  onion, cut into chunks; 3  dried guajillo chile peppers, stems and seeds removed; 1 (1 inch) piece cinnamon stick; 6  whole cumin seeds; 2  whole cloves; 2  black peppercorns; 3 tablespoons dried epazote; 2 teaspoons achiote seed; ¼ cup olive oil; salt to taste",
  "directions": "1. Place the chicken thighs, zucchini, potatoes, carrots, chicken broth, and 1 teaspoon of salt into a large pot. Bring to a boil, reduce the heat, and simmer until the chicken is no longer pink and the vegetables are tender, about 20 minutes. Remove the chicken and vegetables from the pot, reserving the broth, and set aside. 2. Mix the masa harina with water in a small bowl, and let stand until the corn flour has absorbed the water and made a pliable dough, about 10 minutes. Form the masa dough into a 2 inch ball. Place the dough ball, tomatoes, tomatillos, garlic, onion, guajillo peppers, cinnamon stick, cumin seeds, cloves, peppercorns, epazote, and achiote seed into the broth, bring to a boil, reduce the heat, and simmer until the vegetables are tender, about 20 minutes. 3. Discard the cinnamon stick, and remove the vegetables and dough ball from the broth with a strainer. Place them into a blender, and working in batches if necessary, blend the ingredients until mostly smooth. Strain the sauce, and set it aside. Retain about 1/2 cup of broth. 4. Heat the olive oil in a large pot over medium heat, and slowly pour the sauce into the hot oil, letting it fry and bubble until it starts to change color, about 3 minutes. Add the chicken, zucchini, potatoes, and carrots to the sauce, pour in about 1/2 cup of reserved chicken broth, and stir. Season with salt to taste, and simmer over low heat for about 10 minutes to blend the flavors.",
  "prep": "40 mins",
  "cook": "55 mins",
  "total": "1 hr 45 mins",
  "calories": "407"
},
{
  "url": "https://www.allrecipes.com/recipe/237708/chicken-manchurian/",
  "name": "Chicken Manchurian",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1  egg, beaten; 1 ½ tablespoons all-purpose flour; 1 ½ tablespoons corn flour; 1 pinch salt and ground black pepper to taste; 1 pound chicken, cut into cubes; vegetable oil for frying; 2 tablespoons vegetable oil; 2 tablespoons crushed fresh ginger root; 2 tablespoons crushed garlic; ½ cup chopped fresh cilantro; 2  serrano chile peppers, cut into 1/4-inch pieces, or more to taste; 1 cup chicken stock; 2 tablespoons soy sauce; ¼ teaspoon white sugar; ¼ teaspoon ground black pepper; ¼ teaspoon monosodium glutamate (such as Ajinomoto®) (Optional); ½  green bell pepper, cut into 1-inch pieces; ½ cup water; 2 tablespoons corn flour",
  "directions": "1. Beat egg in a large bowl. Mix all-purpose flour and 1 1/2 tablespoons corn flour into egg until batter is smooth; season with salt and pepper. Dip chicken into batter, working in batches, until coated; place on a plate in a single layer so the pieces do not touch. 2. Heat a skillet over medium-high heat; add enough vegetable oil to reach about 1/2-inch depth. Fry battered chicken, working in batches, in the hot oil until no longer pink in the center, 5 to 10 minutes. Transfer cooked chicken, using a slotted spoon, to a paper towel-lined plate to drain. 3. Heat 2 tablespoons vegetable oil in skillet over medium heat; cook and stir ginger and garlic until lightly browned, 1 to 2 minutes. Add cilantro and serrano peppers; reduce heat to medium-low. 4. Mix chicken stock, soy sauce, sugar, 1/4 teaspoon black pepper, and monosodium glutamate into garlic-ginger mixture; cook and stir until sauce is heated through, about 5 minutes. Add green bell pepper to sauce and cook until slightly tender, 2 to 3 minutes. 5. Whisk water and 2 tablespoons corn flour together in a bowl until smooth; stir into sauce until incorporated. Bring sauce to a boil. Add chicken and stir to coat.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "327"
},
{
  "url": "https://www.allrecipes.com/recipe/242237/easy-turkish-delight/",
  "name": "Easy Turkish Delight",
  "rating": "4.0",
  "ratingcount": "6",
  "ingredients": "3 cups water; 2 cups white sugar; ¼ cup unflavored gelatin; 1 ½ cups confectioners' sugar, sifted; ⅔ cup corn flour; ¼ teaspoon cream of tartar; ½ teaspoon rose water; 3 drops pink food coloring, or as desired; ¾ cup confectioners' sugar, sifted",
  "directions": "1. Combine water, white sugar, and gelatin in a large microwave-safe bowl; heat in microwave on high for 7 minutes. Stir sugar mixture and cook in microwave for 7 minutes more. 2. Mix 1 1/2 cups confectioners' sugar, corn flour, and cream of tartar together in a bowl; stir into sugar mixture. Heat mixture in microwave on high for 6 minutes more. Stir rose water and food coloring into mixture. 3. Lightly grease a 7x11-inch baking dish. Pour mixture into the greased dish; refrigerate until firm, about 30 minutes. 4. Cut Turkish delight into small squares using a wet knife. 5. Place 3/4 cup confectioners' sugar in a bowl. Roll Turkish delight in the confectioners' sugar until evenly coated. Store in an airtight container in the refrigerator.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "1 hr 10 mins",
  "calories": "87"
},
{
  "url": "https://www.allrecipes.com/recipe/262325/minnesota-hunters-chili/",
  "name": "Minnesota Hunter's Chili",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "4 tablespoons bacon fat; 1 large red onion, chopped fine; 2 pounds coarsely ground venison; 1 pound coarsely ground beef; 3 pounds coarsely ground pork; 3 tablespoons chili powder; 1 ½ tablespoons cayenne pepper; 1 tablespoon minced garlic; 1 ½ teaspoons ground cumin; 3 (8 ounce) cans tomato sauce; 2 cups water; 1 (6 ounce) can tomato paste; 2 tablespoons paprika; 2 tablespoons dried parsley; 1 tablespoon kosher salt; ½ teaspoon dried oregano; ½ cup masa harina",
  "directions": "1. Heat bacon fat in a 5-quart Dutch oven over medium heat. Add onion and cook until tender, about 5 minutes. Add venison and brown well, about 10 minutes. 2. Brown beef in a separate skillet over medium heat, 7 to 10 minutes; add to Dutch oven with venison. Brown pork in the skillet over medium heat, 10 to 15 minutes; add to Dutch oven with meat mixture. Add chili powder, cayenne pepper, garlic, and cumin. Cook over medium heat until flavors have combined, stirring occasionally, about 30 minutes. 3. Stir tomato sauce, water, tomato paste, paprika, parsley, salt, and oregano into the meat mixture in the Dutch oven. Bring to a boil. Reduce heat to a simmer and cook for about 1 hour. Stir occasionally and add water as needed. 4. Mix masa harina into the meat mixture in the Dutch oven; cook until thickened, at least 30 minutes. Add more water as needed.",
  "prep": "10 mins",
  "cook": "2 hrs 40 mins",
  "total": "2 hrs 50 mins",
  "calories": "332"
},
{
  "url": "https://www.allrecipes.com/recipe/273993/bison-chili-from-scratch/",
  "name": "Bison Chili from Scratch",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "½ pound dried red beans; ¼ cup vegetable oil; 1 large onion, diced; 6 cloves garlic, minced; 1 ½ pounds ground bison; 8 medium tomatoes, finely chopped, with liquid; 2 tablespoons red pepper flakes, or more to taste; 4 teaspoons ground cumin; 3 teaspoons dried oregano; 1 teaspoon chili powder, or more to taste; 1 teaspoon sea salt; 1 teaspoon ground white pepper; 1 teaspoon paprika; 1 cup water; 2 tablespoons masa flour, or more as needed",
  "directions": "1. Rinse beans. Combine with 3 quarts of cold water in a large pot. Soak 8 hours to overnight. 2. Drain beans and return to the pot. Add 3 quarts fresh water and bring to a boil. Reduce heat to low and simmer uncovered until tender, 1 to 2 hours. Drain and set aside. 3. Heat vegetable oil in a 4-quart stockpot over medium heat. Add onion and stir until softened, 5 to 10 minutes. Add garlic, stir for a minute, then add bison and cook until browned, 10 to 15 minutes. Stir tomatoes and liquid into stockpot. 4. Combine red pepper flakes, cumin, oregano, chili powder, sea salt, white pepper, and paprika in a small container and stir to mix. Add to the stockpot and stir through. Add 1 cup water and stir gently while bringing water to a boil, about 5 minutes. Reduce heat to low and simmer, uncovered, for 1 hour. 5. Taste bison mixture and adjust seasoning as desired. Add beans and mix through. Sprinkle 1 tablespoon masa flour on top and gently stir in to achieve a medium-thick consistency. Cover and simmer chili over low heat for 1 hour. 6. Uncover chili, stir, and add another tablespoon masa flour. Continue simmering, uncovered, over low heat to desired consistency, 60 to 90 minutes. Cover the pot or add a teaspoon of masa flour to control consistency.",
  "prep": "20 mins",
  "cook": "4 hrs 20 mins",
  "total": "12 hrs 40 mins",
  "calories": "286"
},
{
  "url": "https://www.allrecipes.com/recipe/261730/gluten-free-vegan-cornbread/",
  "name": "Gluten-Free Vegan Cornbread",
  "rating": "3.0",
  "ratingcount": "4",
  "ingredients": "2 cups instant corn flour; 3 tablespoons white sugar; ½ teaspoon baking powder; ½ teaspoon baking soda; ½ teaspoon salt; 1 cup almond milk; ½ cup vegetable oil; 3 tablespoons maple syrup",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Grease a 9-inch cake pan. 2. Mix corn flour, sugar, baking powder, baking soda, and salt together in a large bowl. 3. Mix almond milk, oil, and maple syrup together in a small bowl. Fold into the corn flour mixture until batter is just moist. Spread mixture into the prepared cake pan. 4. Bake in the preheated oven until a knife inserted into the center comes out clean, 20 to 25 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "270"
},
{
  "url": "https://www.allrecipes.com/recipe/262050/arepas/",
  "name": "Arepas",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "2 ½ cups milk; 1 ½ cups arepas flour (such as P.A.N.®); ½ cup grated Monterey Jack cheese; 1 teaspoon kosher salt; ½ teaspoon freshly ground black pepper; ¼ cup unsalted butter, cut into pieces; 1 tablespoon honey; vegetable oil; 1 (6 ounce) package cooked chicken, shredded, or to taste; ½ (8 ounce) package Monterey Jack cheese, sliced, or to taste; ½  avocado, sliced, or to taste",
  "directions": "1. Bring milk to a simmer in a pot. Remove from heat and stir in butter. 2. Combine arepas flour, grated Monterey Jack cheese, kosher salt, and black pepper in a large bowl. Add the hot milk mixture and honey; stir until combined. Let mixture sit until milk is absorbed enough for a soft dough to form, 1 to 2 minutes. Dough will continue to stiffen. 3. Form dough into 12 balls about 2 inches in diameter. Flatten between palms into 3 1/2- to 4-inch arepa patties about 1/3-inch thick. 4. Heat oil in a large nonstick skillet over medium heat. Fry 3 to 4 arepas at a time until lightly golden brown, about 3 minutes per side. Slice each arepa in half crosswise and stuff a portion of chicken, sliced Monterey Jack cheese, and avocado between the halves.",
  "prep": "15 mins",
  "cook": "11 mins",
  "total": "27 mins",
  "calories": "222"
},
{
  "url": "https://www.allrecipes.com/recipe/228924/arizona-roadhouse-chili/",
  "name": "Arizona Roadhouse Chili",
  "rating": "3.8",
  "ratingcount": "4",
  "ingredients": "1 pound dried pinto beans; 1 pound 90%-lean ground beef; 2 large sweet onions, diced; 3 cups diced celery; 3  carrots, peeled and diced; 6 cloves garlic, minced; 2  red bell peppers, diced; 4  jalapeno peppers, seeded and minced; 2  Anaheim peppers, seeded and diced; 2  poblano peppers, seeded and diced; 1 quart diced tomatoes; 2 tablespoons guajillo chile powder; 1 ½ tablespoons ground cumin; 1 teaspoon dried oregano; 1 teaspoon ground coriander; ¼ teaspoon ground cinnamon; 2 tablespoons hot pepper sauce; 1 tablespoon beef bouillon granules; water, as needed; 2 teaspoons masa harina flour (Mexican corn masa mix) (Optional); 2 teaspoons salt",
  "directions": "1. Place pinto beans in a large container and cover with several inches of cool water; let stand 8 hours to overnight. 2. Cook and stir beef in a large stockpot over medium-high heat until crumbly, evenly browned, and no longer pink, 7 to 10 minutes. Drain and discard grease from pot. 3. Drain pinto beans and add to stockpot; add onions, celery, carrots, garlic, red bell peppers, jalapeno peppers, Anaheim peppers, poblano peppers, diced tomatoes, guajillo chile powder, cumin, oregano, coriander, cinnamon, and hot pepper sauce. Reduce heat to medium-low and cook mixture at a simmer for about 3 hours. 4. Stir beef granules into the chili and continue simmering until beans are very tender and disintegrate easily, 1 to 3 hours more, adding water as needed to keep beans and vegetables immersed in liquid. Thicken the chili with masa harina if you prefer a thicker texture. Season with salt just before serving.",
  "prep": "20 mins",
  "cook": "4 hrs 10 mins",
  "total": "12 hrs 30 mins",
  "calories": "393"
},
{
  "url": "https://www.allrecipes.com/recipe/18171/corn-and-poppy-seed-loaf/",
  "name": "Corn and Poppy Seed Loaf",
  "rating": "3.3",
  "ratingcount": "3",
  "ingredients": "2 cups all-purpose flour; 1 cup corn flour; 2 tablespoons white sugar; 2 (.25 ounce) packages rapid rise yeast; 1 ½ teaspoons salt; ¾ cup milk; 1 ¼ cups all-purpose flour; ½ cup water; ¼ cup butter; 1  egg; 4 tablespoons poppy seeds; 1 tablespoon butter, melted",
  "directions": "1. In a large bowl, combine 2 cups flour, corn flour, sugar, yeast and salt. In a medium saucepan, heat milk, water and butter until warm. Stir milk mixture and egg into flour mixture. Mix in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 6 to 8 minutes. Knead in the poppy seeds last, reserving 1 tablespoon for topping. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 30 minutes. 2. Deflate the dough and turn it out onto a lightly floured surface. Form into loaf and place in a lightly greased 9x5 inch loaf pan. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 375 degrees F (190 degrees C). 3. Bake in preheated oven for 30 to 35 minutes, or until golden brown and bottom of loaf sounds hollow when tapped. Remove loaf from pan, brush with melted butter and sprinkle with 1 tablespoon poppy seeds. Place on a wire rack to cool.",
  "prep": "30 mins",
  "cook": "35 mins",
  "total": "2 hrs 30 mins",
  "calories": "245"
},
{
  "url": "https://www.allrecipes.com/recipe/173297/1-dish-taco-bake/",
  "name": "1-Dish Taco Bake",
  "rating": "4.2",
  "ratingcount": "130",
  "ingredients": "1 pound ground beef; 1 (1.25 ounce) package taco seasoning; Mazola Pure® Cooking Spray; ¾ cup all-purpose flour; ½ cup masa corn flour OR corn meal; 2 envelopes Fleischmann's® RapidRise Yeast; 1 tablespoon sugar; ½ teaspoon salt; ¾ cup very warm milk (120 degrees F to 130 degrees F); 3 tablespoons Mazola® Corn Oil; 1  egg; 1 cup chunky salsa; 1 cup shredded Mexican-style cheese; 1 cup corn chips, partially crushed",
  "directions": "1. Brown ground beef and drain. Add taco seasoning and mix well. 2. Mix batter ingredients together in a pre-sprayed 9-1/2-inch deep dish pie plate. 3. Top batter with taco meat filling. Pour salsa evenly over meat; sprinkle with shredded cheese and corn chips. 4. Bake by placing in a COLD oven; set temperature to 350 degrees F. Bake for 30 minutes or until done.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "534"
},
{
  "url": "https://www.allrecipes.com/recipe/272448/gorditas-mexicanas/",
  "name": "Gorditas Mexicanas",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 cups water; 1 pound chicken thighs and drumsticks; 2 tablespoons chicken bouillon granules; ½  onion; 1 clove garlic; 2 cups instant corn masa flour (such as Maseca®); 1 ¼ cups water, or more as needed; 1 teaspoon salt; ½ cup oil for frying, or as needed; 1 (15 ounce) can black beans (such as Goya®); ½ head lettuce, finely chopped; 1 large tomato, diced; 1 large avocado, sliced; 8 ounces grated cotija cheese; 1 cup sour cream, or as needed",
  "directions": "1. Bring 2 cups water to a boil in a saucepan. Add chicken, chicken bouillon, onion, and garlic. Cover and simmer until chicken is no longer pink the middle, about 40 minutes. 2. Meanwhile, preheat a pancake grill to 400 degrees F (200 degrees C). 3. Mix corn flour, 1 1/4 cups water, and salt together in a bowl until a smooth, moist dough is formed. Add more water if the dough seems too dry. Divide dough into 8 to 10 medium-sized balls and pat each into a 1/4-inch thick round. 4. Cook dough rounds on the preheated grill until cooked on the outside, about 3 minutes per side. Pull the edges out while still hot, making a little indention in the center of each gordita. 5. Heat oil in a skillet over medium heat. Deep fry gorditas until golden brown on both sides, 2 to 5 minutes per gordita. Set aside on a wire cooling rack. 6. Pour beans into a small saucepan and warm over medium heat. 7. Drain chicken, reserving cooking liquid. Remove meat from the bones and transfer meat to a food processor. Add a few tablespoons of cooking liquid and chop to desired consistency. 8. Spread a layer of warm beans on each gordita, then top with chopped chicken, lettuce, tomato, avocado, and cotija cheese. Finish with a dollop of sour cream.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "591"
},
{
  "url": "https://www.allrecipes.com/recipe/261634/poblano-and-cheese-tamales-tamales-de-rajas-con-queso/",
  "name": "Poblano and Cheese Tamales (Tamales de Rajas con Queso)",
  "rating": "4.9",
  "ratingcount": "7",
  "ingredients": "corn husks; 10 ounces poblano peppers; 1 ¼ pounds fresh tomatillos, husks removed; 11 ounces lard, divided; 1  onion, chopped; salt and ground black pepper to taste; 3 tablespoons chopped fresh cilantro; 4 ½ cups masa harina; 2 teaspoons baking powder; 1 ¾ cups chicken broth, or as needed; 2 ½ cups sliced Monterey Jack cheese",
  "directions": "1. Place corn husks in a large bowl and cover with boiling water. Allow to soak for 30 to 60 minutes. Drain, place husks on a work surface, and cover with a clean, damp towel. 2. While husks are soaking, line a heavy cast iron grill pan or griddle with aluminum foil and place it over high heat. Arrange poblano peppers in a single layer over foil. Grill until peppers are blackened, turning as necessary, 3 to 5 minutes. Transfer to a resealable plastic bag and let them steam, 10 to 15 minutes. Peel off skins and remove seeds. Cut into strips and set aside. 3. Place tomatillos in a medium pot and cover with water; bring to a boil. Cook until tomatillos change color, about 5 minutes. Drain, place in a blender, and blend until smooth. Set sauce aside. 4. Heat 1 tablespoon lard in a large pot over medium heat. Cook and stir onion in hot lard until soft and translucent, about 5 minutes. Add blended tomatillos; season with salt and pepper. Bring to a boil, reduce heat, and simmer until flavors are well combined, about 5 minutes. Add poblano pepper strips and cilantro; cook at a boil for 5 minutes. Remove from heat and allow to cool, about 10 minutes. 5. Beat remaining lard in a large bowl with an electric mixer until creamy. Season with salt and continue beating for a few minutes. Beat in masa harina and baking powder until well combined. Mix in broth, 1/4 cup at a time, until dough has a smooth and workable consistency that is not too wet, similar to cookie dough. Test if masa mixture is ready by dropping a small ball of masa into a glass of cold water; if it floats, it's ready; if not, keep working dough a little longer. 6. Select 1 wide corn husk or 2 small ones. Spread about 2 tablespoons masa mixture onto corn husk, filling it 2 inches from the bottom and 1/4 inch from the top. Add 1 tablespoon tomatillo sauce and a Monterey Jack cheese slice in the center of masa mixture. Fold the sides of husk together, one over the other. Fold the bottom of the husk over the seam of the 2 folded sides. Repeat with remaining husks. 7. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Place tamales, open-side up, into the insert. Cover and steam until filling is heated through and separates from husk, about 1 hour 15 minutes. Let tamales rest for 15 minutes before serving.",
  "prep": "1 hr",
  "cook": "2 hrs",
  "total": "3 hrs 25 mins",
  "calories": "252"
},
{
  "url": "https://www.allrecipes.com/recipe/143644/pupusas/",
  "name": "Pupusas",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "4 cups plain tomato sauce; 1 cup water; 4 bunches fresh cilantro, chopped; 1  green bell pepper, seeded and chopped; 1  onion, chopped; 2 cloves garlic, crushed (Optional); 1 cube chicken bouillon; salt to taste; ½ head cabbage, shredded; 1 large carrot, peeled and grated; ½ cup white vinegar; 3  scallions, minced; 2 tablespoons dried oregano; 1 pinch crushed red pepper flakes; 1 (12 ounce) package bacon, or to taste; 4  tomatoes, halved, or more to taste; 1  green bell pepper, seeded and quartered; 1 cup grated Monterey Jack cheese; 2 cloves garlic, minced (Optional); salt to taste; 4 cups masa harina, or more to taste; 2 cups water, or as needed; ½ cup vegetable oil for frying",
  "directions": "1. Combine tomato sauce, water, cilantro, green bell pepper, onion, crushed garlic, bouillon cube, and salt in a saucepan over medium-low heat. Cook and stir until vegetables are soft, about 20 minutes. Let salsa roja cool for 10 minutes. 2. Fill a blender halfway with the salsa roja. Cover and hold lid down with a potholder; pulse a few times before leaving on to blend. Pour into a bowl. Repeat with remaining salsa roja. Return to saucepan and simmer for 10 minutes more stirring occasionally. Allow to cool completely, about 1 hour, and refrigerate. 3. Place cabbage and carrots in a large bowl. Add 4 cups boiling water and let stand for 5 minutes. Drain well. Mix in vinegar, scallions, oregano, and red pepper flakes. Chill curtido until serving. 4. Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until almost fully cooked and not yet crispy, 5 to 7 minutes. Transfer bacon and grease (if desired) to a food processor. Add tomatoes, quartered green bell pepper, Monterey Jack cheese, and minced garlic. Puree and season the chicharron with salt. 5. Mix masa harina and 1/2 cup water together in a bowl by hand. Add the remaining water slowly, about 2 tablespoons at a time, mixing well after each addition, until dough is moist but still firm. Cover with a wet towel. 6. Heat 1/2 cup oil a large skillet over medium-high heat. 7. Take a golf ball-sized piece of dough and roll into a ball in your hands. Make a hole in the dough ball with your thumb; put a small amount of chicharron inside the hole, close it up, and flatten the ball with your hands into a thick tortilla shape. Place pupusa in the skillet and fry until golden brown, about 2 minutes per side. Repeat with the remaining dough and chicharron. 8. Serve each pupusa topped with 2 tablespoons of curtido and 1 tablespoon of salsa roja.",
  "prep": "1 hr",
  "cook": "39 mins",
  "total": "2 hrs 54 mins",
  "calories": "234"
},
{
  "url": "https://www.allrecipes.com/recipe/223537/hot-dog-chili-for-chili-dogs/",
  "name": "Hot Dog Chili for Chili Dogs",
  "rating": "3.0",
  "ratingcount": "4",
  "ingredients": "3  dried ancho chiles, stems removed but seeds left in; 1 cup boiling water; 3  slices thick-cut bacon, chopped; 2 tablespoons bacon drippings; 1  white onion, diced; 1  sweet red onion, diced; 1 pinch salt; 6 cloves garlic, minced; 3 cups boiling water; 2 pounds ground beef chuck; 1 (6 ounce) can tomato paste; 2 packets low-sodium beef bouillon granules; ¼ cup spicy brown mustard; ¼ cup dark red chili powder; ¼ cup Worcestershire sauce; ¼ cup ground cumin; 2 tablespoons garlic powder; 2 tablespoons adobo seasoning with cumin; 2 tablespoons paprika; 1 (15 ounce) can kidney beans, rinsed and drained; ¼ cup masa harina, or as needed; salt and ground black pepper to taste",
  "directions": "1. Place ancho chiles into 1 cup boiling water and set aside until softened, about 15 minutes. While chiles are soaking, place bacon in a large saucepan and cook over medium-high heat, stirring occasionally, until evenly browned, about 10 minutes. Drain excess grease but reserve 2 tablespoons bacon drippings in the pan. 2. Cook and stir white and red onion in bacon drippings with bacon over medium heat with a pinch of salt until onions are translucent, about 5 minutes; stir in garlic and cook until softened, about 1 more minute. Pour in 3 cups boiling water and stir in beef chuck, mixing the meat with the water to break it apart. Bring to a boil and reduce heat to low. 3. Stir in tomato paste and beef bouillon granules until the granules dissolve; allow mixture to simmer while you complete remaining steps. 4. Place soaked ancho chiles and their liquid, spicy brown mustard, chili powder, Worcestershire sauce, cumin, garlic powder, adobo seasoning, and paprika into a blender and blend until smooth; pour mixture into the chili. Use a little water to dissolve remaining mixture in blender and pour into the chili. 5. Bring chili to a slow boil over medium-low heat and stir in kidney beans and masa harina. Reduce heat to low; allow to simmer until thick and the flavors have blended, at least 45 more minutes. Season with salt and black pepper. If chili is too thin, mix in more masa harina.",
  "prep": "30 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 45 mins",
  "calories": "261"
},
{
  "url": "https://www.allrecipes.com/recipe/180147/ninas-texas-chili/",
  "name": "Nina's Texas Chili",
  "rating": "4.2",
  "ratingcount": "22",
  "ingredients": "2 teaspoons cooking oil; 3 pounds beef top sirloin, thinly sliced; 2 pounds sweet Italian sausage, casings removed; 1  onion, chopped; 1  green bell pepper, chopped; 1  red bell pepper, chopped; 1  yellow bell pepper, chopped; 2 cloves garlic, minced; 20 ounces diced tomatoes; 3 (8 ounce) cans tomato sauce; 2 teaspoons chicken bouillon granules; ½ cup honey; 1 (15 ounce) can kidney beans, rinsed and drained; 2 tablespoons cayenne pepper; 6 tablespoons chili powder; 3 tablespoons dried oregano; 1 teaspoon ground black pepper; 2 teaspoons salt; ⅓ cup white sugar; 1 cup shredded Cheddar cheese; ¼ cup masa (corn flour)",
  "directions": "1. Heat the oil in a large pot over medium heat; cook the steak, sausage, onion, green pepper, red, pepper, yellow pepper, and garlic in the pot until the onions and peppers are soft, about 5 minutes. Add the diced tomatoes, tomato sauce, chicken bouillon, honey, and kidney beans; bring to a boil. One at a time, stir in the cayenne pepper, chili powder, oregano, black pepper, salt, and sugar. Sprinkle the Cheddar cheese into the chili in small batches and stir to melt. Reduce heat to low and slow cook about 2 hours. Thicken by stirring the masa through the chili, and simmering for 10 minutes.",
  "prep": "30 mins",
  "cook": "2 hrs 15 mins",
  "total": "2 hrs 45 mins",
  "calories": "675"
},
{
  "url": "https://www.allrecipes.com/recipe/143617/pupusas-de-queso-cheese-stuffed-tortillas/",
  "name": "Pupusas de Queso (Cheese-Stuffed Tortillas)",
  "rating": "3.8",
  "ratingcount": "56",
  "ingredients": "2 cups masa harina; 1 cup water; 1 cup queso fresco, crumbled",
  "directions": "1. Stir the masa harina and water together in a mixing bowl until smooth; knead well. Cover bowl, and let the dough rest 5 to 10 minutes. 2. Shape the dough into eight, 2 inch diameter balls. On a lightly floured surface, roll out each ball into 6 inch diameter round. Sprinkle 1/4 cup queso fresco over each round. Place a second tortilla over the cheese, and pinch the edges together to seal in the cheese. 3. Heat ungreased skillet over medium-high heat. Place one tortilla into the skillet at a time, and cook until cheese melts and tortillas are lightly browned, about 2 minutes on each side.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "40 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/78174/gorditas/",
  "name": "Gorditas",
  "rating": "4.1",
  "ratingcount": "52",
  "ingredients": "1 cup masa harina (instant corn masa mix); 1 cup all-purpose flour; 1 teaspoon salt; 1 tablespoon shortening; 1 cup hot water; 1 cup oil for frying",
  "directions": "1. In a large bowl, stir together the masa harina, salt and hot water. Gradually mix in the shortening and flour. If the dough seems dry, add a little more hot water. Form the dough into balls that will fit into the palm of your hand. 2. Line a work surface with waxed paper or plastic. Sprinkle with water. Flatten balls on the wet surface until about 1/4 inch thick. 3. Heat a griddle or comal over medium heat. Cook the gorditas on each side until they are cooked through. 4. Heat oil in a large heavy skillet over medium to medium-high heat until hot. Fry each gordita until puffed, pressing it down into the oil occasionally with a spatula. Drain briefly on paper towels, cut the tips off and stuff full of your favorite foods.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "197"
},
{
  "url": "https://www.allrecipes.com/recipe/74817/crispy-coated-cajun-fries/",
  "name": "Crispy Coated Cajun Fries",
  "rating": "4.2",
  "ratingcount": "27",
  "ingredients": "2 pounds russet potatoes, cut into fries; 1 cup corn flour; 2 tablespoons cornmeal; 2 tablespoons Cajun seasoning; 1 quart oil for deep frying; salt to taste",
  "directions": "1. Place cut potatoes into a large bowl of cold water. Soak for 10 minutes. In a large resealable plastic bag, combine the corn flour, corn meal, and Cajun seasoning. Shake the bag to blend. Drain the potatoes, but leave them wet. Place the fries in the plastic bag with the seasoning, and shake to coat. 2. Heat the oil in a deep-fryer to 375 degrees F (190 degrees C). 3. Cook fries in hot oil for 7 to 10 minutes, or until golden brown. Remove from the fryer to paper towels to drain. Season with a small amount of salt.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "342"
},
{
  "url": "https://www.allrecipes.com/recipe/184197/new-mexico-green-chile-stew/",
  "name": "New Mexico Green Chile Stew",
  "rating": "4.5",
  "ratingcount": "35",
  "ingredients": "1 pound beef tenderloin, cubed; 1 pound boneless pork loin, cubed; ¼ cup masa harina; 1 tablespoon olive oil; 1  red onion, chopped; 3 cups chopped fresh tomatoes; 2 cups diced green chile peppers; 2 cups low-sodium beef broth; 1 tablespoon ground cumin; 1 large potato, cubed; 3 cloves garlic, minced; 2 teaspoons chopped fresh oregano; 2 teaspoons chopped fresh cilantro; 1 dash cayenne pepper (Optional); salt to taste; ground white pepper to taste",
  "directions": "1. Place the beef tenderloin cubes, pork loin cubes, and masa harina in a plastic bag, and shake to coat the meat. Heat the olive oil in a large skillet over medium-high heat, and cook and stir the meat cubes until evenly browned, about 10 minutes. 2. Place the meat, red onion, tomatoes, green chile peppers, beef broth, cumin, potato, garlic, oregano, cilantro, cayenne pepper, salt and white pepper in a slow cooker. Cook on Low until the meat is tender, about 8 hours.",
  "prep": "30 mins",
  "cook": "8 hrs 15 mins",
  "total": "8 hrs 45 mins",
  "calories": "295"
},
{
  "url": "https://www.allrecipes.com/recipe/17500/corn-tortillas/",
  "name": "Homemade Corn Tortillas",
  "rating": "4.4",
  "ratingcount": "188",
  "ingredients": "1 ¾ cups masa harina; 1 ⅛ cups hot water",
  "directions": "1. Mix together masa harina and hot water in a medium bowl until thoroughly combined. Transfer dough to a clean work surface and knead until pliable and smooth. If dough is too sticky, add more masa harina; if it begins to dry, sprinkle with water. Cover dough tightly with plastic wrap and allow to sit at room temperature for 30 minutes. 2. Preheat a cast iron skillet or griddle over medium-high heat. 3. Divide dough into 15 equal-sized balls. Using a tortilla press, a rolling pin, or your hands, press each ball flat between 2 sheets of plastic wrap. 4. Cook a tortilla in the preheated pan until browned and slightly puffy, about 30 seconds. Flip tortilla over and continue cooking until the other side is browned, about 30 more seconds. Remove to a plate; cover to keep warm and moist. Repeat with remaining tortillas.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "1 hr 5 mins",
  "calories": "146"
},
{
  "url": "https://www.allrecipes.com/recipe/85905/restaurant-style-taco-meat-seasoning/",
  "name": "Restaurant-Style Taco Meat Seasoning",
  "rating": "4.6",
  "ratingcount": "299",
  "ingredients": "1 ½ tablespoons corn flour; 4 ½ teaspoons chili powder; ½ teaspoon onion powder; ½ teaspoon garlic powder; ½ teaspoon seasoned salt; ½ teaspoon paprika; ¼ teaspoon cumin; ½ teaspoon garlic salt; ¼ teaspoon sugar; 1 teaspoon dried minced onion; ½ teaspoon beef bouillon granules; ¼ teaspoon ground red pepper; 1 ⅓ pounds lean ground chuck; 1 cup water",
  "directions": "1. In a medium bowl, combine the corn flour, chili powder, onion powder, garlic powder, and seasoned salt. Stir in the paprika, cumin, garlic salt, and sugar. Blend in the onion, bouillon, and ground red pepper, stirring until all spices are well blended. 2. Crumble the ground chuck into a large skillet over medium heat. Cook, stirring, until browned. Remove from heat, rinse meat with hot water, and drain water and grease from beef. 3. Return meat to skillet, and pour in seasoning. Stir in water. Reduce heat to medium-low, and simmer until most of the liquid has cooked away, about 20 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "164"
},
{
  "url": "https://www.allrecipes.com/recipe/272374/slow-cooker-chicken-massaman-curry/",
  "name": "Slow Cooker Chicken Massaman Curry",
  "rating": "4.1",
  "ratingcount": "10",
  "ingredients": "2 tablespoons olive oil, divided; 3 pounds boneless, skinless chicken thighs, cut into bite-size pieces; 6  red potatoes, peeled and cubed; 2 cups carrots, cut into bite-size chunks; 1 cup mixed red, yellow, and orange bell peppers, cut into bite-sized chunks (Optional); 2  onions, cut into chunks; 4 tablespoons Thai red curry paste (such as Maesri Masaman Curry®); 1 tablespoon fresh ginger paste (such as Gourmet Garden™); 2 teaspoons lemongrass paste (such as Gourmet Garden™); 2 (14 ounce) cans coconut milk, divided; 2 cups chicken stock, such as (Kitchen Basics®); ¼ cup peanut butter; 4 tablespoons lemon juice; 3 tablespoons fish sauce, or more to taste; 2 tablespoons brown sugar, or more to taste; 1 cup dry roasted peanuts, chopped, divided; 6 cups cooked jasmine rice",
  "directions": "1. Heat 1 tablespoon olive oil over medium-high heat in a large, heavy-bottomed skillet. Add chicken pieces in batches, cooking until golden brown, 3 to 4 minutes per side. Place browned chicken in the bottom of a slow cooker. Place potatoes, carrots, and bell peppers on top of the meat in the slow cooker. 2. Heat remaining 1 tablespoon olive oil in the skillet and add onion. Cook until soft and translucent, 3 to 4 minutes. Add to slow cooker. Add red curry paste, ginger paste, and lemongrass paste to the skillet and saute until fragrant, about 1 minute. Pour in 1 can coconut milk; reduce heat to medium-low and let simmer until reduced by half, about 10 minutes. 3. Whisk in remaining 1 can coconut milk, chicken broth, and peanut butter. Bring to a boil, reduce heat to low, and simmer until liquid begins to thicken, about 5 minutes. Pour sauce over ingredients in the slow cooker; stir gently to combine. 4. Set slow cooker to Low and cook until vegetables are tender and chicken is no longer pink in the center and juices run clear, 4 to 6 hours. 5. 20 minutes before serving season with lemon juice, fish sauce, and brown sugar. Stir in 1/2 cup of chopped peanuts. Serve with hot cooked rice and sprinkle with remaining 1/2 cup of peanuts.",
  "prep": "30 mins",
  "cook": "4 hrs 40 mins",
  "total": "5 hrs 10 mins",
  "calories": "841"
},
{
  "url": "https://www.allrecipes.com/recipe/134083/mexican-atole/",
  "name": "Mexican Atole",
  "rating": "4.0",
  "ratingcount": "40",
  "ingredients": "½ cup masa (corn flour); 5 cups water; 1 tablespoon ground cinnamon; 5 tablespoons piloncillo, brown sugar cones; 1 tablespoon vanilla extract",
  "directions": "1. Place the masa, water, cinnamon and piloncillo in a blender. Blend until smooth, about 3 minutes. 2. Pour the contents of the blender into a sauce pan and bring the mixture to boil over medium heat, stirring constantly. When the mixture reaches a boil, turn the heat to low and continue to whisk for 5 minutes. 3. Remove the pan from the heat and stir in the vanilla. Pour into mugs and serve hot.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "68"
},
{
  "url": "https://www.allrecipes.com/recipe/257631/basic-cheese-pupusas/",
  "name": "Basic Cheese Pupusas",
  "rating": "4.7",
  "ratingcount": "7",
  "ingredients": "2 cups shredded green cabbage; ½ cup apple cider vinegar; ½ cup water, or more as needed; ½  onion, thinly sliced; 1  carrot, grated; ¼ teaspoon ground oregano; ¼ teaspoon red pepper flakes; salt to taste; 3 cups masa harina flour (Mexican corn masa mix); 1 ½ cups water, or more as needed; ½ teaspoon salt; 1 cup ricotta cheese; 1 cup shredded mozzarella cheese; 2 tablespoons heavy whipping cream, or more to taste; 1  scallion, finely chopped, or more to taste; cooking spray",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add cabbage and cook uncovered until slightly softened, about 3 minutes. Drain in a colander and immediately immerse in ice water for several minutes to stop the cooking process. Drain. 2. Mix cabbage, apple cider vinegar, water, onion, carrot, oregano, red pepper flakes, and 1 pinch salt together in a large bowl. Refrigerate until flavors combine, 8 hours to overnight. 3. Combine masa harina, water, and 1/2 teaspoon salt together in a large bowl; knead until a smooth, moist dough forms. Add water if dough cracks when you press down on it. Let dough rest, 5 to 10 minutes. 4. Stir ricotta cheese, mozzarella cheese, heavy cream, and scallion together in a bowl to make a paste. 5. Divide dough into 8 balls. Press your thumb into the center of each ball to form an indentation. Fill indentations with ricotta cheese paste. Pinch edges together around the filling; flatten and smooth into round 1/4 inch-thick patties between your palms. 6. Grease a skillet with cooking spray; preheat over medium heat. Cook pupusas in batches until browned, 2 to 3 minutes per side. 7. Drain cabbage mixture and serve alongside pupusas.",
  "prep": "40 mins",
  "cook": "12 mins",
  "total": "8 hrs 57 mins",
  "calories": "197"
},
{
  "url": "https://www.allrecipes.com/recipe/241841/captain-crunch-and-cornmeal-shrimp/",
  "name": "Captain Crunch and Cornmeal Shrimp",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "⅔ cup beer; ½ cup masa flour; 1  egg; 2 tablespoons white sugar (Optional); 1 ½ teaspoons baking powder; 1 ½ cups sweetened corn-based cereal (such as Cap'N Crunch®), crushed; ½ cup cornmeal; 24  shrimp; 3 cups oil for frying; ½ cup marmalade; 2 tablespoons deli-style Dijon mustard",
  "directions": "1. Line a baking sheet with waxed paper. 2. Whisk beer, masa flour, egg, sugar, and baking powder together in a bowl until beer batter is smooth. Place crushed cereal in a shallow bowl and cornmeal in a third shallow bowl. 3. Dredge shrimp through cornmeal, holding shrimp by the tail; shake off excess cornmeal. Dip shrimp in beer batter, allowing excess to drip back into batter. Roll shrimp in the crushed cereal until evenly coated. Arrange coated shrimp on the prepared baking sheet and freeze for 15 minutes. 4. Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). 5. Working in batches, fry shrimp in the hot oil, turning once, until golden brown, 2 to 3 minutes. Transfer cooked shrimp to a paper towel-lined plate using tongs. 6. Stir marmalade and mustard together in a bowl until sauce is smooth. Serve cooked shrimp alongside dipping sauce.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "329"
},
{
  "url": "https://www.allrecipes.com/recipe/261633/tamales-de-puerco-red-pork-tamales/",
  "name": "Tamales de Puerco (Red Pork Tamales)",
  "rating": "4.3",
  "ratingcount": "6",
  "ingredients": "1 ½ pounds boneless pork shoulder, trimmed; ½  onion; 4 cloves garlic, minced; 2  bay leaves; salt to taste; water to cover; corn husks; 1 pound Roma tomatoes; 4  dried chile de arbol peppers; 4 small guajillo chile peppers, stemmed and seeded; 1 tablespoon cornstarch; 1 ¼ cups lard; 4 ½ cups fresh corn masa dough; 1 tablespoon salt; 1 tablespoon baking powder",
  "directions": "1. Cut pork into 3 chunks and place in a large saucepan. Add onion, garlic, bay leaves, and salt and cover with water. Bring to a boil; skim foam from surface. Reduce heat, cover, and simmer for 1 hour. Remove pork and let cool. Strain broth and reserve. 2. Bring a pot of water to a boil while pork is cooking. Add tomatoes, arbol chiles, and guajillo chiles, and boil until chiles are soft, about 5 minutes. Remove with a slotted spoon, reserving cooking water, and allow to cool. 3. Place corn husks in a bowl, cover with boiling water, and soak for 30 to 60 minutes. Drain, place on a work surface, and cover with a clean, damp towel. 4. Combine tomatoes, 1/2 cup cooking water, chiles de arbol, guajillo chiles, and cornstarch in a blender; blend until smooth. Strain tomato sauce through a fine-mesh sieve. 5. Beat lard with an electric mixer in a large bowl until fluffy. Combine masa, 1 cup reserved pork broth, 1 tablespoon salt, and baking powder in a separate bowl and mix until smooth. Add masa mixture to lard and mix until it has a smooth cookie dough consistency. Test if the masa is ready by dropping a small ball of masa into a glass of cold water; if it floats, it's ready, if not, keep beating for a little longer. 6. Shred cooled pork with 2 forks. 7. Select 1 wide corn husk or 2 small ones. Spread about 2 tablespoons masa mixture onto the the corn husk, filling it up to 2 inches from the bottom and 1/4 inch from the top. Add 1 tablespoon of the tomato sauce and pork down the center of the masa mixture. Fold sides of husk together, 1 over the other. Fold the bottom of the husk over the seam of the 2 folded sides. Repeat with remaining husks. 8. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add tamales with the open side up and cook until filling is heated through and separates from the husk, about 1 hour. Let tamales rest for 15 minutes before serving.",
  "prep": "30 mins",
  "cook": "2 hrs",
  "total": "2 hrs 45 mins",
  "calories": "344"
},
{
  "url": "https://www.allrecipes.com/recipe/261684/red-chicken-tamales-tamales-rojos-de-pollo/",
  "name": "Tamales Rojos de Pollo (Red Chicken Tamales)",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "corn husks; 1 ¼ pounds skinless, boneless chicken breast halves; 1 pinch salt to taste; 1 cup mulato chiles, stemmed and seeded; ⅓ cup ancho chiles, stemmed and seeded; 1 clove garlic; 8  cumin seeds; boiling water as needed; ½ pound lard; 1 pound masa harina; 3 cups chicken broth, or as needed; 1 ½ teaspoons baking powder; 1 ½ teaspoons salt",
  "directions": "1. Place corn husks in a bowl, cover with boiling water, and soak for a few hours. Drain, place on a work surface, and cover with a clean, damp towel. 2. Place chicken in a pot, season with salt, and cover with water. Bring to a boil over medium-high heat, reduce heat, cover, and simmer until chicken is cooked through, 20 to 25 minutes. Drain chicken and shred with 2 forks. 3. Heat a griddle over medium heat and toast mulato and ancho chiles until fragrant, 3 to 5 minutes. Place in a bowl and cover with boiling water. Soak until soft, about 25 minutes. Combine ancho and mulato chiles, garlic, cumin seeds, and about 1/2 cup of the soaking water in a blender; blend until a thick, smooth, mole-like sauce forms, adding more water if necessary. 4. Heat 1 tablespoon lard in a saucepan over medium heat and add the sauce; cook for 3 to 5 minutes. Add shredded chicken and cook until flavors are combined and chicken is heated through, about 5 minutes. 5. Place remaining lard in a large bowl; beat with an electric mixer until creamy. Add masa harina, chicken broth, baking powder, and 1 1/2 teaspoon salt, and beat until all ingredients are well combined. Test if the masa is ready by dropping a small ball of masa into a glass of cold water; if it floats, it's ready, if not, keep working the dough a little longer. 6. Select 1 wide corn husk. Spread about 2 tablespoons masa mixture onto the the corn husk, filling it up to 2 inches from the bottom and 1/4 inch from the top. Add 1 tablespoon of the chicken filling in the center of the masa mixture. Fold sides of husk together, one over the other. Fold the bottom of the husk over the seam of the 2 folded sides. Repeat with remaining husks. 7. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add tamales with the open side up and cook until filling is heated through and separates from the husk, about 1 hour. Let tamales rest for 15 minutes before serving.",
  "prep": "1 hr",
  "cook": "1 hr 20 mins",
  "total": "4 hrs 35 mins",
  "calories": "131"
},
{
  "url": "https://www.allrecipes.com/recipe/34759/beef-tamales/",
  "name": "Beef Tamales",
  "rating": "4.5",
  "ratingcount": "197",
  "ingredients": "4 pounds boneless chuck roast; 4 cloves garlic; 3 (8 ounce) packages dried corn husks; 4  dried ancho chiles; 2 tablespoons vegetable oil; 2 tablespoons all-purpose flour; 1 cup beef broth; 2 cloves garlic, minced; 2 teaspoons chopped fresh oregano; 1 teaspoon cumin seeds; 1 teaspoon ground cumin; 1 teaspoon red pepper flakes; 1 teaspoon white vinegar; salt to taste; 3 cups lard; 1 tablespoon salt; 9 cups masa harina",
  "directions": "1. Place beef and garlic in a large pot. Cover with cold water and bring to a boil over high heat; reduce heat, cover, and simmer until beef is tender and shreds easily, about 3 1/2 hours. Remove beef from pot, reserving 5 cups cooking liquid and discarding garlic. Allow meat to cool slightly; shred finely with forks. 2. Meanwhile, place corn husks in a large container and cover with warm water; soak, weighed down with an inverted plate and a heavy can, until soft and pliable, about 3 hours. 3. Toast ancho chiles in a cast iron skillet; cool, then remove stems and seeds. Crumble and grind in a clean coffee grinder or with a mortar and pestle. 4. Heat oil in a large skillet; stir in flour and allow to brown slightly. Pour in 1 cup beef broth and stir until smooth. Mix in ground chiles, garlic, oregano, cumin seeds, ground cumin, red pepper flakes, vinegar, and salt. Stir shredded beef into skillet and cover. Let simmer for 45 minutes. 5. Place lard and salt in a large mixing bowl; beat with an electric mixer on high speed until fluffy. Add masa harina and beat at low speed until well mixed. Pour in reserved cooking liquid, a little at a time, until mixture is the consistency of soft cookie dough. 6. Drain water from corn husks. One at a time, flatten out each husk, with the narrow end facing you, and spread approximately 2 tablespoons masa mixture onto the top 2/3 of the husk. Spread about 1 tablespoon of meat mixture down the middle of the masa. Roll up the corn husk starting at one of the long sides. Fold the narrow end of the husk onto the rolled tamale and tie with a piece of butchers' twine. 7. Place tamales in a steamer basket. Steam over boiling water for approximately one hour, until masa is firm and holds its shape, adding more water if needed so the steamer does not boil dry. Serve immediately, allowing each person to unwrap their own tamales.",
  "prep": "30 mins",
  "cook": "4 hrs 30 mins",
  "total": "5 hrs",
  "calories": "347"
},
{
  "url": "https://www.allrecipes.com/recipe/235756/easy-mexican-sopes/",
  "name": "Easy Mexican Sopes",
  "rating": "4.8",
  "ratingcount": "20",
  "ingredients": "3 cups masa harina; 1 tablespoon salt; 2 cups warm water, or as needed; 1 quart oil for frying",
  "directions": "1. Whisk masa harina and salt together in a bowl. Stir in enough water until dough is smooth and holds together. 2. Form dough into twelve 2-inch balls. Place balls onto parchment paper and flatten to 1/2-inch thick circles. 3. Heat oil in a deep fryer or large saucepan to 400 degrees F (200 degrees C). 4. Working in batches, fry a few sopes at a time until lightly browned, about 30 seconds per side. Transfer with tongs to a paper towel-lined plate and let cool just until they can be handled, 2 to 3 minutes. Pinch the edges of each sope together to form a little boat. 5. Return sopes to the hot oil and fry until golden and cooked through, 1 to 2 more minutes. Drain on paper towels.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "169"
},
{
  "url": "https://www.allrecipes.com/recipe/261636/green-chicken-tamales/",
  "name": "Green Chicken Tamales",
  "rating": "4.0",
  "ratingcount": "7",
  "ingredients": "corn husks; 1 pound skinless, boneless chicken breast halves; salt to taste; water to cover; ¾ pound fresh tomatillos, husks removed; 2  serrano peppers, or more to taste; 1  onion, chopped; 3 tablespoons chopped fresh cilantro; 1 clove garlic, minced; 1 cup unsalted butter, softened, divided; 3 cups chicken broth; 1 pound masa harina; 1 ½ teaspoons baking powder; 1 ½ teaspoons salt",
  "directions": "1. Place corn husks in a bowl, cover with boiling water, and soak for 30 to 60 minutes. Drain, place on a work surface, and cover with a clean, damp towel. 2. Place chicken in a pot, season with salt, and cover with water. Bring to a boil over medium-high heat, reduce heat, cover, and simmer until chicken is cooked through, 20 to 25 minutes. Drain chicken and shred with 2 forks. 3. Place tomatillo and serrano peppers in a pot while chicken is cooking, cover with water, and bring to a boil. Cook until tomatillos are soft and have changed color, but are not falling apart, 3 to 5 minutes. 4. Combine tomatillos, serrano peppers, onion, cilantro, and garlic in a blender; blend into a smooth sauce. 5. Heat 1 tablespoon butter in a saucepan over medium heat and add tomatillo sauce. Cook until sauce has slightly thickened, 3 to 5 minutes. Add shredded chicken and season filling with salt. 6. Beat remaining butter in a large bowl with an electric mixer until creamy. Add chicken broth, masa harina, baking powder, and 1 1/2 teaspoons salt and beat well until combined and the consistency of cookie dough. Test if the masa is ready by dropping a small ball of masa into a glass of cold water; if it floats, it's ready, if not, keep beating for a little longer. 7. Select 1 wide corn husk or 2 small ones. Spread about 2 tablespoons masa mixture onto the the corn husk, filling it up to 2 inches from the bottom and 1/4 inch from the top. Add 1 tablespoon of filling down the center of the masa mixture. Fold sides of husk together, one over the other. Fold the bottom of the husk over the seam of the 2 folded sides. Repeat with remaining husks. 8. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add tamales with the open side up and cook until filling is heated through and separates from the husk, about 1 hour. Let tamales stand for 15 minutes before serving.",
  "prep": "45 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs 30 mins",
  "calories": "115"
},
{
  "url": "https://www.allrecipes.com/recipe/86915/daddys-if-theyda-had-this-at-the-alamo-we-wouldha-won-texas-chili/",
  "name": "Daddy's 'If They'da had This at the Alamo we would'ha WON!' Texas Chili",
  "rating": "4.6",
  "ratingcount": "108",
  "ingredients": "3 tablespoons bacon drippings; 2 large onions, chopped; 8 pounds beef stew meat, or coarse ground chili beef; 5 cloves garlic, finely chopped; 4 tablespoons ground red chile pepper; 4 tablespoons mild chili powder; 1 tablespoon ground cumin; ¼ cup sweet Hungarian paprika; 1 teaspoon dried Mexican oregano; 3 (10 ounce) cans tomato sauce; 1 (6 ounce) can tomato paste; 3 cups water; 2 tablespoons salt; ¼ cup dried parsley (Optional); 1  fresh jalapeno peppers; 1 cup masa harina flour",
  "directions": "1. Melt the bacon drippings in a large heavy pot over medium heat. Add the onions and cook until they are translucent. 2. Combine the beef with the garlic, ground chile, chili powder and cumin. Add this meat-and-spices to the onions in the pot. Break up any meat that sticks together as you cook, stirring occasionally, about 30 minutes, until meat is evenly browned (very browned, not just gray). Sprinkle in Hungarian paprika and oregano. 3. Pour in the tomato sauce, tomato paste, water, salt, parsley and jalapeno. Bring to a boil, then lower the heat and simmer, uncovered, for 1 hour. NOTE: True Texans DO NOT add beans to their chili, but my husband loves them, so this is the point where you can add as many cans of drained and rinsed pinto beans as you wish (I add 2 cans, but shhhhhh don't tell my Daddy!!!). 4. During cooking you may squeeze the jalapeno as it softens against the sides of the pot to release more heat if desired. 5. Mix in the masa harina, and cook while stirring for 30 minutes longer, or until desired consistency is achieved. Taste and adjust seasonings.",
  "prep": "30 mins",
  "cook": "2 hrs",
  "total": "2 hrs 30 mins",
  "calories": "512"
},
{
  "url": "https://www.allrecipes.com/recipe/233363/deep-fried-candy-bars/",
  "name": "Deep Fried Candy Bars",
  "rating": "4.2",
  "ratingcount": "6",
  "ingredients": "2 cups all-purpose flour; 1 cup corn flour; ⅛ teaspoon baking soda; 2 cups milk, or as needed; 1 cup vegetable oil for frying; 2  chilled full-size chocolate-covered, nougat-filled candy bars (such as Snickers®)",
  "directions": "1. Mix all-purpose flour, corn flour, and baking soda in a shallow bowl. Stir enough milk into the flour mixture to make a somewhat-thin batter that will stick to the candy bars, but not drip off. 2. Heat oil in a deep-fryer or deep skillet to 350 degrees F (175 degrees C). 3. Dip the candy bars in the batter to coat. 4. Carefully put coated candy bar into hot oil and fry until golden brown, 2 to 3 minutes.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "1004"
},
{
  "url": "https://www.allrecipes.com/recipe/21097/sweet-corn-cakes/",
  "name": "Sweet Corn Cakes",
  "rating": "4.6",
  "ratingcount": "73",
  "ingredients": "½ cup butter, softened; ⅓ cup masa harina; ¼ cup water; 1 ½ cups frozen corn kernels, thawed; ¼ cup cornmeal; ⅓ cup white sugar; 2 tablespoons heavy cream; ¼ teaspoon salt; ½ teaspoon baking powder",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. In a medium bowl, beat butter with an electric mixer until creamy. Beat in the masa harina and water until well combined. 3. Put the corn in a blender or food processor and coarsely chop on low speed. Stir the corn and the cornmeal into the butter mixture. In another bowl, mix together the sugar, cream, salt and baking powder. Combine the two mixtures until well blended. Pour the batter into an ungreased 8x8 pan. 4. Cover the pan with foil and place into a 9x13 inch pan filled 3/4 inch high with hot water. Bake in preheated oven for 50 to 60 minutes, until a toothpick inserted into center of the cake comes out clean. Remove small pan from water and let sit for 10 minutes before serving.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "207"
},
{
  "url": "https://www.allrecipes.com/recipe/261685/tamales-oaxaquenos-oaxacan-style-tamales/",
  "name": "Tamales Oaxaqueños (Oaxacan-Style Tamales)",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "11 ounces lard, divided; salt to taste; 9 cups masa harina; 1 cup warm chicken broth, divided; 3  fresh tomatillos, husks removed; 1  ancho chile pepper - stems, seeds, and veins removed; 1  mulato chile pepper - stems, seeds, and veins removed; 1 clove garlic, minced; 1 pinch freshly ground black pepper, or to taste; 1 pinch crushed dried oregano; 1 pound shredded cooked chicken; 36  banana leaves, softened",
  "directions": "1. Beat 9 ounces lard in a large bowl with an electric mixer until creamy. Add salt and continue beating for a few minutes. Add masa harina and beat well until combined. Add chicken broth, 1/4 cup at a time, beating until masa has a smooth and workable consistency similar to cookie dough, about 3/4 cup total. Test if the masa is ready by dropping a small ball of masa into a glass of cold water; if it floats, it's ready, if not, beat the dough a little longer. 2. Combine tomatillos, ancho chile pepper, mulato chile pepper, garlic, salt, pepper, and oregano in a blender; blend until smooth. 3. Heat remaining 2 ounces lard in a skillet and cook tomatillo sauce until lightly thickened, 3 to 5 minutes. Add shredded chicken and a little of the remaining chicken broth. Cook over low heat until chicken filling has thickened, about 10 minutes. 4. Spread 2 to 3 tablespoons masa mixture onto 1 banana leaf, filling it up to 2 inches from the bottom and 1/4 inch from the top. Add 1 tablespoon of the chicken filling in the center of the masa mixture. Fold sides of banana leaf together, one over the other. Fold the bottom of the banana leaf over the seam of the 2 folded sides and tie together with kitchen string. Repeat with remaining banana leaves. 5. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add tamales with the open side up and cook until filling is heated through and separates from the leaf, 1 hour 30 minutes to 2 hours. Let tamales rest for 15 minutes before serving.",
  "prep": "1 hr",
  "cook": "1 hr 45 mins",
  "total": "3 hrs",
  "calories": "210"
},
{
  "url": "https://www.allrecipes.com/recipe/222502/homemade-beef-tamales/",
  "name": "Homemade Beef Tamales",
  "rating": "3.8",
  "ratingcount": "6",
  "ingredients": "5 pounds ground beef; 1 (4 ounce) can chopped roasted green chile peppers; 5 teaspoons hot pepper sauce (such as Cholula®); 1 tablespoon kosher salt; 4 cloves garlic, pressed, divided; 1 tablespoon minced white onion; 2 teaspoons ground black pepper; 1 teaspoon ground cayenne pepper; 1 (2 pound) package yellow masa flour; 2 tablespoons lard; 1 teaspoon baking powder; 2 cups water, divided; 50 dried corn husks; 8 ounces grated Chihuaua cheese, or to taste; 5 tablespoons chili powder",
  "directions": "1. Heat a large cast-iron skillet over medium heat. Add beef, green chiles, hot sauce, salt, 3 cloves garlic, onion, black pepper, and cayenne pepper. Cook and stir until beef is thoroughly browned, 10 to 15 minutes. Drain and reserve the drippings. 2. Combine reserved drippings, masa, lard, and baking powder in a large bowl. Mix well. Add up to 1 cup water, 1 teaspoon at a time, until mixture is as thick as biscuit dough. Divide into 50 equal balls. Place dough balls between 2 cutting boards each lined with a sheet of waxed paper; flatten into circles. 3. Place each dough circle into a corn husk. Spoon about 3 tablespoons beef mixture in a line across the middle of each husk. Top with a small amount of cheese. Fold opposing sides of the tortilla to overlap the filling. Roll the husk around the tamale and fold in one end. 4. Combine the remaining 1 clove garlic, 1 cup water, and chili powder in a small saucepan over medium-high heat. Bring chili sauce to a boil. Remove from heat. 5. Stand a batch of the tamales, folded ends-down, in a steamer basket on top of a double boiler over simmering water. Bring water to a boil; cover and steam for 20 minutes. Remove tamales from heat; remove husks and top tamales with the chili sauce. Repeat with remaining tamales.",
  "prep": "1 hr",
  "cook": "40 mins",
  "total": "1 hr 40 mins",
  "calories": "375"
},
{
  "url": "https://www.allrecipes.com/recipe/262059/cachapas-from-venezuela/",
  "name": "Cachapas from Venezuela",
  "rating": "2.3",
  "ratingcount": "4",
  "ingredients": "2 (15.25 ounce) cans whole kernel corn, drained; ¼ cup milk; 1  egg; ¼ cup masa harina; 2 tablespoons white sugar; ½ teaspoon salt; 4 tablespoons vegetable oil",
  "directions": "1. Blend corn, milk, egg, masa harina, sugar, and salt together in a blender until the mixture has the consistency of pancake batter. 2. Heat oil in a a large skillet over medium heat. Add enough batter to form the size of a taco shell, 4 to 5 inches around. Cook until golden brown, about 2 minutes per side. Repeat with remaining batter.",
  "prep": "5 mins",
  "cook": "4 mins",
  "total": "9 mins",
  "calories": "246"
},
{
  "url": "https://www.allrecipes.com/recipe/222496/honduran-tamales/",
  "name": "Honduran Tamales",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "1 (4 pound) package masa harina (such as Maseca®), divided; 1 large tomato, chopped; 1 large green bell pepper, chopped; 1 large onion, chopped; 1 cup chopped fresh cilantro; ¼ cup ground cumin; 2 cubes  chicken bouillon; salt to taste; 1 (6 ounce) can tomato paste; 3 cups vegetable oil, or to taste; 30  banana leaves; 3 ½ pounds cubed cooked pork; 3 large potatoes, peeled and cubed; 2 cups cooked white rice; 1 (15 ounce) can peas, drained; kitchen twine",
  "directions": "1. Pour about 3/4 of the masa harina into a large pot. Add water in batches, mixing until a moderately thin batter forms. 2. Combine tomato, bell pepper, onion, cilantro, cumin, and bouillon in a blender. Blend until smooth. Pour into the pot with the batter and season with salt. Pour about 5 cups of this combined mixture into a smaller pot; add tomato paste and stir until it is an even red color. 3. Pour 2 cups oil into the large pot of batter; pour remaining 1 cup oil into the smaller pot of red batter. Bring both pots to a boil, stirring continuously to prevent burning. Cook until flavors set, 3 to 5 minutes more. Remove from heat. 4. Cut banana leaves into 12x15-inch rectangles. Spoon 1 cup regular batter and 1/4 cup red batter into the center of each leaf. Add small amounts of pork, potatoes, rice, and peas. Fold leaf over the filling several times; fold sides in. Wrap twine around tamale to hold in place. 5. Place tamales in a large pot; cover halfway with water. Cover and cook over medium heat until filling has thickened, about 1 hour.",
  "prep": "1 hr 30 mins",
  "cook": "1 hr 10 mins",
  "total": "2 hrs 40 mins",
  "calories": "552"
},
{
  "url": "https://www.allrecipes.com/recipe/261683/sweet-tamales-with-pineapple-and-coconut/",
  "name": "Sweet Tamales with Pineapple and Coconut",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "corn husks; 2 pounds chopped fresh pineapple; 1 ½ cups water; 1 ¼ cups white sugar; 2 pounds fresh corn masa dough; 1 cup unsalted butter; 2 tablespoons baking powder; 1 cup grated coconut; ⅔ cup raisins",
  "directions": "1. Place corn husks in a bowl, cover with boiling water, and soak for about 3 hours. Drain, place on a work surface, and cover with a clean, damp towel. 2. Combine pineapple, water, and sugar in a saucepan and cook over medium heat until pineapple is very soft, 7 to 10 minutes. Drain. 3. Mix masa dough with butter and baking powder in a bowl until well combined. Add cooked pineapple, coconut, and raisins; knead into a smooth dough. 4. Select 1 wide corn husk or 2 small ones. Spread about 1 tablespoons masa mixture onto the corn husk, filling it up to 2 inches from the bottom and 1/4 inch from the top. Fold sides of husk together, one over the other. Fold the bottom of the husk over the seam of the 2 folded sides. Repeat with remaining husks. 5. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add tamales with the open side up and cook until filling is heated through and separates from the husk, about 45 minutes. Let tamales stand for 15 minutes before serving.",
  "prep": "25 mins",
  "cook": "55 mins",
  "total": "4 hrs 35 mins",
  "calories": "151"
},
{
  "url": "https://www.allrecipes.com/recipe/212913/beef-asado/",
  "name": "Beef Asado",
  "rating": "4.8",
  "ratingcount": "28",
  "ingredients": "1 (4 pound) beef chuck roast, quartered; salt and pepper to taste; 2 tablespoons cooking oil; 1  onion, diced; 2 cloves garlic, crushed; 2 large tomatoes, chopped; 1 tablespoon whole peppercorns, crushed; 1 (5 ounce) jar pitted Manzanilla olives; 1  onion, quartered; 2  bay leaves; 2  beef bouillon cubes; ½ cup ketchup; 1 large red bell pepper, sliced; 4 small potatoes, peeled and quartered; 1 tablespoon corn flour (Optional); 1 teaspoon water (Optional)",
  "directions": "1. Season the beef with salt and pepper; set aside. 2. Heat the oil in a skillet over medium heat; cook the diced onion and garlic in the hot oil until softened, about 5 minutes. Transfer the onion and garlic to a 6-quart pot. Individually brown the beef chunks on all sides in the skillet and place in the pot. Add the tomatoes, crushed peppercorns, olives with their juice, quartered onion, bay leaves, and bouillon cubes to the pot; bring to a boil. Stir the ketchup into the mixture, reduce heat to medium-low, and simmer 1 hour. 3. Remove the beef from the pot and set aside. Add the red bell pepper to the mixture and continue simmering another 30 minutes. 4. While the mixture continues to simmer, heat 2 tablespoons oil in the skillet. Cook the potatoes in the oil until golden brown; immediately add to the simmering mixture. 5. Slice the meat against the grain and add to the pot; stir. Cook together another 5 minutes before serving. If the sauce is too thin, mix the corn flour and water together and stir into the sauce to thicken.",
  "prep": "25 mins",
  "cook": "1 hr 40 mins",
  "total": "2 hrs 5 mins",
  "calories": "639"
},
{
  "url": "https://www.allrecipes.com/recipe/19004/chi-chis-corn-cake/",
  "name": "Chi Chi's Corn Cake",
  "rating": "4.5",
  "ratingcount": "59",
  "ingredients": "½ cup butter; ⅓ cup masa harina; ¼ cup water; 1 ½ cups whole kernel corn; ¼ cup cornmeal; ⅓ cup white sugar; 2 tablespoons heavy cream; ¼ teaspoon salt; ½ teaspoon baking powder",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. In a medium bowl, beat butter with electric mixer until creamy. Add masa harina and water and beat until well combined. 3. In food processor or blender, process corn in short pulses to coarsely chop. Leave several pieces of whole corn. Stir the processed corn and the cornmeal into the butter mixture. 4. In a separate bowl, stir together sugar, cream, salt and baking powder until well combined. Stir sugar mixture into butter mixture and pour all into a 9x9-inch baking dish. Cover with foil. 5. Line a roasting pan with a damp kitchen towel. Place baking dish on towel, inside roasting pan, and place roasting pan on oven rack. Fill roasting pan with boiling water to reach halfway up the sides of the baking dish. Bake 50 to 60 minutes, or until pick inserted in center comes out clean. Remove baking dish from water bath and let rest 10 minutes. Serve using ice cream scoop or large spoon.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "169"
}]