[{
  "url": "https://www.allrecipes.com/recipe/247247/mushroom-stew/",
  "name": "Mushroom Stew",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "½ ounce dried mushrooms (such as porcini); 1 cup hot water, or as needed; 2 tablespoons extra-virgin olive oil; 1  yellow onion, minced; 2 cloves garlic, minced; 1 tablespoon fresh thyme leaves; 1 pinch ground cloves; 2 pounds assorted fresh mushrooms, cut into bite size pieces; salt and ground black pepper to taste; 1 ½ pounds tomatoes - peeled, seeded, and chopped; 1 quart vegetable stock, or as needed; 8 ounces instant polenta; 4 teaspoons chopped fresh parsley, or as desired",
  "directions": "1. Place dried mushrooms in a small bowl with enough hot water to cover; let stand 20 minutes. Drain mushrooms; reserve liquid. 2. Heat oil in a large pot over medium-high heat; cook and stir onion until soft, about 5 minutes. Reduce heat to medium. Stir in garlic, thyme, and cloves; cook and stir 2 minutes more. Stir fresh mushrooms and soaked dried mushrooms into onion mixture; cook and stir until mushrooms are soft, about 10 minutes. Season with salt and pepper. 3. Stir tomatoes and reserved mushroom liquid into mushroom mixture; simmer over low heat until thickened, about 20 minutes. 4. Bring vegetable stock to a boil; whisk in polenta. Cook polenta, whisking constantly, until polenta is thick and stock is absorbed, about 5 minutes. Divide polenta into 4 bowls; ladle mushroom stew over polenta and garnish with fresh parsley.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 25 mins",
  "calories": "424"
},
{
  "url": "https://www.allrecipes.com/recipe/259353/black-eyed-pea-cornbread/",
  "name": "Black-Eyed Pea Cornbread",
  "rating": "5.0",
  "ratingcount": "5",
  "ingredients": "cooking spray; 1 pound bulk spicy breakfast sausage; 1  onion, chopped; 1 cup white cornmeal; ½ cup all-purpose flour; 1 teaspoon salt; ½ teaspoon baking soda; 1 cup buttermilk; ½ cup vegetable oil; 2  eggs, lightly beaten; 1 (15 ounce) can black-eyed peas, drained; 1 (8 ounce) package shredded Cheddar cheese; ¾ cup cream-style corn; 1 (4.5 ounce) can chopped green chile peppers; ¼ cup chopped pickled jalapeño peppers",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with cooking spray. 2. Cook sausage and onion in a large skillet over medium heat, stirring until sausage is crumbly and no longer pink, about 5 minutes. Drain on paper towels. 3. Mix cornmeal, flour, salt, and baking soda together in a large bowl. 4. Whisk buttermilk, oil, and eggs together in a small bowl. Add to cornmeal mixture, stirring just until moistened. Stir in sausage mixture, black-eyed peas, Cheddar cheese, corn, chile peppers, and jalapeños. Pour batter into the prepared baking dish. 5. Bake in the preheated oven until a toothpick inserted into center comes out clean, about 1 hour.",
  "prep": "15 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 20 mins",
  "calories": "377"
},
{
  "url": "https://www.allrecipes.com/recipe/221432/authentic-mexican-corn-bread/",
  "name": "Authentic Mexican Corn Bread",
  "rating": "4.3",
  "ratingcount": "46",
  "ingredients": "1 (14 ounce) can sweetened condensed milk (such as La Lechera®); ½ cup white sugar (Optional); 5  large eggs; 2 teaspoons vanilla extract; 2 (15.25 ounce) cans whole kernel corn, drained and rinsed; 1 (15 ounce) can cream-style corn; ½ cup butter, melted; 2 ½ cups cornmeal; ½ cup all-purpose flour; 1 tablespoon baking soda; 1 teaspoon salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 2-quart baking dish. 2. Whisk sweetened condensed milk and sugar together in a large bowl. Whisk in eggs, and vanilla. Stir in whole kernel corn, cream-style corn, and butter. 3. Whisk cornmeal, flour, baking soda, and salt in a separate bowl; stir cornmeal mixture into the corn mixture. 4. Pour batter into the prepared baking dish. 5. Bake until a toothpick inserted into the center of the cornbread comes out clean, about 45 minutes. Serve warm.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/280532/fresh-fried-largemouth-bass/",
  "name": "Fresh Fried Largemouth Bass",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "1 pound largemouth bass fillets, cut into bite-sized pieces; 2 tablespoons salt; vegetable oil for frying; ½ cup yellow cornmeal; ¼ cup all-purpose flour; 1 teaspoon seasoned salt; 1 teaspoon paprika; ½ teaspoon ground black pepper",
  "directions": "1. Place bass in a bowl. Add salt and cover with water. Cover and let sit for 30 minutes to draw out all blood. Rinse bass thoroughly to remove salt. Pat dry with paper towels. 2. Heat oil in a deep-fryer to 350 degrees F (175 degrees C). 3. Place cornmeal, flour, seasoned salt, paprika, and pepper in a gallon-sized resealable plastic bag. Zip and shake until evenly combined. 4. Drop 2 pieces of bass into the bag, zip, and shake to coat. Transfer to a plate. Repeat with remaining bass. 5. Fry bass in the preheated deep fryer for 3 minutes per batch. Transfer to a paper towel-lined plate. Serve immediately.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "45 mins",
  "calories": "419"
},
{
  "url": "https://www.allrecipes.com/recipe/18347/blueberry-cornmeal-muffins/",
  "name": "Blueberry Cornmeal Muffins",
  "rating": "4.4",
  "ratingcount": "243",
  "ingredients": "1 ¼ cups all-purpose flour; ½ cup cornmeal; ½ cup brown sugar; ½ teaspoon salt; 1 tablespoon baking powder; 1 cup milk; ½ cup butter, melted; 1  egg, beaten; 1 cup frozen blueberries",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Grease muffin cups or line with paper muffin liners. 2. Sift flour, cornmeal, brown sugar, salt and baking powder together into a large bowl. Dredge the blueberries in the sifted ingredients. In a small bowl, combine the milk, butter and egg. Stir the wet ingredients into the flour mixture just until moistened. Spoon batter into prepared muffin tins. 3. Bake in preheated oven for 20 minutes. Let muffins sit for 10 minutes before removing from the pan.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "180"
},
{
  "url": "https://www.allrecipes.com/recipe/230998/bacon-cheddar-jalapeno-cornbread/",
  "name": "Bacon Cheddar Jalapeño Cornbread",
  "rating": "4.7",
  "ratingcount": "30",
  "ingredients": "5 slices bacon; 3 cups all-purpose flour; 1 cup yellow cornmeal; ¼ cup white sugar; 2 tablespoons baking powder; 2 teaspoons kosher salt; 1 cup milk; 1 cup buttermilk; 1 cup unsalted butter, melted; 3 extra large eggs, lightly beaten; 1 (8 ounce) package shredded sharp Cheddar cheese; 3  jalapeno peppers, diced",
  "directions": "1. Fry bacon in a large cast iron skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer bacon to a paper towel-lined plate; reserve remaining bacon grease in the skillet. Crumble bacon. 2. Preheat the oven to 350 degrees F (175 degrees C). Place the skillet with bacon grease in the oven. 3. Combine flour, cornmeal, sugar, baking powder, and salt in a large bowl. Whisk milk, buttermilk, butter, and eggs in another bowl; stir milk mixture into flour mixture until just combined. Batter will be slightly lumpy. Fold in Cheddar cheese and jalapeño peppers. Allow batter to rest at room temperature for 10 minutes. 4. Pour batter into the hot skillet; sprinkle with crumbled bacon, gently pressing bacon into batter. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 35 minutes. Cool in the pan for 10 minutes before slicing.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "445"
},
{
  "url": "https://www.allrecipes.com/recipe/187199/blue-corn-cornbread/",
  "name": "Blue Corn Cornbread",
  "rating": "4.4",
  "ratingcount": "50",
  "ingredients": "1 cup blue cornmeal; 1 cup all-purpose flour; 5 teaspoons baking powder; ¼ cup white sugar; 1 pinch salt; 2  eggs, beaten; 1 cup milk; ½ cup butter",
  "directions": "1. Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x9 inch baking dish. 2. Mix cornmeal, flour, baking powder, sugar, and salt in a bowl. Sift 3 times. 3. Stir the eggs and milk into the cornmeal mixture. Place the butter in the prepared baking dish, and melt in the preheated oven. Mix hot, melted butter into the cornmeal mixture. Transfer cornmeal mixture to the prepared baking dish. 4. Bake on center rack in the preheated oven for 30 to 35 minutes, until the edges of the cornbread pull away from the sides of the dish, and a toothpick inserted into the center comes out clean. Let cool 10 minutes before cutting.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "141"
},
{
  "url": "https://www.allrecipes.com/recipe/244753/dads-homemade-corn-dogs/",
  "name": "Dad's Homemade Corn Dogs",
  "rating": "4.7",
  "ratingcount": "37",
  "ingredients": "1 cup yellow cornmeal; 1 cup all-purpose flour; ¼ cup white sugar; 4 teaspoons baking powder; ¼ teaspoon salt; ⅛ teaspoon ground black pepper; 1 cup cold whole milk; 1 large egg; 16  large hot dogs; 2 cups vegetable oil for frying, or as needed; 16  skewers",
  "directions": "1. Combine cornmeal, flour, sugar, baking powder, salt, and pepper in a bowl; stir in milk and egg until smooth. Cover and refrigerate until needed. 2. Bring a large pot of water to a boil. Cook hot dogs in boiling water until heated through, about 7 minutes. Remove to a paper towel-lined plate and let rest for 10 minutes. 3. Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Insert one skewer into each hot dog and blot dry if wet. Pour chilled batter into a tall drinking glass. 4. Dip one hot dog into batter until well coated; transfer to hot oil. Repeat with as many hot dogs as can comfortably fit in the fryer without overcrowding (one or two more). Fry until lightly browned, about 3 minutes. Drain on paper towels. Repeat to coat and fry remaining hot dogs.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "1 hr 5 mins",
  "calories": "660"
},
{
  "url": "https://www.allrecipes.com/recipe/236853/waffle-iron-cornbread/",
  "name": "Waffle Iron Cornbread",
  "rating": "4.4",
  "ratingcount": "20",
  "ingredients": "1 cup yellow cornmeal; ½ cup all-purpose flour; 1 teaspoon baking powder; ½ teaspoon baking soda; ½ teaspoon salt; ¼ teaspoon ground paprika; 1 ½ cups buttermilk; 3 tablespoons melted butter; 1  egg, slightly beaten",
  "directions": "1. Preheat and lightly grease a waffle iron according to the manufacturer's instructions. 2. Whisk cornmeal, flour, baking powder, baking soda, salt, and paprika together in a bowl. Stir buttermilk, butter, and egg together in a separate bowl; stir into flour mixture until batter is just blended. 3. Ladle 1/2 to 3/4 cup batter into the preheated waffle iron; cook waffle according to manufacturer's instructions until golden brown, about 5 minutes. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "316"
},
{
  "url": "https://www.allrecipes.com/recipe/16755/basic-corn-muffins/",
  "name": "Basic Corn Muffins",
  "rating": "4.5",
  "ratingcount": "873",
  "ingredients": "1 cup cornmeal; 1 cup all-purpose flour; ⅓ cup white sugar; 2 teaspoons baking powder; ½ teaspoon salt; 1  egg, beaten; ¼ cup canola oil; 1 cup milk",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Grease muffin pan or line with paper muffin liners. 2. In a large bowl, mix together corn meal, flour, sugar, baking powder and salt. 3. Add egg, oil and milk; stir gently to combine. 4. Spoon batter into prepared muffin cups. 5. Bake at 400 degrees F (200 degrees C) for 15 to 20 minutes, or until a toothpick inserted into a muffin comes out clean. 6. Enjoy!",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "154"
},
{
  "url": "https://www.allrecipes.com/recipe/76594/grandmothers-buttermilk-cornbread/",
  "name": "Grandmother's Buttermilk Cornbread",
  "rating": "4.8",
  "ratingcount": "7",
  "ingredients": "½ cup butter; ⅔ cup white sugar; 2 large eggs; 1 cup buttermilk; ½ teaspoon baking soda; 1 cup cornmeal; 1 cup all-purpose flour; ¼ teaspoon salt",
  "directions": "1. Preheat the oven to 375 degrees F (175 degrees C). Grease an 8-inch square pan. 2. Melt butter in a large skillet over medium heat. Remove from heat and stir in sugar. Quickly whisk in eggs. 3. Combine buttermilk and baking soda in a small bowl; whisk mixture into the skillet. Stir in cornmeal, flour, and salt until well-blended and only a few lumps remain. Pour batter into the prepared pan. 4. Bake in the preheated oven until a toothpick inserted in the center comes out clean, 30 to 40 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "284"
},
{
  "url": "https://www.allrecipes.com/recipe/17891/golden-sweet-cornbread/",
  "name": "Golden Sweet Cornbread",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1 cup all-purpose flour; 1 cup yellow cornmeal; ⅔ cup white sugar; 3 ½ teaspoons baking powder; 1 teaspoon salt; 1 cup milk; ⅓ cup vegetable oil; 1 large egg",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Lightly grease a 9-inch round cake pan. 2. Whisk flour, cornmeal, sugar, baking powder, and salt together in a large bowl. Add milk, vegetable oil, and egg; whisk until well combined. Pour batter into the prepared pan. 3. Bake in the preheated oven until a toothpick inserted into the center of the pan comes out clean, 20 to 25 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "189"
},
{
  "url": "https://www.allrecipes.com/recipe/282823/arepas-de-queso/",
  "name": "Arepas de Queso",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "1 (8 ounce) package low-moisture mozzarella cheese; 2 cups pre-cooked white cornmeal (such as P.A.N.®); 2 ½ cups warm water; 1 ½ teaspoons kosher salt, divided; ¼ cup canola oil, divided",
  "directions": "1. Shred 3 ounces of the mozzarella and cut remaining 5 ounces into 1/2-inch cubes. Transfer shredded cheese to a large bowl and cubed cheese to a medium bowl. 2. Add cornmeal, 1 teaspoon salt, and warm water to the shredded cheese and mix to combine. Set aside for 10 minutes to allow cornmeal to absorb liquid. The mixture should resemble soft Play-Doh. 3. Preheat the oven to 200 degrees F (95 degrees C). 4. With damp palms and fingers, place 1/4 cup arepa mixture into your palm and flatten into a 2 1/2-inch disk. Place 3 to 4 cubes of the mozzarella into the center. Gently fold edges of dough over to cover mozzarella cubes completely, patting to form a cake. Repeat until all dough and cheese has been used. 5. Heat 1 tablespoon oil in a large nonstick skillet over medium heat. Add 3 or 4 arepas and cook until both sides are golden brown and charred in spots, 4 to 5 minutes per side. Remove to a parchment-lined baking sheet and season with a pinch of the remaining salt. Place in the preheated oven to keep warm. Repeat with remaining oil, arepas, and salt.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "55 mins",
  "calories": "127"
},
{
  "url": "https://www.allrecipes.com/recipe/22176/fried-okra/",
  "name": "Fried Okra",
  "rating": "4.4",
  "ratingcount": "401",
  "ingredients": "10 pods okra, sliced in 1/4 inch pieces; 1  egg, beaten; 1 cup cornmeal; ¼ teaspoon salt; ¼ teaspoon ground black pepper; ½ cup vegetable oil",
  "directions": "1. In a small bowl, soak okra in egg for 5 to 10 minutes. 2. In a medium bowl, combine cornmeal, salt, and pepper. 3. Heat oil in a large skillet over medium-high heat. Dredge okra in the cornmeal mixture, coating evenly. 4. Carefully place okra in hot oil; stir continuously. Reduce heat to medium when okra first starts to brown, and cook until golden. Drain on paper towels. 5. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "394"
},
{
  "url": "https://www.allrecipes.com/recipe/262048/colombian-arepas/",
  "name": "Colombian Arepas",
  "rating": "4.6",
  "ratingcount": "12",
  "ingredients": "1 cup warm water; 1 cup pre-cooked white cornmeal (such as P.A.N.); 1 cup shredded mozzarella cheese; 1 tablespoon butter; ½ teaspoon salt, or to taste; cooking spray",
  "directions": "1. Mix water, cornmeal, mozzarella cheese, butter, and salt together in a large bowl. Knead until well combined and a soft dough forms. Form dough into balls the size of a medium orange. Place each ball between two sheets of plastic wrap and flatten with a rolling pin to the desired thickness. 2. Leaving plastic wrap in place, press the top edge of a cereal bowl or drinking glass into the surface of the dough to cut circles. Remove the plastic wrap and remove any excess dough scraps. 3. Spray a griddle with cooking spray and set over medium-high heat. Working in batches, cook arepas on the hot griddle until golden brown, about 5 minutes per side. Serve immediately.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "125"
},
{
  "url": "https://www.allrecipes.com/recipe/37865/cornmeal-coating/",
  "name": "Cornmeal Coating",
  "rating": "4.4",
  "ratingcount": "87",
  "ingredients": "½ cup milk; 1 tablespoon lemon juice; 4 (3 ounce) fillets cod; 1 cup oil for frying; ⅓ cup cornmeal; ⅓ cup all-purpose flour; 1 teaspoon paprika; ½ teaspoon ground black pepper; ½ teaspoon salt; ½ teaspoon garlic powder; ½ teaspoon dried thyme; ⅛ teaspoon cayenne pepper",
  "directions": "1. Combine milk and lemon juice in a medium bowl. Add cod fillets and soak for 5 minutes. 2. Heat oil in a deep saucepan over medium heat. 3. Mix cornmeal and flour together in a shallow bowl. Season with paprika, black pepper, salt, garlic powder, thyme, and cayenne pepper. Dredge cod fillets in cornmeal mixture to coat both sides. 4. Fry cod fillets in hot oil, until cooked through and golden brown, about 3 to 4 minutes per side. Transfer to a paper towel-lined plate to drain.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "219"
},
{
  "url": "https://www.allrecipes.com/recipe/146572/sweet-cornbread-cake/",
  "name": "Sweet Cornbread Cake",
  "rating": "4.8",
  "ratingcount": "876",
  "ingredients": "3 cups all-purpose flour; 1 ⅓ cups white sugar; 1 cup cornmeal; 2 tablespoons baking powder; 1 teaspoon salt; 2 ½ cups whole milk; 4  eggs, beaten; ⅔ cup vegetable oil; ⅓ cup melted butter; 2 tablespoons honey",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 3. Stir flour, sugar, cornmeal, baking powder, and salt together in a mixing bowl. Pour in milk, beaten eggs, vegetable oil, melted butter, and honey; stir just to moisten. 4. Pour batter into the prepared baking dish. 5. Bake in the preheated oven until golden brown and a toothpick inserted in the center comes out clean, about 45 minutes. 6. Enjoy!",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "55 mins",
  "calories": "461"
},
{
  "url": "https://www.allrecipes.com/recipe/279239/deep-fried-tilapia/",
  "name": "Deep-Fried Tilapia",
  "rating": "4.7",
  "ratingcount": "10",
  "ingredients": "10 (4 ounce) fillets tilapia; salt and ground black pepper to taste; ⅓ cup all-purpose flour; 1 cup buttermilk; 1 large egg; ½ cup all-purpose flour; ½ cup yellow cornmeal; 2 tablespoons seafood seasoning (such as Old Bay®); ½ teaspoon baking powder; ½ teaspoon baking soda; vegetable oil for frying",
  "directions": "1. Season fillets with salt and pepper. Dust fillets with 1/3 cup flour. 2. Beat buttermilk and egg in a bowl until combined. Stir together 1/2 cup flour, cornmeal, seafood seasoning, baking powder, and baking soda in another bowl. Dip flour-dusted fillets into egg mixture, then into seasoned flour mixture. 3. Heat oil over medium-high heat in a large frying pan or deep fryer to 350 degrees F (175 degrees C). 4. Working in batches, fry fillets in hot oil until golden, about 2 minutes per side. Transfer to a paper towel-lined plate to drain. Season immediately with salt after frying.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "214"
},
{
  "url": "https://www.allrecipes.com/recipe/267829/cast-iron-cornbread/",
  "name": "Cast Iron Cornbread",
  "rating": "4.4",
  "ratingcount": "58",
  "ingredients": "½ cup unsalted butter; 1 ½ cups buttermilk; 1 cup cornmeal; 2 large eggs; 3 tablespoons honey, or to taste; ½ teaspoon fine salt; 1 pinch cayenne pepper; 1 cup self-rising flour",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Melt butter in a cast iron skillet. Turn off the heat; set the skillet aside. 3. Whisk buttermilk, cornmeal, eggs, honey, salt, and cayenne pepper together in a large bowl. Add flour and 1/2 of the butter from the pan; whisk again. Pour batter over remaining butter in the skillet. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes. Let cool briefly before slicing.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "281"
},
{
  "url": "https://www.allrecipes.com/recipe/263247/breaded-pan-fried-salmon/",
  "name": "Breaded Pan-Fried Salmon",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "⅓ cup vegetable oil for frying; 1 ½ cups cornmeal; ½ cup all-purpose flour; 1 tablespoon seasoned salt; 1 tablespoon kosher salt; ½ tablespoon lemon pepper; ½ teaspoon ground white pepper; 3 large eggs; 6  salmon fillets",
  "directions": "1. Heat oil in a cast iron skillet to 350 degrees F (175 degrees C). 2. Whisk together cornmeal, flour, seasoned salt, kosher salt, lemon pepper, and white pepper in a medium bowl. 3. Beat eggs in a separate bowl for 10 seconds. 4. Working one at a time, dip salmon into beaten eggs to coat completely. Dredge salmon in cornmeal mixture to cover completely. Shake off excess. 5. Working in batches, fry salmon in hot oil, flipping halfway, until a golden brown crust forms, 8 to 10 minutes. Transfer to a paper towel-lined plate to drain.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "380"
},
{
  "url": "https://www.allrecipes.com/recipe/19583/cornmeal-mush/",
  "name": "Cornmeal Mush",
  "rating": "3.7",
  "ratingcount": "83",
  "ingredients": "2 ½ cups water; 1 ¼ cups cornmeal; ½ teaspoon salt",
  "directions": "1. Mix together water, cornmeal, and salt in a medium saucepan. Cook over medium heat, stirring frequently, until mixture thickens, 5 to 7 minutes.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "80"
},
{
  "url": "https://www.allrecipes.com/recipe/256967/chef-johns-cuban-bread/",
  "name": "Chef John's Cuban Bread",
  "rating": "4.5",
  "ratingcount": "66",
  "ingredients": "½ cup warm water; ½ cup flour; ½ teaspoon active dry yeast; 1 package active dry yeast; 2 teaspoons white sugar; ¾ cup warm water; 3 tablespoons lard; 2 teaspoons fine salt; 3 cups all-purpose flour, or as needed - divided; 1 teaspoon vegetable oil, or as needed; 1 tablespoon cornmeal",
  "directions": "1. Combine 1/2 cup warm water, 1/2 cup flour, and 1/2 teaspoon yeast, in a bowl or measuring cup. Whisk the starter until well blended. Cover with plastic wrap and refrigerate 8 hours to overnight. 2. Place 1 package yeast and 2 teaspoons sugar in a mixing bowl. Pour in 3/4 cup warm water. Let rest 15 minutes to ensure yeast is alive and bubbling on the surface. Add lard and salt to bowl, then add 1 cup of the flour. Mix until incorporated and dough forms a sticky ball. Add the starter. Add all but 1/2 cup of the remaining flour and mix to incorporate. 3. Knead dough on a lightly floured work surface until it comes together in a firm ball, adding up to 1/2 cup of the remaining flour as needed. Dough should be soft and supple with just a bit of tackiness on the surface. 4. Place dough in a bowl and coat the surface with vegetable oil. Cover the bowl with a damp kitchen towel and place in a warm spot to rise. Let rise until at least doubled in size, about 2 hours. 5. Line two rimmed baking sheets with parchment paper and sprinkle with cornmeal. 6. Transfer dough to a lightly floured surface. Lightly press dough into a rectangle with lightly floured hands. Divide dough in half and shape each half into a rectangle about 12 inches long and 1/2 inch thick. Starting at the long ends, tightly roll dough to form two skinny loaves. Slightly flatten the tops. Transfer loaves to a prepared baking sheet and dust with flour. Cover with a light, dry towel and let rise until doubled in size, 1 1/2 to 2 hours. 7. Preheat the oven to 400 degrees F (200 degrees C). Cut a 1/4-inch deep slit down the top of loaves with a sharp knife or razor. Lightly mist loaves with water. 8. Bake in the preheated oven, one pan on the lower rack and one on the higher rack, for 10 minutes. Switch pan positions and continue to bake until loaves are golden brown, 10 to 15 minutes longer. 9. Transfer loaves to cooling rack and let cool to room temperature before slicing.",
  "prep": "25 mins",
  "cook": "20 mins",
  "total": "12 hrs 15 mins",
  "calories": "172"
},
{
  "url": "https://www.allrecipes.com/recipe/141882/southern-corn-pone-bread/",
  "name": "Southern Corn Pone Bread",
  "rating": "4.0",
  "ratingcount": "27",
  "ingredients": "¼ cup canola oil; 1 ½ cups white cornmeal; 1 ½ teaspoons salt; 1 ⅓ cups buttermilk; 2 large eggs",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Preheat a 9-inch cast iron skillet on the center rack. 2. Carefully remove the preheated skillet from the oven and pour in oil; gently swirl to coat the bottom and sides. Return the skillet to the oven for 10 minutes. 3. Meanwhile, mix together cornmeal and salt in a medium bowl. Beat in buttermilk and eggs to form a thin batter. 4. Carefully pull out the center rack and pour batter into hot oil in the skillet. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes. If desired, turn the oven to broil for the last few minutes of baking to brown the top. 6. Shake the skillet to release corn pone. Serve warm in the skillet or turn out onto a serving plate.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "179"
},
{
  "url": "https://www.allrecipes.com/recipe/143644/pupusas/",
  "name": "Pupusas",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "4 cups plain tomato sauce; 1 cup water; 4 bunches fresh cilantro, chopped; 1  green bell pepper, seeded and chopped; 1  onion, chopped; 2 cloves garlic, crushed (Optional); 1 cube chicken bouillon; salt to taste; ½ head cabbage, shredded; 1 large carrot, peeled and grated; ½ cup white vinegar; 3  scallions, minced; 2 tablespoons dried oregano; 1 pinch crushed red pepper flakes; 1 (12 ounce) package bacon, or to taste; 4  tomatoes, halved, or more to taste; 1  green bell pepper, seeded and quartered; 1 cup grated Monterey Jack cheese; 2 cloves garlic, minced (Optional); salt to taste; 4 cups masa harina, or more to taste; 2 cups water, or as needed; ½ cup vegetable oil for frying",
  "directions": "1. Combine tomato sauce, water, cilantro, green bell pepper, onion, crushed garlic, bouillon cube, and salt in a saucepan over medium-low heat. Cook and stir until vegetables are soft, about 20 minutes. Let salsa roja cool for 10 minutes. 2. Fill a blender halfway with the salsa roja. Cover and hold lid down with a potholder; pulse a few times before leaving on to blend. Pour into a bowl. Repeat with remaining salsa roja. Return to saucepan and simmer for 10 minutes more stirring occasionally. Allow to cool completely, about 1 hour, and refrigerate. 3. Place cabbage and carrots in a large bowl. Add 4 cups boiling water and let stand for 5 minutes. Drain well. Mix in vinegar, scallions, oregano, and red pepper flakes. Chill curtido until serving. 4. Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until almost fully cooked and not yet crispy, 5 to 7 minutes. Transfer bacon and grease (if desired) to a food processor. Add tomatoes, quartered green bell pepper, Monterey Jack cheese, and minced garlic. Puree and season the chicharron with salt. 5. Mix masa harina and 1/2 cup water together in a bowl by hand. Add the remaining water slowly, about 2 tablespoons at a time, mixing well after each addition, until dough is moist but still firm. Cover with a wet towel. 6. Heat 1/2 cup oil a large skillet over medium-high heat. 7. Take a golf ball-sized piece of dough and roll into a ball in your hands. Make a hole in the dough ball with your thumb; put a small amount of chicharron inside the hole, close it up, and flatten the ball with your hands into a thick tortilla shape. Place pupusa in the skillet and fry until golden brown, about 2 minutes per side. Repeat with the remaining dough and chicharron. 8. Serve each pupusa topped with 2 tablespoons of curtido and 1 tablespoon of salsa roja.",
  "prep": "1 hr",
  "cook": "39 mins",
  "total": "2 hrs 54 mins",
  "calories": "234"
},
{
  "url": "https://www.allrecipes.com/recipe/277403/air-fryer-hush-puppies/",
  "name": "Air Fryer Hush Puppies",
  "rating": "1.7",
  "ratingcount": "3",
  "ingredients": "nonfat cooking spray; 1 cup yellow cornmeal; ¾ cup all-purpose flour; 1 ½ teaspoons baking powder; ½ teaspoon salt; ¼ teaspoon cayenne pepper, or more to taste; ¼ teaspoon garlic powder; 2 tablespoons minced onion; 2 tablespoons minced bell pepper; ¾ cup low-fat buttermilk; 1 large egg",
  "directions": "1. Preheat an air fryer to 390 degrees F (198 degrees C) according to the manufacturer's instructions. Line the bottom of the air fryer basket with foil and spray the foil with cooking spray. 2. Stir cornmeal, flour, baking powder, salt, cayenne, and garlic powder together in a large bowl. Mix in onion and bell pepper. 3. Whisk buttermilk and egg together in a separate bowl; pour into dry ingredients and stir to combine. Let mixture rest for 5 minutes. 4. Use a 2-tablespoon scoop to drop portions of batter into the prepared basket; leave space between each scoop. Spray with cooking spray. 5. Cook in the preheated air fryer until golden brown, crispy, and cooked through, 9 to 10 minutes. Serve hot.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "85"
},
{
  "url": "https://www.allrecipes.com/recipe/23161/southern-cornbread-dressing/",
  "name": "Southern Cornbread Dressing",
  "rating": "4.6",
  "ratingcount": "127",
  "ingredients": "¼ cup butter; ½ cup chopped onions; ½ cup chopped celery; 1 (1 pound) loaf cornbread, crumbled; 1 (1 pound) loaf day-old white bread, torn into small pieces; 1 pound shredded, cooked chicken breast meat; 4 cups chicken broth, or more to taste; 1 (10.5 ounce) can condensed cream of chicken soup; 6 large eggs; 2 teaspoons poultry seasoning; ½ teaspoon ground black pepper; ⅛ teaspoon garlic powder",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Melt butter in a skillet over medium heat. Add onions and celery; cook and stir until tender, 5 to 7 minutes. 3. Meanwhile, combine crumbled cornbread and white bread pieces in a large bowl. 4. Add cooked onions and celery to the bread mixture. Mix in shredded chicken, 4 cups chicken broth, condensed soup, eggs, poultry seasoning, pepper, and garlic powder. Blend with a potato masher until mixture is the consistency of gelatin. Add up to 2 cups more broth to attain the desired consistency. Transfer to a 9x13-inch baking dish. 5. Bake in the preheated oven until dressing is golden brown, about 30 minutes.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "182"
},
{
  "url": "https://www.allrecipes.com/recipe/261634/poblano-and-cheese-tamales-tamales-de-rajas-con-queso/",
  "name": "Poblano and Cheese Tamales (Tamales de Rajas con Queso)",
  "rating": "4.9",
  "ratingcount": "7",
  "ingredients": "corn husks; 10 ounces poblano peppers; 1 ¼ pounds fresh tomatillos, husks removed; 11 ounces lard, divided; 1  onion, chopped; salt and ground black pepper to taste; 3 tablespoons chopped fresh cilantro; 4 ½ cups masa harina; 2 teaspoons baking powder; 1 ¾ cups chicken broth, or as needed; 2 ½ cups sliced Monterey Jack cheese",
  "directions": "1. Place corn husks in a large bowl and cover with boiling water. Allow to soak for 30 to 60 minutes. Drain, place husks on a work surface, and cover with a clean, damp towel. 2. While husks are soaking, line a heavy cast iron grill pan or griddle with aluminum foil and place it over high heat. Arrange poblano peppers in a single layer over foil. Grill until peppers are blackened, turning as necessary, 3 to 5 minutes. Transfer to a resealable plastic bag and let them steam, 10 to 15 minutes. Peel off skins and remove seeds. Cut into strips and set aside. 3. Place tomatillos in a medium pot and cover with water; bring to a boil. Cook until tomatillos change color, about 5 minutes. Drain, place in a blender, and blend until smooth. Set sauce aside. 4. Heat 1 tablespoon lard in a large pot over medium heat. Cook and stir onion in hot lard until soft and translucent, about 5 minutes. Add blended tomatillos; season with salt and pepper. Bring to a boil, reduce heat, and simmer until flavors are well combined, about 5 minutes. Add poblano pepper strips and cilantro; cook at a boil for 5 minutes. Remove from heat and allow to cool, about 10 minutes. 5. Beat remaining lard in a large bowl with an electric mixer until creamy. Season with salt and continue beating for a few minutes. Beat in masa harina and baking powder until well combined. Mix in broth, 1/4 cup at a time, until dough has a smooth and workable consistency that is not too wet, similar to cookie dough. Test if masa mixture is ready by dropping a small ball of masa into a glass of cold water; if it floats, it's ready; if not, keep working dough a little longer. 6. Select 1 wide corn husk or 2 small ones. Spread about 2 tablespoons masa mixture onto corn husk, filling it 2 inches from the bottom and 1/4 inch from the top. Add 1 tablespoon tomatillo sauce and a Monterey Jack cheese slice in the center of masa mixture. Fold the sides of husk together, one over the other. Fold the bottom of the husk over the seam of the 2 folded sides. Repeat with remaining husks. 7. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Place tamales, open-side up, into the insert. Cover and steam until filling is heated through and separates from husk, about 1 hour 15 minutes. Let tamales rest for 15 minutes before serving.",
  "prep": "1 hr",
  "cook": "2 hrs",
  "total": "3 hrs 25 mins",
  "calories": "252"
},
{
  "url": "https://www.allrecipes.com/recipe/231158/skillet-corn-bread/",
  "name": "Skillet Cornbread",
  "rating": "4.3",
  "ratingcount": "176",
  "ingredients": "1 ¼ cups milk; 1 cup cornmeal; 1 cup all-purpose flour; 4 teaspoons baking powder; ¾ teaspoon kosher salt; 2  eggs, beaten; ¼ cup unsalted butter, melted; 1 tablespoon vegetable oil",
  "directions": "1. Place a 9-inch cast iron skillet into the oven and preheat to 425 degrees F (220 degrees C). 2. Mix milk and cornmeal together in small bowl. Let soak for 10 minutes. 3. Sift flour, baking powder, and salt together into a mixing bowl. Add cornmeal mixture, eggs, and butter; beat until a smooth batter forms, about 1 minute. 4. Remove the hot skillet from the oven. Add vegetable oil to the skillet and swish to coat. Pour out any excess oil, then pour batter into the skillet. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 18 to 23 minutes. Cut into wedges to serve.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "225"
},
{
  "url": "https://www.allrecipes.com/recipe/24741/cornbread-stuffing-with-sausage/",
  "name": "Cornbread Stuffing with Sausage",
  "rating": "4.6",
  "ratingcount": "152",
  "ingredients": "1 pound ground pork sausage; 2 cups diced celery; 2 large onions, chopped; 5 cups crumbled cornbread; 5 cups seasoned bread crumbs; 2 ¾ cups chicken broth; 1 ½ teaspoons poultry seasoning; 1 teaspoon dried sage, crushed",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Combine sausage, celery, and onions in a large, deep skillet over medium-high heat. Cook, stirring often and breaking sausage up with a spoon, until sausage is evenly browned and crumbly and vegetables are translucent, 7 to 10 minutes. Remove from the heat and drain. 3. Transfer sausage mixture to a large bowl. Add crumbled cornbread, bread crumbs, chicken broth, poultry seasoning, and sage. Mix until well combined, then transfer to a 9x13-inch baking dish. Cover with foil. 4. Bake in the preheated oven until stuffing is well set and cooked through, about 45 minutes.",
  "prep": "10 mins",
  "cook": "55 mins",
  "total": "1 hr 5 mins",
  "calories": "441"
},
{
  "url": "https://www.allrecipes.com/recipe/263611/chicago-deep-dish-pizza/",
  "name": "Chicago Deep-Dish Pizza",
  "rating": "4.7",
  "ratingcount": "43",
  "ingredients": "1 ⅓ cups warm water; 2 ¼ teaspoons active dry yeast; ¼ cup olive oil; ¼ cup melted butter; 2 teaspoons white sugar; 1 ½ teaspoons fine salt; ½ cup cornmeal; 3 ¾ cups all-purpose flour; 2 teaspoons olive oil, or as needed, divided; 4 cups pizza sauce, or to taste; 4 ounces sliced provolone cheese; 8 ounces fresh mozzarella cheese, cubed; 1 pound spicy Italian sausage, casings removed; 4 ounces shredded part-skim, low-moisture mozzarella cheese; 2 ounces Parmigiano-Reggiano cheese; 1 tablespoon olive oil",
  "directions": "1. Make the dough: Pour water into the bowl of a stand mixer fitted with a paddle attachment. Sprinkle in yeast and let dissolve, about 10 minutes. Add olive oil, melted butter, sugar, salt, cornmeal, and most of the flour, in that order. Knead, stopping occasionally to scrape down the sides and adding more flour as needed, until smooth and elastic. 2. Transfer dough to a lightly floured work surface. Knead in extra flour if needed. Roll into a ball and transfer to a bowl greased with 1/2 teaspoon olive oil. Cover with a plate and let rise in a warm spot until doubled in volume, 1 to 2 hours. 3. While the dough is rising, simmer pizza sauce in a pot over low heat until very thick, 60 to 90 minutes. 4. Preheat the oven to 425 degrees F (220 degrees C). 5. Poke dough to deflate and turn out onto your work surface. Press and stretch out dough into a round shape 3 to 4 inches larger than a 12-inch cast iron skillet. Brush the skillet with 1 1/2 teaspoons olive oil. Place dough into the skillet; stretch and pull to evenly distribute it over the bottom and sides. 6. Apply fillings and toppings in order as follows: Lay provolone cheese over the bottom of the crust. Scatter fresh mozzarella over provolone, then add Italian sausage and firm mozzarella. Ladle pizza sauce generously over top. Grate Parmesan cheese over pizza sauce, then fold the crust edges in towards the center to seal in the sides. Drizzle 1 tablespoon olive oil over crust and center of pizza. 7. Bake in the center of the preheated oven until crust sounds hollow when tapped and pizza is beautifully browned, about 35 minutes. Let rest for 10 minutes before slicing.",
  "prep": "35 mins",
  "cook": "35 mins",
  "total": "2 hrs 30 mins",
  "calories": "613"
},
{
  "url": "https://www.allrecipes.com/recipe/21006/fried-cornmeal-mush/",
  "name": "Fried Cornmeal Mush",
  "rating": "4.5",
  "ratingcount": "138",
  "ingredients": "3 cups water; 1 teaspoon salt; 1 cup yellow cornmeal; 1 tablespoon butter",
  "directions": "1. In a medium saucepan, heat water to boiling. Reduce heat to medium; stir in salt and cornmeal. Cook, stirring regularly, until mixture is thick. 2. Spoon cornmeal mixture into a lightly greased 9x5 inch loaf pan. Cover and refrigerate overnight. 3. In the morning, melt butter in a skillet over medium high heat. Slice cornmeal mush into 1 inch wide slices. Cook in melted butter until golden brown on both sides.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "13 hrs 20 mins",
  "calories": "153"
},
{
  "url": "https://www.allrecipes.com/recipe/66428/moms-mexican-cornbread/",
  "name": "Mom's Mexican Cornbread",
  "rating": "4.4",
  "ratingcount": "62",
  "ingredients": "1 pound ground beef; 1 cup cornmeal; 1 teaspoon salt; 1 teaspoon baking soda; 1 cup milk; 1  egg; 1  onion, chopped; 1 (14.5 ounce) can cream-style corn; 1 cup shredded Cheddar cheese; 2  jalapeno peppers, chopped",
  "directions": "1. Preheat an oven to 350 degrees F (175 degrees C). Coat a 9X12 inch baking dish with cooking spray. 2. Heat a large skillet over medium heat; cook the ground beef in the skillet until no longer pink. Set aside. 3. In a large bowl, stir together the cornmeal, salt, and baking soda. Mix in milk, egg, onion, corn, Cheddar cheese, and jalapeno pepper. Stir in browned beef. Pour into the prepared baking dish. 4. Bake in the preheated oven until golden brown, about 1 hour.",
  "prep": "15 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 20 mins",
  "calories": "205"
},
{
  "url": "https://www.allrecipes.com/recipe/191710/cornbread-pancakes/",
  "name": "Cornbread Pancakes",
  "rating": "4.6",
  "ratingcount": "209",
  "ingredients": "¾ cup all-purpose flour; ¾ cup cornmeal; 2 tablespoons white sugar; ½ teaspoon baking powder; ½ teaspoon baking soda; ½ teaspoon salt; 1 ¼ cups buttermilk; 2  large eggs; 3 tablespoons butter, melted and cooled",
  "directions": "1. Whisk flour, cornmeal, sugar, baking powder, baking soda, and salt in a large bowl. Whisk buttermilk, eggs and butter in a separate large bowl. Stir the liquid mixture into the dry mixture until blended and smooth. 2. Heat a lightly oiled griddle or skillet over medium-high heat. For each pancake, pour 1/4 cup batter on griddle and cook until browned, about 1 1/2 minutes. Flip and cook until browned on the other side, about 1 minute. Continue with remaining batter.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "278"
},
{
  "url": "https://www.allrecipes.com/recipe/256997/chef-johns-no-knead-ciabatta/",
  "name": "Chef John's No-Knead Ciabatta",
  "rating": "4.7",
  "ratingcount": "117",
  "ingredients": "3 ½ cups white bread flour; ½ cup whole wheat bread flour; 1 ½ teaspoons salt; ¼ teaspoon active dry yeast; 2 cups water; 1 tablespoon olive oil; 2 tablespoons cornmeal",
  "directions": "1. Place white and wheat flour in a large bowl. Add salt, yeast, and water. Mix until a wet sticky dough comes together, about 5 minutes. Scrape down sides of bowl. Cover with foil. Allow dough to rise for 18 hours at room temperature. It should not be too warm. 2. Punch dough down with a spatula and fold it over a few times. 3. Lightly grease a heavy-rimmed baking sheet with olive oil. Sprinkle generously with cornmeal. 4. Lightly spray a work surface with water. Place a long sheet of plastic wrap on the damp surface to hold it in place. Sprinkle plastic wrap with flour. Scrape the dough onto the floured surface. Sprinkle flour on top of the dough. Gently stretch and pull dough into a long, flat rectangular shape, 12 to 15 inches long. Bring plastic sheet to edge of prepared pan and flip the dough into the prepared pan. Reshape the dough, if necessary. Dust with flour. Cover with a light dry towel. Let rise about 2 hours. 5. Preheat oven to 425 degrees F (220 degrees C). 6. Bake dough in preheated oven until loaf is nicely browned, 35 to 45 minutes.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "20 hrs 55 mins",
  "calories": "273"
},
{
  "url": "https://www.allrecipes.com/recipe/244696/self-rising-cornmeal/",
  "name": "Self-Rising Cornmeal",
  "rating": "5.0",
  "ratingcount": "5",
  "ingredients": "15 tablespoons cornmeal; 1 tablespoon baking powder; ½ teaspoon salt",
  "directions": "1. Mix cornmeal, baking powder, and salt together in a bowl until combined. Store in an air-tight container.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "122"
},
{
  "url": "https://www.allrecipes.com/recipe/242327/pan-fried-swai-fillets/",
  "name": "Pan-Fried Swai Fillets",
  "rating": "4.6",
  "ratingcount": "16",
  "ingredients": "2 teaspoons red pepper flakes; 1 teaspoon seafood seasoning (such as Old Bay®); 1 teaspoon garlic powder; salt and ground black pepper to taste; 1 cup cornmeal; 4 (4 ounce) fillets swai fish; 2 tablespoons canola oil; ¼ cup water",
  "directions": "1. Combine red pepper flakes, seafood seasoning, garlic powder, salt, and pepper in a bowl. Spread corn meal into a shallow bowl. Season swai fish with red pepper flake mixture and press each fillet into cornmeal to coat. Wrap coated fillets in plastic wrap and refrigerate for 30 minutes. 2. Heat oil in a skillet over medium heat. Unwrap fish and place in the hot oil; cook until browned, about 5 minutes per side. Add water, bring to a simmer, cover, and cook, flipping occasionally, until fish flakes easily with a fork, about 10 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "330"
},
{
  "url": "https://www.allrecipes.com/recipe/276023/old-school-tamale-pie/",
  "name": "Old-School Tamale Pie",
  "rating": "4.7",
  "ratingcount": "15",
  "ingredients": "1 ½ pounds lean ground beef; 1 cup chopped onion; ½ cup chopped green bell pepper; 1 (14.5 ounce) can diced tomatoes; 1 (8 ounce) can tomato sauce; 1 cup frozen corn; 1 (2.25 ounce) can sliced black olives, drained; 1 tablespoon chili powder; 1 teaspoon minced garlic; 1 teaspoon ground cumin; 1 teaspoon salt; ¼ teaspoon red pepper flakes, or to taste; ¼ teaspoon ground black pepper; 1 cup shredded Cheddar cheese; 1 ½ cups milk; 2 tablespoons butter; 1 tablespoon white sugar; ½ teaspoon salt; ½ cup cornmeal; 1 cup shredded Cheddar cheese; 2  eggs, lightly beaten; 1 tablespoon sour cream, or to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 2. Heat a large skillet over medium-high heat. Cook and stir ground beef, onion, and bell pepper in the hot skillet until beef is browned and crumbly, 5 to 7 minutes. Drain and discard grease. 3. Stir tomatoes, tomato sauce, corn, olives, chili powder, garlic, cumin, salt, red pepper flakes, and black pepper into the skillet. Bring to a low boil, about 5 minutes. Reduce heat to medium-low and let simmer for 5 minutes. Stir in 1 cup Cheddar cheese and continue to simmer until melted, 3 to 5 minutes. Remove from heat and transfer mixture to the prepared baking dish. 4. Heat milk, butter, sugar, and salt for topping in a large saucepan over medium heat until butter has melted, 2 to 3 minutes. Reduce heat to low and stir in cornmeal a little at a time, stirring vigorously with each addition, until smooth and thickened. Remove from heat and stir in 1 cup Cheddar cheese. Drizzle in beaten eggs slowly, stirring vigorously until combined. Pour mixture over filling in the prepared dish, smoothing evenly over the surface. 5. Bake in the preheated oven until top is golden brown and filling is bubbly, 30 to 40 minutes. Allow pie to rest for 10 to 15 minutes before serving.",
  "prep": "30 mins",
  "cook": "50 mins",
  "total": "1 hr 30 mins",
  "calories": "311"
},
{
  "url": "https://www.allrecipes.com/recipe/223511/deep-fried-corn-meal-sticks-sorullitos-de-maiz-with-dipping-sauce/",
  "name": "Deep Fried Corn Meal Sticks (Sorullitos de Maiz) with Dipping Sauce",
  "rating": "4.8",
  "ratingcount": "42",
  "ingredients": "2 cups water; 3 tablespoons white sugar, or more to taste; 1 tablespoon butter; 1 teaspoon salt; 1 ½ cups cornmeal, or as needed; 3 cups vegetable oil for frying; vegetable oil; ½ cup mayonnaise, or to taste; ¼ cup ketchup; 1 pinch garlic salt, or to taste (Optional)",
  "directions": "1. Bring water to a boil in a saucepan and stir in sugar, butter, and salt until sugar has dissolved. Turn heat to low and whisk in 1 cup of cornmeal until smooth. Stir in remaining 1/2 cup cornmeal to make a very thick, workable dough. 2. Heat 3 cups vegetable oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Grease your hands well with 2 teaspoons of oil and scoop about 3 tablespoons of cornmeal dough; roll the dough into a ball, then shape into a 3-inch long stick about 1/2 inch wide. Repeat with remaining dough, oiling your hands as needed. Deep-fry the cornmeal sticks until golden brown, working in batches of 3 or 4 at a time. Drain fried cornmeal sticks on paper towels and keep warm. 3. Mix mayonnaise, ketchup, and garlic salt in a bowl until well combined; serve cornmeal sticks with the sauce for dipping.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "421"
},
{
  "url": "https://www.allrecipes.com/recipe/257631/basic-cheese-pupusas/",
  "name": "Basic Cheese Pupusas",
  "rating": "4.7",
  "ratingcount": "7",
  "ingredients": "2 cups shredded green cabbage; ½ cup apple cider vinegar; ½ cup water, or more as needed; ½  onion, thinly sliced; 1  carrot, grated; ¼ teaspoon ground oregano; ¼ teaspoon red pepper flakes; salt to taste; 3 cups masa harina flour (Mexican corn masa mix); 1 ½ cups water, or more as needed; ½ teaspoon salt; 1 cup ricotta cheese; 1 cup shredded mozzarella cheese; 2 tablespoons heavy whipping cream, or more to taste; 1  scallion, finely chopped, or more to taste; cooking spray",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add cabbage and cook uncovered until slightly softened, about 3 minutes. Drain in a colander and immediately immerse in ice water for several minutes to stop the cooking process. Drain. 2. Mix cabbage, apple cider vinegar, water, onion, carrot, oregano, red pepper flakes, and 1 pinch salt together in a large bowl. Refrigerate until flavors combine, 8 hours to overnight. 3. Combine masa harina, water, and 1/2 teaspoon salt together in a large bowl; knead until a smooth, moist dough forms. Add water if dough cracks when you press down on it. Let dough rest, 5 to 10 minutes. 4. Stir ricotta cheese, mozzarella cheese, heavy cream, and scallion together in a bowl to make a paste. 5. Divide dough into 8 balls. Press your thumb into the center of each ball to form an indentation. Fill indentations with ricotta cheese paste. Pinch edges together around the filling; flatten and smooth into round 1/4 inch-thick patties between your palms. 6. Grease a skillet with cooking spray; preheat over medium heat. Cook pupusas in batches until browned, 2 to 3 minutes per side. 7. Drain cabbage mixture and serve alongside pupusas.",
  "prep": "40 mins",
  "cook": "12 mins",
  "total": "8 hrs 57 mins",
  "calories": "197"
},
{
  "url": "https://www.allrecipes.com/recipe/276019/easy-tamale-pie/",
  "name": "Easy Tamale Pie",
  "rating": "4.1",
  "ratingcount": "8",
  "ingredients": "1 tablespoon butter; ½ pound ground beef; ½ cup chopped onion; 1 (15.25 ounce) can whole kernel corn, drained; 1 (14.5 ounce) can diced tomatoes; ¼ cup vegetable oil; 1 tablespoon chili powder; 1 teaspoon ground cumin; 1 cup milk; ½ cup yellow cornmeal; 2  eggs; 1 (6 ounce) can black olives, drained",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Butter an 8-inch baking or casserole dish. 2. Heat a large skillet over medium-high heat. Cook and stir ground beef and onion in the hot skillet until beef is browned and crumbly, 5 to 7 minutes. Mix in corn, tomatoes, oil, chili powder, and cumin. Bring to a boil; remove from heat. 3. Combine milk, cornmeal, and eggs in a large bowl. Stir in meat mixture. Mix in olives. Pour into the prepared baking dish. 4. Bake in the preheated oven until golden and set, 50 to 60 minutes; mixture should not be mushy.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "367"
},
{
  "url": "https://www.allrecipes.com/recipe/277285/cheesy-grits/",
  "name": "Cheesy Grits",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "4 cups water; 1 teaspoon salt; 1 cup uncooked quick-cooking grits; 1 cup shredded Cheddar cheese; ½ cup shredded Parmesan cheese; 2 tablespoons butter; ground black pepper to taste",
  "directions": "1. Bring water and salt to a boil in a saucepan. Whisk in grits, reduce heat to medium-low, and cook until thickened, 5 to 6 minutes. Remove from heat. 2. Stir in Cheddar cheese, Parmesan cheese, and butter until fully combined and cheeses have melted. Season with pepper and serve immediately.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "353"
},
{
  "url": "https://www.allrecipes.com/recipe/262261/mexican-corn-bread-casserole/",
  "name": "Mexican Corn Bread Casserole",
  "rating": "4.5",
  "ratingcount": "32",
  "ingredients": "1 tablespoon olive oil; 1 small onion, diced; ½  red bell pepper, chopped; 1 pound ground beef; 1 teaspoon minced garlic; 1 teaspoon chili powder; ¼ teaspoon cayenne pepper; salt and ground black pepper to taste; ½ cup frozen corn; 1 cup shredded Mexican cheese blend, divided, or more to taste; 1 cup salsa; 1 cup cornmeal; ¾ teaspoon salt; ½ teaspoon baking soda; 1 cup milk; 2  eggs, beaten",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Heat olive oil in a skillet over medium-high heat. Add onion and red bell pepper; saute until softened, 5 to 7 minutes. Add ground beef, garlic, chili powder, cayenne pepper, salt, and black pepper. Cook and stir until beef is browned and crumbly, 5 to 7 minutes. 3. Mix corn into the beef mixture and toss to defrost, about 3 minutes. Drain and discard fat. Add about 1/4 of the shredded Mexican cheese blend and mix well. Pour meat sauce into a 9x13-inch casserole dish. Cover meat with a thin layer of salsa. 4. Combine cornmeal, salt, and baking soda in a large bowl. Add milk and eggs; stir until well blended. Pour cornmeal mixture on top of salsa layer and top with remaining shredded Mexican cheese blend. 5. Bake in the preheated oven until browned on top, about 30 minutes.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "304"
},
{
  "url": "https://www.allrecipes.com/recipe/241303/banana-cornbread/",
  "name": "Banana Cornbread",
  "rating": "4.4",
  "ratingcount": "40",
  "ingredients": "2 cups all-purpose flour; 2 cups cornmeal; 2 cups milk; 2  bananas; 1 ⅓ cups white sugar; ⅔ cup vegetable oil; 2 teaspoons baking powder; 2 teaspoons salt",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 2. Combine flour, cornmeal, milk, bananas, sugar, vegetable oil, baking powder, and salt together in a bowl until batter is smooth; pour into the prepared baking dish. 3. Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 30 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "196"
},
{
  "url": "https://www.allrecipes.com/recipe/213605/5-minute-microwave-cornbread/",
  "name": "5 Minute Microwave Cornbread",
  "rating": "4.4",
  "ratingcount": "137",
  "ingredients": "½ cup all-purpose flour; ½ cup cornmeal; 2 tablespoons white sugar; 2 teaspoons baking powder; ¼ teaspoon salt; 1  egg; ½ cup milk; 2 tablespoons vegetable oil",
  "directions": "1. Mix the flour, cornmeal, sugar, baking powder, salt, egg, milk, and vegetable oil in a microwave-safe glass or ceramic bowl. 2. Heat in the microwave on high, until a toothpick inserted into the center comes out clean, about 3 minutes, rotating the bowl halfway through cooking if the microwave does not have a rotating tray.",
  "prep": "7 mins",
  "cook": "3 mins",
  "total": "10 mins",
  "calories": "154"
},
{
  "url": "https://www.allrecipes.com/recipe/7123/johnnycakes/",
  "name": "Johnnycakes",
  "rating": "3.6",
  "ratingcount": "68",
  "ingredients": "2 cups stone ground cornmeal; 1 teaspoon salt; 4 tablespoons unsalted butter; 1 cup whole milk; 2 tablespoons boiling water",
  "directions": "1. Cream the cornmeal, salt, and butter together. Add the milk and enough water to make a moist but firm batter. 2. Drop by large spoonfuls onto a hot greased griddle, and flatten slightly with the back of a spoon. When brown, turn and cook the other side.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "144"
},
{
  "url": "https://www.allrecipes.com/recipe/255254/gluten-free-cornbread/",
  "name": "Gluten-Free Cornbread",
  "rating": "4.8",
  "ratingcount": "18",
  "ingredients": "1 ¼ cups white cornmeal; ½ cup white sugar; ¼ cup gluten-free all-purpose flour; 1 tablespoon gluten-free baking powder; 1 cup milk; ¼ cup butter, melted; 1  egg; 1 (14.75 ounce) can cream-style corn",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Grease an 8-inch square pan. 2. Mix cornmeal, sugar, flour, and baking powder together in a bowl. 3. Whisk milk, butter, and egg together in another bowl. Stir into cornmeal mixture just until combined and some lumps remain. Fold in corn. Pour batter into the pan and smooth out the top. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "248"
},
{
  "url": "https://www.allrecipes.com/recipe/229629/buttermilk-oatmeal-pancakes/",
  "name": "Buttermilk Oatmeal Pancakes",
  "rating": "4.5",
  "ratingcount": "124",
  "ingredients": "2 cups buttermilk; 1 ½ cups rolled oats; ½ cup all-purpose flour; ½ cup cornmeal; 2 teaspoons baking powder; 1 ½ teaspoons white sugar; ½ teaspoon baking soda; ½ teaspoon salt; 2  eggs, beaten; ¼ cup vegetable oil",
  "directions": "1. Mix buttermilk and oats in a large bowl; allow to rest about 5 minutes. Stir flour, cornmeal, baking powder, sugar, baking soda, and salt into oat mixture. Add eggs and vegetable oil; mix until just combined. 2. Heat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle; cook until bubbles form and the edges are dry, about 3 minutes. Flip and cook until browned on the other side, about 3 minutes more. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/277075/crispy-air-fryer-cod/",
  "name": "Crispy Air Fryer Cod",
  "rating": "3.6",
  "ratingcount": "7",
  "ingredients": "1 pound cod, about 1-inch thick, cut into 4 pieces; ¼ cup polenta; ¼ cup all-purpose flour; 1 ½ teaspoons seafood seasoning (such as Old Bay®); 1 ½ teaspoons garlic salt; 1 teaspoon onion powder; ½ teaspoon ground black pepper; ½ teaspoon paprika; olive oil cooking spray",
  "directions": "1. Preheat an air fryer to 380 degrees F (195 degrees C). Pat cod pieces dry with paper towels. 2. Combine polenta, flour, seafood seasoning, garlic salt, onion powder, pepper, and paprika in a shallow dish. Coat each piece of cod with the breading mixture, pressing breading on each side of the fish until well coated. 3. Spray the basket of the air fryer with olive oil cooking spray. Arrange cod in the basket, leaving space between each piece so air can circulate. Spray the top of each piece of cod with cooking spray. 4. Cook for 8 minutes. Turn each piece, spray with cooking spray, and cook for 4 minutes more.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "171"
},
{
  "url": "https://www.allrecipes.com/recipe/45145/blue-cornmeal-pancakes/",
  "name": "Blue Cornmeal Pancakes",
  "rating": "4.7",
  "ratingcount": "151",
  "ingredients": "¾ cup blue cornmeal; 1 teaspoon salt; 1 tablespoon white sugar; 1 cup boiling water; 1  beaten egg; ½ cup milk; 2 tablespoons butter, melted; ¾ cup unbleached all-purpose flour; 2 teaspoons baking powder; ½ cup pine nuts, toasted",
  "directions": "1. In a medium bowl, mix together the blue cornmeal, salt and sugar. Stir in the boiling water until all of the ingredients are wet. Cover, and let stand for a few minutes. 2. In a measuring cup, combine the milk, egg and melted butter. Stir the milk mixture into the cornmeal mixture. Combine the flour and baking powder; stir into the cornmeal mixture until just incorporated. If the batter is stiff, add a little more milk until it flows off the spoon thickly but smoothly. 3. Heat a large cast iron skillet over medium heat, and grease it with a dab of oil or butter. Use about 2 tablespoons of batter for each pancake. Quickly sprinkle a few pignoli onto each cake. When the entire surface of the pancakes are covered with bubbles, flip them over, and cook the other side until golden. It's hard to tell when blue food is cooked through--so give them a few extra seconds if you're in doubt. 4. Serve immediately with maple syrup of fruit preserves.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "376"
},
{
  "url": "https://www.allrecipes.com/recipe/280081/air-fryer-frog-legs/",
  "name": "Air Fryer Frog Legs",
  "rating": "2.0",
  "ratingcount": "2",
  "ingredients": "1 pound frog legs; 2 cups milk; 2 cups yellow cornmeal; 1 cup all-purpose flour; 2 tablespoons seafood seasoning (such as Old Bay®); cooking spray",
  "directions": "1. Place frog legs in a bowl and pour milk over the top. Cover and refrigerate for 1 hour. 2. Preheat an air fryer to 400 degrees F (200 degrees C) according to manufacturer's instructions. 3. Meanwhile, combine cornmeal, flour, and seafood seasoning in a gallon-sized resealable plastic bag. Seal and shake to combine. 4. Remove 1 pair of frog legs from the milk, letting excess drain back into the bowl. Place in the bag with the seasoned cornmeal mixture and shake to coat. Dip the frog legs back in the milk and return to the cornmeal mixture. Shake to coat once more and transfer to a plate. Repeat with remaining frog legs. 5. Spray the air fryer basket with cooking spray and add as many frog legs as you can without overlapping. Spray the tops with cooking spray. Work in batches if needed. 6. Air fry for 5 minutes. Spray any chalky spots with cooking spray. Continue cooking until crispy, about 3 minutes more. Transfer to a plate and repeat with remaining batches.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "1 hr 35 mins",
  "calories": "512"
},
{
  "url": "https://www.allrecipes.com/recipe/203170/fried-cucumbers/",
  "name": "Fried Cucumbers",
  "rating": "4.0",
  "ratingcount": "28",
  "ingredients": "½ cup vegetable oil; 2  cucumbers, peeled and sliced; 1 cup cornmeal; salt to taste",
  "directions": "1. Heat the vegetable oil in a large heavy skillet over medium high heat. Line a plate with a paper towel; set aside. 2. Roll the cucumber slices in the cornmeal. Fry the slices in the hot oil, a few at a time, until golden brown, about 2 minutes per side. Transfer the cucumbers to the prepared plate; sprinkle with salt to serve.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "392"
},
{
  "url": "https://www.allrecipes.com/recipe/222502/homemade-beef-tamales/",
  "name": "Homemade Beef Tamales",
  "rating": "3.8",
  "ratingcount": "6",
  "ingredients": "5 pounds ground beef; 1 (4 ounce) can chopped roasted green chile peppers; 5 teaspoons hot pepper sauce (such as Cholula®); 1 tablespoon kosher salt; 4 cloves garlic, pressed, divided; 1 tablespoon minced white onion; 2 teaspoons ground black pepper; 1 teaspoon ground cayenne pepper; 1 (2 pound) package yellow masa flour; 2 tablespoons lard; 1 teaspoon baking powder; 2 cups water, divided; 50 dried corn husks; 8 ounces grated Chihuaua cheese, or to taste; 5 tablespoons chili powder",
  "directions": "1. Heat a large cast-iron skillet over medium heat. Add beef, green chiles, hot sauce, salt, 3 cloves garlic, onion, black pepper, and cayenne pepper. Cook and stir until beef is thoroughly browned, 10 to 15 minutes. Drain and reserve the drippings. 2. Combine reserved drippings, masa, lard, and baking powder in a large bowl. Mix well. Add up to 1 cup water, 1 teaspoon at a time, until mixture is as thick as biscuit dough. Divide into 50 equal balls. Place dough balls between 2 cutting boards each lined with a sheet of waxed paper; flatten into circles. 3. Place each dough circle into a corn husk. Spoon about 3 tablespoons beef mixture in a line across the middle of each husk. Top with a small amount of cheese. Fold opposing sides of the tortilla to overlap the filling. Roll the husk around the tamale and fold in one end. 4. Combine the remaining 1 clove garlic, 1 cup water, and chili powder in a small saucepan over medium-high heat. Bring chili sauce to a boil. Remove from heat. 5. Stand a batch of the tamales, folded ends-down, in a steamer basket on top of a double boiler over simmering water. Bring water to a boil; cover and steam for 20 minutes. Remove tamales from heat; remove husks and top tamales with the chili sauce. Repeat with remaining tamales.",
  "prep": "1 hr",
  "cook": "40 mins",
  "total": "1 hr 40 mins",
  "calories": "375"
},
{
  "url": "https://www.allrecipes.com/recipe/212469/cornbread-dressing-with-gravy/",
  "name": "Cornbread Dressing With Gravy",
  "rating": "4.9",
  "ratingcount": "22",
  "ingredients": "3 (6.5 ounce) packages white cornbread mix; 2 cups water; 1 (6 ounce) box herb-seasoned stuffing mix; 1 large onion, chopped; 2 stalks celery, chopped; 4 cups chopped cooked chicken; 1 (23 ounce) can condensed cream of chicken soup; 1 (10.5 ounce) can condensed cream of celery soup; 1 (32 ounce) container chicken broth, or as needed; 6 large eggs, beaten; 1 cup melted butter; salt and ground black pepper to taste; 2 cups chopped cooked chicken; 1 cup diced onion; 1 cup diced celery; 1 (32 ounce) container chicken broth, or more as needed; 4 large hard-cooked eggs, chopped; 2 ½ tablespoons cornstarch, or as needed; 2 tablespoons water",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Spray a large roasting pan with nonstick spray and place in the preheating oven until hot, 7 to 8 minutes. 2. Meanwhile, prepare dressing: Combine cornbread mix and water in a mixing bowl; stir until smooth. 3. Remove the hot pan from the oven and pour in the cornbread batter. Return to the oven and bake until golden brown, 17 to 21 minutes. Remove from the oven and let sit until cool enough to handle, 10 to 15 minutes; keep the oven on. 4. Crumble cooled cornbread into a large bowl. Stir in stuffing mix, onion, and celery. Add chicken and both condensed soups, then stir in as much chicken broth as needed to moisten the dry ingredients. Stir in eggs and melted butter; season with salt and pepper. 5. Grease the roasting pan used for the cornbread with more nonstick spray, if needed. Lightly pack dressing mixture into the pan. 6. Bake until the top is golden brown, 45 minutes to 1 hour. 7. While the dressing is baking, make gravy: Combine chicken, onion, celery, and hard-cooked eggs in a large saucepan. Add container of chicken broth and simmer over medium-low heat, stirring occasionally, until vegetables are tender and broth has reduced slightly, about 45 minutes. 8. Mix cornstarch with water in a small bowl; stir into the gravy and simmer, stirring occasionally, until thickened, about 5 minutes. 9. Remove dressing from the oven and serve with hot gravy.",
  "prep": "35 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 55 mins",
  "calories": "328"
},
{
  "url": "https://www.allrecipes.com/recipe/268498/air-fryer-fried-okra/",
  "name": "Air Fryer Fried Okra",
  "rating": "4.1",
  "ratingcount": "13",
  "ingredients": "1 large egg; ½ pound okra pods, cut into 1/2-inch slices; 1 cup cornmeal; ¼ cup all-purpose flour; cooking spray; salt to taste",
  "directions": "1. Place egg in a shallow dish and beat; gently stir in sliced okra. 2. Combine cornmeal and flour in a gallon-size resealable plastic bag. Drop 5 slices of okra in the cornmeal mixture, zip the bag, and shake. Remove breaded okra to a plate. Repeat with remaining okra slices. 3. Preheat air fryer to 400 degrees F (200 degrees C). Place 1/2 the breaded okra slices in the basket of the air fryer and spray with cooking spray. Cook 4 minutes. Shake the basket and mist okra with cooking spray again. Cook an additional 4 minutes. Shake the basket one last time and cook for 2 minutes. Remove the okra from the basket and salt to taste. 4. Repeat with remaining okra slices.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "191"
},
{
  "url": "https://www.allrecipes.com/recipe/186802/whole-grain-pancakes/",
  "name": "Whole Grain Pancakes",
  "rating": "4.6",
  "ratingcount": "103",
  "ingredients": "1 cup whole wheat flour; ½ cup rolled oats; ¼ cup cornmeal; 3 tablespoons flaxseed meal; 3 tablespoons brown sugar; 1 teaspoon baking powder; ½ teaspoon baking soda; 1  egg, beaten; 2 cups buttermilk; cooking spray",
  "directions": "1. In a large bowl, stir together the whole wheat flour, oats, cornmeal, flaxseed meal, brown sugar, baking powder, and baking soda. Pour in buttermilk and egg. Stir just until smooth. 2. Heat a large skillet or griddle over medium heat. Coat with cooking spray. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "306"
},
{
  "url": "https://www.allrecipes.com/recipe/262059/cachapas-from-venezuela/",
  "name": "Cachapas from Venezuela",
  "rating": "2.3",
  "ratingcount": "4",
  "ingredients": "2 (15.25 ounce) cans whole kernel corn, drained; ¼ cup milk; 1  egg; ¼ cup masa harina; 2 tablespoons white sugar; ½ teaspoon salt; 4 tablespoons vegetable oil",
  "directions": "1. Blend corn, milk, egg, masa harina, sugar, and salt together in a blender until the mixture has the consistency of pancake batter. 2. Heat oil in a a large skillet over medium heat. Add enough batter to form the size of a taco shell, 4 to 5 inches around. Cook until golden brown, about 2 minutes per side. Repeat with remaining batter.",
  "prep": "5 mins",
  "cook": "4 mins",
  "total": "9 mins",
  "calories": "246"
},
{
  "url": "https://www.allrecipes.com/recipe/238255/sweet-cornmeal-cake-brazilian-style/",
  "name": "Sweet Cornmeal Cake Brazilian-Style",
  "rating": "4.3",
  "ratingcount": "8",
  "ingredients": "2 cups cornmeal; 1 ½ cups white sugar; 1 cup milk; 1 cup coconut milk; 1 cup all-purpose flour; 3  eggs; ⅓ cup vegetable oil; 1 teaspoon baking powder",
  "directions": "1. Preheat oven to 340 degrees F (170 degrees C). Grease and flour a 10-inch round cake pan. 2. Blend cornmeal, sugar, milk, coconut milk, flour, eggs, and vegetable oil in a blender until smooth; add baking powder and blend to integrate. Pour the cornmeal mixture into the prepared cake pan. 3. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 40 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "508"
},
{
  "url": "https://www.allrecipes.com/recipe/6953/hot-water-cornbread/",
  "name": "Hot Water Cornbread",
  "rating": "4.4",
  "ratingcount": "191",
  "ingredients": "1 cup cornmeal; 1 teaspoon salt; 1 teaspoon white sugar; ¾ cup boiling water; 1 tablespoon bacon grease; 1 cup bacon grease, or as needed",
  "directions": "1. Combine cornmeal, salt, and sugar in a medium bowl. Add boiling water and 1 tablespoon bacon grease; stir until bacon grease melts melts. 2. Pour bacon grease to a depth of 1/2-inch in a large skillet; heat to 375 degrees F (190 degrees C). 3. Shape cornmeal mixture into 12 flattened balls using a heaping tablespoon as a measuring guide. 4. Fry, turning once, in hot oil until crisp and golden brown, about 5 minutes. Drain on paper towels and serve warm.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "95"
},
{
  "url": "https://www.allrecipes.com/recipe/238510/homemade-arepas/",
  "name": "Homemade Arepas",
  "rating": "4.5",
  "ratingcount": "60",
  "ingredients": "2 ½ cups lukewarm water; 1 teaspoon salt; 2 cups pre-cooked white cornmeal (such as P.A.N.®); ¼ cup vegetable oil, or as needed",
  "directions": "1. Stir water and salt together in a medium bowl; gradually stir in cornmeal with your fingers until the mixture forms a soft, moist, malleable dough. 2. Form dough into eight 2-inch diameter balls; pat each ball to flatten into a 3/8-inch-thick arepa patty. 3. Heat oil in a large skillet over medium heat; fry arepas in batches until golden brown, about 4 to 5 minutes per side. Transfer cooked arepas to a paper towel-lined plate to drain until cool enough to handle. 4. Slice halfway through each arepa horizontally with a thin serrated knife to form a pita-like pocket. 5. Enjoy!",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "96"
},
{
  "url": "https://www.allrecipes.com/recipe/230999/sweet-jalapeno-cornbread/",
  "name": "Sweet Jalapeño Cornbread",
  "rating": "4.7",
  "ratingcount": "151",
  "ingredients": "⅔ cup margarine, softened; ⅔ cup white sugar; 2 cups cornmeal; 1 ⅓ cups all-purpose flour; 4 ½ teaspoons baking powder; 1 teaspoon salt; 3  large eggs; 1 ⅔ cups milk; 1 cup chopped fresh jalapeno peppers, or to taste",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking pan. 2. Beat margarine and sugar together in a large bowl until smooth. 3. Combine cornmeal, flour, baking powder, and salt in another bowl. Gently stir eggs and milk together in a third bowl. Pour 1/3 of the milk mixture and 1/3 of the flour mixture alternately into margarine mixture; whisk until just mixed. Repeat with remaining flour and milk mixtures; stir in jalapeño peppers. Spread mixture evenly into the prepared baking pan. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 22 to 26 minutes. Cool in the pan for 10 minutes before slicing.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "294"
}]