[{
  "url": "https://www.allrecipes.com/recipe/212666/easy-orange-glaze-duck/",
  "name": "Easy Orange Glaze Duck",
  "rating": "4.6",
  "ratingcount": "15",
  "ingredients": "1 (12 fluid ounce) can or bottle orange soda; 1 (6 ounce) can frozen orange juice concentrate, thawed; ½ (18 ounce) bottle honey barbecue sauce; ¼ cup brown sugar; ⅓ cup bottled teriyaki sauce; 1 (5 pound) whole frozen duckling, thawed; 1 (4.5 ounce) can sliced mushrooms, drained",
  "directions": "1. Pour the orange soda, orange juice concentrate, barbecue sauce, brown sugar, and teriyaki sauce into a bowl, and stir to combine and dissolve the sugar. 2. Preheat oven to 350 degrees F (175 degrees C). Remove any excess pieces of fat from inside the duckling, place the duck into a roasting pan, and prick the skin all over with a fork to allow the fat to drain off while roasting. 3. Brush the duckling with the orange mixture. Place the mushrooms into the cavity of the duck, and spoon in some of the orange sauce. 4. Roast the duck in the preheated oven, brushing it every 20 to 30 minutes with the orange sauce, until a meat thermometer inserted into a thick part of a thigh reads 165 degrees F (75 degrees C), about 2 1/2 hours.",
  "prep": "10 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 40 mins",
  "calories": "947"
},
{
  "url": "https://www.allrecipes.com/recipe/207282/chicago-style-roast-duck/",
  "name": "Chicago Style Roast Duck",
  "rating": "4.3",
  "ratingcount": "7",
  "ingredients": "1 (4 pound) whole duck; 1 tablespoon garlic powder; 1 tablespoon onion powder; salt and pepper, to taste; 2 tablespoons caraway seeds",
  "directions": "1. Preheat oven to 425 degrees F (220 degrees C). 2. Wash duck and pat dry. Score breast and legs by cutting into skin with sharp knife, going 2/3 of the way through the skin, being careful not to slice into meat. Season the cavity and the outside of the duck with garlic powder, onion powder, salt, and pepper; massage spices into meat. Sprinkle caraway seeds over duck, and into scored skin. Place on a rack in a roasting pan, breast side up. 3. Roast duck in preheated oven for 15 minutes. Turn breast side down, and roast for an additional 15 minutes. Remove duck from the oven; reduce oven temperature to 350 degrees F. Turn duck breast side up again, and return to the oven for 20 minutes. Turn duck one more time, breast side down. Roast for a final 20 minutes. Remove duck from oven and allow to rest for 10 minutes before serving.",
  "prep": "15 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 35 mins",
  "calories": "389"
},
{
  "url": "https://www.allrecipes.com/recipe/230047/duck-adobo/",
  "name": "Duck Adobo",
  "rating": "4.6",
  "ratingcount": "35",
  "ingredients": "6  duck legs; salt and freshly ground black pepper to taste; 1 tablespoon vegetable oil; 1 large onion, sliced; 8 cloves garlic, minced; 1 ½ cups chicken broth; 1 cup seasoned rice vinegar; ½ cup soy sauce, or to taste; 2 teaspoons sambal chili paste, or other hot pepper sauce to taste; 2  bay leaves",
  "directions": "1. Season duck legs with salt and black pepper. 2. Heat oil in a large, deep skillet over medium-high heat. Add duck legs, skin-side down, and cook until browned, 3 to 4 minutes per side. Transfer to a plate; drain all but 1 tablespoon fat from the skillet. 3. Cook onion in reserved duck fat over medium heat until it begins to turn translucent, 3 to 4 minutes. Add garlic; cook and stir until fragrant, 1 to 2 minutes. Stir in broth, vinegar, soy sauce, chili paste, and bay leaves; bring to a simmer. 4. Return duck legs to the skillet, loosely cover, and simmer until duck legs are tender and easily pierced with a fork, about 2 hours. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 5. Uncover, increase the heat to high, and cook until the sauce is thick, about 5 minutes; season with salt and black pepper to taste. Discard bay leaves before serving.",
  "prep": "15 mins",
  "cook": "2 hrs 20 mins",
  "total": "2 hrs 35 mins",
  "calories": "111"
},
{
  "url": "https://www.allrecipes.com/recipe/18777/roast-duck-with-apple-dressing/",
  "name": "Roast Duck with Apple Dressing",
  "rating": "4.4",
  "ratingcount": "48",
  "ingredients": "1 (4 pound) whole duck; salt and pepper to taste; 1 teaspoon poultry seasoning; ½ tablespoon butter; 3 tablespoons chopped onion; 5 stalks celery, chopped; 3 cups peeled, cored and chopped apple; 3 cups cornbread crumbs; 1 tablespoon olive oil",
  "directions": "1. Rinse duck and pat dry; rub with salt, pepper, and poultry seasoning. 2. Melt butter in a small skillet over medium heat. Saute onion and celery in butter until tender. In a medium bowl, combine with apple and cornbread crumbs. Mix together to make dressing (if necessary, add a little water to moisten). 3. Preheat oven to 350 degrees F (175 degrees C). 4. Fill the duck's cavity with dressing, and sew shut with kitchen twine. Rub outside of bird lightly with olive oil, and place in a shallow roasting pan or 9x13 inch baking dish. 5. Bake in preheated oven for 60 to 80 minutes, or until internal temperature reaches 180 degrees F (80 degrees C.)",
  "prep": "10 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 30 mins",
  "calories": "477"
},
{
  "url": "https://www.allrecipes.com/recipe/222207/sous-vide-duck-breast/",
  "name": "Sous Vide Duck Breast",
  "rating": "4.9",
  "ratingcount": "30",
  "ingredients": "2 (8 ounce) boneless duck breast halves, skin on; salt and ground black pepper to taste; 2 teaspoons fresh thyme leaves; 1 teaspoon vegetable oil",
  "directions": "1. Cut several very shallow crosswise slashes across the skin of each duck breast about 1/2 inch apart. (The cuts should only barely cut into the skin and fat; don't cut into the meat.) Season skin sides with salt, then generously season meat sides with salt, pepper, and thyme. Place into a heavy-duty resealable plastic bag, squeeze out all the air, and seal. Refrigerate for 1 hour. 2. Fill a large Dutch oven about 2/3 full with water and place over medium heat; heat to 135 degrees F (57 degrees C). Attach a candy thermometer to the side of the Dutch oven in order to monitor and maintain the water temperature. Place a silicone hot pad into the bottom of the pot to keep the plastic bag from contacting the bottom of the pan. 3. Place the sealed plastic bag into the Dutch oven. Cook, moving the bag around occasionally and adjusting the heat as necessary to maintain the temperature at 135 degrees F (57 degrees C), for 1 hour. 4. Remove duck breasts from the plastic bag and pat dry. Generously season skin sides with salt. 5. Heat oil in a skillet over high heat. Place duck breasts, skin-side down, in the hot skillet until fat renders and skin is golden brown, 5 minutes. Turn breasts over and cook until lightly browned and meat still pink in the center, 1 minute. Let rest for 2 minutes before slicing.",
  "prep": "10 mins",
  "cook": "1 hr 10 mins",
  "total": "2 hrs 25 mins",
  "calories": "177"
},
{
  "url": "https://www.allrecipes.com/recipe/114442/grilled-wild-duck-breast/",
  "name": "Grilled Wild Duck Breast",
  "rating": "4.8",
  "ratingcount": "80",
  "ingredients": "¼ cup Worcestershire sauce; 2 tablespoons olive oil; 2 tablespoons minced garlic; ½ teaspoon hot sauce; ¼ teaspoon black pepper; 4  skinned, boned duck breast halves",
  "directions": "1. Stir together Worcestershire sauce, olive oil, garlic, hot sauce, and pepper in a large bowl. Add duck breasts; toss well to coat. Cover and marinate in the refrigerator, 30 minutes to overnight. 2. Preheat the grill for medium-high heat. 3. Remove duck from marinade and cook on the preheated grill to desired doneness, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Discard marinade.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "55 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/259009/cranberry-orange-duck/",
  "name": "Cranberry Orange Duck",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1 teaspoon Chinese five-spice powder, or more to taste; 1 (5 1/2 pound) whole duck; 1  onion, chopped; 1  orange - zested, peeled, and cubed; 1 (12 ounce) bag fresh cranberries; 1 ounce brandy-based orange liqueur (such as Grand Marnier®); 1 tablespoon honey; 1 tablespoon white sugar; 1 teaspoon soy sauce",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Sprinkle Chinese five-spice powder inside the duck cavity. Add chopped onion and cubed orange. 3. Combine cranberries, orange liqueur, honey, white sugar, and soy sauce in a saucepan. Cook and stir until glaze reaches a jam-like consistency, 7 to 10 minutes. Allow to cool slightly, about 3 minutes. 4. Place duck on a roasting rack inside a roasting pan; baste with the glaze. 5. Bake in the preheated oven until no longer pink at the bone and the juices run clear, about 2 1/2 hours. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C).",
  "prep": "20 mins",
  "cook": "2 hrs 37 mins",
  "total": "3 hrs",
  "calories": "673"
},
{
  "url": "https://www.allrecipes.com/recipe/65147/roasted-duck/",
  "name": "Roasted Duck",
  "rating": "4.6",
  "ratingcount": "370",
  "ingredients": "2 teaspoons paprika; 2 teaspoons salt; 1 teaspoon black pepper; 1 (5 pound) whole duck; ½ cup butter, melted, divided",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Combine paprika, salt, and pepper in a small bowl; rub spice mixture onto skin of duck. Place duck in a roasting pan. 3. Roast in the preheated oven for 1 hour. 4. Spoon 1/4 cup melted butter over duck and continue cooking for 45 minutes more. 5. Spoon remaining 1/4 cup melted butter over duck and cook until golden brown, about 15 minutes more.",
  "prep": "10 mins",
  "cook": "2 hrs",
  "total": "2 hrs 10 mins",
  "calories": "625"
},
{
  "url": "https://www.allrecipes.com/recipe/267804/no-fail-duck-breast/",
  "name": "No-Fail Duck Breast",
  "rating": "1.0",
  "ratingcount": "1",
  "ingredients": "2  large duck breasts, with skin on; ¼ cup soy sauce; 1  lemon, juiced; 2 tablespoons garlic powder; 1 (1/2 inch) piece ginger, grated; 2 medium onions, coarsely chopped",
  "directions": "1. Pierce duck breast skin using a knife. Combine soy sauce, lemon juice, garlic powder, and ginger in a large shallow bowl. Add duck breasts to the marinade and let sit 30 minutes. 2. Preheat the oven to 500 degrees F (260 degrees C). 3. Divide onions evenly between 2 small casserole dishes. Place 1 duck breast in each dish. Pour remaining marinade equally over duck. 4. Bake in the preheated oven for 15 minutes. Remove dishes from oven and carefully drain and discard as much accumulated fat as possible. Return dishes to oven and bake 20 minutes more. 5. Transfer duck to serving dishes and let sit about 5 minutes. Slice thinly and top with baked onions.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "1 hr 20 mins",
  "calories": "257"
},
{
  "url": "https://www.allrecipes.com/recipe/31972/peking-duck/",
  "name": "Peking Duck",
  "rating": "4.5",
  "ratingcount": "118",
  "ingredients": "1 (4 pound) whole duck, dressed; ½ teaspoon ground cinnamon; ½ teaspoon ground ginger; ¼ teaspoon ground nutmeg; ¼ teaspoon ground white pepper; ⅛ teaspoon ground cloves; 3 tablespoons soy sauce, divided; 1 tablespoon honey; 5  green onions, divided; ½ cup plum jam; ¼ cup finely chopped chutney; 1 ½ teaspoons sugar; 1 ½ teaspoons distilled white vinegar; 1  orange, sliced in rounds; 1 tablespoon chopped fresh parsley, for garnish",
  "directions": "1. Rinse duck inside and out; pat dry. Cut off tail and discard. 2. Mix together cinnamon, ginger, nutmeg, white pepper, and cloves in a small bowl. Sprinkle 1 teaspoon spice mixture into cavity of duck. Stir 1 tablespoon soy sauce into remaining spice mixture and rub evenly over entire outside of duck. Cut 1 green onion in half and tuck it inside cavity. Cover and refrigerate duck for at least 2 hours or up to overnight. 3. Place duck breast-side up on a rack set in a wok or pot. Steam for 1 hour, adding more water as it evaporates. Lift duck with two large spoons to drain juices and green onion. Place duck breast-side up in a roasting pan and prick skin all over with a fork. 4. Preheat the oven to 375 degrees F (190 degrees C). 5. Roast duck in the preheated oven for 30 minutes. 6. Mix together remaining 2 tablespoons soy sauce and honey in a small bowl. Brush honey mixture onto duck. 7. Increase the oven temperature to 500 degrees F (260 degrees C). Roast until skin is richly browned, about 5 minutes. Do not allow skin to char. 8. Mix together plum jam, chutney, sugar, and vinegar in a small serving bowl. Chop remaining green onions and place them into a separate bowl. 9. Place whole duck onto a serving platter and garnish with orange slices and fresh parsley. Serve with plum sauce and chopped green onions.",
  "prep": "15 mins",
  "cook": "1 hr 35 mins",
  "total": "3 hrs 50 mins",
  "calories": "556"
},
{
  "url": "https://www.allrecipes.com/recipe/239783/duck-rillettes/",
  "name": "Duck Rillettes",
  "rating": "5.0",
  "ratingcount": "10",
  "ingredients": "1 ½ tablespoons kosher salt; 2 teaspoons ground black pepper, or more to taste; 2 teaspoons dried thyme; 12 cloves garlic; 1 bunch fresh thyme sprigs; 1 orange, zested into thin strips; 6 (1/4-inch-thick) slices fresh ginger; 3  bay leaves; 1 whole duck; 2 tablespoons unsalted butter, softened; 1 tablespoon brandy (such as Armagnac); 2 teaspoons chopped fresh parsley; 1 teaspoon chopped fresh chives; 1/2 teaspoon Dijon mustard; 1 pinch cayenne pepper; salt and ground black pepper to taste; 1/2 teaspoon grated orange zest; 2 teaspoons fresh thyme leaves, or to taste",
  "directions": "1. Preheat the oven to 250 degrees F (120 degrees C). Line a 9x13-baking dish with two pieces of aluminum foil. 2. Make the spice rub: Stir kosher salt, pepper, and thyme together in a small bowl. Make the seasoning mix: Mix garlic, thyme sprigs, garlic, ginger, and bay leaves together in another bowl. 3. Season duck all over, both inside and out, with about 2/3 of the spice rub. Fill the cavity with all of the seasoning mix. Place duck, breast-side up, into the prepared baking dish and season with remaining spice rub. Wrap duck tightly in aluminum foil. 4. Roast in the preheated oven until meat pulls away from the bones, 5 to 6 hours. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cool duck with its accumulated juices, wrapped in aluminum foil, to room temperature, about 1 hour. Chill in the refrigerator for 12 hours. 5. Pick meat from the bones and place into a bowl. 6. Spoon all accumulated juices in the foil into a saucepan and set over medium-high heat. Cook until hot throughout, about 5 minutes. Strain juices through a fine-mesh strainer into a bowl. Let fat and stock separate, then transfer fat from the top to another bowl. 7. Mash duck meat, 3 tablespoons duck fat, 2 tablespoons duck stock, butter, brandy, parsley, chives, Dijon mustard, cayenne pepper, salt, and black pepper together in a bowl with a wooden spoon. Transfer to to a sealable container, press down, and drizzle a little duck fat over the top. Sprinkle thyme leaves, more black pepper, and orange zest over the top. Seal the container and refrigerate for the flavors to blend, 1 to 3 days.",
  "prep": "1 hr",
  "cook": "5 hrs 5 mins",
  "total": "1 day 19 hrs 5 mins",
  "calories": "125"
},
{
  "url": "https://www.allrecipes.com/recipe/261982/duck-jalapeno-poppers/",
  "name": "Duck Jalapeño Poppers",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2  duck breast halves; 2 cups water; 2 tablespoons salt; 1 tablespoon ground chipotle pepper (such as Mrs. Dash Southwest Chipotle Seasoning Blend®); ¼ cup apple cider vinegar; 2 tablespoons Worcestershire sauce; 1 teaspoon monosodium glutamate (such as Ac'cent®); 1 teaspoon garlic powder; 5 drops hot pepper sauce; 8  jalapeno peppers - stemmed, seeded, and halved lengthwise, or to taste; 1 (8 ounce) package pepper Jack cheese, sliced, or to taste; 1 (8 ounce) package cream cheese; 8 thick slices bacon, or to taste; toothpicks",
  "directions": "1. Clean and rinse duck breasts thoroughly in cold water. Cut into 1/4-inch slices and place in a resealable plastic bag with water and salt. Refrigerate for 2 to 3 hours. Remove from bag and rinse again under cold running water. 2. Combine duck, ground chipotle pepper, vinegar, Worcestershire sauce, monosodium glutamate, garlic powder, and hot pepper sauce in a resealable plastic bag. Refrigerate until well marinated, 2 to 3 hours more. 3. Fill jalapenos with pepper Jack cheese and cream cheese. Top with marinated duck. Cut bacon strips in half and wrap each stuffed pepper with a bacon strip. Secure with a toothpick. 4. Preheat an outdoor grill for 400 degrees F (204 degrees C) and lightly oil the grate. Cook jalapeno peppers, flipping once or twice, until bacon is browned, about 15 minutes.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "2 hrs 45 mins",
  "calories": "164"
},
{
  "url": "https://www.allrecipes.com/recipe/13874/turducken/",
  "name": "Turducken",
  "rating": "4.7",
  "ratingcount": "27",
  "ingredients": "1 (3 pound) whole chicken, boned; salt and pepper to taste; Creole seasoning to taste; 1 (4 pound) duck, boned; 1 (16 pound) turkey, boned; 3 cups prepared sausage and oyster dressing",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Lay the boned chicken skin-side down on a platter and season liberally with salt, pepper and Creole seasoning. Lay the boned duck skin-side down on top of the chicken and season liberally with salt, pepper and Creole seasoning. Cover and refrigerate. 2. Lay the boned turkey skin-side down on a flat surface. Cover with a layer of cold Sausage and Oyster Dressing and push the dressing into the leg and wing cavities so they will look as if they still have bones in them. 3. Lay the duck on top of the turkey skin-side down and cover it with a layer of cold dressing. Lay the chicken on top of the duck skin-side down and cover it with a layer of cold dressing. 4. With the help of an assistant, bring the edges of the turkey skin up and fasten them together with toothpicks. Use the kitchen string to lace around the toothpicks to help hold the stuffed turkey together. Carefully place the turducken, breast up in a large roasting pan. 5. Roast covered for 4 hours or until the turducken is golden brown. Continue to roast uncovered for 1 hour or until a meat thermometer inserted through the thigh registers 180 degrees F. and a thermometer inserted through the stuffing registers 165 degrees F. Check the turducken every few hours to baste and remove excess liquid. There will be enough pan juices for a gallon of gravy. Carve and serve.",
  "prep": "1 hr",
  "cook": "4 hrs",
  "total": "5 hrs",
  "calories": "836"
},
{
  "url": "https://www.allrecipes.com/recipe/259008/garlic-roasted-duck-breast/",
  "name": "Garlic Roasted Duck Breast",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1 (6 ounce) skin-on duck breast; 2 cloves garlic, cut into 1/8-inch strips; 1 teaspoon salt; 1 teaspoon ground black pepper; 1 sprig fresh rosemary",
  "directions": "1. Place duck breast skin side-down on a cutting board. Cut a small slit from top to bottom, 2/3 of the way through the duck breast. Season with salt and pepper. 2. Preheat oven to 400 degrees F (200 degrees C). 3. Heat a skillet over medium-high heat. Place duck breast skin side-down in the hot skillet; cook until browned, about 30 seconds. Flip and repeat on the other side. 4. Transfer duck breast to a clean work surface, skin-side down. Place 3 or 4 garlic strips inside the slit. Place rosemary sprig over garlic; top with remaining garlic strips. Place skin side-up in a baking pan. 5. Bake in the preheated oven until an instant-read thermometer inserted into the center reads 120 degrees F (50 degrees C), about 10 minutes. Cover with aluminum foil. Let rest for 5 minutes before slicing.",
  "prep": "10 mins",
  "cook": "13 mins",
  "total": "28 mins",
  "calories": "132"
},
{
  "url": "https://www.allrecipes.com/recipe/141831/pan-seared-duck-breast-with-blueberry-sauce/",
  "name": "Pan-Seared Duck Breast with Blueberry Sauce",
  "rating": "4.6",
  "ratingcount": "53",
  "ingredients": "2 teaspoons salt; 1 teaspoon  fresh-ground black pepper; 1 ½ tablespoons dried thyme leaves; 1 tablespoon crushed dried rosemary; 3 tablespoons olive oil; 4  potatoes, cubed; 2 pints fresh or frozen blueberries; ½ cup water; ½ cup apple juice; ½ cup white sugar; 1  jalapeno pepper, finely chopped; 3 slices pancetta or bacon, cut into thin strips; 6  shallots, thinly sliced; ½ cup sliced shiitake mushrooms; 2 pounds bok choy, sliced; 4 (8 ounce) boneless duck breast halves; 2 tablespoons vegetable oil; 1 tablespoon butter; 2 tablespoons aged balsamic vinegar",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). In a small bowl mix together the salt, ground black pepper, thyme, and rosemary; set aside. This will be your spice blend for seasoning the roasted potatoes and the duck breasts. 2. Place cubed potatoes into a 9x13 inch baking dish. Drizzle with olive oil and sprinkle 2 tablespoons of your spice blend over the top of the potatoes. Toss the potatoes in the pan until they are evenly coated with oil and seasonings. Spread into a single layer across the bottom of the baking dish and bake for 35 to 40 minutes in the preheated oven. 3. While the potatoes are roasting, stir together the blueberries, water, apple juice, sugar, and jalapeno in a small saucepan. Bring to a boil over medium-high heat, then reduce heat to low, and simmer until the mixture has reduced to the consistency of syrup, about 10 minutes. 4. Cook the pancetta in a large skillet over medium heat until crispy. Remove the pancetta to drain on a paper towel, leaving the drippings in the skillet. Add the shallots and the mushrooms to the hot skillet; stir and cook them until soft and just beginning to brown. Remove the shallots and mushrooms and set aside. Increase heat to medium-high and place the bok choy in the hot skillet. Stir and cook the bok choy until the leaves are wilted and the white stalk pieces are tender, about 5 minutes. Return the shallots, mushrooms, and pancetta to the skillet, turn off the heat and set aside. 5. Rinse the duck breast halves and pat dry. Rub the remaining spice blend onto both sides of the duck breasts. Preheat a large skillet over medium-high heat, when the pan is hot put in the vegetable oil and butter. Immediately place the duck breasts in the pan, skin and fat side down. Do not move the duck breasts until the skin is deep brown, about 5 minutes. Turn the breasts and cook until the internal temperature of the thickest part is 160 degrees F (71 degrees C) for well done. Remove the duck from the pan and place on a plate, covered with foil to rest for 5 minutes. While the duck is resting, place the skillet with the bok choy mixture onto a burner over medium heat to warm through. 6. Slice each duck breast diagonally into 1/2 inch strips. Divide the bok choy mixture among four plates and drizzle each serving with 1/2 tablespoon of aged balsamic vinegar. Arrange the sliced duck breasts on top of the bok choy mixture; ladle on blueberry sauce. Serve with oven-roasted potatoes on the side.",
  "prep": "45 mins",
  "cook": "45 mins",
  "total": "1 hr 30 mins",
  "calories": "846"
},
{
  "url": "https://www.allrecipes.com/recipe/236699/chef-johns-orange-duck/",
  "name": "Duck a l'Orange",
  "rating": "4.8",
  "ratingcount": "51",
  "ingredients": "2  duck breast halves; salt to taste; 1 cup chicken broth; 2 tablespoons orange liqueur (such as Grand Marnier); 1 tablespoon sherry vinegar; 1 tablespoon Seville orange marmalade, or more to taste; 2 teaspoons grated orange zest; 1 pinch cayenne pepper; 1 tablespoon reserved duck fat; 1 teaspoon all-purpose flour; 1 tablespoon butter",
  "directions": "1. Score duck skin almost all the way through the skin and fat each way on the diagonal in a crosshatch pattern. Generously season with salt and rub salt into each breast. Let rest, skin-side up, at room temperature, for 15 minutes. 2. Whisk chicken broth, orange liqueur, sherry vinegar, orange marmalade, orange zest, and cayenne pepper together in a small bowl. 3. Pat duck breasts dry with paper towels. Re-season skin-side of duck breasts with salt. 4. Heat duck fat in a heavy skillet over medium heat for 2 minutes. Place duck in skillet, skin-side down, and cook for 6 minutes. Flip duck breasts and cook until they start to firm and are reddish-pink and juicy in the center, about 4 minutes more. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Transfer breasts to a plate to rest. Pour any rendered duck fat into a glass jar. 5. Return skillet to medium heat and whisk flour into pan; cook and stir until flour is completely incorporated, about 1 minute. Pour orange mixture into skillet; bring to a boil. Cook until sauce thickens and is reduced, 3 to 5 minutes. Reduce heat to low. When orange mixture stops bubbling, add butter; stir until butter is completely melted and incorporated into the sauce, about 1 minute. Season with salt to taste. 6. Slice duck breasts across the grain, arrange on a plate, and spoon orange sauce over the top.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "354"
},
{
  "url": "https://www.allrecipes.com/recipe/269925/maple-smoked-duck-breasts/",
  "name": "Maple-Smoked Duck Breasts",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "2  boneless duck breast halves, skin on; 2 tablespoons kosher salt; 2 teaspoons cracked black pepper; 3 tablespoons maple syrup; 2 teaspoons maple syrup; maple wood chips",
  "directions": "1. Season duck breasts on all sides with salt and pepper. Place in a shallow dish and cover with 3 tablespoons maple syrup. Cover, place in refrigerator, and allow to marinate 12 to 24 hours. 2. Preheat an electric smoker according to manufacturer's directions to 225 degrees F (110 degrees C) using maple wood chips. 3. Remove duck breasts from marinade and rinse well. Pat dry with paper towels. Use a sharp knife to cut shallow cross-hatch marks into duck breast skin; do not cut all the way through to the meat. Brush with 2 teaspoons maple syrup. 4. Place duck breasts, skin-side up, on grill rack in the smoker. Place a drip pan underneath. Smoke at 225 degrees F (110 degrees C) for 3 to 4 hours, adding more maple wood chips as necessary to keep smoke continuous, until duck breasts reach an internal temperature of 160 degrees F (70 degrees C). Cool to room temperature before slicing. Keep refrigerated until ready to serve.",
  "prep": "10 mins",
  "cook": "3 hrs",
  "total": "15 hrs 10 mins",
  "calories": "64"
},
{
  "url": "https://www.allrecipes.com/recipe/108257/duck-with-honey-soy-and-ginger/",
  "name": "Duck with Honey, Soy, and Ginger",
  "rating": "4.5",
  "ratingcount": "53",
  "ingredients": "2  duck breast halves; 1 pinch salt; 1 pinch cayenne pepper; 1 pinch ground black pepper; ½ cup chicken stock; 2 tablespoons honey; 2 tablespoons soy sauce; 2 tablespoons rice wine; 1 tablespoon grated fresh ginger; 1 tablespoon tomato sauce; 1 pinch chili powder; 1 teaspoon lime juice",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). 2. Use a sharp knife to score across the duck breasts 4 times through the skin and fat but just barely to the meat. Rub the skin with salt, cayenne, and black pepper. 3. Preheat an ovenproof skillet over medium-high heat. Lay the breasts in the skillet skin-side down and fry until the skin is brown and crisp, about 5 minutes. Use a spoon to carefully discard any excess fat from the bottom of the skillet. Turn the breasts over and cook for 1 minute. 4. Place the skillet into the preheated oven and roast until the internal temperature of the thickest part of the breasts reach 160 degrees F (71 degrees C) for well done, or the breasts reach desired doneness. 5. Remove the duck breasts from the skillet and cover with foil. Set aside to rest. Pour off excess fat from the skillet. Place the stock, honey, soy sauce, rice wine, ginger, tomato sauce, chili powder, and lime juice in the skillet. Whisk the sauce over high heat, bring to a boil and cook until the sauce thickens, about 2 minutes. Slice the duck breasts thinly, arrange on serving plates, and pour the sauce over the top.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "260"
},
{
  "url": "https://www.allrecipes.com/recipe/246668/chef-johns-cassoulet/",
  "name": "Chef John's Cassoulet",
  "rating": "5.0",
  "ratingcount": "15",
  "ingredients": "1 pound Tarbais beans, or other white beans, soaked overnight; 3 quarts seasoned chicken stock or broth; 4 ounces pancetta, cut into 1/4-inch dice; 2  bay leaves; 1 teaspoon black peppercorns; 6 sprigs thyme; 6  unpeeled garlic cloves, cut in half; Reserved bones from duck confit and pork, if available; 12 ounces fresh pork shoulder or chop, cut into 2-inch pieces; Salt and freshly ground black pepper; 1 tablespoon vegetable oil; 1 ½ pounds Toulouse sausages, or other garlic pork sausage; 2  duck leg confit; 1 cup diced onion; ½ cup diced carrot; ½ cup diced celery; ¼ cup tomato paste; ¾ cup white wine; 1 teaspoon salt; 2 cups plain dry bread crumbs; ½ cup chopped Italian parsley, plus more for garnish; 2 tablespoons rendered duck fat; 2 tablespoons melted butter; 1/4 cup cooking liquid",
  "directions": "1. Rinse soaked beans and drain. 2. Pour broth into a large pot. Add chopped pancetta, bones from duck confit, and drained beans. Tie bay leaves, peppercorns, thyme sprigs, and garlic into a small square of cheesecloth to create the bouquet garni; add to the pot. Stir. Bring to a simmer over high heat; skim foamy scum that forms, if desired. Reduce heat to low until beans are almost tender, 30 to 45 minutes. 3. Sprinkle pork pieces with salt and pepper. Heat oil in a skillet over medium-high heat; brown the pork pieces, 3 to 5 minutes. Transfer to a bowl. Add sausage to the skillet and cook in the same oil, turning until nicely browned on all sides, 3 to 4 minutes. Cut sausages in half and transfer to bowl with pork pieces. 4. Remove fat and skin from duck confit and add them to the same skillet. Cook over medium heat until fat is rendered, about 3 minutes. Transfer all fat and browned pieces from the skillet to a mixing bowl. Add melted butter. Stir in bread crumbs and chopped parsley; stir until mixture looks like damp sand. Mix in about 1/4 to 1/2 cup broth. 5. Preheat oven to 350 degrees F (175 degrees C). 6. Place onions, carrots, and celery in the same skillet used to brown meats; add pinch of salt. Cook and stir over medium heat until onions are translucent and mixture turns golden, 5 to 7 minutes. Stir in tomato paste; cook and stir until tomato paste starts to caramelize and stick to the bottom of the pan, 3 or 4 minutes. Pour in white wine; cook and stir until most of the wine evaporates, 5 or 6 minutes. Remove from heat. 7. Drain beans over a large bowl to retain all the cooking liquid. Remove bones and bouquet garni. 8. Place drained beans in large shallow baking dish or cast iron skillet (about 12 inches in diameter and 3 inches deep). Stir in cooked vegetables and about 1 cup broth. Add pork pieces and distribute evenly among the beans. Top with shredded duck confit. Nestle sausage halves into bean mixture. 9. Ladle cooking liquid into the baking dish until beans are nearly submerged. Spread bread crumb mixture evenly over the top but don't press into liquid. Use your fingertips to make gentle indentations on the crumb surface for better browning. 10. Bake in preheated oven until most of the liquid has been absorbed, about 2 hours. Remove from oven and create a small \"well\" in the center of the cassoulet crust. Ladle about 1/2 cup of cooking liquid (or as needed) into the well to rehydrate mixture. Use a fork to gently poke into the cassoulet to ensure the liquid is fairly evenly distributed but try not to disturb the crusty surface. 11. Continue baking until cassoulet surface is crispy and caramelized, meat is fork tender, and beans are creamy and tender, about 30 to 45 more minutes. 12. Serve in large bowls with a spoonful or 2 of hot cooking liquid. Top with chopped fresh parsley.",
  "prep": "20 mins",
  "cook": "3 hrs 50 mins",
  "total": "12 hrs 10 mins",
  "calories": "712"
},
{
  "url": "https://www.allrecipes.com/recipe/162383/duck-fried-rice/",
  "name": "Duck Fried Rice",
  "rating": "4.4",
  "ratingcount": "8",
  "ingredients": "1 cup chopped Chinese roast duck meat, skin and fat separated and set aside; ½ cup thinly sliced Chinese barbecued pork; 6  green onions, thinly sliced; 2 tablespoons soy sauce; 2  eggs, beaten; 3 cups cooked long-grain rice; salt and pepper to taste",
  "directions": "1. Cook the duck skin and fat in a wok or large skillet over medium heat until the skin is crispy, and the fat has rendered, about 10 minutes. Increase heat to medium-high, and stir in the duck meat, pork, half of the green onions, and the soy sauce. Cook and stir until the meats are heated through, about 5 minutes. 2. Add rice and toss together until rice is hot and sizzling, about 5 minutes. Make a wide well in the middle of the rice, exposing the bottom of the pan. Pour in the beaten eggs and stir until the eggs have scrambled. Then stir the scrambled eggs into the rice along with the rest of the green onions. Toss and stir until the rice is very hot, about 5 minutes. Season to taste with salt and pepper before serving.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "375"
},
{
  "url": "https://www.allrecipes.com/recipe/55965/bacon-wrapped-duck-breasts/",
  "name": "Bacon Wrapped Duck Breasts",
  "rating": "4.0",
  "ratingcount": "23",
  "ingredients": "¼ cup salt; 8 cups water; 12  duck breast halves; 12 slices bacon; 1 (16 ounce) bottle Italian-style salad dressing; toothpicks",
  "directions": "1. Mix together salt and water. Set aside 2/3 of the mixture, and pour the rest into a glass baking dish. Soak the duck in the salt water overnight to remove the gamey. Change the salt water twice, or until mostly clear. 2. The next morning, discard the salt water, and pour salad dressing over the duck breasts, and marinate for at least 8 hours. 3. Preheat the oven to 350 degrees F (175 degrees C). Wrap each breast half in one strip of bacon, and secure with a toothpick. Place the breasts in a 9x13 inch baking dish. 4. Bake for about 1 hour, or until bacon is crisp, and duck is cooked through.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "21 hrs 15 mins",
  "calories": "532"
},
{
  "url": "https://www.allrecipes.com/recipe/218788/fayes-duck-dressing/",
  "name": "Faye's Duck Dressing",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 (4 pound) whole duck; 10 cups water, or more as needed; 1 (9x9 inch) pan prepared cornbread, crumbled; 4  prepared biscuits, chopped; 1 large onion, chopped; 1 teaspoon dried sage; 1 teaspoon ground black pepper; ½ teaspoon garlic salt; ½ teaspoon salt; 8 large eggs",
  "directions": "1. Place duck in a 12-quart stockpot with enough water to cover by 2 to 3 inches. Bring to a boil, reduce heat to medium-low, and simmer until meat is tender, about 1 hour. Remove duck from broth, allow to cool, and pull meat from the bones into bite-sized pieces. Reserve broth. 2. Preheat the oven to 375 degrees F (190 degrees C). 3. Mix together cornbread, biscuits, onion, sage, pepper, garlic salt, and salt in a large roasting pan. Beat eggs in a bowl; pour over cornbread mixture. Add duck pieces to the pan; mix thoroughly. Stir in reserved duck broth until dressing is very moist (about the consistency of thick pancake batter). 4. Bake in the preheated oven until a spoon inserted into the center of dressing can stand up, 45 minutes to 1 hour.",
  "prep": "30 mins",
  "cook": "1 hr 45 mins",
  "total": "2 hrs 15 mins",
  "calories": "461"
},
{
  "url": "https://www.allrecipes.com/recipe/13250/duck-soup-czarnina/",
  "name": "Duck Soup (Czarnina)",
  "rating": "4.2",
  "ratingcount": "9",
  "ingredients": "1 (4 pound) wild duck, whole; 4 cups duck blood; 8 cups water; 1 teaspoon salt; 1 stalk celery, cut into 2 inch pieces; 1 sprig chopped fresh parsley; 1 cup heavy cream; 5  whole allspice berries; 2  whole cloves; 16 ounces pitted prunes; ½ cup raisins; 1  tart apple - peeled, cored and chopped; 2 tablespoons all-purpose flour; 1 tablespoon white sugar; salt and pepper to taste; 1 tablespoon fresh lemon juice",
  "directions": "1. Cover whole duck with water in large stock pot. Add salt, and bring to a boil. Skim off foam. 2. Place celery, parsley, allspice, and cloves in a cheese cloth bag, and add to stock pot. Cover and cook over low heat until meat is tender, approximately 1 1/2 hours. 3. Remove cheese cloth bag from stock pot. Remove duck. Discard bones, cut up meat, and return to the broth. 4. Mix in prunes, raisins and apple. Simmer for 30 minutes. 5. In a medium bowl, beat flour and sugar into cream until smooth. Beat in duck blood gradually. Add 1/2 cup hot soup stock to blood mixture, blending thoroughly. Pour mixture slowly back into stock pot, stirring constantly until soup comes to a boil. Season to taste with salt, pepper, lemon juice and vinegar.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "712"
},
{
  "url": "https://www.allrecipes.com/recipe/41879/duck-breasts-with-raspberry-sauce/",
  "name": "Duck Breasts with Raspberry Sauce",
  "rating": "4.0",
  "ratingcount": "39",
  "ingredients": "4  duck breast halves; 2 teaspoons sea salt; 2 teaspoons ground cinnamon; 4 teaspoons demerara sugar; ½ cup red wine; ¼ cup creme de cassis liqueur; 1 teaspoon cornstarch; 4 ounces raspberries",
  "directions": "1. Preheat oven on broiler setting. Use a fork to score the duck breasts through the skin and fat but not all the way through to the meat. 2. Heat a large heavy skillet on medium high. Fry the duck breasts skin side down, until the skin browns and fat runs out, about 10 minutes. Remove the breasts from the pan, and pour off most of the fat. Return breasts to pan, and fry skin side up for another 10 minutes. Remove breasts from pan, and allow to rest on a baking sheet. Mix the sea salt, cinnamon and Demerara sugar together and sprinkle over the skin of the duck breasts. Pour most of the fat out of the frying pan. 3. Mix together the red wine, cassis, and cornstarch in a small bowl. Pour into the pan, and simmer for 3 minutes, stirring constantly, until the sauce is thickened. Add raspberries, and simmer for another minute until heated through. 4. Broil the duck breasts skin side up, until the sugar begins to caramelize, about 1 minute. Slice the duck breasts thinly, pour a little sauce over the top, and serve warm.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "395"
},
{
  "url": "https://www.allrecipes.com/recipe/234677/how-to-make-cassoulet/",
  "name": "How to Make Cassoulet",
  "rating": "4.6",
  "ratingcount": "19",
  "ingredients": "1 pound dried Great Northern beans; 1  whole clove; ½  onion; 4 cloves garlic, smashed; 1  bay leaf; 1 teaspoon dried thyme; ½ teaspoon dried rosemary; 10 cups water; ½ pound thick-sliced bacon, chopped; 2  ribs celery, diced; 2  carrots, diced; ½  onion, diced; salt to taste; 1 teaspoon olive oil; 1 pound link sausages (preferably French herb sausage), cut in half crosswise; 1 pound cooked duck leg confit; 1 ½ teaspoons salt; 1 teaspoon freshly cracked black pepper; 1 teaspoon herbes de Provence; 1 (14 ounce) can diced tomatoes; ¼ cup butter; 4 cloves garlic, crushed; 2 cups panko bread crumbs; 1 bunch fresh parsley, finely chopped; salt and freshly ground black pepper to taste; 1 tablespoon olive oil",
  "directions": "1. Soak Great Northern beans in water in a large bowl overnight. Drain beans and place into a large soup pot. Push whole clove into the 1/2 onion and add to beans; stir in garlic, bay leaf, thyme, rosemary, and 10 cups water. Bring beans to a simmer and cook over medium-low heat until beans have started to soften, about 1 hour. Drain beans and reserve the cooking liquid, removing and discarding onion with clove and bay leaf. Transfer beans to a large mixing bowl. 2. Preheat oven to 350 degrees F (175 degrees C). 3. Cook bacon in a large, heavy Dutch oven over medium heat until lightly browned and still limp, about 5 minutes. Stir celery, carrots, and 1/2 diced onion into bacon; season with salt. Cook and stir vegetables in the hot bacon fat until tender, about 10 minutes. 4. Heat 1 teaspoon olive oil in a large, heavy skillet over medium heat; brown sausage link halves and duck confit in the hot oil until browned, about 5 minutes per side. 5. Season vegetable-bacon mixture with 1 1/2 teaspoon salt, cracked black pepper, and herbes de Provence; pour in diced tomatoes. Cook and stir mixture over medium heat until juice from tomatoes has nearly evaporated and any browned bits of food on the bottom of pot have dissolved, about 5 minutes. Stir mixture into beans. 6. Spread half the bean mixture into the heavy Dutch oven and place duck-sausage mixture over the beans; spread remaining beans over meat layer. Pour just enough of the reserved bean liquid into pot to reach barely to the top of the beans, reserving remaining liquid. Bring bean cassoulet to a simmer on stovetop and cover Dutch oven with lid. 7. Bake bean cassoulet in the preheated oven for 30 minutes. 8. Melt butter in a large skillet over medium heat; add 4 crushed garlic cloves, panko crumbs, and parsley to the melted butter. Season with salt and black pepper, and drizzle 1 tablespoon olive oil over crumbs. Stir to thoroughly combine. 9. Uncover cassoulet and check liquid level; mixture should still have several inches of liquid. If beans seem dry, add more of the reserved bean liquid. Spread half the crumb mixture evenly over the beans and return to oven. Cook, uncovered, for 20 minutes. There should be about 2 or 3 inches of liquid at the bottom of the pot; if mixture seems dry, add more reserved bean mixture. Sprinkle remaining half the bread crumb mixture over cassoulet. 10. Turn oven heat to 375 degrees F (190 degrees C) and bake cassoulet, uncovered, until crumb topping is crisp, edges are bubbling, and the bubbles are slow and sticky, 20 to 25 more minutes. Serve beans on individual plates and top each serving with a piece of duck and several sausage pieces.",
  "prep": "20 mins",
  "cook": "2 hrs 40 mins",
  "total": "11 hrs",
  "calories": "524"
},
{
  "url": "https://www.allrecipes.com/recipe/259108/duck-confit-the-right-way/",
  "name": "Duck Confit, the Right Way",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "1  shallot, minced; ¼ cup evaporated cane sugar; ¼ cup kosher salt; 3 tablespoons coarsely ground black pepper; 4 cloves garlic, minced; 6 sprigs thyme, chopped; 4  duck legs with thighs; 4  duck wings, trimmed; 4 cups duck fat",
  "directions": "1. Combine shallot, sugar, salt, pepper, garlic, and thyme in a small bowl. Rub all over duck legs, thighs, and wings. 2. Arrange duck parts skin side-up in a dish and cover with plastic wrap. Refrigerate until the seasoning is well absorbed, 24 to 48 hours. 3. Rinse off the seasoning and pat the duck dry. Arrange duck in a single layer in a 9x13-inch baking pan. Let duck stand until it reaches room temperature, about 30 minutes. 4. Preheat oven to 225 degrees F (110 degrees C). 5. Melt duck fat in a saucepan over medium heat until bubbles begin to form, 6 to 8 minutes. Pour duck fat over the room-temperature duck. 6. Bake duck in the preheated oven until tender and the juices run clear, 2 to 3 hours. An instant-read thermometer inserted near the bone should read 135 degrees F (57 degrees C). Pour off the duck fat. 7. Brush a grill pan with some of the used duck fat and heat over medium-high heat until smoking. Add baked duck; cook in batches until skin is crispy, about 90 seconds per side.",
  "prep": "35 mins",
  "cook": "2 hrs 8 mins",
  "total": "1 day 3 hrs 13 mins",
  "calories": "554"
},
{
  "url": "https://www.allrecipes.com/recipe/240607/duck-fesenjan/",
  "name": "Duck Fesenjān",
  "rating": "4.9",
  "ratingcount": "9",
  "ingredients": "8  duck legs; salt and freshly ground black pepper to taste; 2 tablespoons vegetable oil; ¼ cup water, or as needed; 3 tablespoons olive oil, or more to taste; 2 cups diced yellow onion; 1 teaspoon ground turmeric; ½ teaspoon ground cinnamon; ⅛ teaspoon ground nutmeg; 6 cups chicken broth, or more as needed; ⅔ cup pomegranate molasses; ¼ cup honey; 3 cups walnut halves",
  "directions": "1. Season duck legs all over with salt and pepper. 2. Heat vegetable oil in a large skillet over high heat. Place duck legs, skin-side down, in hot oil and cook until browned, 2 to 5 minutes. Turn and cook until browned on the other side, 2 to 4 minutes. Transfer legs to a plate; pour rendered duck fat into a bowl. 3. Pour water into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Remove from the heat. 4. Place about 2 tablespoons duck fat into a Dutch oven; add olive oil and heat over medium heat until hot. Add onion and sauté until golden brown, 7 to 10 minutes. Add turmeric, cinnamon, and nutmeg; cook and stir until fragrant, 1 minute. 5. Pour chicken broth, pomegranate molasses, honey, and reserved water mixture from the skillet into the Dutch oven; bring to a simmer. 6. Meanwhile, grind walnuts to a fine powder in a food processor. 7. Cook and stir ground walnuts in a dry skillet over medium heat until fragrant, 2 to 3 minutes; stir into broth mixture. 8. Place duck legs into broth and press gently to submerge. Reduce the heat and simmer until duck legs are no longer pink at the bone and the juices run clear, 3 to 4 hours. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). 9. Bring broth to a boil; cook until reduced and desired sauce consistency is reached. Season with salt. Ladle sauce over duck legs to serve.",
  "prep": "10 mins",
  "cook": "3 hrs 40 mins",
  "total": "3 hrs 50 mins",
  "calories": "668"
},
{
  "url": "https://www.allrecipes.com/recipe/214676/roast-duck-legs-with-red-wine-sauce/",
  "name": "Roast Duck Legs With Red Wine Sauce",
  "rating": "4.8",
  "ratingcount": "18",
  "ingredients": "1 bunch chopped fresh rosemary; 4 large garlic cloves; 4  duck legs; salt to taste; 1 teaspoon Chinese five-spice powder; 1 ½ cups red wine; 1 ½ tablespoons red currant jelly",
  "directions": "1. Preheat an oven to 375 degrees F (190 degrees C). Spread the rosemary sprigs and garlic cloves into a 9x13-inch baking dish. 2. Place the duck legs on top of the rosemary, and sprinkle with salt and five-spice powder. Bake in the preheated oven for 1 hour. Meanwhile, bring the wine to a boil in a small saucepan over medium-high heat. Stir in the currant jelly until dissolved. Reduce heat to medium-low, and simmer 5 minutes; set aside. 3. After the duck has cooked 1 hour, pour off and discard the fat that has accumulated in the baking dish. Pour the wine sauce over the duck legs, and bake 15 minutes more until the duck is very tender and the sauce has thickened slightly.",
  "prep": "5 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 20 mins",
  "calories": "235"
},
{
  "url": "https://www.allrecipes.com/recipe/151010/duck-confit/",
  "name": "Duck Confit",
  "rating": "4.8",
  "ratingcount": "15",
  "ingredients": "2  uncooked Peking duck legs; 1 tablespoon kosher salt; 1  lemon, zested and thinly sliced; 3 cloves garlic, crushed; 1 tablespoon whole allspice berries; 1 tablespoon juniper berries; 2 sprigs fresh thyme; 2 cups rendered duck fat",
  "directions": "1. Season duck legs with kosher salt on both sides. Place in a large resealable bag. Add lemon zest and slices, garlic, allspice berries, juniper berries, and fresh thyme. Seal the bag; massage duck legs through the bag until all of the ingredients are evenly dispersed. Marinate in the refrigerator for 24 hours. 2. Preheat the oven to 200 degrees F (95 degrees C). 3. Remove duck legs from the marinade. Rinse them off and pat dry. Place remaining marinade ingredients in the bag in the an oven-safe dish, preferably enameled cast iron or glass, just large enough to hold the legs in a single layer. Arrange legs skin-side down in the dish. 4. Pour duck fat into a small saucepan and warm over low heat until liquid. Pour over legs until they are completely covered. If the legs are not covered, add olive oil until they are. As the legs cook, more fat will be rendered from the skin. Cover the dish with a lid. 5. Bake in the preheated oven until the meat pulls easily from the bones, 6 to 7 hours. 6. Remove legs from fat and place in a sealable container. You may leave the bones in or remove them. Make sure there is room at the top of the container. Strain all of the solids from the remaining fat and discard the solids. Pour the fat over the duck until it is covered completely. Seal and allow to cool to room temperature. Once cool, refrigerate and let duck meat cure for 2 months. Reserve any leftover duck fat for other uses.",
  "prep": "15 mins",
  "cook": "6 hrs",
  "total": "1 day 6 hrs 15 mins",
  "calories": "2521"
},
{
  "url": "https://www.allrecipes.com/recipe/245029/easy-peking-duck-lettuce-cups/",
  "name": "Easy \"Peking Duck\" Lettuce Cups",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "6  whole duck legs; 1 tablespoon vegetable oil; 1 tablespoon kosher salt; 2 teaspoons five-spice powder; 1 teaspoon freshly ground black pepper; 3  green onions, cut into large pieces; 5 cloves garlic, halved; 1 tablespoon chopped green onion; ¼ cup hoisin sauce; ½  lemon, juiced; 1 teaspoon sesame oil; 1 teaspoon hot sauce; 18  whole butter or Bibb lettuce leaves; 1  cucumber, diced; 5  green onions, chopped; 1 tablespoon sesame seeds",
  "directions": "1. Preheat the oven to 250 degrees F (120 degrees C). 2. Prepare duck: Place duck legs into a large bowl and drizzle with oil. Sprinkle with salt, five-spice powder, and black pepper; mix to evenly coat. 3. Sprinkle large green onion pieces into a baking dish large enough to hold duck legs in a single layer. Place duck legs, skin-side up, on top of green onions. Scatter garlic over duck. Place a piece of parchment paper directly on top of duck to help retain moisture. Cover the baking dish tightly with aluminum foil. 4. Bake in the preheated oven for 3 hours. Turn off the oven, crack open the oven door, and let duck rest in the oven for 1 hour; do not uncover the dish during this time. 5. Remove the dish from the oven and let cool to room temperature. Baste duck with rendered fat in the dish. Place the parchment paper back over duck and re-wrap the dish in aluminum foil. Refrigerate for 8 hours to overnight. 6. Make sauce: Mix together hoisin sauce, lemon juice, sesame oil, and hot sauce in a small bowl. Set aside. 7. Remove duck meat from bones; leave skin on. Cut meat into 1/2-inch cubes. 8. Remove 1 tablespoon rendered fat from the dish to a skillet over medium-high heat. Cook and stir 1/2 of the cubed meat in hot fat until pieces are brown and crispy, 4 to 5 minutes. Add remaining meat; cook and stir until duck is just heated through, about 1 minute more. Stir in 1 tablespoon chopped green onion. 9. Spoon duck mixture into lettuce leaves. Drizzle with sauce; garnish with cucumber, green onions, and sesame seeds.",
  "prep": "20 mins",
  "cook": "3 hrs 10 mins",
  "total": "12 hrs 30 mins",
  "calories": "280"
},
{
  "url": "https://www.allrecipes.com/recipe/235356/chef-johns-duck-sausage-and-shrimp-gumbo/",
  "name": "Chef John's Duck, Sausage, and Shrimp Gumbo",
  "rating": "4.7",
  "ratingcount": "30",
  "ingredients": "1 tablespoon vegetable oil, or more as needed; 2  duck legs; 1 cup all-purpose flour; 2 tablespoons all-purpose flour; 6 cups chicken broth; 1 pound andouille sausage, thickly sliced; 1 large onion, chopped; 1 cup diced serrano and pasilla peppers; 1 cup chopped celery; 4  green onions, chopped (Optional); 1 teaspoon ground black pepper; ½ teaspoon dried thyme; ¼ teaspoon cayenne pepper, or to taste; 1  bay leaf; 1 cup diced fresh tomatoes; 1  smoked ham hock; 2 cups water, or as needed; 1 cup pickled okra, rinsed and sliced; 1 pound gulf shrimp; 1 pound crawfish tail meat; 1 tablespoon thinly sliced green onions (Optional)",
  "directions": "1. Heat oil in a skillet over medium heat. Cook duck legs in the hot oil, skin-side down, until browned and fat has rendered, about 10 minutes. Flip and cook for 3 to 4 minutes on other meat side. Transfer to a plate, leaving rendered fat in the skillet. 2. Whisk 1 cup flour into the duck fat, adding enough oil to make a thick and smooth roux. Reduce the heat to medium-low and cook, stirring constantly, until it turns a rich, reddish-brown color, about 40 minutes. Whisk 2 more tablespoons flour into roux and cook for 2 minutes. 3. Whisk in broth, 1 cup at a time, until incorporated. Remove from the heat. 4. Cook sausage in a large Dutch oven over medium heat until browned, about 8 minutes. Stir in onion, peppers, celery, and chopped green onions; cook and stir until onion is translucent, about 10 minutes. Stir in black pepper, thyme, cayenne pepper, and bay leaf, followed by diced tomatoes. Stir to combine. 5. Place smoked ham hock into the center of the Dutch oven. Pour roux mixture over ham hock along with enough water to cover. Place duck legs into the mixture. Bring to a simmer, then reduce the heat to low. Cover with a lid set at an angle to let steam out. Simmer slowly, stirring occasionally, until duck and ham hock meat are tender, about 4 hours. Skim as much fat as possible off the top as it simmers. 6. Transfer duck legs and ham hock to a bowl and let cool. Stir pickled okra into gumbo. Pick meat from duck legs and pork hock and return meat to the gumbo. Simmer gumbo for 45 more minutes. 7. Increase the heat to medium-high and bring to a boil. Stir in shrimp and crawfish tails; cook until both are bright pink, about 3 minutes. Stir in remaining 1 tablespoon sliced green onion, taste and adjust seasoning, and serve.",
  "prep": "30 mins",
  "cook": "6 hrs 20 mins",
  "total": "6 hrs 50 mins",
  "calories": "485"
}]