[{
  "url": "https://www.allrecipes.com/recipe/190094/miso-and-soy-chilean-sea-bass/",
  "name": "Miso and Soy Chilean Sea Bass",
  "rating": "4.7",
  "ratingcount": "133",
  "ingredients": "⅓ cup sake; ⅓ cup mirin (Japanese sweet rice wine); ⅓ cup miso paste; ¼ cup packed brown sugar; 3 tablespoons soy sauce; 4 (4 ounce) fillets fresh sea bass, about 1 inch thick; 2 tablespoons chopped green onion",
  "directions": "1. Whisk together sake, mirin, miso paste, brown sugar, and soy sauce in a bowl. Place sea bass fillets in a large resealable plastic bag; pour marinade over fillets. Chill in the refrigerator for 3 to 6 hours. 2. Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Prop the oven door to remain slightly ajar. 3. Arrange fillets on a baking sheet; discard marinade. 4. Broil sea bass in the preheated oven until fish flakes easily with a fork, 7 to 9 minutes. 5. Sprinkle with chopped green onions to serve.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "3 hrs 20 mins",
  "calories": "287"
},
{
  "url": "https://www.allrecipes.com/recipe/70163/easy-baked-tilapia/",
  "name": "Easy Baked Tilapia",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "4 (4 ounce) fillets tilapia; 2 teaspoons butter; ½ teaspoon garlic salt, or to taste; ¼ teaspoon seafood seasoning (such as Old Bay®), or to taste; 1  lemon, sliced; 1 (16 ounce) package frozen cauliflower with broccoli and red pepper; salt and ground black pepper to taste",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees F). Grease a 9x13-inch baking dish. 2. Place tilapia fillets in the bottom of the baking dish, then dot with butter and season with garlic salt and seafood seasoning. 3. Top each fillet with a slice or two of lemon. 4. Arrange frozen mixed vegetables around fillets and season lightly with salt and pepper. Cover the dish with aluminum foil. 5. Bake in the preheated oven until vegetables are tender and fish flakes easily with a fork, 25 to 30 minutes. 6. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "25 mins",
  "total": "30 mins",
  "calories": "172"
},
{
  "url": "https://www.allrecipes.com/recipe/256349/baked-fish-fillets/",
  "name": "Baked Fish Fillets",
  "rating": "4.7",
  "ratingcount": "22",
  "ingredients": "1 tablespoon vegetable oil, or to taste; 2 pounds mackerel fillets; 1 teaspoon salt; ⅛ teaspoon ground black pepper; ¼ cup butter, melted; 2 tablespoons lemon juice; ⅛ teaspoon ground paprika",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease a baking pan with vegetable oil. 3. Place mackerel fillets in the baking pan; season with salt and pepper. 4. Mix butter, lemon juice, and paprika together in a bowl. Pour over mackerel fillets. 5. Bake in the preheated oven until fish flakes easily with a fork, 20 to 25 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "399"
},
{
  "url": "https://www.allrecipes.com/recipe/36487/blackened-salmon-fillets/",
  "name": "Blackened Salmon Fillets",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "2 tablespoons ground paprika; 1 tablespoon ground cayenne pepper; 1 tablespoon onion powder; 2 teaspoons salt; ½ teaspoon ground white pepper; ½ teaspoon ground black pepper; ¼ teaspoon dried thyme; ¼ teaspoon dried basil; ¼ teaspoon dried oregano; 4  salmon fillets, skin and bones removed; ½ cup unsalted butter, melted",
  "directions": "1. Mix paprika, cayenne pepper, onion powder, salt, white and black pepper, thyme, basil, and oregano together in a small bowl. 2. Brush salmon fillets on both sides with 1/4 cup butter, and sprinkle evenly with the spice mixture. 3. Heat 2 tablespoons melted butter in a large, heavy skillet over high heat. Add salmon and cook until blackened, 2 to 5 minutes. Lift fillets, add remaining melted butter to the skillet, and flip fillets into the butter. Cook until the other side is blackened and fish flakes easily with a fork, 3 to 5 minutes.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "511"
},
{
  "url": "https://www.allrecipes.com/recipe/280935/air-fryer-tilapia-with-fresh-lemon-pepper/",
  "name": "Air Fryer Tilapia with Fresh Lemon Pepper",
  "rating": "4.7",
  "ratingcount": "7",
  "ingredients": "4 (6 ounce) tilapia fillets; 2 tablespoons lemon zest; 2 tablespoons olive oil; 2 cloves garlic, minced; 1 ½ teaspoons coarsely ground black peppercorns; ½ teaspoon salt; 1 pinch paprika, or to taste; cooking spray; 1 sprig parsley, chopped, or more to taste; 4 wedges lemon",
  "directions": "1. Preheat the air fryer to 400 degrees F (200 degrees C) for 3 minutes. 2. Meanwhile, rinse tilapia fillets and pat dry with a paper towel. 3. Mix together lemon zest, olive oil, garlic, pepper, and salt in a small bowl until well combined. Rub over tops of fillets, then sprinkle lightly with paprika. Lightly coat the air fryer basket with cooking spray. Arrange fillets evenly in the basket, spice-side up. Do not crowd; if needed, cook in batches. 4. Cook in the preheated air fryer until fish flakes easily with a fork, 7 to 10 minutes. Remove fillets to a plate and garnish with parsley. Serve with lemon wedges.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "239"
},
{
  "url": "https://www.allrecipes.com/recipe/230905/savory-pan-seared-tuna-steaks/",
  "name": "Savory Pan-Seared Tuna Steaks",
  "rating": "4.6",
  "ratingcount": "81",
  "ingredients": "¼ cup soy sauce; ¼ cup extra-virgin olive oil; 2 tablespoons lemon juice; 2 teaspoons Asian (toasted) sesame oil; 2 teaspoons molasses; 1 teaspoon cayenne pepper, or more to taste; 6  thin slices fresh ginger, minced; 2 cloves garlic, minced; 2  1-inch-thick tuna steaks, thawed",
  "directions": "1. Mix soy sauce, olive oil, lemon juice, sesame oil, molasses, cayenne pepper, ginger, and garlic together in a bowl. 2. Place tuna steaks in a large resealable plastic bag or airtight container; pour marinade over steaks, coat with marinade, and seal. Marinate steaks at room temperature for 20 minutes. 3. Heat a nonstick pan over medium heat. 4. Remove steaks from marinade and discard any remaining marinade. Arrange steaks in the hot pan; gently shake the pan to avoid sticking. Cook for 1 1/2 minutes. Flip and cook 1 minute more.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "35 mins",
  "calories": "592"
},
{
  "url": "https://www.allrecipes.com/recipe/21306/fish-in-foil/",
  "name": "Fish in Foil",
  "rating": "4.4",
  "ratingcount": "427",
  "ingredients": "2  rainbow trout fillets; 1 tablespoon olive oil; 2 teaspoons garlic salt; 1 teaspoon ground black pepper; 2 sheets heavy-duty aluminum foil; 1  fresh jalapeno pepper, sliced; 1  lemon, sliced",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Rinse and pat fillets dry. Rub fillets with olive oil, and season with garlic salt and black pepper. Place each fillet on a large sheet of aluminum foil. Top with jalapeno slices, and squeeze the juice from the ends of the lemon over fillets. Arrange remaining lemon slices on top of fillets. 3. Carefully seal all edges of the foil to form enclosed packets. Place packets on a baking sheet. 4. Bake in the preheated oven until fish flakes easily with a fork, 15 to 20 minutes depending on size of fillets.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "213"
},
{
  "url": "https://www.allrecipes.com/recipe/16580/classic-fish-and-chips/",
  "name": "Classic Fish and Chips",
  "rating": "4.2",
  "ratingcount": "346",
  "ingredients": "4 large potatoes, peeled and cut into strips; 1 cup all-purpose flour; 1 teaspoon baking powder; 1 teaspoon salt; 1 teaspoon ground black pepper; 1 cup milk; 1  egg; 1 quart vegetable oil for frying; 1 ½ pounds cod fillets",
  "directions": "1. Place sliced potatoes in a medium bowl and cover with cold water. 2. Mix flour, baking powder, salt, and pepper together in a separate medium bowl. Add milk and egg; stir until batter is smooth. Let stand for 20 minutes. 3. Meanwhile, heat oil in a large pot or electric skillet to 350 degrees F (175 degrees C). 4. Drain and pat dry potatoes. Fry in hot oil until tender, about 5 minutes; drain on paper towels. 5. Dredge cod in batter, one piece at a time, and place in hot oil. Fry fish in batches until golden brown on all sides; drain on paper towels. Monitor oil temperature, increasing the heat as needed to maintain 350 degrees F (175 degrees C). 6. Fry potatoes again in hot oil until crisp, 1 to 2 minutes; drain on paper towels.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "782"
},
{
  "url": "https://www.allrecipes.com/recipe/234676/how-to-make-a-tuna-melt/",
  "name": "How to Make a Tuna Melt",
  "rating": "4.9",
  "ratingcount": "107",
  "ingredients": "1 (6.5 ounce) jar oil-packed tuna, drained; 2 tablespoons finely diced celery; 1 tablespoon minced green onion; 2 teaspoons capers, drained; 2 tablespoons mayonnaise, or more to taste; 1 teaspoon Asian chile paste (such as sambal oelek); ⅓ cup fresh mozzarella cheese; salt and ground black pepper to taste; 2 tablespoons softened butter, divided; 2 thick slices French bread; ¼ cup shredded sharp white Cheddar cheese, divided; 1 pinch cayenne pepper, or to taste",
  "directions": "1. Place tuna into a mixing bowl and lightly break it apart with a fork. Add celery, green onion, capers, mayonnaise, and chile paste. Pinch in small pieces mozzarella and stir to mix. Season with salt and black pepper; refrigerate tuna salad until needed. 2. Preheat the oven's broiler. Line a baking sheet with aluminum foil. 3. Spread butter generously on both sides of French bread slices. 4. Broil buttered bread until golden brown on top, 2 to 3 minutes. Flip bread slices and broil other side until toasted, 2 to 3 more minutes. Remove from the oven and turn bread slices over on the baking sheet so the darkest sides are on the bottom. 5. Gently spread tuna salad onto bread slices using 2 forks. Press the salad onto the bread and spread tuna all the way to the edges of the bread. Spread shredded Cheddar over each sandwich. Dust tops with cayenne pepper. 6. Place sandwiches under the broiler and cook until cheese is melted and bubbling, 5 to 6 minutes.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "594"
},
{
  "url": "https://www.allrecipes.com/recipe/109297/cedar-planked-salmon/",
  "name": "Cedar Planked Salmon",
  "rating": "4.8",
  "ratingcount": "849",
  "ingredients": "3 (12 inch) untreated cedar planks; ⅓ cup soy sauce; ⅓ cup vegetable oil; 1 ½ tablespoons rice vinegar; 1 teaspoon sesame oil; ¼ cup chopped green onions; 1 tablespoon grated fresh ginger; 1 teaspoon minced garlic; 2 (2 pound) salmon fillets, skin removed",
  "directions": "1. Soak cedar planks for at least 1 hour in warm water. Soak longer if you have time. 2. Stir soy sauce, vegetable oil, rice vinegar, sesame oil, green onions, ginger, and garlic together in a shallow dish. 3. Place salmon fillets in soy mixture and turn to coat. Cover and marinate for at least 15 minutes, or up to 1 hour refrigerated. 4. Preheat an outdoor grill for medium heat. Place planks on the grill grate. Heat planks until they start to smoke and crackle just a little. 5. Remove salmon from marinade and place on planks; discard marinade. 6. Close grill cover. Grill salmon until it flakes easily with a fork, about 20 minutes; salmon will continue to cook after you remove it from the grill.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "678"
},
{
  "url": "https://www.allrecipes.com/recipe/12816/cioppino/",
  "name": "Cioppino",
  "rating": "4.8",
  "ratingcount": "874",
  "ingredients": "¾ cup butter; 2  onions, chopped; 1 bunch fresh parsley, chopped; 2 cloves garlic, minced; 2 (14.5 ounce) cans stewed tomatoes; 2 (14.5 ounce) cans chicken broth; 1 ½ cups white wine; 1 cup water; 2  bay leaves; 1 tablespoon dried basil; ½ teaspoon dried thyme; ½ teaspoon dried oregano; 1 ½ pounds cod fillets, cubed; 1 ½ pounds large shrimp - peeled and deveined; 1 ½ pounds bay scallops; 18 small clams; 18  mussels, cleaned and debearded; 1 ½ cups crabmeat",
  "directions": "1. Melt butter in a large stockpot over medium-low heat. Add onions, parsley, and garlic. Cook and stir until onions are softened, 3 to 4 minutes. 2. Add tomatoes to the pot (break them into chunks as you add them). Stir in chicken broth, wine, water, bay leaves, basil, thyme, and oregano. Cover and simmer for 30 minutes. 3. Stir in cod, shrimp, scallops, clams, mussels, and crabmeat. Bring to boil; lower heat, cover, and simmer until clams open up, 5 to 7 minutes. Ladle soup into bowls and serve. 4. Enjoy!",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "318"
},
{
  "url": "https://www.allrecipes.com/recipe/222202/grilled-cod/",
  "name": "Grilled Cod",
  "rating": "4.6",
  "ratingcount": "203",
  "ingredients": "2 (8 ounce) fillets cod, cut in half; 1 tablespoon Cajun seasoning; ½ teaspoon lemon pepper; ¼ teaspoon salt; ¼ teaspoon ground black pepper; 2 tablespoons butter; 1  lemon, juiced; 2 tablespoons chopped green onion (white part only)",
  "directions": "1. Stack about 15 charcoal briquettes into a grill in a pyramid shape. If desired, drizzle coals lightly with lighter fluid and allow to soak for 1 minute before lighting coals with a match. Allow fire to spread to all coals, about 10 minutes, before spreading briquettes out into the grill; let coals burn until a thin layer of white ash covers the coals. Lightly oil the grates. 2. Season both sides of cod fillets with Cajun seasoning, lemon pepper, salt, and black pepper. Set fillets aside on a plate. 3. Melt butter in a small saucepan over medium heat, stir in lemon juice and green onion, and cook until onion is softened, about 3 minutes. 4. Grill fillets on the preheated grill until browned and flaky, about 3 minutes per side; baste frequently with butter mixture while grilling. 5. Allow fillets to rest off the heat for about 5 minutes before serving.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "35 mins",
  "calories": "152"
},
{
  "url": "https://www.allrecipes.com/recipe/16964/quick-and-easy-tuna-casserole/",
  "name": "Quick and Easy Tuna Casserole",
  "rating": "4.3",
  "ratingcount": "688",
  "ingredients": "1 (12 ounce) package egg noodles; 2 cups frozen green peas; 2 (10.75 ounce) cans  condensed cream of mushroom soup; 2 (5 ounce) cans tuna, drained; 10 slices American processed cheese; 1  onion, chopped; ground black pepper to taste",
  "directions": "1. Gather all ingredients. 2. Bring a large pot of water to a boil. Add noodles and frozen peas; simmer for 8 to 10 minutes, or until noodles are al dente. Drain well, then return noodles and peas to the pot. 3. Stir in condensed soup, tuna, cheese, onion, and pepper until well mixed and the cheese has melted. Serve. 4. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "25 mins",
  "total": "30 mins",
  "calories": "545"
},
{
  "url": "https://www.allrecipes.com/recipe/100195/baked-haddock/",
  "name": "Baked Haddock",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "¾ cup milk; 2 teaspoons salt; ¾ cup bread crumbs; ¼ cup grated Parmesan cheese; ¼ teaspoon ground dried thyme; 4  haddock fillets; ¼ cup butter, melted",
  "directions": "1. Preheat oven to 500 degrees F (260 degrees C). 2. In a small bowl, combine the milk and salt. In a separate bowl, mix together the bread crumbs, Parmesan cheese, and thyme. 3. Dip the haddock fillets in the milk, then press into the crumb mixture to coat. Place haddock fillets in a glass baking dish, and drizzle with melted butter. 4. Bake on the top rack of the preheated oven until the fish flakes easily, about 15 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "325"
},
{
  "url": "https://www.allrecipes.com/recipe/189058/super-simple-salmon/",
  "name": "Easy 5-Ingredient Salmon",
  "rating": "4.7",
  "ratingcount": "641",
  "ingredients": "1 tablespoon garlic powder; 1 tablespoon dried basil; ½ teaspoon salt; 4 (6 ounce) fillets salmon; 2 tablespoons butter; 4  lemon wedges",
  "directions": "1. Stir garlic powder, basil, and salt together in a small bowl. Rub the mixture evenly over salmon. 2. Melt butter in a large skillet over medium heat. Add salmon and cook until browned and flaky, about 5 minutes per side. 3. Serve salmon with lemon wedges.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "304"
},
{
  "url": "https://www.allrecipes.com/recipe/236814/baked-fresh-rainbow-trout/",
  "name": "Baked Fresh Rainbow Trout",
  "rating": "4.6",
  "ratingcount": "116",
  "ingredients": "2 teaspoons olive oil, divided; 2  whole rainbow trout, gutted and cleaned, heads and tails still on; ¼ teaspoon dried dill weed; ¼ teaspoon dried thyme; salt to taste; ½ large onion, sliced; 2 thin slices lemon (Optional); 2 tablespoons hot water; ground black pepper to taste",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking dish with 1 teaspoon olive oil. 2. Place trout in the prepared baking dish and coat with remaining olive oil. Gather the seasoning ingredients. 3. Season inside and outside of fish with dill, thyme, and salt. Stuff each fish with onion slices; grind pepper on top. Place 1 lemon slice on each fish. 4. Bake in the preheated oven for 10 minutes; add hot water to dish. Continue baking until fish flakes easily with a fork, about 10 minutes more. 5. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "373"
},
{
  "url": "https://www.allrecipes.com/recipe/231549/baked-flounder-with-panko-and-parmesan/",
  "name": "Baked Flounder with Panko and Parmesan",
  "rating": "4.6",
  "ratingcount": "461",
  "ingredients": "4 (4 ounce) flounder fillets; 4 tablespoons butter, melted, divided; 1 cup panko bread crumbs; ⅔ cup grated Parmesan cheese; ½ teaspoon salt; 1 pinch dried thyme; ground black pepper to taste",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Lightly grease a large, shallow baking dish. 2. Lay flounder fillets in the prepared baking dish and brush with 1 tablespoon butter. 3. Combine remaining 3 tablespoons butter with bread crumbs, Parmesan cheese, salt, thyme, and pepper in a bowl; sprinkle over flounder and pat down lightly. 4. Bake in the preheated oven until fish flakes easily with a fork, 15 to 20 minutes. 5. Carefully transfer fillets to a plate with a thin spatula.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "331"
},
{
  "url": "https://www.allrecipes.com/recipe/71387/best-salmon-bake/",
  "name": "Best Salmon Bake",
  "rating": "4.5",
  "ratingcount": "41",
  "ingredients": "1 (1 pound) salmon fillet, halved; 1 small tomato, chopped; 5  green onions, chopped; ¼ teaspoon salt; ¼ teaspoon pepper",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). 3. Place salmon on a lightly oiled sheet pan or in a shallow baking dish, folding under thin outer edges of fillets for even cooking. 4. Top salmon with chopped tomatoes and green onions, and season with salt and pepper. 5. Cook salmon in the preheated oven, uncovered, until fish flakes easily with a fork, about 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "386"
},
{
  "url": "https://www.allrecipes.com/recipe/76659/heavenly-halibut/",
  "name": "Heavenly Halibut",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "½ cup grated Parmesan cheese; ¼ cup butter, softened; 3 tablespoons mayonnaise; 3 tablespoons chopped green onions; 2 tablespoons lemon juice; ¼ teaspoon salt; 1 dash hot pepper sauce; 2 pounds skinless halibut fillets",
  "directions": "1. Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Grease a rimmed baking sheet; place halibut fillets on the sheet. 2. Broil in the preheated oven until fish flakes easily with a fork, about 8 minutes. 3. Meanwhile, mix Parmesan cheese, butter, mayonnaise, green onions, lemon juice, salt, and hot pepper sauce in a bowl. 4. Remove fillets from the oven; spread Parmesan mixture over top. Return to the oven and broil until topping is bubbly and lightly browned, about 2 more minutes. 5. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "235"
},
{
  "url": "https://www.allrecipes.com/recipe/265170/birthday-cake-for-your-cat/",
  "name": "Birthday Cake for Your Cat",
  "rating": "4.6",
  "ratingcount": "25",
  "ingredients": "cooking spray; 1 (6 ounce) can tuna, drained; 2 tablespoons all-purpose flour; 1  egg white; ⅛ teaspoon shredded mild Cheddar cheese; 4  peeled, cooked shrimp",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Spray 2 muffin tin cups with cooking spray. 2. Combine tuna, flour, egg white, and Cheddar cheese in a bowl. Fill the prepared muffin cups equally with the mixture. 3. Bake in the preheated oven for 15 minutes. Let cool in the tin for 5 minutes. Invert onto a wire rack to cool completely. 4. Garnish cakes with shrimp.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "145"
},
{
  "url": "https://www.allrecipes.com/recipe/22538/baked-salmon-fillets-dijon/",
  "name": "Baked Salmon Fillets Dijon",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "4 (4 ounce) fillets salmon; 3 tablespoons prepared Dijon-style mustard; salt and ground black pepper to taste; ¼ cup Italian-style dry bread crumbs; ¼ cup butter, melted",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a shallow baking pan with aluminum foil. 2. Place salmon fillets skin-side down on the prepared baking pan. Spread a thin layer of mustard on top of each fillet; season with salt and pepper. Top with bread crumbs, then drizzle with melted butter. 3. Bake in the preheated oven until salmon flakes easily with a fork, about 15 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "331"
},
{
  "url": "https://www.allrecipes.com/recipe/233564/the-best-smoked-salmon-spread/",
  "name": "The Best Smoked Salmon Spread",
  "rating": "4.7",
  "ratingcount": "161",
  "ingredients": "1 (8 ounce) package cream cheese, softened; 6 ounces smoked salmon, chopped; ¼ cup capers, or to taste; 2 tablespoons chopped green onion (Optional); 1 ½ teaspoons chopped fresh dill; ¼ cup heavy whipping cream; 3 dashes Worcestershire sauce; 3 drops hot pepper sauce; 1 squeeze fresh lemon juice",
  "directions": "1. Gather all ingredients. 2. Process cream cheese in a food processor to soften completely. 3. Add smoked salmon, capers, green onion, dill, cream, Worcestershire sauce, hot pepper sauce, and lemon juice. Process the mixture again until creamy and smooth.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "120"
},
{
  "url": "https://www.allrecipes.com/recipe/240130/scrumptious-salmon-cakes/",
  "name": "Scrumptious Salmon Cakes",
  "rating": "4.6",
  "ratingcount": "522",
  "ingredients": "2 (14.75 ounce) cans salmon, drained and flaked; ¾ cup Italian-seasoned panko (Japanese bread crumbs); ½ cup minced fresh parsley; 2  eggs, beaten; 2  green onions, chopped; 3 tablespoons Worcestershire sauce; 3 tablespoons grated Parmesan cheese; 2 tablespoons Dijon mustard; 2 tablespoons creamy salad dressing (such as Miracle Whip®); 2 teaspoons seafood seasoning (such as Old Bay®); 1 ½ teaspoons garlic powder; 1 ½ teaspoons ground black pepper; 1 tablespoon olive oil, or as needed, divided",
  "directions": "1. Mix together salmon, panko, parsley, eggs, green onions, Worcestershire sauce, Parmesan cheese, Dijon mustard, creamy salad dressing, seafood seasoning, garlic powder, and pepper in a large bowl. Divide mixture and shape into 8 patties. 2. Heat enough olive oil in a large skillet to cover the cooking surface over medium heat. Fry salmon patties in batches until browned, 5 to 7 minutes per side. Repeat with more olive oil as needed.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "263"
},
{
  "url": "https://www.allrecipes.com/recipe/281262/easy-grilled-mahi-mahi/",
  "name": "Easy Grilled Mahi Mahi",
  "rating": "4.8",
  "ratingcount": "8",
  "ingredients": "1 teaspoon paprika; 1 teaspoon dried oregano; 1 teaspoon ground cumin; ½ teaspoon garlic powder; ½ teaspoon onion powder; ½ teaspoon salt; ¼ teaspoon ground black pepper; 1 pinch cayenne pepper; 3 (4 ounce) fillets wild-caught skin-on mahi-mahi fillets; 3 tablespoons olive oil; 2 tablespoons lemon juice",
  "directions": "1. Preheat a gas grill for medium-high heat (450 degrees F (230 degrees C)) and lightly oil the grate. 2. To make the spice mixture: Combine paprika, oregano, cumin, garlic powder, onion powder, salt, pepper, and cayenne in a small bowl. Brush mahi mahi fillets with olive oil on both sides and season with spice mixture. 3. Grill on the hot grill until golden and fish flakes easily with a fork, about 4 to 5 minutes per side. Drizzle with lemon juice and serve.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "227"
},
{
  "url": "https://www.allrecipes.com/recipe/278876/spicy-tuna-rice-bowl/",
  "name": "Spicy Tuna Rice Bowl",
  "rating": "4.3",
  "ratingcount": "66",
  "ingredients": "1 cup uncooked long-grain rice; 1 ½ cups water; 1 (7 ounce) jar tuna packed in olive oil; ½ cup finely diced red bell pepper; ¼ cup finely diced jalapeno pepper; ¼ cup finely sliced green onions; ⅓ cup seasoned rice vinegar; ½  lemon, juiced, or to taste; 2 tablespoons soy sauce; 2 teaspoons Sriracha hot sauce; ½ teaspoon sesame oil; 1 pinch Korean red pepper flakes (gochugaru), or to taste; 1 teaspoon finely sliced green onion, or to taste",
  "directions": "1. Pour rice into a heavy pot and add water; swirl to allow rice to settle. Bring to a simmer over medium-high heat; do not stir. Reduce heat to low, cover, and continue to simmer for 15 minutes. 2. While rice is cooking, place tuna into a large mixing bowl and break up with your hands or a fork. Toss in red bell pepper, jalapeno, 1/4 cup green onions, rice vinegar, lemon juice, soy sauce, Sriracha, and sesame oil. Mix with a fork until thoroughly combined. 3. Turn off heat and let rice sit, covered, for 10 minutes. 4. Fluff rice with a fork to separate the grains and break up any large clumps; transfer into the mixing bowl. Mix thoroughly with a spoon until all the ingredients are evenly incorporated. Taste and adjust seasoning if needed. Serve warm, at room temperature, or cold like a rice salad, topped with red pepper flakes and 1 teaspoon green onion.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "583"
},
{
  "url": "https://www.allrecipes.com/recipe/71698/sesame-seared-tuna/",
  "name": "Sesame-Seared Tuna",
  "rating": "4.7",
  "ratingcount": "527",
  "ingredients": "¼ cup soy sauce; 2 tablespoons sesame oil; 1 tablespoon mirin (Japanese sweet wine); 1 tablespoon honey; 1 tablespoon rice wine vinegar; ½ cup sesame seeds; 4 (6 ounce) tuna steaks; 1 tablespoon olive oil; wasabi paste",
  "directions": "1. Stir together soy sauce, sesame oil, mirin, and honey in a small bowl. Pour half into a separate small bowl, stir in rice wine vinegar, and set it aside as a dipping sauce. 2. Spread sesame seeds out on a plate. Coat tuna steaks with remaining soy sauce mixture, then press into sesame seeds to coat. 3. Heat olive oil in a cast iron skillet over high heat until very hot. Place steaks in the pan; sear for about 30 seconds on each side. Serve with dipping sauce and wasabi paste.",
  "prep": "10 mins",
  "cook": "1 mins",
  "total": "11 mins",
  "calories": "422"
},
{
  "url": "https://www.allrecipes.com/recipe/228056/parmesan-crusted-tilapia-fillets/",
  "name": "Parmesan Crusted Tilapia Fillets",
  "rating": "4.6",
  "ratingcount": "785",
  "ingredients": "¾ cup grated Parmesan cheese; 1 tablespoon chopped fresh parsley; 2 teaspoons paprika; salt and ground black pepper to taste; 4  tilapia fillets; 1 drizzle olive oil",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil. 2. Whisk Parmesan cheese, parsley, paprika, salt, and pepper together in a shallow dish. 3. Coat tilapia fillets with olive oil and press into the Parmesan cheese mixture. Arrange coated fillets on the prepared baking sheet. 4. Bake in the preheated oven until the fish flakes easily with a fork, 10 to 12 minutes.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "210"
},
{
  "url": "https://www.allrecipes.com/recipe/45782/grilled-sea-bass/",
  "name": "Grilled Sea Bass",
  "rating": "4.7",
  "ratingcount": "408",
  "ingredients": "¼ teaspoon garlic powder; ¼ teaspoon onion powder; ¼ teaspoon paprika; lemon pepper to taste; sea salt to taste; 2 pounds sea bass; 3 tablespoons butter; 2 large cloves garlic, chopped; 1 tablespoon chopped Italian flat leaf parsley; 1 ½ tablespoons extra virgin olive oil",
  "directions": "1. Gather all ingredients. 2. Preheat grill for high heat. 3. In a small bowl, stir together the garlic powder, onion powder, paprika, lemon pepper, and sea salt. 4. Sprinkle seasonings onto the fish. 5. In a small saucepan over medium heat, melt the butter with the garlic and parsley. Remove from heat when the butter has melted, and set aside. 6. Lightly oil grill grate. Grill fish for 7 minutes, then turn and drizzle with butter. Continue cooking for 7 minutes, or until easily flaked with a fork. Drizzle with olive oil before serving.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "232"
},
{
  "url": "https://www.allrecipes.com/recipe/20107/beer-batter-fish-made-great/",
  "name": "Beer Batter Fish Made Great",
  "rating": "4.3",
  "ratingcount": "793",
  "ingredients": "2 quarts vegetable oil for frying; 8 (4 ounce) fillets cod; salt and pepper to taste; 1 cup all-purpose flour; 2 tablespoons garlic powder; 2 tablespoons paprika; 2 teaspoons salt; 2 teaspoons ground black pepper; 1  egg, beaten; 1 (12 fluid ounce) can or bottle beer, or as needed",
  "directions": "1. Heat oil in a deep fryer to 365 degrees F (185 degrees C). Rinse cod fillets, pat dry, and season with salt and pepper. 2. Mix flour, garlic powder, paprika, salt, and pepper in a large bowl; add egg and stir well to combine. Gradually mix in enough beer to make a thin batter. 3. Dip cod fillets into the batter to coat. Carefully lower fillets, one at a time, into the hot oil. Fry several fillets at a time, turning once, until cooked through and golden brown, about 2 minutes per side. Drain on paper towels. Repeat to cook remaining fillets. Serve warm.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/239541/chef-johns-fresh-salmon-cakes/",
  "name": "Chef John's Fresh Salmon Cakes",
  "rating": "4.8",
  "ratingcount": "360",
  "ingredients": "1 tablespoon extra-virgin olive oil; ¼ cup minced onion; 2 tablespoons minced red bell pepper; 2 tablespoons minced celery; salt and pepper to taste; 1 tablespoon capers; 1 ¼ pounds fresh wild salmon, coarsely chopped; ¼ cup mayonnaise; ¼ cup panko bread crumbs; 2 cloves garlic, minced; 1 teaspoon Dijon mustard; 1 pinch cayenne pepper; 1 pinch seafood seasoning (such as Old Bay®); 1 tablespoon panko bread crumbs, or to taste; 2 tablespoons olive oil, or as needed",
  "directions": "1. Heat extra virgin olive oil in a skillet over medium heat. Cook and stir onion, red pepper, celery, and a pinch of salt in hot oil until onion is soft and translucent, about 5 minutes. Add capers; cook and stir until fragrant, about 2 minutes. Remove from heat and cool to room temperature. 2. Stir salmon, onion mixture, mayonnaise, 1/4 cup bread crumbs, garlic, mustard, cayenne, seafood seasoning, salt, and ground black pepper together in a bowl until well-mixed. Cover the bowl with plastic wrap and refrigerate until firmed and chilled, 1 to 2 hours. 3. Form salmon mixture into four 1-inch thick patties; sprinkle remaining panko bread crumbs over each patty. 4. Heat olive oil in a skillet over medium-heat. Cook patties in hot oil until golden and cooked through, 3 to 4 minutes per side.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "1 hr 35 mins",
  "calories": "460"
},
{
  "url": "https://www.allrecipes.com/recipe/38028/blackened-fish/",
  "name": "Blackened Fish",
  "rating": "4.6",
  "ratingcount": "277",
  "ingredients": "1 tablespoon paprika; 2 teaspoons dry mustard; 1 teaspoon cayenne pepper; 1 teaspoon ground cumin; 1 teaspoon black pepper; 1 teaspoon white pepper; 1 teaspoon dried thyme; 1 teaspoon salt; 1 cup unsalted butter, melted, divided; 6 (4 ounce) fillets trout",
  "directions": "1. Mix together paprika, dry mustard, cayenne pepper, cumin, black pepper, white pepper, thyme, and salt in a small bowl. 2. Heat a heavy cast iron pan on high heat until extremely hot, about 10 minutes. 3. While the pan is heating, pour 3/4 cup melted butter into a shallow dish. Dip each fillet into butter, turning once to coat both sides. Sprinkle both sides of fillets with spice mixture; gently pat mixture onto fish. 4. Working in batches, place fillets into the hot pan without crowding. Carefully pour about 1 teaspoon melted butter over each fillet. Cook until fish has a charred bottom, about 2 minutes. Turn fillets and spoon about 1 teaspoon melted butter over each. Continue cooking until bottoms are charred, 1 to 2 minutes. Repeat with remaining fish.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "30 mins",
  "calories": "420"
},
{
  "url": "https://www.allrecipes.com/recipe/58997/grilled-marinated-swordfish/",
  "name": "Grilled Marinated Swordfish",
  "rating": "4.7",
  "ratingcount": "307",
  "ingredients": "⅓ cup white wine; ¼ cup lemon juice; 2 tablespoons soy sauce; 2 tablespoons olive oil; 4 cloves garlic; 1 tablespoon poultry seasoning; ¼ teaspoon salt; ⅛ teaspoon pepper; 4  swordfish steaks; 1 tablespoon chopped fresh parsley (Optional); 4 slices  lemon, for garnish (Optional)",
  "directions": "1. To make the marinade: Mix wine, lemon juice, soy sauce, olive oil, garlic, poultry seasoning, salt, and pepper in a glass baking dish until combined. 2. Lay swordfish steaks in marinade; turn to coat. Refrigerate for 1 hour, turning frequently. 3. Preheat an outdoor grill for high heat and lightly oil the grate. 4. Cook swordfish steaks on the preheated grill until cooked through and the fish flakes easily with a fork, 5 to 6 minutes per side; discard marinade. An instant-read thermometer inserted into the center of each steak should read at least 145 degrees F (63 degrees C). 5. Garnish swordfish steaks with parsley and serve with lemon wedges.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "1 hr 20 mins",
  "calories": "258"
},
{
  "url": "https://www.allrecipes.com/recipe/8462462/proper-british-fish-cakes/",
  "name": "Proper British Fish Cakes",
  "rating": "4.9",
  "ratingcount": "9",
  "ingredients": "½ cup mayonnaise; 2 tablespoons capers, drained and chopped; 1 tablespoon finely chopped shallot; 1 tablespoon finely chopped Italian parsley; 1 tablespoon finely chopped fresh tarragon; 2 teaspoons prepared horseradish; 1 teaspoon Dijon mustard; 1 pinch cayenne pepper; ½ cup milk; 1  bay leaf; 1 pound cod, cut into 1-inch pieces; salt and freshly ground black pepper to taste; 12 ounces russet potato, peeled and quartered; 1 pinch cayenne pepper; 1 tablespoon finely chopped Italian parsley; 1 tablespoon sliced fresh chives; 1 teaspoon finely grated lemon zest; ⅓ cup all-purpose flour; 1 large egg, beaten; 1 cup panko bread crumbs, or as needed; ¼ cup vegetable oil, or as needed",
  "directions": "1. Mix mayonnaise, capers, shallot, parsley, tarragon, horseradish, mustard, and cayenne together in a bowl for tartar sauce and refrigerate until needed. 2. Add milk and bay leaf to a saucepan and place the pieces of fish over the top. Season with salt. Bring to a simmer over medium heat, and cook for about 1 minute, stirring occasionally. As soon as the fish firms up, but before it starts to flake apart, turn off the heat and cover. Let sit for 5 minutes before draining. Let cool, about 10 minutes. Refrigerate until needed. 3. Meanwhile, bring a pot of lightly salted water to a boil. Add russet potato and boil until tender but not falling apart. 4. Drain and mash potato in a bowl. Season with salt, black pepper, and cayenne. Add parsley, chives, and lemon zest; add 1 tablespoon tartar sauce mixture. Mix until combined. Flake chilled fish over the top. Mix until combined. 5. Scoop out ¼ of the mixture and form into a patty. Repeat with remaining mixture. 6. Dust cakes with flour on both sides. Brush both sides of cakes with beaten egg. Coat in bread crumbs. 7. Heat oil in a skillet over medium heat. Pan-fry patties in the hot oil until golden brown and heated through, 3 to 4 minutes per side. Drain on paper towels before serving with tartar sauce.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "623"
},
{
  "url": "https://www.allrecipes.com/recipe/75115/grilled-swordfish/",
  "name": "Grilled Swordfish",
  "rating": "4.6",
  "ratingcount": "66",
  "ingredients": "4 (8 ounce) swordfish steaks; ½ cup teriyaki sauce; 2 tablespoons butter, softened; 1 teaspoon garlic powder",
  "directions": "1. Preheat an outdoor grill for medium heat and lightly oil the grate. 2. Meanwhile, marinate swordfish in teriyaki sauce, 5 minutes per side. 3. Grill swordfish, basting frequently with melted butter, until fish flakes easily with a fork, 5 to 6 minutes per side. 4. Season with garlic powder and serve.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "350"
},
{
  "url": "https://www.allrecipes.com/recipe/8532964/air-fryer-tilapia/",
  "name": "Air Fryer Tilapia",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "½ cup freshly grated Parmesan cheese; 1 ½ teaspoons paprika; 1 teaspoon garlic powder; ½ teaspoon salt; ½ teaspoon freshly ground black pepper; 4 (6 ounce) tilapia fillets, thawed if frozen; cooking spray; 1 tablespoon minced fresh parsley (Optional); 4 lemon wedges (optional)",
  "directions": "1. Preheat the air fryer to 400 degrees F (200 degrees C). 2. Combine Parmesan cheese, paprika, garlic powder, salt, and pepper in a bowl. 3. Pat tilapia filets dry with paper towels. Spritz both sides with cooking spray, then press both sides of the filets into the Parmesan mixture. Shake off any excess, then spray again with cooking spray. Place in the basket of the air fryer. 4. Cook until the fish flakes easily with a fork, 6 to 8 minutes. You may need to cook the fish in 2 batches, depending on the size of your air fryer. 5. Sprinkle with parsley and serve with lemon wedges.",
  "prep": "5 mins",
  "cook": "6 mins",
  "total": "11 mins",
  "calories": "217"
},
{
  "url": "https://www.allrecipes.com/recipe/8525309/maple-mustard-salmon/",
  "name": "Maple Mustard Salmon",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "2 ½ tablespoons stone-ground mustard; 1 tablespoon maple syrup; 1 teaspoon fresh lemon juice; ½ teaspoon minced garlic; ¼ teaspoon minced fresh thyme; 6 (6 ounce) frozen salmon fillets, thawed and patted dry; 1 teaspoon kosher salt; ½ teaspoon black pepper; 1 tablespoon olive oil",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a large baking sheet with foil. 2. Whisk together mustard, maple syrup, lemon juice, garlic, and thyme in a small bowl. 3. Season salmon on both sides with salt and pepper and brush with oil. Arrange salmon on prepared baking sheet. Brush with mustard mixture. 4. Bake in the preheated oven until salmon flakes easily with a fork, 8 to 10 minutes.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "343"
},
{
  "url": "https://www.allrecipes.com/recipe/8465302/seafood-pot-pie/",
  "name": "Seafood Pot Pie",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "½ cup unsalted butter; 1 ½ cups thinly sliced yellow onion; 1 cup thinly sliced fennel; 1 cup thinly sliced celery; 1 cup thinly sliced carrots; ½ cup all-purpose flour; ½ cup dry white wine; 3 cups fish stock; ¼ cup heavy cream, divided; 1 tablespoon kosher salt; ½ teaspoon ground black pepper; 1 (8 ounce) fillet halibut, skin removed, cut into 1-inch pieces; ½ pound sea scallops, halved horizontally; ½ pound peeled and deveined medium shrimp; 1 pound jumbo lump crabmeat, picked over; 1 cup frozen green peas; 2 tablespoons chopped fresh parsley, plus more for garnish; 1 large egg, lightly beaten; 1 (17.3 ounce) package frozen puff pastry sheets, thawed",
  "directions": "1. Melt butter in a large saucepan over medium-high heat. Add onion, fennel, celery, and carrots; cook, stirring often, until vegetables are softened and onion is translucent, about 8 minutes. Add flour and stir to coat vegetables well, stirring for 1 minute. Add wine, and stir until wine has evaporated and mixture creates a slurry, about 15 seconds. Add fish stock and 3 tablespoons cream, stirring until mixture thickens into a creamy sauce, about 5 minutes. Season with salt and pepper, then gently fold in seafood, green peas and parsley. 2. Reduce heat to medium-low, and, gently stirring often, bring mixture to a low simmer until sauce is warm again but the seafood will not be completely cooked through, about 6-8 minutes. Ladle 2 cups mixture into each of 5 (18- to 20-ounce) ungreased ramekins or ovenproof bowls. Place bowls on a foil-lined rimmed baking sheet. 3. Preheat oven to 375 degrees F (190 degrees C). Place an oven rack in middle position. 4. Whisk egg and remaining 1 tablespoon heavy cream in a small bowl. Place defrosted puff pastry sheets on a lightly floured work surface. Roll each sheet into a 13\" x 13\" square and cut each square into quarters. Discard any extra pastry. Place a square of pastry over each bowl, decoratively folding corners in to fit the bowl, and brush the top with egg wash. Use the tip of a knife to create 3 small slits in the center of the pastry to allow steam to vent during cooking. You may place chopped fennel fronds or parsley leaves on the top of the pastry, lightly pressing leaves onto the pastry in the egg wash to adhere. 5. Place baking sheet with individual portions in the preheated oven and bake until pastry is golden browned and filling is hot and bubbly, about 40 minutes. Let cool 10 minutes before serving.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 40 mins",
  "calories": "940"
},
{
  "url": "https://www.allrecipes.com/recipe/8525637/gochujang-glazed-salmon/",
  "name": "Gochujang Glazed Salmon",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "8 ounces salmon fillets; 1 tablespoon gochujang (Korean hot pepper paste); 2 tablespoons pineapple juice; 1 pinch black sesame seeds; 1 pinch white sesame seeds; 1 tablespoon sliced green onions, or to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C) 2. Whisk together gochujang and pineapple juice in a small bowl . to form a glaze. Brush mixture over salmon and place on a baking sheet. 3. Bake until salmon flakes easily with a fork, about 20 minutes. 4. Sprinkle salmon with sesame seeds and green onion.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "240"
},
{
  "url": "https://www.allrecipes.com/recipe/17219/best-tuna-casserole/",
  "name": "Best Tuna Casserole",
  "rating": "4.3",
  "ratingcount": "2",
  "ingredients": "1 (12 ounce) package egg noodles; 2 (10.5 ounce) cans condensed cream of mushroom soup; 2 cups shredded Cheddar cheese, divided; 2 (5 ounce) cans tuna, drained; 1 cup frozen green peas; ½ (4.5 ounce) can sliced mushrooms; ¼ cup chopped onion; 1 cup crushed potato chips",
  "directions": "1. Gather all ingredients. 2. Fill a large pot with lightly salted water and bring to a rapid boil. Cook egg noodles at a boil until tender yet firm to the bite, 7 to 9 minutes; drain. 3. Meanwhile, preheat the oven to 425 degrees F (220 degrees C). 4. Mix noodles, condensed soup, 1 cup cheese, tuna, peas, mushrooms, and onion in a large bowl until well combined. 5. Transfer the mixture into a 9x13-inch baking dish. 6. Top the mixture with crushed potato chip and remaining 1 cup of cheese. 7. Bake in the preheated oven until cheese is bubbly, about 15 to 20 minutes. 8. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "595"
},
{
  "url": "https://www.allrecipes.com/recipe/8465314/trout-meuniere/",
  "name": "Trout Meunière",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "4 (6 ounce) fillets boneless, skin-on rainbow trout fillets, patted dry; ¾ teaspoon kosher salt, divided; ½ teaspoon finely ground black pepper; ½ cup all-purpose flour; 4 tablespoons ghee (clarified butter); 6 tablespoons unsalted butter; 2 tablespoons finely chopped shallot; 3 tablespoons fresh lemon juice; 3 tablespoons finely chopped fresh flat-leaf parsley; lemon wedges, for serving",
  "directions": "1. Preheat the oven to 200 degrees F (93 degrees C). Line a rimmed baking sheet with parchment paper and set aside. 2. Season trout fillets evenly with 1/2 teaspoon salt and pepper. Lightly dredge each fillet in flour, shaking off excess flour. 3. Heat ghee over medium-high in a large skillet. When butter shimmers, add fish fillets skin-side down, cooking in batches if necessary. Cook for 2 to 3 minutes, flip, and continue cooking until the outside is lightly golden brown, and fish is just cooked through and opaque, 1 to 2 minutes. Remove cooked fish to the prepared baking sheet and place in the preheated oven to keep warm. 4. Pour excess ghee or clarified butter from skillet; wipe skillet clean. Add unsalted butter and shallot to the skillet and cook briefly over medium heat until butter is melted and shallot has softened a bit, about 1 minute. Stir in lemon juice and season with remaining 1/4 teaspoon salt. Allow mixture to cook for about 30 seconds. Remove from heat, and stir in parsley. 5. Place fish fillets on plates or a platter; top with sauce from skillet and serve immediately with lemon wedges on the side.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "530"
},
{
  "url": "https://www.allrecipes.com/recipe/39455/marinated-tuna-steak/",
  "name": "Marinated Tuna Steak",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "¼ cup orange juice; ¼ cup soy sauce; 2 tablespoons olive oil; 2 tablespoons chopped fresh parsley; 1 tablespoon lemon juice; 1 clove garlic, minced; ½ teaspoon chopped fresh oregano; ½ teaspoon ground black pepper; 4 (4 ounce) tuna steaks",
  "directions": "1. Mix orange juice, soy sauce, olive oil, parsley, lemon juice, garlic, oregano, and pepper together in a large non-reactive dish until well combined. Place tuna steaks in marinade and turn to coat. Cover the dish with plastic wrap and marinate in the refrigerator for at least 30 minutes. 2. Preheat an outdoor grill for high heat and lightly oil the grate. Remove tuna steaks from the marinade and shake off excess; reserve marinade for basting. 3. Cook tuna steaks on the preheated grill for 5 to 6 minutes; flip steaks and baste with reserved marinade. Cook for an additional 5 minutes, or to desired doneness. Discard any remaining marinade.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "50 mins",
  "calories": "200"
},
{
  "url": "https://www.allrecipes.com/recipe/228319/perfect-ten-baked-cod/",
  "name": "Perfect Ten Baked Cod",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "4 tablespoons butter, divided; ½ sleeve buttery round crackers (such as Ritz®), crushed; 1 pound thick-cut cod loin; ½ medium lemon, juiced; ¼ cup dry white wine; 1 tablespoon chopped fresh parsley; 1 tablespoon chopped green onion; 1 medium lemon, cut into wedges",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 400 degrees F (200 degrees C). 3. Place 2 tablespoons butter in a microwave-safe bowl. Melt in the microwave on high, about 30 seconds. Stir buttery round crackers into melted butter. 4. Place remaining 2 tablespoons butter in a 7x11-inch baking dish. Melt in the preheated oven, 1 to 3 minutes. Remove dish from oven. 5. Coat both sides of cod in melted butter in the baking dish. 6. Bake cod in the preheated oven for 10 minutes. Remove from oven; top with lemon juice, wine, and cracker mixture. Return to the oven and bake until fish is opaque and flakes easily with a fork, about 10 more minutes. 7. Garnish with parsley and green onion and serve with lemon wedges.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "280"
},
{
  "url": "https://www.allrecipes.com/recipe/12720/grilled-salmon-i/",
  "name": "Grilled Salmon",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "1 ½ pounds salmon fillets; lemon pepper to taste; garlic powder to taste; salt to taste; ⅓ cup soy sauce; ⅓ cup brown sugar; ⅓ cup water; ¼ cup vegetable oil",
  "directions": "1. Season salmon fillets with lemon pepper, garlic powder, and salt. 2. Stir soy sauce, brown sugar, water, and vegetable oil together in a small bowl until sugar is dissolved. Place fish in a large resealable plastic bag; add soy sauce mixture, seal, and turn to coat. Refrigerate for at least 2 hours. 3. Preheat an outdoor grill for medium heat and lightly oil the grate. 4. Place salmon on the preheated grill, and discard marinade. Cook salmon until fish flakes easily with a fork, about 6 to 8 minutes per side.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "2 hrs 25 mins",
  "calories": "318"
},
{
  "url": "https://www.allrecipes.com/recipe/8532969/quick-air-fryer-tilapia/",
  "name": "Quick Air Fryer Tilapia",
  "rating": "3.0",
  "ratingcount": "1",
  "ingredients": "olive oil cooking spray; 2 tablespoons all-purpose flour; 1 ½ teaspoons seafood seasoning (such as Old Bay®); ¾ teaspoon paprika; ½ teaspoon garlic powder; salt and freshly ground black pepper to taste; 1 pound tilapia fillets, thawed if frozen; 4 lemon slices",
  "directions": "1. Preheat an air fryer to 400 degrees F (200 degrees C). Spray the air fryer basket with olive oil spray or line with a parchment liner. 2. Whisk flour, seafood seasoning, paprika, garlic powder, salt, and pepper together in a small bowl. 3. Remove tilapia filets from the package and pat dry with a paper towel. Lightly spray filets with olive oil, and sprinkle flour seasoning over each filet, pressing down to coat all of the fish. Turn them over, and season on the other side as well. Place the filets into the air fryer basket, without overlapping, so air can circulate around the filets. 4. Cook until tilapia filets flake easily with a fork, 7 to 10 minutes. There is no need to flip them. Depending on your air fryer size, you might have to cook them in batches. 5. Top each filet with a slice of lemon, and serve hot.",
  "prep": "10 mins",
  "cook": "8 mins",
  "total": "18 mins",
  "calories": "132"
},
{
  "url": "https://www.allrecipes.com/recipe/13107/miso-soup/",
  "name": "Miso Soup",
  "rating": "4.7",
  "ratingcount": "488",
  "ingredients": "4 cups water; 2 teaspoons dashi granules; 3 tablespoons miso paste; 1 (8 ounce) package silken tofu, diced; 2  green onions, sliced diagonally into 1/2 inch pieces",
  "directions": "1. Combine water and dashi granules in a medium saucepan over medium-high heat; bring to a boil. Reduce heat to medium and whisk in miso paste. Stir in tofu. Separate the layers of green onions, and add them to the soup. Simmer gently for 2 to 3 minutes before serving.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "63"
},
{
  "url": "https://www.allrecipes.com/recipe/145853/unbelievable-fish-batter/",
  "name": "Unbelievable Fish Batter",
  "rating": "4.2",
  "ratingcount": "545",
  "ingredients": "1 cup all-purpose flour; ½ cup milk; ½ cup water; ¼ teaspoon baking powder; 1 teaspoon salt",
  "directions": "1. Whisk flour, milk, water, baking powder, and salt together in a bowl until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "91"
},
{
  "url": "https://www.allrecipes.com/recipe/151593/campbells-tuna-noodle-casserole/",
  "name": "Campbell's Tuna Noodle Casserole",
  "rating": "4.4",
  "ratingcount": "509",
  "ingredients": "4 cups hot cooked medium egg noodles; 2 (10.5 ounce) cans Campbell's® Condensed Cream of Mushroom Soup (regular or 25% Lower Sodium); 2 (10 ounce) cans tuna, drained; 2 cups frozen peas; 1 cup milk; 2 tablespoons dry bread crumbs; 1 tablespoon butter, melted",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Stir cooked noodles, condensed soup, tuna, peas, and milk in a 3-quart casserole. 3. Bake in the preheated oven until hot, about 30 minutes; stir well. 4. Mix bread crumbs with melted butter in a bowl; sprinkle over tuna casserole and continue to bake until bread crumbs are golden brown and crispy, 5 minutes more.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/246066/salmon-en-croute/",
  "name": "Salmon en Croûte",
  "rating": "4.6",
  "ratingcount": "9",
  "ingredients": "2 tablespoons olive oil, divided; ½  onion, chopped; 1 cup chopped fresh mushrooms; 2 teaspoons minced garlic, divided; salt and ground black pepper to taste; 1 cup baby spinach; 1 tablespoon all-purpose flour, or as needed; 2 sheets frozen puff pastry, thawed; 1 (1 1/2-pound) boned, skinned salmon fillet; ½ teaspoon smoked paprika, or more to taste; 1  egg, beaten; ½ cup mayonnaise; 2 tablespoons fresh lemon juice; 2 teaspoons Dijon mustard; ½ teaspoon dried dill",
  "directions": "1. Heat 1 tablespoon oil in a large skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Add mushrooms and 1 teaspoon garlic; cook and stir until mushrooms are soft, about 5 minutes. Season with salt and black pepper. Transfer onion and mushroom mixture to a small bowl. 2. Heat remaining 1 tablespoon oil in the same skillet. Add remaining 1 teaspoon garlic; cook and stir until fragrant, about 30 seconds. Add spinach; cook and stir until wilted, 3 to 5 minutes. Season with salt and black pepper. Transfer to another bowl. 3. Preheat oven to 350 degrees F (175 degrees C). Line a glass baking dish with parchment paper. 4. Dust work surface with flour. Lay 1 puff pastry sheet out on work surface; spread onion and mushroom mixture evenly across pastry, leaving a 1/2-inch border. Center salmon on top; sprinkle paprika over salmon and top with wilted spinach. Cover with second puff pastry sheet. Fold over and crimp edges to seal. Brush top with beaten egg. Transfer to prepared baking dish. 5. Bake in the preheated oven until pastry is golden, 40 to 45 minutes. Let cool briefly, then slice into 4 portions. 6. To make the sauce: Whisk mayonnaise, lemon juice, Dijon mustard, and dill together in a small bowl. Spoon sauce onto 4 plates and place a piece of salmon en croûte on each.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "1206"
},
{
  "url": "https://www.allrecipes.com/recipe/51283/maple-salmon/",
  "name": "Maple Salmon",
  "rating": "4.7",
  "ratingcount": "5",
  "ingredients": "¼ cup maple syrup; 2 tablespoons soy sauce; 1 clove garlic, minced; ¼ teaspoon garlic salt; ⅛ teaspoon ground black pepper; 1 pound salmon",
  "directions": "1. Stir maple syrup, soy sauce, garlic, garlic salt, and pepper together in a small bowl. 2. Cut salmon into 4 equal-sized fillets; place in a shallow glass baking dish and coat with maple syrup mixture. Cover the dish and marinate salmon in the refrigerator for 30 minutes, turning once halfway. 3. Preheat the oven to 400 degrees F (200 degrees C). 4. Place the baking dish in the preheated oven and bake salmon uncovered until flesh easily flakes with a fork, about 20 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "265"
},
{
  "url": "https://www.allrecipes.com/recipe/230857/easy-tuna-patties/",
  "name": "Easy Tuna Patties",
  "rating": "4.6",
  "ratingcount": "577",
  "ingredients": "2  eggs; 2 teaspoons lemon juice; 10 tablespoons Italian-seasoned bread crumbs; 3 tablespoons grated Parmesan cheese; 3 (5 ounce) cans tuna, drained; 3 tablespoons diced onion; 1 pinch ground black pepper; 3 tablespoons vegetable oil",
  "directions": "1. Beat eggs and lemon juice in a bowl; stir in bread crumbs and Parmesan cheese to make a paste. Fold in tuna and onion until well combined; season with black pepper. 2. Use your hands to shape tuna mixture into 8 (1-inch-thick) patties. 3. Heat vegetable oil in a skillet over medium heat. Fry patties in the hot oil until golden brown, about 5 minutes per side.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "325"
},
{
  "url": "https://www.allrecipes.com/recipe/231537/grilled-halibut/",
  "name": "Grilled Halibut",
  "rating": "4.6",
  "ratingcount": "104",
  "ingredients": "¾ cup butter, softened; 1 tablespoon lemon juice; 1 ½ teaspoons onion powder; 1 ½ teaspoons dried parsley; ¾ teaspoon dried dill weed (Optional); ¼ teaspoon white sugar (Optional); ¼ teaspoon salt; ¼ teaspoon ground black pepper; 4 (1-inch thick) halibut steaks",
  "directions": "1. Preheat an outdoor grill for medium heat and lightly oil the grate. 2. Stir butter, lemon juice, onion powder, parsley, dill, sugar, salt, and pepper together in a bowl; spread evenly over halibut steaks. 3. Cook on the preheated grill until fish flakes easily with a fork, 5 to 6 minutes per side.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "498"
},
{
  "url": "https://www.allrecipes.com/recipe/12870/ahi-poke-basic/",
  "name": "Ahi Tuna Poke",
  "rating": "4.5",
  "ratingcount": "183",
  "ingredients": "2 pounds fresh tuna steaks, cubed; 1 cup soy sauce; ¾ cup chopped green onions; 2 tablespoons sesame oil; 2 tablespoons finely chopped macadamia nuts; 1 tablespoon toasted sesame seeds; 1 tablespoon crushed red pepper (Optional)",
  "directions": "1. Gather all ingredients. 2. Place tuna in a medium non-reactive bowl. Add soy sauce, green onions, sesame oil, sesame seeds, macadamia nuts, and red pepper flakes; mix well. Cover and refrigerate at least 2 hours before serving. 3. Serve over rice.",
  "prep": "10 mins",
  "cook": "",
  "total": "2 hrs 10 mins",
  "calories": "396"
},
{
  "url": "https://www.allrecipes.com/recipe/232906/simple-broiled-haddock/",
  "name": "Simple Broiled Haddock",
  "rating": "4.6",
  "ratingcount": "266",
  "ingredients": "2 pounds haddock fillets; ½ teaspoon onion powder; ½ teaspoon paprika; ½ teaspoon garlic powder; ½ teaspoon ground black pepper; ½ teaspoon salt; ¼ teaspoon cayenne pepper; 1 tablespoon butter, cut in small pieces; 1  lemon, cut into wedges",
  "directions": "1. Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil; spray with cooking spray. 2. Arrange haddock fillets on the prepared baking sheet. 3. Mix onion powder, paprika, garlic powder, black pepper, salt, and cayenne pepper in a small bowl; sprinkle seasoning over fish, then dot with butter. 4. Broil in the preheated oven until fish flakes easily with a fork, 6 to 8 minutes. Serve with lemon wedges.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/140930/southern-fried-catfish/",
  "name": "Southern Fried Catfish",
  "rating": "4.5",
  "ratingcount": "154",
  "ingredients": "½ cup buttermilk; ½ cup water; salt and pepper, to taste; 1 pound catfish fillets, cut in strips; 1 ½ cups fine cornmeal; ½ cup all-purpose flour; 1 teaspoon seafood seasoning, such as Old Bay™; 1 quart vegetable oil for deep frying",
  "directions": "1. Mix buttermilk, water, salt, and pepper in a small bowl. Pour mixture into a flat pan large enough to hold fillets. Arrange fillets in a single layer in the pan, turning to coat each side. Set aside to marinate. 2. Combine cornmeal, flour, and seafood seasoning in a 2-gallon resealable plastic bag. Add fillets to the bag, a few at a time, and tumble gently until evenly coated. 3. Heat oil in a deep fryer to 365 degrees F (185 degrees C). 4. Fry fillets in hot oil until crisp and golden brown, about 3 minutes. Work in batches to avoid overcrowding, so fillets have room to brown properly. Drain on paper towels.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "1427"
},
{
  "url": "https://www.allrecipes.com/recipe/201934/pan-seared-tilapia/",
  "name": "Pan-Seared Tilapia",
  "rating": "4.6",
  "ratingcount": "802",
  "ingredients": "4 (4 ounce) tilapia fillets; salt and ground black pepper to taste; ½ cup all-purpose flour; 1 tablespoon olive oil; 2 tablespoons unsalted butter, melted; 1 tablespoon lemon juice, or to taste (Optional); 1 teaspoon chopped fresh flat-leaf parsley, or to taste (Optional); ½ teaspoon chopped fresh thyme, or to taste (Optional)",
  "directions": "1. Rinse tilapia fillets in cold water and pat dry with paper towels. Season both sides of each fillet with salt and pepper. 2. Place flour in a shallow dish. Gently press each fillet into the flour to coat and shake off any excess. 3. Heat olive oil in a large skillet over medium-high heat. Cook tilapia fillets in the hot oil, in batches if necessary, until fish flakes easily with a fork, about 4 minutes per side. 4. Brush melted butter onto the tilapia fillets in the last minute before removing from the skillet. 5. Drizzle fillets with lemon juice and garnish with parsley and thyme.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "249"
},
{
  "url": "https://www.allrecipes.com/recipe/160099/seared-ahi-tuna-steaks/",
  "name": "Seared Ahi Tuna Steaks",
  "rating": "4.6",
  "ratingcount": "837",
  "ingredients": "2 (5 ounce) ahi tuna steaks; 1 teaspoon kosher salt; ¼ teaspoon cayenne pepper (Optional); ½ tablespoon butter; 2 tablespoons olive oil; 1 teaspoon whole peppercorns",
  "directions": "1. Pat tuna steaks dry and season on both sides with salt and cayenne pepper. 2. Melt butter in a skillet over medium-high heat. 3. Add olive oil and pepper corns; cook until peppercorns soften and pop, about 5 minutes. 4. Gently place seasoned tuna in the skillet and cook to desired doneness, anywhere from 30 seconds to 1 1/2 minutes per side. 5. Slice tuna into 1/4-inch thick slices to serve. 6. Enjoy!",
  "prep": "5 mins",
  "cook": "2 mins",
  "total": "7 mins",
  "calories": "301"
}]