[{
  "url": "https://www.allrecipes.com/recipe/241934/super-food-chocolate-chip-cookies/",
  "name": "Super Food Chocolate Chip Cookies",
  "rating": "4.7",
  "ratingcount": "17",
  "ingredients": "1 cup packed brown sugar; 1 cup coconut sugar; ½ cup butter, softened; ½ cup coconut oil; 2  eggs; 2 teaspoons vanilla extract; 2 teaspoons hot water; 1 teaspoon baking soda; ½ teaspoon cream of tartar; 3 cups all-purpose flour; 1 cup dark chocolate chips (such as Ghirardelli® 60% Cacao); ½ cup chopped walnuts; ¼ cup chia seeds; ¼ cup ground flax seeds; ¼ cup cocoa nibs; ½ teaspoon salt",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Beat brown sugar, coconut sugar, butter, and coconut oil with an electric mixer in a large bowl until smooth. Beat the first egg into creamed butter mixture until completely blended; beat in vanilla extract with the last egg. 3. Stir hot water and baking soda together in a small bowl until baking soda is dissolved; stir into butter mixture. Add cream of tartar and mix well. 4. Mix flour into butter mixture until dough is smooth; fold in walnuts, chia seeds, flax seeds, cocoa nibs, and salt. Drop dough by rounded tablespoons onto prepared baking sheet. 5. Bake in the preheated oven until cookies are lightly browned around the edges, about 12 minutes. Transfer cookies to a wire rack to cool.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "107"
},
{
  "url": "https://www.allrecipes.com/recipe/273134/skinny-banana-bread/",
  "name": "Skinny Banana Bread",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 ¾ cups whole wheat flour; 3 teaspoons baking powder; 2 teaspoons ground cinnamon; ½ teaspoon baking soda; ¼ teaspoon salt; ¼ teaspoon ground nutmeg; 3  mashed ripe bananas, or to taste; 2  eggs; ½ cup applesauce; ⅓ cup brown sugar; 3 tablespoons flaxseed meal; ⅛ cup milk; ½ tablespoon vanilla extract; ½ cup chopped walnuts (Optional)",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease two 4x8-inch loaf pans. 2. Combine flour, baking powder, cinnamon, baking soda, salt, and nutmeg in a bowl. 3. Combine bananas, eggs, applesauce, brown sugar, flaxseed meal, milk, and vanilla extract in a large bowl and mix until well combined. Gradually add flour mixture to the banana mixture, stirring until uniform. Add walnuts and mix lightly just until evenly distributed. Pour batter evenly into the prepared loaf pans. 4. Bake in the preheated oven until a toothpick inserted in the center comes out clean, 45 to 60 minutes. 5. Remove loaves from oven and set aside to cool for 15 minutes. Remove loaves from pans and let cool about 5 minutes more before serving.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 20 mins",
  "calories": "127"
},
{
  "url": "https://www.allrecipes.com/recipe/263787/vegan-zucchini-carrot-muffins-with-applesauce/",
  "name": "Vegan Zucchini Carrot Muffins with Applesauce",
  "rating": "4.3",
  "ratingcount": "4",
  "ingredients": "½ cup brown sugar; ¼ cup canola oil; ¾ cup applesauce; ½  ripe banana, mashed; 1  Golden Delicious apple, diced; 1 cup grated zucchini; 1 cup grated carrots; 1 cup whole wheat flour; ½ cup all-purpose flour; ¼ cup ground flax seeds; 2 teaspoons baking powder; ½ teaspoon ground cinnamon; ½ teaspoon salt; ¼ cup chopped walnuts, or to taste",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease a 12-cup muffin tin or line cups with paper liners. 2. Mix brown sugar and oil together in a bowl. Stir in applesauce and mashed banana. Mix in apple, zucchini, and carrots. 3. Combine whole wheat flour, all-purpose flour, flax seeds, baking powder, cinnamon, and salt in another bowl. Fold flour mixture into the sugar mixture. Pour batter into the prepared muffin cups; sprinkle chopped walnuts on top. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes.",
  "prep": "30 mins",
  "cook": "25 mins",
  "total": "55 mins",
  "calories": "179"
},
{
  "url": "https://www.allrecipes.com/recipe/270852/clean-carrot-muffins/",
  "name": "Clean Carrot Muffins",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "½ cup rolled oats; 2 teaspoons flax seeds; 1  ripe banana; 1  egg; ¼ cup natural peanut butter; 2 tablespoons honey (Optional); 2 teaspoons vanilla extract; 1 teaspoon baking soda; 1 teaspoon cinnamon; ½ teaspoon ground ginger; ¼ teaspoon ground nutmeg; ¼ teaspoon salt; ¾ cup finely grated carrot",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease 6 cups of a muffin tin. 2. Mix together oats and flaxseeds in a small bowl. 3. Combine oat mixture, banana, egg, peanut butter, honey, flax seeds, vanilla extract, baking soda, cinnamon, ginger, nutmeg, and salt in a blender. Process until smooth. Fold in grated carrots. Divide batter evenly among the prepared muffin cups. 4. Bake in the preheated oven until tops spring back when lightly pressed, about 18 minutes. Cool in the tin for 5 minutes. Transfer to a wire rack to cool completely.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "159"
},
{
  "url": "https://www.allrecipes.com/recipe/241169/orange-pancakes/",
  "name": "Orange Pancakes",
  "rating": "4.5",
  "ratingcount": "6",
  "ingredients": "2 cups white whole wheat flour; 2 tablespoons baking powder; 2 tablespoons ground flax meal; 17 fluid ounces orange juice; 1 teaspoon orange extract",
  "directions": "1. Whisk flour, baking powder, and flax meal together in a bowl; stir orange juice and orange extract into flour mixture until batter is well-combined. 2. Heat a lightly oiled griddle over medium-high heat, or an electric griddle to 375 degrees F (190 degrees C). Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "305"
},
{
  "url": "https://www.allrecipes.com/recipe/16923/wheat-bread-with-flax-seed/",
  "name": "Wheat Bread with Flax Seed",
  "rating": "4.3",
  "ratingcount": "57",
  "ingredients": "1 (.25 ounce) package active dry yeast; 1 ¼ cups whole wheat flour; ¾ cup ground flax seed; 1 cup bread flour; 1 tablespoon vital wheat gluten; 2 tablespoons dry milk powder; 1 teaspoon salt; 1 ½ tablespoons vegetable oil; ¼ cup honey; 1 ½ cups water",
  "directions": "1. Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select cycle; press Start.",
  "prep": "5 mins",
  "cook": "40 mins",
  "total": "4 hrs 5 mins",
  "calories": "168"
},
{
  "url": "https://www.allrecipes.com/recipe/255094/healthy-after-school-granola-bars/",
  "name": "Healthy After-School Granola Bars",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "2 ½ cups oats; 1 ½ cups quinoa; 1 cup slivered almonds; ⅓ cup chia seeds; 1 cup crunchy peanut butter; ½ cup honey; ¼ cup coconut oil, warmed; ½ cup flaxseed meal; 1 teaspoon salt; 2 cups dark chocolate chips",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Spread oats, quinoa, almonds, and chia seeds on a baking sheet. 2. Toast in the preheated oven, stirring halfway through, until golden brown, about 15 minutes. 3. Mix peanut butter, honey, and coconut oil together in a bowl until thoroughly combined. Mix in oat mixture, flaxseed meal, and salt until well combined. Press granola mixture into a 12x18-inch baking pan. 4. Bake in the preheated oven until bars set, about 5 minutes. Remove from oven; sprinkle with chocolate chips. Bake until chocolate is just melted, about 5 minutes. Spread melted chocolate evenly over bars with a rubber spatula. 5. Place in the freezer until chocolate is firm, about 20 minutes; cut into bars.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "1 hr",
  "calories": "223"
},
{
  "url": "https://www.allrecipes.com/recipe/256565/chocolate-protein-cookies/",
  "name": "Chocolate Protein Cookies",
  "rating": "4.0",
  "ratingcount": "3",
  "ingredients": "1 small ripe banana; ¼ cup golden flax seeds; 2 teaspoons chia seeds; 2 scoops vanilla protein powder; 1 tablespoon powdered peanut butter; 2 tablespoons dairy-free mini chocolate chips",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Mash banana in a bowl with an electric mixer until creamy. Blend in flax seeds and chia seeds. Mix in protein powder and powdered peanut butter. Fold in chocolate chips using a spatula. 3. Drop 6 cookies onto the baking sheet using an ice cream scoop. Flatten each cookie with the palm of your hand. 4. Bake in the preheated oven until cookies are firm in the center and edges are browned, 8 to 9 minutes. Transfer to a wire rack; cool for 10 minutes.",
  "prep": "10 mins",
  "cook": "8 mins",
  "total": "28 mins",
  "calories": "141"
},
{
  "url": "https://www.allrecipes.com/recipe/254738/overnight-buckwheat-oats/",
  "name": "Overnight Buckwheat Oats",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "¼ cup buckwheat flakes; 2 teaspoons chia seeds; 1 tablespoon coconut, divided; 1 teaspoon flax seed meal; ⅛ teaspoon ground cinnamon; ⅛ teaspoon vanilla powder; ⅓ cup milk; 2 tablespoons mixed berries; 1 teaspoon agave",
  "directions": "1. Combine buckwheat, chia seeds, 1 1/2 teaspoons coconut, flax seed meal, cinnamon, and vanilla powder in a jar; stir until well mixed. Stir in milk; cover. Place in the refrigerator, 8 hours to overnight. 2. Stir buckwheat mixture. Heat in the microwave for 30 seconds. Stir in mixed berries, remaining coconut, and agave.",
  "prep": "5 mins",
  "cook": "1 mins",
  "total": "8 hrs 6 mins",
  "calories": "215"
},
{
  "url": "https://www.allrecipes.com/recipe/92974/blueberry-flax-pancakes/",
  "name": "Blueberry Flax Pancakes",
  "rating": "4.8",
  "ratingcount": "108",
  "ingredients": "1 ½ cups dry pancake mix; ½ cup flax seed meal; 1 cup skim milk; 2  eggs; 1 cup fresh or thawed frozen blueberries",
  "directions": "1. Set a nonstick skillet over medium heat. 2. In a medium bowl, stir together the pancake mix and flax seed meal. In a separate bowl or measuring cup, whisk together the milk and eggs. Pour the liquid into the dry ingredients, and stir just until moistened. 3. Spoon 1/4 cupfuls of batter onto the hot skillet. Sprinkle with as many blueberries as desired. Cook until bubbles appear on the surface, then flip and cook until browned on the other side.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "332"
},
{
  "url": "https://www.allrecipes.com/recipe/265865/vegan-pumpkin-brownie/",
  "name": "Vegan Pumpkin Brownie",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "¾ cup pumpkin puree; 1 ½ tablespoons coconut oil; 3 tablespoons orange juice; 1 pinch ground nutmeg; 1 pinch ground cinnamon; 5 tablespoons hot water; 3 tablespoons flaxseed meal; 1 cup almond flour; 6 tablespoons white sugar; 3 tablespoons orange juice; 1 ½ tablespoons coconut oil; 1 tablespoon vanilla extract; ⅔ cup dark chocolate, melted; ⅓ cup chopped pecans; 1 teaspoon baking powder; 1 pinch salt; 1 pinch ground black pepper",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch square baking pan. 2. Blend pumpkin puree, 1 1/2 tablespoons coconut oil, 3 tablespoons orange juice, nutmeg, and cinnamon together in a bowl. Refrigerate pumpkin swirl until needed. 3. Combine hot water and flaxseed meal in a small bowl. Stir and let soak for about 5 minutes. 4. Combine flaxseed mixture, almond flour, sugar, 3 tablespoons orange juice, 1 1/2 tablespoons coconut oil, and vanilla extract in a blender and process. Transfer to a bowl. Stir melted chocolate, pecans, baking powder, salt, and pepper into brownie mixture. 5. Spread brownie mixture into the prepared baking pan. Spread pumpkin swirl on top. Run a knife through the mixture to create a pretty marbled look. 6. Bake in the preheated oven for 30 minutes. Cover the baking pan with aluminum foil and return to the hot oven. Bake until brownies are set, about 20 minutes more. Cool completely before slicing and serving, about 30 minutes. Store in the refrigerator.",
  "prep": "30 mins",
  "cook": "50 mins",
  "total": "1 hr 55 mins",
  "calories": "303"
},
{
  "url": "https://www.allrecipes.com/recipe/262478/canadian-vegan-peanut-butter-granola-recipe/",
  "name": "Canadian Vegan Peanut Butter Granola Recipe",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "½ cup natural, salted peanut butter; ¼ cup maple syrup; 1 tablespoon flaxseed meal; 2 teaspoons vanilla extract; 2 teaspoons ground cinnamon; 4 cups rolled oats; ½ cup shredded coconut, or to taste; ¼ cup pumpkin seeds, or to taste; ¼ cup raisins, or to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line 1 large or 2 smaller baking sheets with parchment paper. 2. Mix peanut butter, maple syrup, flaxseed meal, vanilla extract, and cinnamon together in a large bowl. Add oats and coconut and mix until completely combined. Transfer mixture to the prepared baking sheets. 3. Bake in the preheated oven until toasted and fragrant, about 10 minutes. Add pumpkin seeds and stir the granola. Continue baking until evenly browned and dry to the touch, about 9 minutes more. 4. Let granola cool slightly. Add raisins. Store granola in an airtight container.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "180"
},
{
  "url": "https://www.allrecipes.com/recipe/256228/overnight-muesli/",
  "name": "Overnight Muesli",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "1 tablespoon ground flax seeds; 1 tablespoon oat bran; 1 tablespoon quick-cooking oats; 1 tablespoon cooked brown rice; 12  raisins, or more to taste; ¼ teaspoon ground cinnamon; ½ cup soy milk, or more as needed",
  "directions": "1. Mix ground flax seeds, oat bran, quick-cooking oats, brown rice, raisins, and cinnamon together in a container with a lid. Pour in soy milk; stir to make sure flaxseed mixture is suspended in milk. 2. Cover and refrigerate until oats soften, at least 6 hours. Uncover and stir before serving.",
  "prep": "5 mins",
  "cook": "",
  "total": "6 hrs 5 mins",
  "calories": "168"
},
{
  "url": "https://www.allrecipes.com/recipe/34816/flax-seed-carrot-cake/",
  "name": "Flax Seed Carrot Cake",
  "rating": "3.8",
  "ratingcount": "17",
  "ingredients": "3  egg whites; ⅔ cup white sugar; ¼ cup nonfat milk; ⅓ cup applesauce; 1 teaspoon vanilla extract; ¼ teaspoon almond extract (Optional); 1 ⅓ cups whole wheat flour; ⅔ cup all-purpose flour; 2 tablespoons ground flax seed; 2 teaspoons ground cinnamon; ½ teaspoon ground nutmeg; ½ teaspoon ground cloves; 1 teaspoon baking soda; ⅓ cup chopped walnuts; ¼ cup raisins; ½ (8 ounce) can crushed pineapple, drained; 1 cup grated carrot",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x5 inch loaf pan with vegetable cooking spray. 2. Whisk together the egg whites, sugar, milk, applesauce, vanilla, and almond extract in a small bowl; mix until well blended. In a large bowl, sift together the flour, whole wheat flour, flax seed, cinnamon, nutmeg, cloves, and baking soda. Mix the egg into the flour; stir until well blended. Fold in the walnuts, raisins, carrot, and drained pineapple. Pour batter into the prepared pan. 3. Bake in preheated oven until a toothpick inserted into the center comes out clean (but not necessarily dry), about 40 minutes. Set aside to cool for 10 to 20 minutes before refrigerating overnight.",
  "prep": "25 mins",
  "cook": "40 mins",
  "total": "9 hrs 5 mins",
  "calories": "178"
},
{
  "url": "https://www.allrecipes.com/recipe/244799/morning-energy-booster-smoothie/",
  "name": "Morning Energy Booster Smoothie",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "1 cup prune juice; 3 tablespoons vanilla Greek yogurt; 1 cup fresh spinach, or to taste; 1 cup frozen blueberries, or to taste; 6  frozen strawberries; ½  sliced frozen peach; 2 tablespoons flax seeds",
  "directions": "1. Pour prune juice into a blender. Layer Greek yogurt, spinach, blueberries, strawberries, peach, and flax seeds in the blender, in this order. Start blender on low speed and gradually increase speed until smoothie is well blended.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "239"
},
{
  "url": "https://www.allrecipes.com/recipe/260033/banana-and-flax-seed-muffins/",
  "name": "Banana and Flax Seed Muffins",
  "rating": "4.7",
  "ratingcount": "9",
  "ingredients": "6 large ripe bananas; 1 cup brown sugar; ¾ cup salted butter, melted; ½ cup white sugar; 2  eggs; 1 ½ cups all-purpose flour; 1 ¼ cups whole wheat flour; ½ cup ground flax seeds; 2 teaspoons baking soda; 2 teaspoons baking powder",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line 2 muffin tins with paper liners. 2. Mash bananas in a bowl. Add brown sugar, butter, white sugar, and eggs; mix well. Add all-purpose flour, whole wheat flour, flax seeds, baking soda, and baking powder. Scoop batter into the prepared tins. 3. Bake in the preheated oven until tops spring back when lightly pressed, about 20 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "240"
},
{
  "url": "https://www.allrecipes.com/recipe/231625/crunchy-granola-breakfast-cereal/",
  "name": "Crunchy Granola Breakfast Cereal",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "6 cups rolled oats; 1 cup freshly ground flax seed meal; 1 cup steel-cut oats; 1 cup oat bran; ½ cup wheat germ; 1 cup chopped pecans; ¾ cup agave nectar; ½ cup canned pumpkin; ½ cup brown sugar; ½ cup water; 2 tablespoons canola oil; 2 tablespoons vanilla extract; 2 teaspoons pumpkin pie spice; 1 teaspoon sea salt; 1 cup finely chopped dates; 1 cup miniature chocolate chips",
  "directions": "1. Preheat oven to 275 degrees F (135 degrees C). Line baking sheets with parchment paper. 2. Mix rolled oats, flax seed meal, steel-cut oats, oat bran, wheat germ, and pecans in a large bowl. Whisk agave nectar, pumpkin, brown sugar, water, canola oil, vanilla extract, pumpkin pie spice, and sea salt in a separate bowl, stirring until brown sugar and salt are dissolved. Pour liquid ingredients over rolled oats mixture and stir to coat. Spread mixture on prepared baking sheets. 3. Bake in the preheated oven for 1 hour, stirring every 20 minutes. Stir dates into granola and continue baking until granola is lightly golden brown, 20 to 30 more minutes, stirring once. Let cool completely and mix miniature chocolate chips into granola. Store in an airtight container.",
  "prep": "15 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 35 mins",
  "calories": "283"
},
{
  "url": "https://www.allrecipes.com/recipe/228306/lemon-cranberry-whole-wheat-muffins/",
  "name": "Lemon Cranberry Whole Wheat Muffins",
  "rating": "4.5",
  "ratingcount": "25",
  "ingredients": "2 cups whole wheat flour; ¾ cup white sugar; 2 tablespoons ground flax seed; 1 tablespoon baking powder; 1 teaspoon baking soda; ⅛ teaspoon salt; 2  eggs; 1 cup milk; ½ cup unsweetened applesauce; 2 tablespoons fresh lemon juice; 1 tablespoon canola oil; 1 ½ cups halved cranberries",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Line 12 muffin cups with paper liners. 2. Mix flour, sugar, flax seed, baking powder, baking soda, and salt in a bowl. Beat eggs, milk, applesauce, lemon juice and canola oil in another bowl until smooth. Stir flour mixture into egg mixture until just moistened; fold in cranberries. Fill prepared muffin cups about 2/3 full. 3. Bake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, 18 to 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "1 hr 35 mins",
  "calories": "171"
},
{
  "url": "https://www.allrecipes.com/recipe/191936/irresistible-double-chocolate-muffins/",
  "name": "Irresistible Double Chocolate Muffins",
  "rating": "4.4",
  "ratingcount": "177",
  "ingredients": "1 cup whole wheat flour; ¾ cup ground flax seed; ½ cup wheat germ; 1 teaspoon baking soda; 1 ½ teaspoons baking powder; ½ cup cocoa powder; 1 tablespoon ground cinnamon; ½ cup miniature semisweet chocolate chips; 1 cup low-fat buttermilk; ¾ cup pumpkin puree; 1 cup brown sugar; 1  egg; 1 teaspoon vanilla extract",
  "directions": "1. Preheat an oven to 400 degrees F (200 degrees C). Grease 12 muffin cups, or line with paper muffin liners. 2. Combine flour, flax seed, wheat germ, baking soda, baking powder, cocoa powder, cinnamon, and chocolate chips in a large bowl. In another bowl, beat the buttermilk, pumpkin puree, brown sugar, egg, and vanilla until smooth. Gently stir the wet ingredients into the dry, mixing just until combined. Spoon equal amounts of batter into muffin cups. 3. Bake until a toothpick inserted in the center of a muffin comes out clean, about 20 to 30 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "237"
},
{
  "url": "https://www.allrecipes.com/recipe/270924/low-cholesterol-whole-wheat-pancakes/",
  "name": "Low-Cholesterol Whole Wheat Pancakes",
  "rating": "3.0",
  "ratingcount": "1",
  "ingredients": "2 tablespoons flax seeds; 1 ¼ cups skim milk, or more as needed; 2 tablespoons brown sugar; 1 teaspoon vanilla extract; 1 ¼ cups whole wheat flour; 2 teaspoons baking powder; ½ teaspoon salt; ¼ cup raisins; ¼ cup sunflower seeds; cooking spray",
  "directions": "1. Grind flax seeds in a blender to yield about 4 tablespoons ground flax seeds. Transfer to a large mixing bowl and stir in milk. Add brown sugar and vanilla extract; set aside. 2. Sift whole wheat flour, baking powder, and salt together in a separate bowl. Pour into the milk mixture and mix until just combined. Stir raisins and sunflower seeds into the batter. Adjust batter with a little milk if necessary; it should be slightly thick. 3. Preheat a griddle to 350 degrees F (175 degrees C). Grease with cooking spray. Drop 1/4 cup batter onto the hot griddle and cook until bubbles form and the edges are dry, 1 1/2 minutes. Flip and cook until browned on the other side, 1 1/2 minutes more. Repeat with remaining batter.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "200"
},
{
  "url": "https://www.allrecipes.com/recipe/245299/multigrain-seed-biscuits/",
  "name": "Multigrain Seed Biscuits",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "1 ¼ cups multigrain flour; 1 cup whole wheat flour; ¼ cup sunflower seeds; ¼ cup flax seeds; ¼ cup wheat germ; 1 tablespoon white sugar; 1 tablespoon baking powder; ½ teaspoon salt; ½ cup cold butter; 1 cup milk; 1  egg, lightly beaten; ¼ cup sesame seeds",
  "directions": "1. Preheat oven to 425 degrees F (220 degrees C). 2. Whisk multi-grain flour, wheat flour, sunflower seeds, flax seeds, wheat germ, sugar, baking powder, and salt together in a large bowl. 3. Grate cold butter into flour mixture using the largest holes of a cheese grater and mix with a fork until it resembles coarse crumbs. Slowly pour in milk and mix until dough begins to pull away from sides of the bowl. 4. Turn dough out onto a lightly floured surface and gently knead to form a soft dough, about 10 turns. Pat into an 8-inch square, cut into quarters, and cut each quarter into 3 rectangular pieces. 5. Place each piece of dough onto an ungreased baking sheet, about 1 inch apart; brush with egg and sprinkle with sesame seeds. 6. Bake in the preheated oven until golden, 12 to 15 minutes.",
  "prep": "30 mins",
  "cook": "12 mins",
  "total": "42 mins",
  "calories": "228"
},
{
  "url": "https://www.allrecipes.com/recipe/24015/pumpkin-flax-quickbread/",
  "name": "Pumpkin Flax Quickbread",
  "rating": "4.6",
  "ratingcount": "163",
  "ingredients": "2 tablespoons flax seed meal; 6 tablespoons water; 1 ½ cups sugar; 1 cup canned pumpkin puree; ½ cup applesauce; 1 ⅓ cups all-purpose flour; ⅓ cup whole wheat pastry flour; 1 teaspoon baking soda; 1 teaspoon ground cinnamon; ¾ teaspoon salt; ½ teaspoon baking powder; ½ teaspoon ground nutmeg; ¼ teaspoon ground cloves",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 9x5 inch loaf pan. 2. Whisk together flax seed meal and water. Mix in sugar, pumpkin and apple sauce. 3. In a large bowl, stir together all-purpose flour, whole wheat flour, baking soda, cinnamon, salt, baking powder, nutmeg, and cloves. Add flour mixture to pumpkin mixture; stir until smooth. Pour batter into prepared pan. 4. Bake in preheated oven for 65 to 70 minutes, until a toothpick inserted into center of the loaf comes out clean.",
  "prep": "10 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 20 mins",
  "calories": "176"
},
{
  "url": "https://www.allrecipes.com/recipe/238056/banana-coconut-flaxseed-muffins-with-apple-and-chia/",
  "name": "Banana Coconut Flaxseed Muffins with Apple and Chia",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "1 ½ teaspoons butter; 1 ¼ cups flaxseed meal; ¼ cup white sugar; 2 tablespoons chia seeds; 1 tablespoon baking powder; 1 ½ teaspoons ground cinnamon; 3  ripe bananas, mashed; 3  eggs, beaten; 1  apple, chopped; ½ cup coconut flakes, or more to taste",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a muffin tin with butter. 2. Combine flaxseed meal, sugar, chia seeds, baking powder, and cinnamon in a bowl. Add bananas, eggs, and apple; mix batter thoroughly. Stir in 6 tablespoons coconut flakes. Fill tin 3/4 full with batter. Sprinkle remaining 2 tablespoons coconut flakes on top. 3. Bake in the preheated oven until tops spring back when lightly pressed, about 30 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "155"
},
{
  "url": "https://www.allrecipes.com/recipe/246906/chocolate-blueberry-zucchini-bread/",
  "name": "Chocolate Blueberry Zucchini Bread",
  "rating": "4.4",
  "ratingcount": "7",
  "ingredients": "1 cup white sugar; 1 cup vegetable oil; 4  eggs; ½ cup brown sugar; 1 teaspoon vanilla extract, or to taste; 3 cups grated zucchini; 1 ½ cups all-purpose flour; 1 ½ cups whole wheat flour; ½ cup flaxseed meal (Optional); ½ cup unsweetened baking cocoa (such as Ghirardelli®); 2 teaspoons ground cinnamon; 1 ½ teaspoons baking powder; 1 ½ teaspoons baking soda; 1 teaspoon salt; ½ teaspoon ground cardamom; 1 pint blueberries; 2 tablespoons all-purpose flour",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Grease 2 loaf pans. 2. Whisk white sugar, oil, eggs, brown sugar, and vanilla extract together in a large bowl. Fold in grated zucchini. Add 1 1/2 cup all-purpose flour, whole wheat flour, flaxseed meal, cocoa, cinnamon, baking powder, baking soda, salt, and cardamom; mix until batter is combined. 3. Combine blueberries and 2 tablespoons all-purpose flour in a small bowl; toss to combine. 4. Fold blueberry mixture gently into the batter. Pour batter into loaf pans, filling each one 2/3 full. 5. Bake in the preheated oven until a toothpick inserted into the center of each loaf comes out clean, 45 minutes to 1 hour.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "272"
},
{
  "url": "https://www.allrecipes.com/recipe/279012/homemade-plant-based-milk/",
  "name": "Homemade Plant-Based Milk",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "⅓ cup rolled oats; ⅓ cup raw, skin-on almonds; ⅓ cup cashews; 4 cups filtered water, divided; 1 tablespoon whole flax seeds",
  "directions": "1. Combine oats, almonds, and cashews in a large bowl and cover with 2 cups filtered water. Allow to soak in the refrigerator for at least 8 hours. 2. Remove from the refrigerator and add flax seeds. Let stand so flax seeds react with the water and mixture comes to room temperature, about 1 hour. 3. Transfer to a blender and blend until creamy. Let rest for 5 minutes. Add remaining 2 cups filtered water. Blend until well combined, smooth, and creamy. Strain the pulp through a fine-mesh sieve. Enjoy right away or refrigerate for up to 1 week. Shake well before use.",
  "prep": "15 mins",
  "cook": "",
  "total": "9 hrs 20 mins",
  "calories": "176"
},
{
  "url": "https://www.allrecipes.com/recipe/255627/amazing-vegan-pumpkin-bread/",
  "name": "Amazing Vegan Pumpkin Bread",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "cooking spray; 2 tablespoons water; 2 tablespoons flaxseed meal; 1 cup applesauce; 1 cup loosely packed brown sugar; ⅓ cup vegetable oil; ¼ cup almond milk; 2 cups pumpkin puree; 2 ½ cups whole wheat flour; 1 ½ teaspoons baking powder; 1 teaspoon baking soda; 1 teaspoon ground cinnamon; ½ teaspoon sea salt; ½ teaspoon ground cardamom; ¼ teaspoon ground cloves; 1 dash ground nutmeg",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease 2 loaf pans with cooking spray. 2. Combine water and flaxseed meal in a small bowl. Let stand until thickened, about 5 minutes. 3. Stir flaxseed mixture, applesauce, brown sugar, vegetable oil, and almond milk together in a bowl. Add pumpkin puree. 4. Mix whole wheat flour, baking powder, baking soda, cinnamon, salt, cardamom, cloves, and nutmeg together in a bowl. Blend in applesauce mixture. Divide batter between loaf pans. 5. Bake in the preheated oven until a toothpick inserted into the center comes out mostly clean, 35 to 40 minutes. Cool in the pans for 10 minutes before inverting onto a wire rack.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr 5 mins",
  "calories": "105"
},
{
  "url": "https://www.allrecipes.com/recipe/264358/vegan-rhubarb-cinnamon-streusel-muffins/",
  "name": "Vegan Rhubarb Cinnamon Streusel Muffins",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "3 cups water; ⅓ cup flax seeds; 1 cup soy milk; 1 ½ teaspoons lemon juice; 2 ½ cups all-purpose flour; 1 teaspoon baking soda; ½ teaspoon salt; 1 ¼ cups brown sugar; ½ cup vegetable oil; 1 teaspoon vanilla extract; 2 cups chopped rhubarb; ½ cup brown sugar; 1 tablespoon vegan margarine (such as Earth Balance®), cut into cubes; ¾ teaspoon ground cinnamon",
  "directions": "1. Bring water and flax seeds to a boil in a saucepan. Reduce heat and simmer for 30 minutes. Strain mixture to remove seeds. Allow to cool to lukewarm. 2. Preheat the oven to 350 degrees F (175 degrees C). Line 18 muffin cups with paper liners. 3. Mix soy milk and lemon juice together in a small bowl. Set aside until curdled, about 5 minutes. 4. Combine flour, baking soda, and salt together in a large bowl. 5. Blend brown sugar and oil in a separate bowl. Whisk in 1/2 cup flax egg mixture, curdled soy milk, and vanilla extract. Stir sugar mixture and rhubarb into the flour mixture until flour is just incorporated. 6. Spoon batter into the prepared muffin cups, filling each 3/4 full. Mix brown sugar, vegan margarine, and cinnamon together to make streusel topping. Spoon a little streusel topping over each muffin. 7. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes. Let cool in the pans for 10 minutes before removing to a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "1 hr 30 mins",
  "calories": "211"
},
{
  "url": "https://www.allrecipes.com/recipe/238550/seedy-good-health-banana-bread/",
  "name": "Seedy Good-Health Banana Bread",
  "rating": "5.0",
  "ratingcount": "6",
  "ingredients": "¼ cup coconut oil; ½ cup applesauce; 2  large eggs; ¼ cup butter, melted and cooled; ½ cup white sugar; ½ cup raw sugar; 2 teaspoons vanilla extract; 1 teaspoon sea salt; 2  bananas, mashed; ½ cup sour cream; 1 ½ teaspoons baking soda; ¾ cup all-purpose flour; ¾ cup whole wheat flour; ½ cup chopped roasted almonds; ¼ cup teff; ¼ cup poppy seeds; ¼ cup chia seeds; ¼ cup flax seeds",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease two 9x5-inch loaf pans with the coconut oil. 2. Beat applesauce, eggs, and butter together in a large bowl until smooth. Add white sugar, raw sugar, vanilla extract, and salt; mix well. 3. Whisk bananas, sour cream, and baking soda together in a separate bowl until smooth; stir into the applesauce mixture until evenly combined. 4. Gradually stir all-purpose flour, 1/4 cup at a time, into banana mixture until well mixed. Gradually stir whole wheat flour, 1/4 cup at a time, into banana-flour mixture until batter is well mixed. Fold almonds, teff, poppy seeds, chia seeds, and flax seeds into the batter. Pour batter into the prepared loaf pans. 5. Bake on the middle rack of the preheated oven until a toothpick inserted in the center comes out clean, 40 to 50 minutes. Cool bread in the pans for 15 minutes before transferring to a wire rack to cool, about 20 minutes.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 40 mins",
  "calories": "197"
},
{
  "url": "https://www.allrecipes.com/recipe/235732/mms-granola-bars/",
  "name": "M&M's® Granola Bars",
  "rating": "4.6",
  "ratingcount": "8",
  "ingredients": "2 ½ cups rolled oats; 1 cup candy-coated milk chocolate pieces (such as M&M's®); 1 cup all-purpose flour; 1 cup flax seed meal; ⅓ cup brown sugar; ¾ teaspoon salt; 1  egg; ½ cup honey; ½ cup vegetable oil; 1 tablespoon vanilla extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Stir oats, milk chocolate pieces, flour, flax seed meal, brown sugar, and salt together in a large bowl. Make a well in the center of the oat mixture. 3. Whisk egg in a separate bowl until light and fluffy. Add honey, oil, and vanilla; whisk until well-combined. Pour egg mixture into the well in the oat mixture. Stir until evenly combined. Pour mixture into a 9x13-inch glass baking dish; pat down and spread the mixture flat, leaving at least 1-inch of space between the mixture and the sides of the dish. 4. Bake in the preheated oven until golden and set, about 25 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "294"
},
{
  "url": "https://www.allrecipes.com/recipe/247088/whole-wheat-banana-bread-with-flaxseed-and-oats/",
  "name": "Whole Wheat Banana Bread with Flaxseed and Oats",
  "rating": "3.7",
  "ratingcount": "3",
  "ingredients": "1 ½ cups whole wheat flour; ⅔ cup brown sugar; ½ cup flaxseed meal; ⅓ cup rolled oats; 2 tablespoons white sugar; ½ teaspoon baking powder; ½ teaspoon baking soda; ⅛ teaspoon salt; 2  eggs; 6 tablespoons butter, melted; ⅓ cup buttermilk; 1 tablespoon buttermilk; 1 teaspoon vanilla extract; 3  bananas, mashed",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan. 2. Mix whole wheat flour, brown sugar, flaxseed meal, oats, white sugar, baking powder, baking soda, and salt together in a large bowl. 3. Combine eggs, butter, 1/3 cup plus 1 tablespoon butter milk, and vanilla extract in another bowl. Stir in flour mixture. Add bananas; mix until batter is well-combined. Pour into the prepared loaf pan. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 50 minutes to 1 hour. Cool in the pan for 5 minutes. Invert onto a wire rack and let cool, about 25 minutes.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr 30 mins",
  "calories": "216"
},
{
  "url": "https://www.allrecipes.com/recipe/267120/vegan-pumpkin-pancakes/",
  "name": "Vegan Pumpkin Pancakes",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 cups almond milk; 2 tablespoons distilled white vinegar; 5 tablespoons water; 2 tablespoons flaxseed meal; 2 cups all-purpose flour; 2 tablespoons coconut sugar; 1 tablespoon baking powder; 1 tablespoon ground cinnamon; 2 teaspoons baking soda; 1 teaspoon salt; 1 cup pumpkin puree; 2 tablespoons coconut oil; ¼ cup toasted chopped pecans",
  "directions": "1. Combine almond milk and vinegar together in a measuring cup; set aside for 10 minutes. 2. Combine water and flaxseed meal together in a bowl; allow to rest until gelatinous, about 5 minutes. 3. Combine flour, coconut sugar, baking powder, cinnamon, baking soda, and salt in a medium bowl. 4. Add almond milk mixture, flaxseed meal mixture, pumpkin puree, and coconut oil to the bowl with the flour mixture. Mix until well blended. Fold in pecans. 5. Heat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "288"
},
{
  "url": "https://www.allrecipes.com/recipe/272822/light-and-fluffy-vegan-waffles/",
  "name": "Light and Fluffy Vegan Waffles",
  "rating": "4.7",
  "ratingcount": "6",
  "ingredients": "½ cup warm water; 2 tablespoons flaxseed meal; 2 cups all-purpose flour; 2 tablespoons baking powder; 1 tablespoon white sugar; ½ teaspoon salt; 1 ¾ cups almond milk; ¼ cup vegetable oil; ¼ cup applesauce; 1 teaspoon vanilla extract",
  "directions": "1. Combine water and flaxseed meal in a medium-sized bowl. Set aside for 5 minutes. 2. Combine flour, baking powder, sugar, and salt in a large mixing bowl. Mix well. 3. Add almond milk, oil, applesauce, and vanilla extract to flaxseed mixture. Combine until smooth. Add to flour mixture and stir until just combined. 4. Preheat a waffle iron according to manufacturer's instructions. 5. Add 1/3 cup waffle batter to the preheated waffle iron and cook until waffle is golden brown and the iron stops steaming, about 5 minutes. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "280"
},
{
  "url": "https://www.allrecipes.com/recipe/232191/lactation-cookies/",
  "name": "Lactation Cookies",
  "rating": "4.8",
  "ratingcount": "357",
  "ingredients": "2 tablespoons flaxseed meal; ¼ cup water; 1 cup butter, softened; 1 cup white sugar; ½ cup brown sugar; 3  egg yolks; 1 ½ teaspoons pure vanilla extract; 2 cups all-purpose flour; ¼ cup brewer’s yeast; 1 tablespoon wheat germ; 1 teaspoon baking soda; ½ teaspoon salt; ½ teaspoon cream of tartar; 2 ½ cups old-fashioned oats; 1 cup chocolate chips",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix flaxseed meal with water in a small bowl and let soak for 5 minutes. 3. Beat butter, white sugar, and brown sugar together in a large mixing bowl until creamy. Add egg yolks and vanilla extract; beat to incorporate. Stir in flaxseed mixture. 4. Mix flour, brewer's yeast, wheat germ, baking soda, salt, and cream of tartar, in a separate bowl. 5. Add dry ingredients to the wet ingredients and stir until just combined. Fold in oats and chocolate chips. 6. Roll dough into walnut-sized balls and place 2 inches apart onto a baking sheet. 7. Bake in the preheated oven until the edges are golden, 10 to 12 minutes. Allow cookies to cool on the baking sheet for 1 minute before removing to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "158"
},
{
  "url": "https://www.allrecipes.com/recipe/269702/homemade-einkorn-spelt-bread/",
  "name": "Homemade Einkorn Spelt Bread",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 ⅓ cups water; 2 cups spelt flour; 2 cups einkorn flour; ½ cup oat flour; ¼ cup flax seeds; 2 tablespoons white sugar; 2 tablespoons butter; 1 ½ teaspoons salt; 2 teaspoons fast-rising yeast; ⅓ cup milk, or as needed (Optional)",
  "directions": "1. Place water, spelt flour, einkorn flour, oat flour, flax seeds, sugar, butter, salt, and yeast in a bread machine in the order listed by the manufacturer. Run Wheat cycle. 2. Check dough's moisture level while the machine is mixing; add enough milk to reach a smooth, damp consistency. Remove dough from the machine after the cycle is done, about 1 hour 45 minutes.",
  "prep": "10 mins",
  "cook": "",
  "total": "1 hr 55 mins",
  "calories": "118"
},
{
  "url": "https://www.allrecipes.com/recipe/272395/bread-machine-honey-whole-wheat-bread/",
  "name": "Bread Machine Honey-Whole Wheat Bread",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "1 ½ cups warm water; 2 tablespoons butter; ¼ cup raw honey; 3 ½ cups whole wheat flour; ¼ cup flaxseed meal; ¼ cup vital wheat gluten; 1 ½ teaspoons salt; 1 ½ tablespoons dry milk powder; 2 teaspoons active dry yeast",
  "directions": "1. Place warm water, butter, honey, whole wheat flour, flaxseed meal, vital wheat gluten, salt, dry milk, and yeast in a bread machine in the order listed. Run a basic wheat bread cycle, but adjust the cook timer to cut baking time down by 25 to 30 minutes. I time the bread and take it out when I see that it is not yet brown. If you like a crusty bread you may let it cook the entire time. 2. Remove loaf from the machine after the cycle is done.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "55 mins",
  "calories": "140"
},
{
  "url": "https://www.allrecipes.com/recipe/246002/almond-flour-bread/",
  "name": "Almond Flour Bread",
  "rating": "4.4",
  "ratingcount": "172",
  "ingredients": "1 ½ cups almond flour; ⅓ cup flaxseed meal; 4 large eggs; ¼ cup unsweetened almond milk; 2 tablespoons olive oil; 2 teaspoons baking powder; ½ teaspoon salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease an 8x4-inch loaf pan, or line with parchment paper. 2. Mix almond flour, flaxseed meal, eggs, almond milk, olive oil, baking powder, and salt together in a bowl until a soft dough forms. Transfer to the prepared loaf pan. 3. Bake in the preheated oven until golden brown on top, about 40 minutes. Cool in the loaf pan for 10 minutes before transferring to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/161325/flax-seed-smoothie/",
  "name": "Flax Seed Smoothie",
  "rating": "4.0",
  "ratingcount": "15",
  "ingredients": "1 cup low-fat vanilla soy milk; 1 cup frozen strawberries; ½  frozen banana, peeled and cut into chunks; 2 tablespoons flaxseed meal",
  "directions": "1. Place soy milk, strawberries, banana, and flaxseed meal into a blender; blend until smooth.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "273"
},
{
  "url": "https://www.allrecipes.com/recipe/231925/high-fiber-high-protein-breakfast-bars/",
  "name": "High-Fiber, High-Protein Breakfast Bars",
  "rating": "4.4",
  "ratingcount": "86",
  "ingredients": "cooking spray; 1 ½ cups quick-cooking oats; ¼ cup wheat germ; ¼ cup ground flax seed; 2 tablespoons vanilla-flavored hemp protein powder; 1 teaspoon ground cinnamon; ½ teaspoon salt; 3  bananas; ¼ cup peanut butter (such as Jif®); 2 tablespoons honey; 1 teaspoon vanilla extract; ¼ cup natural peanut butter, or to taste",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Line an 8x8-inch baking dish with aluminum foil, letting foil hang down over the sides of the pan; spray pan with cooking spray. 2. Stir oats, wheat germ, flax seed, protein powder, cinnamon, and salt together in a bowl. Mash bananas in a separate large bowl and stir 1/4 cup Jif® peanut butter, honey, and vanilla extract into bananas, mixing well. Stir dry ingredients into banana mixture and spread into the prepared baking dish. 3. Bake in the preheated oven for 20 minutes. Spread 1/4 cup natural peanut butter over top. 4. Continue baking until lightly browned on the edges and set, 10 more minutes. Let cool in the pan and lift bars onto a work surface using aluminum foil as handles. Cut into bars, wrap in plastic wrap, and store in refrigerator.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "1 hr 45 mins",
  "calories": "169"
},
{
  "url": "https://www.allrecipes.com/recipe/16877/bran-flax-muffins/",
  "name": "Bran Flax Muffins",
  "rating": "4.7",
  "ratingcount": "609",
  "ingredients": "1 ½ cups all-purpose flour; ¾ cup ground flax seed; ¾ cup oat bran; 1 cup brown sugar; 2 teaspoons baking soda; 1 teaspoon baking powder; 1 teaspoon salt; 2 teaspoons ground cinnamon; ¾ cup skim milk; 2  eggs, beaten; 1 teaspoon vanilla extract; 2 tablespoons vegetable oil; 2 cups shredded carrots; 2  apples, peeled, shredded; ½ cup raisins; 1 cup chopped mixed nuts",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease muffin pan or line with paper muffin liners. 2. In a large bowl, mix together flour, flax seed, oat bran, brown sugar, baking soda, baking powder, salt and cinnamon. Add the milk, eggs, vanilla and oil; mix until just blended. Stir in the carrots, apples, raisins and nuts. Fill prepared muffin cups 2/3 full with batter. 3. Bake at 350 F (175 degrees C) for 15 to 20 minutes, or until a toothpick inserted into the center of a muffin comes out clean.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "272"
},
{
  "url": "https://www.allrecipes.com/recipe/75331/flax-seed-zucchini-bread/",
  "name": "Flax Seed Zucchini Bread",
  "rating": "4.4",
  "ratingcount": "5",
  "ingredients": "2 ¾ cups all-purpose flour; ¼ cup soy flour; 1 teaspoon salt; 1 teaspoon baking soda; ¼ teaspoon baking powder; 2 teaspoons ground cinnamon; ½ cup silken tofu; 3  eggs; ½ cup honey; 1 cup brown sugar; ½ cup walnut oil; 1 teaspoon almond extract; 2 ½ cups grated zucchini; ½ cup crushed pineapple, drained; ½ cup chopped walnuts; ½ cup ground flax seed",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Whisk together the all-purpose flour, soy flour, salt, baking soda, baking powder, and cinnamon in a bowl until blended; set aside. 2. Place the tofu in a blender, and puree until smooth. Scrape into a bowl, and beat with the eggs, honey, brown sugar, walnut oil, and almond extract until smooth. Stir in the flour mixture until just moistened, then stir in the zucchini, pineapple, walnuts, and flax seed until combined. Divide this batter between two 8x4 inch ungreased loaf pans. 3. Bake in the preheated oven until a toothpick inserted into the center of the loaves comes out clean, about 1 hour. Cool in the pans on a wire rack before slicing.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "3 hrs 30 mins",
  "calories": "244"
},
{
  "url": "https://www.allrecipes.com/recipe/18010/flax-and-sunflower-seed-bread/",
  "name": "Flax and Sunflower Seed Bread",
  "rating": "4.8",
  "ratingcount": "561",
  "ingredients": "1 ⅓ cups water; 2 tablespoons butter, softened; 3 tablespoons honey; 1 ½ cups bread flour; 1 ⅓ cups whole wheat bread flour; 1 teaspoon salt; 1 teaspoon active dry yeast; ½ cup flax seeds; ½ cup sunflower seeds",
  "directions": "1. Place all ingredients (except sunflower seeds) in the pan of the bread machine in the order recommended by the manufacturer. Select Basic White Cycle; press Start. Add the sunflower seeds when the alert sounds during the Knead Cycle.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "3 hrs",
  "calories": "140"
},
{
  "url": "https://www.allrecipes.com/recipe/245438/homemade-flax-seed-milk/",
  "name": "Homemade Flax Seed Milk",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "½ cup flax seeds; 4 ½ cups water",
  "directions": "1. Blend flax seeds and water in a blender on high for 1 minute; allow to rest for 2 minutes. Blend again on high for 1 minute; allow to rest for 5 minutes. Blend again for 30 seconds. 2. Pour milk through a nut bag or a strainer lined with cheesecloth into a pitcher or glass container; press solids with back of a spoon to extract liquid. Gather cheesecloth around solids; twist and squeeze to extract all the liquid.",
  "prep": "20 mins",
  "cook": "",
  "total": "20 mins",
  "calories": "104"
},
{
  "url": "https://www.allrecipes.com/recipe/246935/ground-flax-egg-substitute/",
  "name": "Ground Flax Egg Substitute",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "3 tablespoons very warm water; 1 tablespoon ground flax seeds",
  "directions": "1. Whisk water and ground flax seeds together in a bowl until combined, about 30 seconds. Let sit until slightly thickened, about 2 minutes. 2. Whisk again, about 30 seconds. Let sit until thickened, about 2 minutes more.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "37"
},
{
  "url": "https://www.allrecipes.com/recipe/261801/flax-seed-crackers/",
  "name": "Flax Seed Crackers",
  "rating": "4.3",
  "ratingcount": "21",
  "ingredients": "1 cup raw flax seeds; ¾ teaspoon salt; ¼ teaspoon garlic powder; ¼ teaspoon onion powder; 1 pinch cayenne pepper; 1 cup cold water",
  "directions": "1. Place flax seeds in mixing bowl. Add salt, garlic powder, onion powder, and cayenne. Pour in water. Stir. Cover with plastic wrap. Refrigerate overnight. 2. Preheat oven to 200 degrees F (95 degrees C). Line a rimmed baking sheeting with a silicone mat or parchment. 3. Transfer soaked flax seeds to prepared baking sheet. Spread out into a thin, flat rectangle, about 1/8 inch thick, using a spatula. Score the rectangle into about 32 small, rectangles. 4. Bake in preheated oven until flax seeds have darkened and contracted slightly, about 3 hours. Cool in oven with door ajar. Break into individual crackers.",
  "prep": "20 mins",
  "cook": "3 hrs",
  "total": "11 hrs 20 mins",
  "calories": "104"
},
{
  "url": "https://www.allrecipes.com/recipe/245557/healthy-aussie-bites/",
  "name": "Healthy Aussie Bites™",
  "rating": "4.3",
  "ratingcount": "19",
  "ingredients": "2 cups whole wheat flour; 2 cups rolled oats; 1 cup chopped dried mixed fruit; ⅔ cup brown sugar; ½ cup unsweetened shredded coconut; ½ cup sunflower seeds; ⅓ cup flaxseed meal; ¼ cup chia seeds; 1 teaspoon vanilla extract; ½ teaspoon salt; 1 cup unsalted butter; ¼ cup honey; 1 teaspoon baking soda; 2 tablespoons hot water",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Mix whole wheat flour, oats, dried fruit, brown sugar, coconut, sunflower seeds, flaxseed meal, chia seeds, vanilla extract, and salt together in a large bowl. 3. Melt butter and honey together in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each interval, 1 to 2 minutes. 4. Dissolve baking soda in hot water in a small bowl; add to the butter mixture and mix well. 5. Pour butter mixture over flour mixture; mix well to combine. Spoon tablespoons of mixture into ungreased mini muffin pans and flatten tops slightly. 6. Bake in the preheated oven until golden, about 10 minutes. Transfer to wire racks to cool.",
  "prep": "20 mins",
  "cook": "11 mins",
  "total": "31 mins",
  "calories": "171"
},
{
  "url": "https://www.allrecipes.com/recipe/264197/oatmeal-chocolate-chip-lactation-cookies/",
  "name": "Oatmeal Chocolate Chip Lactation Cookies",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "4 tablespoons water; 2 tablespoons flaxseed meal; 1 cup unsalted butter, softened; 1 cup brown sugar; 1 cup white sugar; 2 large eggs; 1 teaspoon vanilla extract; 3 cups all-purpose flour; 4 tablespoons brewers' yeast; 1 teaspoon baking soda; 1 teaspoon salt; 3 cups oats; 1 cup chocolate chips; 2 tablespoons honey (Optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Stir water and flaxseed meal together in a small bowl. Let stand until thickened, about 5 minutes. 3. Beat butter and both sugars with an electric mixer in a large bowl until creamy. Add eggs, one at a time, beating well after each addition. Add flax mixture and vanilla; mix until well combined. 4. Stir flour, yeast, baking soda, and salt together in a bowl. Mix dry ingredients into the wet ingredients until well combined. Stir in oats, chocolate chips, and honey. Drop spoonfuls of dough 2 inches apart onto ungreased baking sheets. 5. Bake in the preheated oven until edges are golden, 12 to 15 minutes. 6. Remove cookies from the oven and transfer to wire racks to cool.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "159"
},
{
  "url": "https://www.allrecipes.com/recipe/246073/high-fiber-bread/",
  "name": "High Fiber Bread",
  "rating": "4.7",
  "ratingcount": "6",
  "ingredients": "1 ⅔ cups warm water; 4 teaspoons molasses; 1 tablespoon active dry yeast; 2 ⅔ cups whole wheat flour; ¾ cup ground flax seed; ⅔ cup bread flour; ½ cup oat bran; ⅓ cup rolled oats; ⅓ cup amaranth seeds; 1 teaspoon salt",
  "directions": "1. Place water, molasses, yeast, wheat flour, ground flax seed, bread flour, oat bran, rolled oats, amaranth seeds, and salt in the pan of a bread machine in the order recommended by the manufacturer. Select dough cycle; press start and allow machine to run complete dough cycle. 2. Turn dough onto a lightly floured surface. Form dough into 2 loaves and place on a baking stone. Cover loaves with a damp cloth and let rise until doubled in volume, about 1 hour. 3. Preheat the oven to 375 degrees F (190 degrees C). 4. Bake in the preheated oven until top is golden brown, 20 to 25 minutes. Slide loaf onto a work surface and gently tap bottom of loaf. If it sounds hollow, the bread is done.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "2 hrs 30 mins",
  "calories": "101"
},
{
  "url": "https://www.allrecipes.com/recipe/246344/delicious-lentil-loaf/",
  "name": "Delicious Lentil Loaf",
  "rating": "4.6",
  "ratingcount": "43",
  "ingredients": "2 ½ cups water; 1 cup brown lentils; ⅓ cup water; 3 tablespoons ground flax seed; 2 tablespoons olive oil; 1  onion, minced; 1 cup minced fresh mushrooms; 1 cup minced celery; 2 large cloves garlic, minced; ¾ cup quick-cooking oats; ½ cup all-purpose flour; 1 teaspoon dried basil; 1 teaspoon ground black pepper; 1 teaspoon salt; ½ teaspoon onion powder; ¼ cup ketchup; ¼ cup brown sugar; 2 tablespoons mustard; 2 tablespoons smoky barbeque sauce",
  "directions": "1. Combine 2 1/2 cups water and lentils in a saucepan; bring to a boil. Reduce heat, cover saucepan, and simmer until all the liquid is absorbed and lentils are tender, 20 to 30 minutes. 2. Mix 1/3 cup water and ground flax seed together in a bowl; set aside until thickened, at least 10 minutes. 3. Heat olive oil in a large pot over medium heat; cook and stir onion, mushrooms, celery, and garlic until softened and liquid from mushrooms has evaporated, 5 to 10 minutes. 4. Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan. 5. Transfer cooked lentils to a food processor and pulse until about 75 percent of lentils are mashed. Mix onion-mushroom mixture, flax seed-water mixture, oats, flour, basil, black pepper, salt, and onion powder into lentils until well combined. Press lentil mixture into the prepared loaf pan. 6. Combine ketchup, brown sugar, mustard, and barbeque sauce in a saucepan over medium-low heat; cook and stir until glaze is smooth and brown sugar is dissolved, about 5 minutes. Remove saucepan from heat. 7. Bake loaf in the preheated oven for 35 minutes. Spread 1/4 cup glaze over lentil loaf; continue baking until cooked through, 10 to 15 minutes more. Serve lentil loaf with remaining glaze on the side.",
  "prep": "15 mins",
  "cook": "1 hr 25 mins",
  "total": "1 hr 50 mins",
  "calories": "318"
},
{
  "url": "https://www.allrecipes.com/recipe/261025/best-low-carb-keto-meatballs/",
  "name": "Best Low-Carb Keto Meatballs",
  "rating": "4.3",
  "ratingcount": "12",
  "ingredients": "1 ½ pounds ground beef; 1 large egg; 2 tablespoons grated Parmesan cheese; 1 tablespoon flaxseed meal; 1 teaspoon dried oregano; salt and ground black pepper to taste; 1 tablespoon olive oil; 1 (14 ounce) can tomato sauce",
  "directions": "1. Combine ground beef, egg, Parmesan cheese, flaxseed, oregano, salt, and pepper in a large bowl; mix with your hands until well combined. Roll mixture into golf ball-size meatballs. 2. Heat olive oil in a large skillet over medium heat. Add meatballs to the skillet; cook in hot oil until browned, about 5 minutes on each side. Pour tomato sauce over meatballs; bring to a simmer and cook until meatballs are cooked through, 25 to 30 minutes. An instant-read thermometer inserted into the center of a meatball should read at least 160 degrees F (72 degrees F).",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "301"
},
{
  "url": "https://www.allrecipes.com/recipe/21619/banana-date-flaxseed-bread/",
  "name": "Banana Date Flaxseed Bread",
  "rating": "4.6",
  "ratingcount": "112",
  "ingredients": "½ cup flax seed; 3  bananas, mashed; ¼ cup vegetable oil; ½ cup white sugar; 2  eggs; 1 ½ cups all-purpose flour; ½ teaspoon baking powder; ½ teaspoon baking soda; ½ teaspoon salt; ¼ cup flax seed; ½ cup chopped pitted dates",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease an 8x4-inch loaf pan. 2. Grind 1/2 cup flax seed in an electric coffee grinder or food processor; set aside. 3. Beat together banana, oil, sugar, and eggs in a large bowl. Mix together flour, baking powder, baking soda, salt, ground flax seed, and 1/4 cup whole flax seed in a separate bowl. Gradually stir flour mixture into banana mixture. Fold in dates. Spoon batter into the prepared loaf pan. 4. Bake in the preheated oven until a toothpick inserted into the loaf comes out clean, 55 to 60 minutes.",
  "prep": "10 mins",
  "cook": "55 mins",
  "total": "1 hr 5 mins",
  "calories": "263"
},
{
  "url": "https://www.allrecipes.com/recipe/255452/lower-carb-banana-protein-muffins/",
  "name": "Lower-Carb Banana Protein Muffins",
  "rating": "4.2",
  "ratingcount": "10",
  "ingredients": "1 ½ cups rolled oats; 2  ripe bananas, mashed; ½ cup creamy natural peanut butter; 2  eggs; ¼ cup flax seed meal; ¼ cup almond flour; ¼ cup plain non-fat Greek-style yogurt; ¼ cup agave nectar; 2 tablespoons vanilla extract; 1 tablespoon powdered stevia baking blend; 1 tablespoon ground cinnamon; 1 teaspoon maple-flavored extract (Optional); 1 teaspoon baking powder; ½ teaspoon baking soda",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease 15 muffin cups or line with aluminum foil liners. 2. Mix oats, bananas, peanut butter, eggs, flax meal, almond flour, yogurt, agave nectar, vanilla extract, stevia, cinnamon, maple-flavored extract, baking powder, and baking soda in a stand mixer or food processor until batter is smooth. Fill each muffin cup 3/4-full with batter. 3. Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 25 minutes. Cool muffins in the muffin cups for 5 minutes before transferring to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "55 mins",
  "calories": "155"
},
{
  "url": "https://www.allrecipes.com/recipe/245768/superfood-berry-green-smoothie/",
  "name": "Superfood Berry-Green Smoothie",
  "rating": "4.8",
  "ratingcount": "9",
  "ingredients": "1 ¼ cups unsweetened almond milk; 1  clementine (such as Cuties®), peeled; ½ cup frozen raspberries; 1 cup spinach, or more to taste; 1 tablespoon chia seeds; 1 tablespoon flaxseed meal; 1 cup frozen blueberries; 1 scoop vanilla protein powder",
  "directions": "1. Place almond milk, clementine, raspberries, spinach, chia seeds, flaxseed meal, blueberries, and protein powder in a blender, respectively. Blend on high until smooth, about 30 seconds.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "490"
},
{
  "url": "https://www.allrecipes.com/recipe/255798/oatmeal-almond-butter-bites/",
  "name": "Oatmeal Almond Butter Bites",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "2 ½ cups rolled oats; 1 cup almond butter; 1 cup semisweet chocolate chips; ½ cup honey; ¼ cup chia seeds; ¼ cup ground flax seeds; ¼ cup finely shredded unsweetened coconut",
  "directions": "1. Mix oats, almond butter, chocolate chips, honey, chia seeds, ground flax seeds, and coconut together in a stand mixer fitted with the paddle attachment, gradually increasing speed, or by hand in a large bowl, until mixture is well combined and forms a large ball. 2. Shape into 1-inch balls. Place balls onto a parchment-lined baking sheet and freeze until firm, about 30 minutes.",
  "prep": "20 mins",
  "cook": "",
  "total": "50 mins",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/256860/steel-cut-oats-and-quinoa-breakfast/",
  "name": "Steel-Cut Oats and Quinoa Breakfast",
  "rating": "5.0",
  "ratingcount": "13",
  "ingredients": "3 cups water; ½ cup quinoa; ½ cup steel-cut oats; 2 tablespoons almond meal; 2 tablespoons flaxseed meal; 1 tablespoon ground cinnamon",
  "directions": "1. Bring water to a boil in a saucepan; add quinoa and oats. Simmer, stirring frequently, until water is absorbed and quinoa is tender, 15 to 20 minutes. 2. Stir almond meal and flaxseed meal into oat-quinoa mixture; pour into a glass container and top with cinnamon. Let cool for about 15 minutes. Transfer to the refrigerator for storage.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "191"
},
{
  "url": "https://www.allrecipes.com/recipe/236763/almond-you-must-be-nuts-crackers/",
  "name": "Almond 'You Must Be Nuts!' Crackers",
  "rating": "4.8",
  "ratingcount": "84",
  "ingredients": "1 cup almond flour; 2 tablespoons finely chopped walnuts; 1 ½ teaspoons flax seed meal; ½ teaspoon salt; 2 tablespoons water; 1 ½ teaspoons olive oil",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Mix almond flour, walnuts, flax seed meal, and salt together in a bowl until well combined. Add water and olive oil; mix until dough is moist and holds together. 3. Turn dough onto prepared baking sheet. Place a second piece of parchment over dough. Roll dough, using a rolling pin, into a 1/16-inch thick rectangle. Remove top piece of parchment paper and cut sides of dough to make an even rectangle. Add excess dough to corners or 1 end of rectangle and re-roll to uniform thickness. 4. Cut dough into 1-inch squares using a pizza cutter, keeping dough still attached. 5. Bake in the preheated oven until outside edges of dough are browned, about 15 minutes. Cool crackers on the baking sheet; break into squares.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "36"
},
{
  "url": "https://www.allrecipes.com/recipe/255234/fabulous-gluten-free-fried-pork-chops/",
  "name": "Fabulous Gluten-Free Fried Pork Chops",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "½ cup coconut flour; ¼ cup cornstarch; 1 tablespoon granulated garlic; 1 tablespoon ground paprika; 1 tablespoon flaxseed meal; 1 tablespoon dried parsley; 1 ½ teaspoons baking powder; 1 ½ teaspoons white sugar; 1 ½ teaspoons onion powder; salt and ground black pepper to taste; 2 ½ pounds bone-in center-cut pork chops; 2 tablespoons coconut oil, or as needed",
  "directions": "1. Mix coconut flour, cornstarch, granulated garlic, paprika, flaxseed meal, parsley, baking powder, sugar, onion powder, salt, and pepper together in a shallow bowl. 2. Dredge pork chops in the coconut flour mixture until coated on both sides. 3. Heat coconut oil in a large skillet over medium-high heat until melted. Cook pork chops, covered, until browned, about 5 minutes. Flip and continue cooking until browned on the second side, about 3 minutes more.",
  "prep": "10 mins",
  "cook": "8 mins",
  "total": "18 mins",
  "calories": "295"
},
{
  "url": "https://www.allrecipes.com/recipe/256230/hearty-multigrain-seeded-bread/",
  "name": "Hearty Multigrain Seeded Bread",
  "rating": "4.7",
  "ratingcount": "9",
  "ingredients": "1 cup warm water; ¼ cup white sugar; 1 (.25 ounce) package active dry yeast; 2 cups bread flour; 1 cup whole wheat flour; ¼ cup coconut oil; 1 teaspoon salt; 1 tablespoon chia seeds; 1 tablespoon wheat germ; 1 tablespoon flax seeds; 1 tablespoon millet; 2 tablespoons hulled hemp seeds, divided; 2 tablespoons salted roasted sunflower seeds, divided; 2 tablespoons old-fashioned oats, divided",
  "directions": "1. Mix warm water and sugar together in a bowl until sugar is dissolved; stir in yeast. Set aside until a creamy foam starts to form, about 5 minutes. 2. Combine bread flour, whole wheat flour, coconut oil, and salt in a food processor; pulse 4 times. Add chia seeds, wheat germ, flax seeds, millet, 1 tablespoon hemp seeds, 1 tablespoon sunflower seeds, and 1 tablespoon oats; pulse until incorporated. 3. Pour yeast mixture over flour mixture in the food processor; process until a dough ball forms, about 1 minute. 4. Turn dough into a well-oiled large bowl and cover with a damp towel; allow to rise in a warm area until doubled in size, about 1 hour. 5. Punch dough down and knead a few times. Form dough into an oblong shape and place in a greased bread pan. Lightly press the remaining hemp seeds, sunflower seeds, and oats onto the loaf. Cover with a damp towel and let rise in a warm area for 30 minutes. 6. Preheat oven to 350 degrees F (175 degrees C). 7. Bake in the preheated oven until cooked through and crust is lightly browned, about 30 minutes. Cool bread in the pan for 5 minutes before transferring to a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "2 hrs 30 mins",
  "calories": "124"
},
{
  "url": "https://www.allrecipes.com/recipe/254802/easy-flourless-banana-flax-pancakes/",
  "name": "Easy Flourless Banana Flax Pancakes",
  "rating": "4.7",
  "ratingcount": "6",
  "ingredients": "1  ripe banana, mashed; 2 tablespoons ground flax seeds, or more to taste; 4  eggs; 1 teaspoon baking powder; ½ teaspoon ground cinnamon; 1 tablespoon butter",
  "directions": "1. Mix banana and ground flax seeds together in a bowl. Add eggs, baking powder, and cinnamon; beat together until combined. 2. Melt butter in a skillet over medium heat. Drop small spoonfuls of batter into the skillet. Cook until bubbles form and edges look dry, 4 to 5 minutes per side.",
  "prep": "10 mins",
  "cook": "8 mins",
  "total": "18 mins",
  "calories": "143"
}]