[{
  "url": "https://www.allrecipes.com/recipe/85501/goat-shoulder-braised-with-prunes-and-preserved-lemons/",
  "name": "Goat Shoulder Braised with Prunes and Preserved Lemons",
  "rating": "4.3",
  "ratingcount": "4",
  "ingredients": "3 pounds goat shoulder; salt and freshly ground black pepper to taste; 2 tablespoons olive oil; 1 medium yellow onion, chopped; 10  pitted prunes, chopped; ¼ cup chopped Moroccan preserved lemon; ½ cup dry red wine; 1 ½ cups chicken broth",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Heat the oil in a Dutch oven over medium-high heat. Season the goat shoulder with salt and pepper, and place into the pan. Brown quickly on all sides. Add the onions to the pan, and cook, stirring constantly until browned. Mix in the prunes and preserved lemon; cook and stir for a few minutes to blend the flavors. Pour in the red wine and chicken broth, and bring to a simmer. 3. Cover the Dutch oven, and bake for 2 hours, or until meat is so tender that it falls off of the bone.",
  "prep": "10 mins",
  "cook": "2 hrs 20 mins",
  "total": "2 hrs 30 mins",
  "calories": "306"
},
{
  "url": "https://www.allrecipes.com/recipe/237347/shyams-goat-biryani/",
  "name": "Shyam's Goat Biryani",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "1 ½ pounds goat meat; 1 ¼ cups plain Greek yogurt, stirred; 6  pitted prunes, or more to taste; 3 ½ tablespoons diced fresh ginger; 1 ¼ tablespoons garlic paste; 1 ½ teaspoons salt, or to taste; 1 ½ teaspoons ground cumin; 1 ½ teaspoons ground black pepper; 1 teaspoon turmeric powder; ½ teaspoon ground red chile pepper; ¼ teaspoon ground cinnamon; ¼ teaspoon ground cloves; 1 ¼ pounds basmati rice; 1 ½ cups unsalted butter; 6  onions, thinly sliced; 4  ripe tomatoes, cut into 1/4-inch cubes; 4  potatoes, peeled and quartered; 1 ½ cups cold water, or more as needed; 12 cups water; 3 tablespoons salt; 1 tablespoon butter; 4  bay leaves, or more to taste",
  "directions": "1. Mix goat meat, yogurt, prunes, ginger, garlic paste, 1 1/2 teaspoons salt, cumin, black pepper, turmeric, red chile pepper, cinnamon, and cloves together in a bowl. Cover bowl with plastic wrap and marinate in the refrigerator, 8 to 14 hours. 2. Rinse the rice under lukewarm water 2 times. Place rice in a pot and cover with enough cold water to reach 1 1/4 to 1 1/2 inches above rice; soak for 1 hour. 3. Melt unsalted butter in a large skillet over low heat; cook and stir onions until translucent and golden, about 10 minutes. Add tomatoes; cook and stir until oil separates and rises to the surface, 5 to 10 minutes. 4. Mix marinated goat meat mixture and potatoes into onion mixture; cook and stir until meat is browned and cooked through, 20 to 30 minutes. Pour 1 1/2 cups cold water (or enough to cover) over goat meat mixture and cook until meat is tender, 30 to 40 minutes. Increase heat to medium and cook, stirring frequently, until oil separates from the mixture, about 5 minutes. Decrease heat to low and keep warm. 5. Preheat oven to 275 degrees F (135 degrees C). 6. Bring 12 cups water, 3 tablespoons salt, and 1 tablespoon butter to a boil in a large pot for 3 to 4 minutes. Drain rice and add to boiling water; cook for 10 minutes. Remove from heat and carefully drain water. 7. Spoon 1/2 the rice into the bottom of a large baking dish; top with 1/2 the goat meat mixture. Arrange 1/2 the bay leaves over goat meat mixture. Repeat layering with remaining rice, goat meat mixture, and bay leaves. Cover dish with aluminum foil. 8. Bake in the preheated oven until rice is fully cooked, 30 to 40 minutes.",
  "prep": "15 mins",
  "cook": "1 hr 55 mins",
  "total": "11 hrs 10 mins",
  "calories": "584"
},
{
  "url": "https://www.allrecipes.com/recipe/246087/jamaican-curried-goat/",
  "name": "Jamaican Curried Goat",
  "rating": "4.6",
  "ratingcount": "7",
  "ingredients": "2 pounds goat stew meat, cut into 1-inch cubes; 2  fresh hot chile peppers, seeded and chopped; 2 tablespoons curry powder; 2 cloves garlic, minced; 1 teaspoon salt; 1 teaspoon ground black pepper; 3 tablespoons vegetable oil; 1  onion, chopped; 1 rib celery, chopped; 2 ½ cups vegetable broth; 1  bay leaf; 3  potatoes, peeled and cut into 1-inch chunks, or more as desired",
  "directions": "1. Combine goat meat, chile pepper, curry powder, garlic, salt, and black pepper in a bowl. Cover and refrigerate to allow flavors to blend, 1 hour to overnight. 2. Remove goat meat mixture from bowl and pat dry, reserving marinade. Heat vegetable oil in a stockpot over medium-high heat. Cook meat in batches, browning on all sides, 5 to 6 minutes per batch. Transfer meat to a plate. Add onion and celery to the stockpot; cook and stir until onion begins to brown, 4 to 6 minutes. 3. Stir browned goat meat into onion mixture. Add reserved marinade, vegetable broth, and bay leaf. Bring to a boil, cover, reduce heat to low, and simmer for 1 hour. Stir in potatoes; simmer until potatoes and meat are tender, 35 to 45 minutes more. 4. Remove stockpot from heat, skim off surface fat, and remove bay leaf.",
  "prep": "15 mins",
  "cook": "1 hr 44 mins",
  "total": "2 hrs 59 mins",
  "calories": "238"
},
{
  "url": "https://www.allrecipes.com/recipe/257535/birria-de-chivo-estilo-jalisco-mexican-braised-goat/",
  "name": "Birria de Chivo Estilo Jalisco (Mexican Braised Goat)",
  "rating": "4.7",
  "ratingcount": "6",
  "ingredients": "3  ancho chile peppers; 1 cup white vinegar; 15  whole black peppercorns; 1 (1 inch) piece fresh ginger root; 2  garlic cloves, peeled; 3  whole cloves; 1 pinch dried marjoram; 1 pinch ground cumin; 1 pinch dried thyme; 4 ½ pounds goat leg; 2 pounds plum tomatoes; 2 cups water; 3  whole black peppercorns; 2  garlic cloves, peeled; 2  whole cloves; 1 pinch dried marjoram; 1 pinch dried thyme; 1 pinch ground cumin; salt to taste; 30  chiles de arbol; ¼ cup white vinegar; 10  whole black peppercorns; 1  clove garlic, peeled; 2  white onions, minced",
  "directions": "1. Bring a pot of water to a boil; add ancho chile peppers and cook for 5 minutes. Remove from heat and let chiles soak in the hot water until soft, about 10 minutes; drain. 2. Blend softened chiles, 1 cup vinegar, 15 peppercorns, ginger, 2 garlic cloves, 3 cloves, 1 pinch marjoram, 1 pinch cumin, and 1 pinch thyme in a blender until marinade is smooth. Strain marinade into a bowl. 3. Place goat in a bowl and pour in marinade, coating goat completely. Cover and refrigerate for 8 hours. 4. Preheat oven to 350 degrees F (175 degrees C). Transfer goat and marinade to a baking dish; cover with a lid or aluminum foil. 5. Bake in the preheated oven until goat is very tender, about 3 1/2 hours. Remove lid or foil and cook until goat is browned, about 15 minutes. Pour meat juices into a container and reserve. Cover the goat to keep warm. 6. Bring a large pot of water to a boil; add tomatoes and boil until soft, 5 to 10 minutes. Drain and let tomatoes cool until easily handled. 7. Peel tomatoes and place in blender with reserved goat juices, 2 cups water, 3 peppercorns, 2 garlic cloves, 2 cloves, 1 pinch marjoram, 1 pinch thyme, and 1 pinch cumin. Blend until meat sauce is smooth. 8. Pour meat sauce into a small saucepan and season with salt; bring to a boil. Reduce heat and simmer over low heat. 9. Bring a pot of water to a boil; add chiles de arbol and boil until soft, about 5 minutes. Drain. 10. Blend softened chiles with 1/4 cup vinegar, 10 peppercorns, 1 garlic clove, and salt until hot sauce is smooth. Strain into a glass. 11. Cut goat into bite-sized pieces and serve with a generous amount of meat sauce and hot sauce on the side. Sprinkle onion over goat.",
  "prep": "35 mins",
  "cook": "4 hrs 20 mins",
  "total": "13 hrs 5 mins",
  "calories": "341"
},
{
  "url": "https://www.allrecipes.com/recipe/254958/pressure-cooker-goat-curry/",
  "name": "Pressure Cooker Goat Curry",
  "rating": "4.7",
  "ratingcount": "7",
  "ingredients": "¼ cup vegetable oil, divided; 2 large onions, thinly sliced; 2 large tomatoes, peeled and diced; 2 tablespoons garlic paste; 1 tablespoon ginger paste; 2 ½ pounds goat meat, cubed; 1 cup water; 1  potato, cubed; 1 large carrot, sliced; 2 teaspoons garam masala; 2 teaspoons ground coriander; 1 teaspoon ground cumin; ½ teaspoon ground turmeric; 2 teaspoons salt, or to taste; ½ teaspoon ground red chile pepper",
  "directions": "1. Heat 2 tablespoons oil in an electric pressure cooker on the \"Sear\" setting. Add onions; cook and stir until golden brown, 10 to 15 minutes. 2. Transfer onions to a food processor; grind into a paste. Remove to a bowl. 3. Combine tomatoes, garlic paste, and ginger paste in the food processor; process until smooth. 4. Heat remaining 2 tablespoons oil in the pressure cooker using the \"Sear\" setting. Add onion paste; cook, stirring constantly, until browned, about 2 minutes. Stir in the tomato mixture. Add goat meat, water, potato, carrot, garam masala, coriander, cumin, turmeric, salt, and red chile pepper. 5. Close pressure cooker and seal according to manufacturer's instructions. Set the timer for 50 minutes at high pressure. Release pressure using the natural-release method according to manufacturer's instructions.",
  "prep": "30 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 35 mins",
  "calories": "255"
},
{
  "url": "https://www.allrecipes.com/recipe/260794/mutton-varuval-malaysian-indian-style-goat-curry/",
  "name": "Mutton Varuval (Malaysian Indian-Style Goat Curry)",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "2 pounds goat stew meat, cut into chunks; 2 teaspoons salt, divided; 1 teaspoon ground turmeric, divided; ½ teaspoon ground black pepper; 2 small red onions, quartered; 1 ½ tablespoons coconut oil; 1  cinnamon stick, broken into pieces; 2  whole star anise pods; 4  cardamom pods; 1 tablespoon fennel seeds; ½ teaspoon whole cloves; 2 tablespoons curry leaves, divided; 1 tablespoon ginger-garlic paste; 1 small tomato, diced; 1 teaspoon coconut oil; 1 ½ teaspoons garam masala; 1 ½ teaspoons curry powder; 1 ½ teaspoons ground paprika; ½ cup chopped fresh cilantro",
  "directions": "1. Season goat meat with 1 teaspoon salt, 1/2 teaspoon turmeric, and black pepper. 2. Place red onions in a blender; grind into a smooth paste. 3. Heat 1 1/2 tablespoons coconut oil in a Dutch oven over medium heat. Add cinnamon stick, star anise, and cardamom pods; cook until aromatic, about 30 seconds. Add fennel and cloves; cook and stir for 30 seconds. Add remaining 1 teaspoon salt and 1 tablespoon curry leaves; stir in the onion paste. Increase heat to medium-high. Cook and stir curry mixture for 5 minutes; add ginger-garlic paste and continue cooking until flavors meld, about 10 minutes. 4. Stir diced tomato into the curry mixture. Cook and stir until mushy, about 4 minutes. Add the seasoned goat meat; cook until browned, 6 to 10 minutes. Transfer goat curry to a slow cooker; cook on High until meat is tender, 2 to 3 hours. 5. Heat 1 teaspoon coconut oil in a saucepan over medium heat. Cook and stir the remaining 1/2 teaspoon turmeric, garam masala, curry powder, and paprika until aromatic, about 1 minute. Add a few cups of the curry from the slow cooker; heat until oil rises to the top. Add remaining 1 tablespoon curry leaves and cilantro; cook until gravy thickens, 3 to 5 minutes. Pour back into the slow cooker and blend well.",
  "prep": "30 mins",
  "cook": "2 hrs 30 mins",
  "total": "3 hrs",
  "calories": "206"
},
{
  "url": "https://www.allrecipes.com/recipe/282988/birria-quesa-tacos/",
  "name": "Birria Quesa Tacos",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "2 teaspoons sesame seeds; 2 teaspoons ground cumin; 1 teaspoon whole black peppercorns; 1 teaspoon coriander seeds; ½ (1 inch) piece cinnamon stick; 2 whole cloves; 3 bay leaves; 2 cups beef broth; 2 tablespoons vegetable oil, divided; 4  guajillo chile peppers; 2 small ancho chile pepper; 1  chile de arbol chile peppers; 1 large white onion; 7 cloves garlic, minced; 2 pounds goat stew meat, cut into 1-inch cubes; ¼ cup distilled white vinegar; 2 teaspoons salt; 2 teaspoons dried Mexican oregano; ¼ teaspoon ground thyme; 1 (14 ounce) can diced tomatoes; 16 (6 inch) flour tortillas; 1 cup grated Cheddar cheese; 1  lime, cut into wedges; 1 tablespoon chopped fresh cilantro, or to taste",
  "directions": "1. Heat sesame seeds, cumin, peppercorns, coriander seeds, cinnamon stick, cloves, and bay leaves in a dry pan over medium heat until fragrant and the sesame seeds begin to brown. Remove from the pan and set aside. 2. Heat beef broth in a medium-sized pot and turn to a low simmer. 3. Heat 1 tablespoon vegetable oil in a large pot over medium heat. Add guajillo, ancho, and chile de arbol peppers, turning occasionally. Remove the peppers once they have started to blister a bit, 5 to 7 minutes. 4. Place the peppers in the pot of simmering broth. Cover and allow to simmer until the peppers are rehydrated and tender, about 20 minutes. 5. Slice 3/4 of the onion into thick slices and finely dice the rest. Put the diced onion aside. Add the thick slices to the pot, along with the garlic, and cook until the onion is browned, about 5 minutes. Remove and set aside. 6. Heat remaining oil in the pot over medium-high heat, and add goat meat. Allow to brown on all sides, 5 to 7 minutes. 7. Add the warmed spices, peppers and broth, onions, garlic, vinegar, salt, Oregano, and thyme into a blender. Allow to cool slightly before blending to prevent scalding yourself, about 5 minutes. Blend until very smooth. 8. Add the blended sauce into the pot, and stir, scraping all the browned bits off the bottom of the pot. Cover and simmer over medium-low heat until the meat is very tender, about 2 1/2 hours. 9. Remove the meat from the sauce and allow to cool enough to shred. Shred the meat with your hands or with 2 forks. Stir in about 1/4 cup of the sauce. Blend the diced tomatoes until very smooth and add to the sauce. 10. Working in batches, dip each tortilla in the pot of sauce and place in a hot pan. Add a bit of the meat mixture and a bit of cheese. Fold in half and brown on both sides, 3 to 4 minutes. Pour the remaining sauce into 4 small bowls. Serve the tacos and sauce with the reserved diced onion, lime wedges, and cilantro. 11. Pour the remaining sauce into 4 small bowls. Serve the tacos and sauce with the reserved diced onion, lime wedges, and cilantro.",
  "prep": "30 mins",
  "cook": "3 hrs 30 mins",
  "total": "4 hrs 10 mins",
  "calories": "453"
},
{
  "url": "https://www.allrecipes.com/recipe/228238/goat-stew/",
  "name": "Goat Stew",
  "rating": "4.7",
  "ratingcount": "53",
  "ingredients": "1 pound bone-in goat meat, cut into large chunks; ¼ cup vinegar; ¼ cup soy sauce; 4 cloves garlic, crushed; 1 tablespoon vegetable oil; 1  onion, chopped; 1  red bell pepper, cut into 1-inch squares; 1 cup tomato sauce; 2 cups beef stock; 1  potato, peeled and cut into large chunks; 2  carrots, peeled and cut into large chunks; ½ cup green peas; ½ teaspoon salt; ¼ teaspoon pepper; 1 pinch cayenne pepper",
  "directions": "1. Mix goat meat with vinegar, soy sauce, and garlic in a large bowl; cover and refrigerate for 1 to 8 hours. For the best flavor, marinate at least 6 hours. Remove meat from marinade and pat dry with paper towels; reserve marinade and garlic separately. 2. Heat oil in a large pot over medium-high heat. Working in batches, cook goat meat in hot oil, stirring occasionally, until browned, 10 to 15 minutes. Transfer goat meat to a plate and set aside. Reserve drippings in the pot. 3. Add onion, bell pepper, and reserved garlic to drippings. Cook and stir over medium heat until onion is translucent, about 5 minutes. Pour in tomato sauce; bring to a simmer. Cook until slightly thickened, about 5 minutes. 4. Return goat meat to sauce. Pour in beef stock and reserved marinade; bring to a boil. Reduce heat to low, cover the pot, and simmer until meat is partially tender, 30 to 40 minutes. 5. Stir in potato, carrots, and peas; season with salt, black pepper, and cayenne pepper. Simmer until goat meat is very tender and potato and carrots are cooked through, 20 to 30 more minutes. Adjust seasonings before serving.",
  "prep": "30 mins",
  "cook": "1 hr 10 mins",
  "total": "2 hrs 40 mins",
  "calories": "272"
},
{
  "url": "https://www.allrecipes.com/recipe/283840/indian-goat-curry/",
  "name": "Indian Goat Curry",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "3 ½ pounds baby goat meat, cut into small cubes; salt to taste; 3 teaspoons ground turmeric, divided; 5 tablespoons vegetable oil; 1 teaspoon white sugar; 3 medium potatoes, halved; 3 pods cardamom; 4 whole cloves; 1 (1 inch) piece cinnamon stick; 3 medium onions, thinly sliced; 2  green chile peppers, minced; 4 cloves garlic, minced; 1 (1 inch) piece minced fresh ginger root; 2 medium tomatoes, sliced; ¾ teaspoon chili powder; 2 ¼ cups water, divided, or as needed; freshly chopped cilantro",
  "directions": "1. Wash goat meat well under cold running water and pat dry. Rub in salt and 1 teaspoon turmeric powder. Set aside for 10 minutes. 2. Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Heat oil and add sugar, allowing it to caramelize. Saute potatoes in the caramelized sugar until golden, about 5 minutes. Remove potatoes and set aside. 3. Stir in cardamom pods, cloves, and cinnamon stick. Add sliced onion, chile peppers, garlic, and ginger. Cook until onions are soft and golden, about 5 minutes. Stir in tomatoes, remaining 2 teaspoons turmeric powder, and chili powder; cook, stirring often, for about 5 minutes. Add goat meat, stirring to blend everything. Add enough water to cover the meat, about 2 cups. 4. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 15 minutes. Allow 10 to 15 minutes for pressure to build. 5. Release pressure using the natural-release method according to manufacturer's instructions, about 15 minutes. Release remaining pressure carefully using the quick-release method, about 5 minutes. Unlock and remove the lid. Taste curry and adjust seasoning with salt and sugar to taste if necessary. 6. Check the goat to make sure it is tender. Add the potatoes and about 1/4 cup more water. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 5 minutes. Allow 10 minutes for pressure to build. 7. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Adjust seasoning once more. Transfer to a serving dish and garnish with fresh cilantro.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 50 mins",
  "calories": "466"
},
{
  "url": "https://www.allrecipes.com/recipe/236899/goat-and-butternut-squash-stew/",
  "name": "Goat and Butternut Squash Stew",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "1 teaspoon ground cumin; 1 teaspoon ground coriander; 1 teaspoon ground ginger; ½ teaspoon sweet paprika; ½ teaspoon smoked sweet paprika; ½ teaspoon smoked hot paprika; ½ teaspoon ancho chile powder; 1 (3 pound) bone-in goat shank; ¼ teaspoon salt, or more to taste; ¼ teaspoon ground black pepper, or to taste; 2 tablespoons coconut oil; 1  onion, chopped; 1 (1 pound) butternut squash, peeled and cut into 1/2-inch cubes; 4 cloves garlic, minced; 1 (14 ounce) can diced tomatoes; 1 ½ cups water; 1  cinnamon stick; 1 pinch saffron",
  "directions": "1. Mix cumin, coriander, ginger, sweet paprika, smoked sweet paprika, smoked hot paprika, and chile powder together in a bowl. 2. Rub goat shank with about 1/4 teaspoon salt and 1/4 teaspoon pepper. 3. Heat coconut oil in a large Dutch oven over medium-high heat until melted and shimmering. Cook goat shank in hot oil until browned as completely as you can get it, 2 to 3 minutes per side. Remove shank to a bowl, reserving oil in the skillet. 4. Reduce heat under the skillet to low. Cook and stir onion in the retained oil until soft, 7 to 10 minutes. Add butternut squash and garlic; cook and stir until the garlic is fragrant, about 1 minute. Sprinkle the cumin mixture over the squash mixture; cook and stir 1 minute more. 5. Stir tomatoes, water, cinnamon stick, and saffron into the squash mixture; return goat shank to the Dutch oven, bring the liquid to a simmer, and cook until the goat meat is tender and falling from the bone, 90 minutes to 2 hours. 6. Remove shank from Dutch oven to a cutting board. Strip meat from the bone and cut into bite-size pieces. Discard bone. Stir meat into the squash mixture, season with salt and pepper, and cook until the meat is reheated, about 5 minutes.",
  "prep": "15 mins",
  "cook": "1 hr 50 mins",
  "total": "2 hrs 5 mins",
  "calories": "473"
}]