[{
  "url": "https://www.allrecipes.com/recipe/218979/traditional-chili-with-ground-turkey/",
  "name": "Traditional Chili with Ground Turkey",
  "rating": "4.8",
  "ratingcount": "137",
  "ingredients": "3 tablespoons olive oil; 1 pound ground turkey; 1 large onion, diced; 1  green bell pepper, chopped; 1 small red bell pepper, chopped; 2  jalapeno peppers, diced (Optional); 4 cloves garlic, minced; 2 tablespoons cumin; 2 tablespoons chili powder; 1 tablespoon white sugar; 1 teaspoon salt; 1 teaspoon ground black pepper; ½ teaspoon ground thyme; 2 cups beef broth; 1 (15 ounce) can pinto beans, rinsed and drained; 1 (15 ounce) can red beans, drained and rinsed; 1 (15 ounce) can diced tomatoes, undrained; 1 (15 ounce) can tomato sauce; 1 (6 ounce) can tomato paste",
  "directions": "1. Heat olive oil in a large skillet over medium-high heat and stir in the ground turkey. Cook and stir until the turkey is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the onion, green and red bell peppers, and jalapeno peppers. Cook and stir until the onion is softened and translucent, about 8 minutes. Add the garlic, cumin, chili powder, sugar, salt, black pepper, and thyme. Continue to cook until fragrant, about 8 more minutes, stirring occasionally. 2. Stir in the beef broth, pinto beans, red beans, diced tomatoes, tomato sauce, and tomato paste. Bring to a boil, then reduce heat to low. Simmer until thickened, about 45 minutes, stirring occasionally. For a thinner chili, cover the pot when simmering.",
  "prep": "25 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 55 mins",
  "calories": "373"
},
{
  "url": "https://www.allrecipes.com/recipe/245585/turkey-and-rice-meatballs-albondigas/",
  "name": "Turkey and Rice Meatballs (Albondigas)",
  "rating": "4.5",
  "ratingcount": "104",
  "ingredients": "1 pound ground turkey thigh meat; 1 cup packed, cooked white long grain rice; 3 cloves crushed garlic; ¼ cup chopped Italian flat leaf parsley; 1  large egg; 2 teaspoons kosher salt; 1 teaspoon smoked paprika; 1 teaspoon ground cumin; ½ teaspoon freshly ground black pepper; ¼ teaspoon dried oregano; ⅛ teaspoon cayenne pepper; 1 tablespoon olive oil; 2 ½ cups prepared tomato sauce; 1 cup chicken broth, plus more as needed; ⅓ cup creme fraiche; 1 tablespoon sherry vinegar; 1 teaspoon paprika; 2 tablespoons chopped Italian flat leaf parsley; salt and pepper to taste",
  "directions": "1. Preheat oven to 450 degrees F. Line a rimmed baking sheet with foil and oil the surface lightly. 2. Mix ground turkey, cooked rice, garlic, parsley, egg, salt, paprika, cumin, pepper, oregano, cayenne, and olive together in a bowl using a fork. Portion mixture with a small scoop (between 1/4 and 1/3 cup) and place on prepared foil-lined baking sheet. Use your (wet) hands to form into round meatballs. Bake in preheated oven until browned, about 15 minutes. 3. Pour chicken broth and prepared tomato sauce in a saucepan. Whisk in creme fraiche, sherry vinegar, and paprika. Transfer meatballs to tomato sauce. Set heat to medium high and bring to a simmer. Reduce heat to low and simmer until tender, 60 to 90 minutes. If sauce gets too thick, add a splash or 2 of broth or water. Remove from heat. Stir in parsley, salt, and pepper.",
  "prep": "25 mins",
  "cook": "2 hrs",
  "total": "2 hrs 25 mins",
  "calories": "258"
},
{
  "url": "https://www.allrecipes.com/recipe/276208/low-sodium-ground-turkey-meatloaf/",
  "name": "Low-Sodium Ground Turkey Meatloaf",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "1 (16 ounce) package ground turkey; ½ cup chopped onion; ¼ cup shredded carrots (Optional); ¼ cup diced green bell pepper (Optional); 5  low-sodium buttery round crackers, crushed (such as Ritz Crackers®); 1 large egg, lightly beaten; 1 tablespoon milk; 1 teaspoon garlic and herb seasoning blend (such as Mrs. Dash®); ¼ teaspoon ground black pepper",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil. 2. Place turkey, onion, carrots, bell pepper, crackers, egg, milk, seasoning blend, and pepper into a mixing bowl. Blend gently using your hands until combined. Mold into a loaf shape and place onto the prepared pan. 3. Bake in the preheated oven until an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C), 40 to 45 minutes.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "218"
},
{
  "url": "https://www.allrecipes.com/recipe/20040/seasoned-turkey-burgers/",
  "name": "Seasoned Turkey Burgers",
  "rating": "4.5",
  "ratingcount": "679",
  "ingredients": "1 ½ pounds ground turkey; 1 large egg, lightly beaten (Optional); 1 (1 ounce) package dry onion soup mix; 1 ½ tablespoons soy sauce; ½ teaspoon ground black pepper; ½ teaspoon garlic powder; 6  hamburger buns, split",
  "directions": "1. Mix turkey, egg, onion soup mix, soy sauce, pepper, and garlic powder in a large bowl until well combined; refrigerate mixture for about 10 minutes, then form into 6 equal-sized patties. 2. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 3. Cook turkey burgers on the preheated grill, turning once, until no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Serve on buns.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "315"
},
{
  "url": "https://www.allrecipes.com/recipe/270849/easy-chili-cornbread-bake/",
  "name": "Easy Chili Cornbread Bake",
  "rating": "4.7",
  "ratingcount": "43",
  "ingredients": "1 pound lean ground turkey; ½ cup chopped celery; ½ cup chopped onion; 1 tablespoon chili powder; ½ teaspoon ground black pepper; ½ teaspoon ground cumin; ½ teaspoon crushed red pepper (Optional); 1 (15 ounce) can tomato sauce; 1 (15 ounce) can chili beans with chili gravy; 1 (15 ounce) can cannellini beans, drained; 2 (8.5 ounce) packages cornbread mix; ⅔ cup milk; 2  eggs; 1 cup shredded Cheddar cheese",
  "directions": "1. Cook turkey, celery, and onion in a skillet over medium heat until turkey is no longer pink, 5 to 7 minutes. Add chili powder, black pepper, cumin, and red pepper. Cook and stir for 2 minutes. Stir in tomato sauce, chili beans, and cannellini beans. Cook until heated through, about 5 minutes. Set aside. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan. 3. Combine cornbread mixes, milk, and egg in a bowl and mix well. Spoon batter into the prepared baking pan. Spoon turkey mixture over batter. 4. Bake in the preheated oven, uncovered, until edges of cornbread are nicely browned and center appears to be set, about 20 minutes. Remove from oven and sprinkle Cheddar cheese on top. Return to the hot oven and bake until cheese is melted, 5 to 10 minutes more.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "528"
},
{
  "url": "https://www.allrecipes.com/recipe/22751/stuffed-shells-iv/",
  "name": "Stuffed Shells IV",
  "rating": "4.6",
  "ratingcount": "392",
  "ingredients": "1 (12 ounce) package jumbo pasta shells; 8 ounces mushrooms, diced; 3 cloves garlic, minced; 1  onion, chopped; 1 pound ground turkey; salt and pepper to taste; 1 (10 ounce) package frozen chopped spinach, thawed and drained; 2 tablespoons chopped fresh parsley; 2 cups cottage cheese; 1 cup freshly grated Parmesan cheese; 1 (32 ounce) jar spaghetti sauce; 1 (8 ounce) package mozzarella cheese, shredded",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Set aside in warm water. 3. In a large heavy skillet saute mushrooms, garlic and onions. Add ground turkey and cook until evenly brown. Season with salt and pepper. Remove from heat, and stir in spinach, parsley, cottage cheese and Parmesan cheese. 4. Stuff the cooked shells with the mixture, and place in a 9x13 inch baking dish. Cover with spaghetti sauce, and sprinkle top with mozzarella cheese. 5. Cover with foil, and bake in preheated oven for 30 to 45 minutes, or until heated through.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "323"
},
{
  "url": "https://www.allrecipes.com/recipe/280834/turkey-beef-meatloaf/",
  "name": "Turkey-Beef Meatloaf",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "cooking spray; ¾ pound ground turkey; ¾ pound lean ground beef; 1 small onion, chopped; 1 cup milk; 1 cup seasoned bread crumbs; 1 large egg; 1 teaspoon dried rosemary; ½ teaspoon salt; ¼ teaspoon ground black pepper; ⅓ cup ketchup; 2 tablespoons brown sugar; 2 tablespoons prepared yellow mustard",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Spray a 9x13-inch loaf pan with cooking spray. 2. Combine ground turkey, ground beef, onion, milk, bread crumbs, egg, rosemary, salt, and pepper in a mixing bowl. Press into the prepared pan. 3. Combine ketchup, brown sugar, and mustard in a separate bowl and whisk together. Pour mixture over meatloaf. 4. Bake in the preheated oven until an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C), about 1 hour. It's best to let rest for at least 5 minutes before serving.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "341"
},
{
  "url": "https://www.allrecipes.com/recipe/230981/asian-turkey-burgers/",
  "name": "Asian Turkey Burgers",
  "rating": "4.5",
  "ratingcount": "80",
  "ingredients": "1 pound lean ground turkey; ½ cup finely chopped onion; ⅓ cup chopped water chestnuts; 2 tablespoons chopped green bell pepper (Optional); 2 cloves garlic, minced; 1 tablespoon dried parsley; 1 tablespoon soy sauce; 1 tablespoon cold water; 2 teaspoons minced fresh ginger root; ½ teaspoon salt; ¼ teaspoon ground black pepper",
  "directions": "1. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 2. Mix ground turkey, onion, water chestnuts, bell pepper, garlic, parsley, soy sauce, water, ginger, salt, and pepper in a bowl; shape into 4 patties. 3. Cook the turkey burgers on the preheated grill until no longer pink in the center and the juices run clear, about 4 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "8 mins",
  "total": "23 mins",
  "calories": "197"
},
{
  "url": "https://www.allrecipes.com/recipe/234627/mild-mannered-chili/",
  "name": "Mild-Mannered Chili",
  "rating": "4.4",
  "ratingcount": "13",
  "ingredients": "cooking spray; 1 pound ground turkey; 1 (28 ounce) can crushed tomatoes; 1 (15 ounce) can black beans, rinsed and drained; 1 (15 ounce) can kidney beans, rinsed and drained; 1 (14.5 ounce) can diced tomatoes; 1 (6 ounce) can tomato paste; 3 tablespoons chili powder; 2 teaspoons ground black pepper; 1 teaspoon salt; ½ teaspoon garlic powder",
  "directions": "1. Lightly coat the inside of a slow cooker with cooking spray. 2. Heat a large skillet over medium-high heat. Cook and stir ground turkey in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Transfer ground turkey to the slow cooker. 3. Stir crushed tomatoes, black beans, kidney beans, diced tomatoes, tomato paste, chili powder, black pepper, salt, and garlic powder into ground turkey. 4. Cook on Low for 3 hours.",
  "prep": "15 mins",
  "cook": "3 hrs 5 mins",
  "total": "3 hrs 20 mins",
  "calories": "198"
},
{
  "url": "https://www.allrecipes.com/recipe/219644/kes-cajun-dirty-rice/",
  "name": "Ke's Cajun (Dirty) Rice",
  "rating": "4.3",
  "ratingcount": "60",
  "ingredients": "1 ½ cups water; ⅔ cup uncooked brown rice; ½ pound ground turkey; ½ cup chopped green bell pepper; ⅓ cup chopped onion; ½ teaspoon minced garlic; ½ teaspoon garlic powder; ½ teaspoon dried celery flakes; 1 teaspoon Cajun seasoning; ¼ teaspoon ground black pepper; ⅓ cup water; 1 pinch salt, or to taste",
  "directions": "1. Bring 1 1/2 cup of water to a boil in a saucepan, and stir in the brown rice. Reduce the heat to a simmer, cover, and simmer until the rice is tender and the liquid has been absorbed, 40 to 50 minutes. Set the rice aside. 2. Place ground turkey into a skillet over medium heat, and cook and stir the turkey until the meat gives up some of its fat, 2 to 3 minutes; stir in green bell pepper, onion, and minced garlic. Cook and stir until the turkey is crumbly and no longer pink and the vegetables are tender, 5 to 8 more minutes. Drain excess grease, if necessary. Stir in the cooked brown rice, garlic powder, celery flakes, Cajun seasoning, black pepper, and 1/3 cup water. 3. Bring the mixture to a simmer, and cook until the liquid is absorbed, about 10 minutes. Season to taste with salt and additional black pepper, if desired.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "141"
},
{
  "url": "https://www.allrecipes.com/recipe/18786/ground-turkey-casserole/",
  "name": "Ground Turkey Casserole",
  "rating": "4.0",
  "ratingcount": "558",
  "ingredients": "1 pound ground turkey; 1 (15 ounce) can tomato sauce; 1 teaspoon white sugar; 1 (8 ounce) container sour cream; 1 (8 ounce) package cream cheese; 1 (12 ounce) package uncooked egg noodles; 2 cups shredded Cheddar cheese",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. In a large skillet over medium-high heat, saute the ground turkey for 5 to 10 minutes, or until browned. Drain the turkey, stir in the tomato sauce and sugar, and set aside. In a medium bowl, combine the sour cream and cream cheese. Mix well and set aside. 3. Cook noodles according to package directions. Place them into a 9x13-inch baking dish, then layer the turkey mixture over the noodles. Then layer the sour cream mixture over the turkey, and top with cheese. 4. Bake at 350 degrees F (175 degrees C) for 20 to 35 minutes, or until cheese is melted and bubbly.",
  "prep": "30 mins",
  "cook": "35 mins",
  "total": "1 hr 5 mins",
  "calories": "516"
},
{
  "url": "https://www.allrecipes.com/recipe/39748/actually-delicious-turkey-burgers/",
  "name": "Best Turkey Burgers",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "3 pounds ground turkey; ¼ cup seasoned bread crumbs; ¼ cup finely diced onion; 2  egg whites, lightly beaten; ¼ cup chopped fresh parsley; 1 clove garlic, peeled and minced; 1 teaspoon salt; ¼ teaspoon ground black pepper",
  "directions": "1. Gather all ingredients. 2. Mix ground turkey, seasoned bread crumbs, onion, egg whites, parsley, garlic, salt, and pepper together in a large bowl. 3. Form into 12 patties. 4. Cook the patties in a medium skillet over medium heat, turning once, to an internal temperature of 180 degrees F (85 degrees C). 5. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "184"
},
{
  "url": "https://www.allrecipes.com/recipe/158968/spinach-and-feta-turkey-burgers/",
  "name": "Spinach and Feta Turkey Burgers",
  "rating": "4.6",
  "ratingcount": "855",
  "ingredients": "cooking spray; 2 pounds ground turkey; 1 (10 ounce) box frozen chopped spinach, thawed and squeezed dry; 4 ounces feta cheese; 2 large eggs, beaten; 2 cloves garlic, minced",
  "directions": "1. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 2. Mix together turkey, spinach, feta, eggs, and garlic in a large bowl until well combined; form into 8 patties. 3. Cook patties on the preheated grill on both sides until no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center of patties should read at least 165 degrees F (74 degrees C).",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "233"
},
{
  "url": "https://www.allrecipes.com/recipe/223050/chef-johns-turkey-sloppy-joes/",
  "name": "Chef John's Turkey Sloppy Joes",
  "rating": "4.7",
  "ratingcount": "542",
  "ingredients": "2 tablespoons butter; 1  onion, diced; salt and ground black pepper to taste; 1 ¼ pounds ground turkey; ½ cup cold water; ¾ cup ketchup; 1 ½ tablespoons brown sugar; ½ teaspoon cayenne pepper, or to taste; ½ teaspoon Worcestershire sauce; ½ teaspoon unsweetened cocoa powder; 1 cup water, or as needed; 6  hamburger buns, split; ½ cup shredded white Cheddar cheese; ⅓ cup chopped green onions",
  "directions": "1. Melt butter in a heavy skillet over medium heat. Cook and stir onion in butter until lightly brown, about 5 minutes. Season with salt and black pepper. 2. Mix turkey and 1/2 cup cold water into onions. Cook and stir, breaking up the meat, until it begins to brown, about 2 minutes. Add ketchup, brown sugar, cayenne pepper, salt, and black pepper. Cook and stir until liquid is reduced, about 5 minutes. 3. Stir in Worcestershire sauce and cocoa powder. Cook, stirring frequently, until meat is cooked through and liquid is reduced and thick, 20 to 30 minutes, adding up to 1 cup water if needed. 4. Preheat the oven's broiler. Set the oven rack about 6 inches from the heat source. 5. Toast hamburger buns under the preheated broiler until golden, 2 to 3 minutes. 6. Remove turkey mixture from the heat; mix in cheese and green onions. Serve on toasted hamburger buns.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "394"
},
{
  "url": "https://www.allrecipes.com/recipe/236091/slow-cooker-3-bean-chili/",
  "name": "Slow Cooker 3-Bean Chili",
  "rating": "4.6",
  "ratingcount": "93",
  "ingredients": "1 (20 ounce) package 93%-lean ground turkey; 1 (28 ounce) can diced fire-roasted tomatoes; 1 (16 ounce) can tomato sauce; 1 (15.5 ounce) can pinto beans, rinsed and drained; 1 (15.5 ounce) can kidney beans, rinsed and drained; 1 (15 ounce) can reduced-sodium black beans, rinsed and drained; 1 small onion, chopped; 1 (4.5 ounce) can chopped green chiles; 2 tablespoons chili powder; 1 tablespoon minced garlic; 1 teaspoon oregano; 1 pinch ground cumin",
  "directions": "1. Gather all ingredients. 2. Cook and stir turkey in a large skillet over medium-high heat until crumbly and browned, 7 to 10 minutes; transfer to a slow cooker. 3. Stir in tomatoes, tomato sauce, pinto beans, kidney beans, black beans, onion, green chilies, chili powder, garlic, oregano, and cumin in the slow cooker. 4. Cover and cook on Low for 7 hours or High for 4 hours.",
  "prep": "10 mins",
  "cook": "4 hrs 10 mins",
  "total": "4 hrs 20 mins",
  "calories": "238"
},
{
  "url": "https://www.allrecipes.com/recipe/77747/moms-turkey-sausage-patties/",
  "name": "Mom's Turkey Sausage Patties",
  "rating": "4.7",
  "ratingcount": "403",
  "ingredients": "2 pounds ground turkey; 1 ½ teaspoons ground black pepper; 1 ½ teaspoons salt; 1 teaspoon dried sage; ¾ teaspoon ground ginger; ¼ teaspoon cayenne pepper; nonstick cooking spray",
  "directions": "1. Mix ground turkey, black pepper, salt, sage, ginger, and cayenne pepper together in a large bowl until well blended. Form mixture into 8 equal-sized patties. 2. Heat a skillet over medium-high heat; coat with nonstick spray. 3. Add patties and fry until browned on both sides and no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "169"
},
{
  "url": "https://www.allrecipes.com/recipe/255545/ground-turkey-taco-meat/",
  "name": "Ground Turkey Taco Meat",
  "rating": "4.7",
  "ratingcount": "204",
  "ingredients": "1 ½ tablespoons chili powder; 2 teaspoons ground cumin; 1 teaspoon ground paprika; 1 teaspoon salt; ½ teaspoon garlic powder; ½ teaspoon onion powder; ½ teaspoon dried oregano; ¼ teaspoon cayenne pepper; 12 ounces ground turkey; ½ cup water; 1 tablespoon cider vinegar; 1 ½ teaspoons brown sugar",
  "directions": "1. Combine chili powder, cumin, paprika, salt, garlic powder, onion powder, oregano, and cayenne in a small bowl. 2. Heat a large nonstick skillet over medium heat. Add ground turkey and cook, stirring to break up clumps, until no longer pink, about 5 minutes. Stir in spice mixture and water. Reduce heat and simmer, stirring occasionally, until most of the liquid is absorbed, about 10 minutes. 3. Stir in cider vinegar and brown sugar; simmer until flavors combine, 3 to 4 minutes. Transfer to a serving bowl.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "201"
},
{
  "url": "https://www.allrecipes.com/recipe/229989/turkey-breakfast-sausage/",
  "name": "Turkey Breakfast Sausage",
  "rating": "4.6",
  "ratingcount": "177",
  "ingredients": "2 pounds ground turkey; 1 tablespoon brown sugar; 2 teaspoons kosher salt; 1 ½ teaspoons ground black pepper; 1 ½ teaspoons ground sage; 1 ½ teaspoons ground thyme; ½ teaspoon dried marjoram; ½ teaspoon red pepper flakes",
  "directions": "1. Mix together turkey, brown sugar, salt, black pepper, sage, thyme, marjoram, and red pepper flakes in a bowl until well combined. Shape turkey mixture into patties. 2. Working in batches, fry patties in a large skillet over medium-high heat until golden brown and no longer pink in the center, 6 to 8 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "176"
},
{
  "url": "https://www.allrecipes.com/recipe/85148/fast-and-friendly-meatballs/",
  "name": "Fast and Friendly Meatballs",
  "rating": "4.4",
  "ratingcount": "1",
  "ingredients": "2 tablespoons olive oil; 1 ¼ pounds 93%-lean ground turkey; ⅓ cup Italian seasoned bread crumbs; 1 large egg, beaten",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with oil, and place it into the oven while preheating. 2. Mix turkey, bread crumbs, and egg together in a bowl with your hands. Use an ice cream scoop to form mixture into golf ball-sized meatballs. 3. Remove the baking dish from the oven. Place meatballs into the hot dish, about 1 inch apart. Press gently on each meatball to flatten the bottom just slightly. 4. Bake in the preheated oven for 15 minutes. Flip meatballs over and continue baking until somewhat crispy on the outside, about 5 more minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "218"
},
{
  "url": "https://www.allrecipes.com/recipe/239951/baked-turkey-meatballs/",
  "name": "Baked Turkey Meatballs",
  "rating": "4.1",
  "ratingcount": "49",
  "ingredients": "1 pound ground turkey; ½ cup Italian bread crumbs; ¼ cup thinly sliced baby spinach; 1 large egg; 2 tablespoons onion powder; 2 tablespoons garlic powder",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Mix turkey, bread crumbs, spinach, egg, onion powder, and garlic powder together in a bowl until well combined. Roll mixture into eight palm-sized meatballs and place 2 inches apart on a baking sheet. 3. Bake in the preheated oven until no longer pink in the center and the outside is browned, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "267"
},
{
  "url": "https://www.allrecipes.com/recipe/231380/best-turkey-meatloaf/",
  "name": "Best Turkey Meatloaf",
  "rating": "4.7",
  "ratingcount": "400",
  "ingredients": "1 ½ pounds ground turkey; ¾ cup crushed buttery round crackers; ½ cup milk; 1 small onion, chopped; 1  egg; 2 cloves garlic, minced; 1 ½ teaspoons salt; ¼ teaspoon ground black pepper; ½ cup ketchup; ¼ cup brown sugar; 1 tablespoon Worcestershire sauce",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a jelly-roll pan. 2. Mix ground turkey, crushed crackers, milk, onion, egg, garlic, salt, and black pepper in a bowl. Shape mixture into a loaf and place on the prepared pan. 3. Mix ketchup, brown sugar, and Worcestershire sauce in a separate bowl; set aside. 4. Bake meatloaf in preheated oven for 30 minutes; remove from the oven and drain off liquids. Top meatloaf with ketchup topping. 5. Return loaf to the oven and continue baking until no longer pink in the center, about 30 minutes more; an instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C).",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "296"
},
{
  "url": "https://www.allrecipes.com/recipe/74053/lazygirls-ground-turkey-stroganoff/",
  "name": "Lazygirl's Ground Turkey Stroganoff",
  "rating": "4.1",
  "ratingcount": "548",
  "ingredients": "1 (8 ounce) package uncooked egg noodles; 1 tablespoon vegetable oil; 1 pound ground turkey; 1 tablespoon minced onion; 1 cube chicken bouillon, crumbled; 1 (10.5 ounce) can condensed cream of mushroom soup; ½ cup water; 1 tablespoon paprika; salt to taste",
  "directions": "1. Fill a large pot with lightly salted water and bring to a rapid boil. Cook egg noodles at a boil until tender yet firm to the bite, 7 to 9 minutes. Drain and keep warm. 2. While the noodles are cooking, heat oil in a large skillet over medium heat. Add turkey and onion; cook and stir until turkey is browned and crumbly, 5 to 7 minutes. Stir in crumbled bouillon. 3. Whisk condensed soup and water together in a small bowl; pour into the skillet and cook, stirring occasionally, until heated through, about 5 minutes. Season with paprika and salt. Serve over warm egg noodles.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "463"
},
{
  "url": "https://www.allrecipes.com/recipe/219874/italian-turkey-meatballs/",
  "name": "Italian Turkey Meatballs",
  "rating": "4.7",
  "ratingcount": "329",
  "ingredients": "2 teaspoons Melt® Organic Buttery Spread, softened; 1 ½ pounds ground lean turkey; ⅔ cup dry Italian bread crumbs; ⅓ cup chopped fresh parsley; ¼ cup shredded Parmesan cheese; ¼ cup tomato sauce; 3 cloves garlic, minced; 3 tablespoons chopped fresh oregano; 2 teaspoons chopped fresh rosemary; 1 teaspoon dry mustard; ½ teaspoon cayenne pepper; ¼ teaspoon salt",
  "directions": "1. Preheat the oven to 400 degrees. Grease a broiler pan with buttery spread. 2. Mix ground turkey, bread crumbs, parsley, Parmesan, tomato sauce, garlic, oregano, rosemary, mustard, cayenne, and salt together in a large bowl until well combined. Form mixture into 30 meatballs; place onto the prepared pan. 3. Bake in the preheated oven until no longer pink inside, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "253"
},
{
  "url": "https://www.allrecipes.com/recipe/222635/ground-turkey-noodle-bake/",
  "name": "Ground Turkey Noodle Bake",
  "rating": "4.4",
  "ratingcount": "341",
  "ingredients": "cooking spray; 1 pound ground turkey; 1 medium onion, chopped; 3 cups wide egg noodles; 1 (15 ounce) can tomato sauce; 1 teaspoon Italian seasoning; ½ cup milk; 4 ounces cream cheese; 1 tablespoon minced fresh parsley; 1 clove garlic, minced; 1 ¼ cups shredded part-skim mozzarella cheese",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Lightly grease an 8-inch square baking dish with cooking spray. 2. Heat a large nonstick skillet over medium-high heat. Add turkey and onion; cook and stir until turkey is browned and crumbly and onion is soft, about 10 minutes. Drain. 3. Bring a large pot of lightly salted water to a boil. Cook egg noodles in boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain and return to the pot. 4. While the water is coming to a boil for the noodles, stir tomato sauce and Italian seasoning into turkey mixture. Bring to a boil over medium heat. Reduce the heat to low, cover, and simmer for 10 minutes. 5. At the same time, combine milk, cream cheese, parsley, and garlic in a small saucepan over medium heat. Cook, stirring occasionally, until cream cheese melts, about 5 minutes. Pour over egg noodles and stir to combine. Transfer to the prepared baking dish. 6. Layer turkey mixture over noodles. Sprinkle mozzarella cheese over top. 7. Bake in the preheated oven until casserole is hot and cheese is melted, 15 to 30 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "510"
},
{
  "url": "https://www.allrecipes.com/recipe/245478/turkey-kofta-kabobs/",
  "name": "Turkey Kofta Kebabs",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "vegetable oil for grill; 1 pound ground turkey; 1 small onion, minced; ¼ cup chopped fresh cilantro; 1 large egg; 2 cloves garlic, minced; ¼ teaspoon chopped green chile pepper; ¼ teaspoon ground coriander; ¼ teaspoon ground paprika; ¼ teaspoon chili powder; salt to taste",
  "directions": "1. Preheat the grill for medium heat and lightly oil the grate. 2. Combine turkey, onion, cilantro, egg, garlic, chile pepper, coriander, paprika, chili powder, and salt in a large bowl; mix thoroughly. Divide mixture into twelve 1/4-cup portions; roll into log-shaped ovals and place on a baking sheet. 3. Grill ovals over indirect heat, turning occasionally, until no longer pink in the center, 25 to 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "65"
},
{
  "url": "https://www.allrecipes.com/recipe/213211/turkey-and-quinoa-meatloaf/",
  "name": "Turkey and Quinoa Meatloaf",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "½ cup water; ¼ cup quinoa; 1 teaspoon olive oil; 1 small onion, chopped; 1 large clove garlic, chopped; 2 tablespoons brown sugar; 2 teaspoons Worcestershire sauce; 1 teaspoon water; 1 (20 ounce) package ground turkey; 1  egg; 2 tablespoons Worcestershire sauce; 1 tablespoon tomato paste; 1 tablespoon hot pepper sauce; 1 ½ teaspoons salt; 1 teaspoon ground black pepper",
  "directions": "1. Bring 1/2 cup water and quinoa to a boil in a saucepan over high heat. Reduce the heat to medium-low, cover, and simmer until quinoa is tender and the water has been absorbed, 15 to 20 minutes. Set aside to cool. 2. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with foil. 3. Heat olive oil in a skillet over medium heat. Add onion; cook and stir until soft and translucent, about 5 minutes. Add garlic and cook for 1 more minute. Remove from the heat and cool slightly. 4. Mix brown sugar, 2 teaspoons Worcestershire sauce, and 1 teaspoon water together in a small bowl until a paste forms. 5. Mix turkey, cooked quinoa, onion mixture, egg, 2 tablespoons Worcestershire sauce, tomato paste, hot sauce, salt, and pepper together in a large bowl until well combined; the mixture will be very moist. Shape into a loaf and place onto the prepared baking sheet. Spread brown sugar paste over the top. 6. Bake in the preheated oven until no longer pink in the center, about 50 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Let cool for 10 minutes before slicing and serving.",
  "prep": "20 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 50 mins",
  "calories": "259"
},
{
  "url": "https://www.allrecipes.com/recipe/239852/homemade-turkey-breakfast-sausage/",
  "name": "Homemade Turkey Breakfast Sausage",
  "rating": "4.8",
  "ratingcount": "122",
  "ingredients": "2 teaspoons dried sage; 2 teaspoons salt; 1 teaspoon ground black pepper; ½ teaspoon red pepper flakes; ¼ teaspoon dried marjoram; 2 pounds ground turkey",
  "directions": "1. Mix sage, salt, black pepper, red pepper flakes, and marjoram together in a small bowl. Place turkey into a large bowl and mix in spice mixture with your hands until well combined. Form into 10 patties. 2. Cook patties in batches in a large skillet over medium-high heat until no longer pink in the center and the juices run clear, about 5 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "135"
},
{
  "url": "https://www.allrecipes.com/recipe/257007/turkey-meatloaf-muffins/",
  "name": "Turkey Meatloaf Muffins",
  "rating": "4.9",
  "ratingcount": "40",
  "ingredients": "cooking spray; 2 pounds ground turkey; 1 (8 ounce) package Cheddar cheese, cubed (Optional); 1  onion, diced; 1 cup seasoned bread crumbs; ¾ cup milk; 2  eggs; 2 tablespoons Worcestershire sauce; 2 cloves garlic, diced; 1 teaspoon salt; 1 teaspoon ground black pepper",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Grease a muffin tin with cooking spray. 2. Combine ground turkey, Cheddar cheese, onion, bread crumbs, milk, eggs, Worcestershire sauce, garlic, salt, and pepper in a large bowl; mix well with your hands. 3. Drop scoops of the turkey mixture into the muffin tin using a large ice cream scoop. 4. Bake in the preheated oven until golden brown, about 45 minutes.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "255"
},
{
  "url": "https://www.allrecipes.com/recipe/229081/sweet-potato-chili/",
  "name": "Sweet Potato Chili",
  "rating": "4.7",
  "ratingcount": "311",
  "ingredients": "2  sweet potatoes, diced; 2 (14.5 ounce) cans diced stewed tomatoes with chili seasonings; 1 (8 ounce) can tomato sauce; ¾ cup diced sweet onion; ½ cup chopped celery; ½ cup water; 1 tablespoon chili powder; 1 teaspoon ground cumin; ½ teaspoon ground cinnamon; 1 pinch salt; 1 pinch ground black pepper; 1 pinch cayenne pepper; 1 pinch garlic powder; 1 pinch onion powder; ½ pound ground turkey; ½ pound ground beef; 1 (12 ounce) can black beans, drained and rinsed; 1 cup corn",
  "directions": "1. Place sweet potatoes, stewed tomatoes, tomato sauce, onion, celery, water, chili powder, cumin, cinnamon, salt, black pepper, cayenne pepper, garlic powder, and onion powder in a slow cooker. Cook on high, stirring occasionally, for 5 hours. 2. Heat a large skillet over medium-high heat and stir in ground turkey and ground beef. Cook and stir until meat is crumbly, evenly browned, and no longer pink, 10 to 15 minutes. Drain and discard any excess grease. Add cooked ground turkey, cooked ground beef, black beans, and corn to sweet potato mixture in the slow cooker; cook until flavors have blended, 1 to 2 more hours. Serve warm.",
  "prep": "30 mins",
  "cook": "6 hrs",
  "total": "6 hrs 30 mins",
  "calories": "250"
},
{
  "url": "https://www.allrecipes.com/recipe/131107/butternut-squash-and-turkey-chili/",
  "name": "Butternut Squash and Turkey Chili",
  "rating": "4.7",
  "ratingcount": "490",
  "ingredients": "2 tablespoons olive oil; 1  onion, chopped; 2 cloves garlic, minced; 1 pound ground turkey breast; 1 pound butternut squash - peeled, seeded and cut into 1-inch dice; ½ cup chicken broth; 1 (4.5 ounce) can chopped green chilies; 2 (14.5 ounce) cans petite diced tomatoes; 1 (15 ounce) can kidney beans with liquid; 1 (15.5 ounce) can white hominy, drained; 1 (8 ounce) can tomato sauce; 1 tablespoon chili powder; 1 tablespoon ground cumin; 1 teaspoon garlic salt",
  "directions": "1. Heat the olive oil in a large pot over medium heat. Stir in the onion and garlic; cook and stir for 3 minutes, then add the turkey, and stir until crumbly and no longer pink. 2. Add the butternut squash, chicken broth, green chilies, tomatoes, kidney beans, hominy, and tomato sauce; season with chili powder, cumin, and garlic salt. Bring to a simmer, then reduce heat to medium-low, cover, and simmer until the squash is tender, about 20 minutes.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "165"
},
{
  "url": "https://www.allrecipes.com/recipe/236982/amazing-ground-turkey-tomato-sauce/",
  "name": "Amazing Ground Turkey Tomato Sauce",
  "rating": "4.6",
  "ratingcount": "30",
  "ingredients": "¼ cup olive oil; ½  white onion, chopped; 1  tomato, chopped; 6  basil leaves, chopped; 4 cloves garlic, minced; 1 (20 ounce) package ground turkey; 1 teaspoon Italian seasoning; ¼ teaspoon oregano; 2 (15 ounce) cans tomato sauce; ½ (6 ounce) can tomato paste, or to taste; salt and ground black pepper to taste",
  "directions": "1. Heat olive oil in a large pot over medium-high heat. Add onion, tomato, basil, and garlic; sauté until onion begins to soften, about 5 minutes. 2. Break ground turkey into small pieces and add to the pot; season with Italian seasoning and oregano. Cook and stir until turkey is completely browned, 7 to 10 minutes. 3. Stir in tomato sauce and bring to a boil. Reduce the heat to low and simmer until sauce has thickened slightly, 20 to 25 minutes. 4. Stir in tomato paste until mixture is evenly colored; season with salt and pepper. Cook for 1 to 2 more minutes.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "414"
},
{
  "url": "https://www.allrecipes.com/recipe/279354/pan-fried-turkey-burgers/",
  "name": "Pan-Fried Turkey Burgers",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1  shallot; 1 ¼ pounds ground turkey; 2 tablespoons mayonnaise; 2 tablespoons steak sauce (such as A1®); 2 tablespoons dried parsley; ¼ teaspoon garlic salt, divided, or to taste; ground black pepper to taste; cooking spray",
  "directions": "1. Grate shallot with a medium plane of a grater into a large bowl. Be sure to collect the juice. Add turkey, mayonnaise, steak sauce, and parsley. Mix gently with your hands until fully incorporated. Divide into 4 equal portions and gently form into patties. Season tops with garlic salt and pepper. 2. Spray a large skillet with cooking spray and place over medium-high heat. When the pan is hot, place in burgers, seasoned-sides down. Season the opposite sides with more garlic salt and pepper. Cook until browned, 4 to 5 minutes. Flip; continue to cook until no longer pink, 4 to 5 minutes more.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "275"
},
{
  "url": "https://www.allrecipes.com/recipe/273157/instant-pot-turkey-chili/",
  "name": "Instant Pot® Turkey Chili",
  "rating": "4.8",
  "ratingcount": "33",
  "ingredients": "1 tablespoon chili powder; 2 teaspoons smoked paprika; 1 teaspoon salt; 1 teaspoon oregano; 1 teaspoon unsweetened cocoa powder; ½ teaspoon cumin; ¼ teaspoon ground cinnamon; ¼ teaspoon ground coriander; ¼ teaspoon black pepper; 1 tablespoon olive oil; 1 pound ground turkey; 1  onion, chopped; 1  jalapeno pepper, seeded and minced; 2 (14.5 ounce) cans fire-roasted diced tomatoes; 1 (15.5 ounce) can dark red kidney beans, drained and rinsed; 1 (15.5 ounce) can light red kidney beans, drained and rinsed; 1 (15 ounce) can tomato sauce; 1  chipotle pepper in adobo sauce, minced; 2 tablespoons adobo sauce from chipotle peppers; salt to taste",
  "directions": "1. Combine chili powder, smoked paprika, salt, oregano, cocoa powder, cumin, cinnamon, coriander, and black pepper in a small bowl. Set seasoning mix aside. 2. Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Heat olive oil over high heat and brown ground turkey until crumbly, 3 to 4 minutes. Add onion and jalapeno and cook an additional 2 to 3 minutes. Add tomatoes, kidney beans, tomato sauce, chipotle pepper, adobo sauce, and seasoning mix. Mix to combine, scraping up any browned bits off the bottom of the pot. Close and lock the lid. 3. Select high pressure according to manufacturer's instructions; set timer for 20 minutes. Allow 10 to 15 minutes for pressure to build. 4. Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Stir chili and adjust salt, if desired. Serve with your favorite toppings.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "247"
},
{
  "url": "https://www.allrecipes.com/recipe/160241/my-favorite-pork-turkey-meatloaf/",
  "name": "My Favorite Pork Turkey Meatloaf",
  "rating": "4.6",
  "ratingcount": "70",
  "ingredients": "1 pound ground turkey; 1 pound ground pork; 1 tablespoon cooking oil; 1  carrot, minced; ½  red bell pepper, minced; ½  onion, minced; 2 cloves garlic, minced; ⅓ cup thawed frozen chopped spinach; ½ cup bread crumbs; ½ cup wheat germ (Optional); 2  eggs, room temperature; 2 tablespoons ketchup; 2 teaspoons salt; 1 teaspoon ground black pepper; 1 tablespoon honey; 1 tablespoon ketchup",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil. 2. Set the ground turkey and ground pork out at room temperature to warm slightly. 3. Heat the oil in a skillet over medium heat; cook the carrot, bell pepper, onion, garlic, and spinach in the heated oil until soft; set aside to cool. 4. Mix together the turkey, pork, bread crumbs, wheat germ, eggs, 2 tablespoons ketchup, salt, and pepper in a large bowl. Add the vegetable mixture and continue to mix until evenly combined; shape into a loaf; lay on the prepared baking sheet. 5. Whisk together the honey and 1 tablespoon ketchup in a small bowl; spread over the meatloaf. 6. Bake in the preheated oven until no longer pink in the center, 60 to 70 minutes; remove to a serving platter and allow to rest 5 minutes before slicing.",
  "prep": "25 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 40 mins",
  "calories": "310"
},
{
  "url": "https://www.allrecipes.com/recipe/285077/easy-one-pot-ground-turkey-pasta/",
  "name": "Easy One-Pot Ground Turkey Pasta",
  "rating": "4.4",
  "ratingcount": "7",
  "ingredients": "1 pound ground turkey; 1 medium onion, chopped; 3 cloves garlic, minced; 2 tablespoons chopped fresh oregano; 1 teaspoon garlic powder; 1 teaspoon dried basil; 3 cups rotini pasta; 1 (28 ounce) jar spaghetti sauce; 1 (14 ounce) can chicken broth; ¼ cup freshly grated Parmesan cheese, or to taste",
  "directions": "1. Heat a high-sided 12-inch skillet with a lid over medium heat. Add ground turkey, onion, and fresh garlic. Cook, stirring occasionally, until meat is browned, about 8 minutes. Season with oregano, garlic powder, and basil. Mix in rotini pasta and stir until well combined. 2. Pour in pasta sauce and broth, making sure pasta is completely covered. Bring to a boil, reduce heat, cover, and cook until pasta is tender yet firm to the bite, 7 to 10 minutes. 3. Top with Parmesan cheese.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "619"
},
{
  "url": "https://www.allrecipes.com/recipe/216629/the-best-turkey-chili/",
  "name": "The Best Turkey Chili",
  "rating": "4.6",
  "ratingcount": "185",
  "ingredients": "2 pounds ground turkey; 1 (28 ounce) can crushed tomatoes; 1 (15 ounce) can tomato sauce; 1 (15.5 ounce) can kidney beans, rinsed and drained; 1 (15.5 ounce) can pinto beans, rinsed and drained; 1 (15.5 ounce) can black beans, rinsed and drained; ½ cup chopped onion; 1 clove garlic, minced; ¼ cup red wine; 2 tablespoons chili powder; 1 teaspoon ground cumin; 1 teaspoon dried parsley; 1 teaspoon dried oregano; ½ teaspoon black pepper; ¼ teaspoon crushed red pepper flakes (Optional); 2  bay leaves",
  "directions": "1. Cook and stir the ground turkey in a large pot over medium heat until crumbly and no longer pink, about 5 minutes. Stir in the crushed tomatoes, tomato sauce, kidney beans, pinto beans, black beans, onion, garlic, and red wine. Season with chili powder, cumin, parsley, oregano, black pepper, red pepper flakes, and bay leaves. Bring to a simmer over medium-high heat, then reduce heat to medium-low, cover, and simmer 2 hours. Stir the chili occasionally as it simmers. Remove and discard bay leaves before serving.",
  "prep": "15 mins",
  "cook": "2 hrs 15 mins",
  "total": "2 hrs 30 mins",
  "calories": "214"
},
{
  "url": "https://www.allrecipes.com/recipe/218628/three-meat-meatloaf/",
  "name": "Three-Meat Meatloaf",
  "rating": "4.5",
  "ratingcount": "20",
  "ingredients": "1 large onion, chopped; 2  carrots, chopped; 1 cup beef broth; 2  eggs; ½ cup bread crumbs; 2 tablespoons minced fresh basil; ½ teaspoon salt; ½ teaspoon ground black pepper; 1 pound ground turkey; ¾ pound ground beef; ½ pound ground pork sausage; ½ cup condensed tomato soup; 1 tablespoon balsamic vinegar; ½ teaspoon Dijon mustard",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Oil a 9x5-inch loaf pan. 2. Place the onion and carrots into a saucepan, and pour in the beef broth. Bring to a boil over medium heat, and reduce heat to a simmer; cook, stirring often, until the vegetables are tender, about 8 minutes. Set the veggies and broth aside. 3. In a large bowl, beat the eggs, and stir in bread crumbs, basil, salt, and black pepper. Allow the mixture to stand for 5 minutes to moisten the crumbs, and lightly mix in the turkey, beef, and pork sausage. Mix in the cooked onions, carrots, and beef broth. Place the mixture into the prepared loaf pan. In a bowl, mix the tomato soup, balsamic vinegar, and Dijon mustard together, and spread the mixture over the meat loaf. 4. Bake until the loaf is no longer pink in the center and an instant-read meat thermometer reads at least 160 degrees F (70 degrees C), about 1 1/2 hours.",
  "prep": "15 mins",
  "cook": "1 hr 40 mins",
  "total": "2 hrs",
  "calories": "305"
},
{
  "url": "https://www.allrecipes.com/recipe/245985/turkey-swedish-meatballs/",
  "name": "Turkey Swedish Meatballs",
  "rating": "4.1",
  "ratingcount": "24",
  "ingredients": "cooking spray; 1 teaspoon olive oil; ½ cup minced onion; 2 cloves garlic, minced; 1 pound lean ground turkey; ½ cup dry bread crumbs; 1  egg; 1 tablespoon Worcestershire sauce; 1 ½ teaspoons dried parsley; 1 teaspoon ground allspice; ¼ teaspoon ground nutmeg; 1 (14.25 ounce) can low-sodium beef broth; 3 tablespoons all-purpose flour; 1 tablespoon Worcestershire sauce; 1 ½ teaspoons dried parsley; ¼ teaspoon ground black pepper; 1 pinch salt to taste; ¼ cup light sour cream",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish lightly with cooking spray. 2. Heat olive oil in a small skillet over medium heat. Add onion and garlic; cook and stir until softened, about 5 minutes. Let cool briefly, about 5 minutes. 3. Combine onion mixture, turkey, bread crumbs, egg, 1 tablespoon Worcestershire sauce, 1 1/2 teaspoon parsley, allspice, and nutmeg in a large bowl; mix well to combine. Form mixture into 1-inch meatballs. Transfer to baking dish. 4. Bake in the preheated oven until meatballs are cooked through, 25 to 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 5. Pour beef broth into a jar with a tight-fitting lid. Add flour; seal and shake vigorously until flour is dissolved. 6. Pour beef broth mixture into a large skillet over medium-high heat. Add 1 tablespoon Worcestershire sauce, 1 1/2 teaspoon parsley, black pepper, and salt. Bring to a boil, stirring frequently. Reduce heat to medium and simmer, stirring occasionally, until thickened, 2 to 3 minutes. Reduce heat to medium-low; stir in sour cream and meatballs. Cover and simmer, stirring occasionally, until flavors combine, 10 to 15 minutes.",
  "prep": "25 mins",
  "cook": "47 mins",
  "total": "1 hr 17 mins",
  "calories": "327"
},
{
  "url": "https://www.allrecipes.com/recipe/235752/turkey-salisbury-steak/",
  "name": "Turkey Salisbury Steak",
  "rating": "4.4",
  "ratingcount": "62",
  "ingredients": "1 cup water; 3 tablespoons dry onion soup mix; 1 tablespoon Worcestershire sauce; 1 teaspoon minced garlic; ½ teaspoon ground black pepper; 1 ½ pounds ground turkey; 1 cup Italian-seasoned bread crumbs; 1  egg; 1 (10.75 ounce) can  condensed cream of mushroom soup; 1 (10.75 ounce) can  water; 3 tablespoons brown gravy mix",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). 2. Whisk 1 cup water, onion soup mix, Worcestershire sauce, garlic, and black pepper together in a bowl. Strain mixture, reserving solids and broth. Pour 1/2 cup broth and the solids into a large bowl; mix turkey, bread crumbs, and egg into broth-solids mixture until thoroughly combined. Scoop 8 portions using 1/2 cup measure and form each into an oval patty; arrange on a baking sheet. 3. Bake in the preheated oven until no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 4. Whisk remaining broth, mushroom soup, 1 can water, and gravy mix together in a saucepan until smooth; bring to a boil, stirring constantly. Remove from heat. 5. Flip patties and pour gravy over each. Continue to cook until gravy has slightly thickened, about 10 more minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "238"
},
{
  "url": "https://www.allrecipes.com/recipe/35554/turkey-patties/",
  "name": "Turkey Patties",
  "rating": "4.1",
  "ratingcount": "39",
  "ingredients": "1 pound ground turkey; ¼ cup fine dry bread crumbs; 1  egg; 2 tablespoons minced green onions; 2 tablespoons soy sauce; 1 teaspoon minced fresh ginger root; 1 clove garlic, minced; 1 tablespoon vegetable oil; 2 tablespoons chopped fresh parsley",
  "directions": "1. Mix turkey, bread crumbs, egg, green onion, soy sauce, ginger, and garlic in a large bowl until combined. Shape into 4 patties. 2. Heat oil in a wide skillet over medium heat. Add patties and cook until no longer pink in the center and the juices run clear, about 5 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). 3. Garnish with chopped parsley.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "251"
},
{
  "url": "https://www.allrecipes.com/recipe/222404/black-bean-turkey-burgers/",
  "name": "Black Bean Turkey Burgers",
  "rating": "4.7",
  "ratingcount": "136",
  "ingredients": "1 cup black beans, rinsed and slightly crushed; 1 pound ground turkey; ¾ cup grated Parmesan cheese; ½ cup Japanese-style bread crumbs (panko); 1  egg; 1 (1 ounce) package dry onion soup mix",
  "directions": "1. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 2. Mix black beans, ground turkey, Parmesan cheese, bread crumbs, egg, and onion soup mix with your hands in a large bowl. Divide into 6 portions and shape into patties. 3. Cook on preheated grill until no longer pink in the middle, 5 to 6 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "238"
},
{
  "url": "https://www.allrecipes.com/recipe/254340/turkey-spaghetti-zoodles/",
  "name": "Turkey Spaghetti Zoodles",
  "rating": "4.8",
  "ratingcount": "53",
  "ingredients": "1 teaspoon extra-virgin olive oil; 1 ¼ pounds ground turkey breast; 1 cup diced green bell pepper; 1 tablespoon minced garlic; 2 teaspoons Italian seasoning; ½ teaspoon ground black pepper; ¼ teaspoon salt; ¼ teaspoon red pepper flakes; 3 cups marinara sauce; 2 cups baby spinach leaves; 4  zucchini, cut into noodle-shape strands",
  "directions": "1. Heat olive oil in a large skillet over medium heat. Add turkey breast, green pepper, garlic, Italian seasoning, ground black pepper, salt, and red pepper flakes; cook and stir until turkey is lightly browned, 4 to 5 minutes. 2. Stir marinara sauce and baby spinach into the turkey mixture; cook and stir until marinara sauce is warm through, about 3 minutes. 3. Stir zucchini noodles into the sauce with tongs; cook and stir until the zucchini is slightly tender, 2 to 3 minutes.",
  "prep": "15 mins",
  "cook": "9 mins",
  "total": "24 mins",
  "calories": "301"
},
{
  "url": "https://www.allrecipes.com/recipe/237758/slow-cooker-turkey-chili/",
  "name": "Slow Cooker Turkey Chili",
  "rating": "4.5",
  "ratingcount": "152",
  "ingredients": "1 ¼ pounds lean ground turkey; 1 (28 ounce) can crushed tomatoes; 1 (16 ounce) can kidney beans, rinsed and drained; 1 (16 ounce) can pinto beans, rinsed and drained; 1 cup chicken stock; 1 small onion, chopped; 1 tablespoon hot sauce (such as Frank's® Redhot®), or more to taste (Optional); 1 tablespoon chili powder; 2 teaspoons salt; 1 teaspoon minced garlic; ½ teaspoon paprika; ½ teaspoon dried oregano; ½ teaspoon cayenne pepper, or more to taste; ½ teaspoon ground cumin; ½ teaspoon ground black pepper",
  "directions": "1. Mix ground turkey, tomatoes, kidney beans, pinto beans, chicken stock, onion, hot sauce, chili powder, salt, minced garlic, paprika, oregano, cayenne pepper, cumin, and black pepper together in a slow cooker; stir to break the turkey into small chunks. 2. Cook on Low 6 to 8 hours (or High for 4 hours).",
  "prep": "10 mins",
  "cook": "6 hrs",
  "total": "6 hrs 10 mins",
  "calories": "323"
},
{
  "url": "https://www.allrecipes.com/recipe/253157/weeknight-skillet-slaw/",
  "name": "Weeknight Skillet Slaw",
  "rating": "4.5",
  "ratingcount": "155",
  "ingredients": "1 tablespoon chipotle hot sauce (such as Cholula®); 1 tablespoon rice vinegar; 1 tablespoon soy sauce; 1 ½ teaspoons minced ginger; 1 teaspoon agave syrup; 1 tablespoon olive oil; 1 tablespoon sesame oil; 1 pound ground turkey; ½ teaspoon salt; ½ tablespoon ground black pepper; 1 (8 ounce) package coleslaw mix; ½  red bell pepper, diced; 2  green onions, chopped, or more to taste; 2 cloves garlic, minced; 1 tablespoon sesame seeds",
  "directions": "1. Mix chipotle hot sauce, rice vinegar, soy sauce, ginger, and agave syrup together in a small bowl to make sauce. 2. Heat olive oil and sesame oil in a wok or large skillet over medium heat. Add ground turkey; cook, stirring to break up clumps, until juices run clear, about 6 minutes. Season with salt and pepper. Transfer to a bowl, reserving juices in the wok. 3. Combine coleslaw mix, red bell pepper, green onions, and garlic in the wok; cook and stir over medium heat until slaw is slightly wilted, 1 to 2 minutes. Add sauce; mix to combine, about 1 minute. Return turkey to the wok and stir until heated through, 2 to 3 minutes. 4. Sprinkle sesame seeds over slaw before serving.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "302"
},
{
  "url": "https://www.allrecipes.com/recipe/232575/moist-spicy-turkey-burgers/",
  "name": "Moist Spicy Turkey Burgers",
  "rating": "4.7",
  "ratingcount": "31",
  "ingredients": "1 pound ground turkey; ¼ cup dry bread crumbs; 1  onion, finely chopped; 1  green onion, chopped; 1  egg; 2 cloves garlic, minced; 2 tablespoons parsley paste; 1 ½ tablespoons Worcestershire sauce; 1 tablespoon hot pepper sauce (such as Tabasco); ½ teaspoon salt; cooking spray",
  "directions": "1. Mix ground turkey, bread crumbs, onion, green onion, egg, garlic, parsley paste, Worcestershire sauce, hot pepper sauce, and salt together in a bowl. Cover bowl with plastic wrap and refrigerate for at least 1 hour. 2. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a baking dish with cooking spray. 3. Form turkey mixture into four patties; arrange in the prepared baking dish. 4. Bake in the preheated oven until no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "1 hr 45 mins",
  "calories": "260"
},
{
  "url": "https://www.allrecipes.com/recipe/234508/italian-style-turkey-meatloaf/",
  "name": "Italian Style Turkey Meatloaf",
  "rating": "4.6",
  "ratingcount": "222",
  "ingredients": "cooking spray; 1 pound ground turkey; 1  egg; ¼ cup Italian seasoned bread crumbs; 1 teaspoon Italian seasoning; ½ clove garlic, minced; ½ teaspoon ground black pepper, or to taste; ¼ teaspoon salt, or to taste; 2 cups tomato sauce, divided",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Prepare a baking dish with cooking spray. 2. Mix turkey, egg, bread crumbs, Italian seasoning, garlic, black pepper, and salt in a large bowl; shape into a loaf and put into prepared baking dish. 3. Bake in preheated oven for 40 minutes. Spoon about half the tomato sauce over the loaf and continue baking until the meatloaf is no longer pink in the center, 10 to 15 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Rest meatloaf 5 to 10 minutes before slicing to serve. 4. While the meatloaf rests, warm remaining tomato sauce in a small saucepan over medium-low heat; serve with the sliced meatloaf.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "163"
},
{
  "url": "https://www.allrecipes.com/recipe/213655/delicious-spinach-and-turkey-lasagna/",
  "name": "Delicious Spinach and Turkey Lasagna",
  "rating": "4.4",
  "ratingcount": "162",
  "ingredients": "9  whole-wheat lasagna noodles; 1 teaspoon olive oil; ½ cup chopped onion; 1 pound ground turkey breast; 3 cups tomato sauce; ½ cup sliced fresh mushrooms; 3 tablespoons Italian seasoning; ¼ teaspoon ground black pepper; ¼ teaspoon garlic powder; 6 cups chopped fresh spinach; 2 cups fat-free ricotta cheese; ¼ teaspoon ground nutmeg; 2 cups shredded mozzarella cheese",
  "directions": "1. Preheat an oven to 375 degrees F (190 degrees C). 2. Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. 3. Heat the olive oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 2 minutes. Add ground turkey and cook 5 to 7 minutes more, stirring to break up any large chunks of meat. Stir in tomato sauce, mushrooms, Italian seasoning, black pepper, and garlic powder. Simmer for 2 minutes and season to taste. 4. Combine spinach, ricotta, and nutmeg in a large bowl. 5. To assemble, arrange 3 noodles lengthwise in the bottom of a greased 9x13 inch baking dish. Spread with 1/3 the ricotta mixture, 1/3 of the turkey mixture, and 1/3 of the mozzarella. Repeat layers, ending with remaining mozzarella. Bake in preheated oven for 25 minutes. Cool for 5 minutes before serving.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "326"
},
{
  "url": "https://www.allrecipes.com/recipe/139972/pesto-turkey-burgers/",
  "name": "Pesto Turkey Burgers",
  "rating": "4.7",
  "ratingcount": "401",
  "ingredients": "1 ¼ pounds lean ground turkey; 2 tablespoons basil pesto; 1 teaspoon minced garlic; ½ cup crumbled feta cheese; 1 ½ teaspoons seasoned salt; ½ cup bread crumbs; ½ teaspoon seasoned salt",
  "directions": "1. Preheat an outdoor grill for medium-high heat. 2. Mix together ground turkey, pesto, garlic, feta cheese, 1 1/2 teaspoons seasoned salt, and breadcrumbs in a bowl until evenly blended. Form into 4 patties. 3. Grill pesto burgers until no longer pink in the center, about 5 minutes per side. Sprinkle with seasoned salt halfway through cooking.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "354"
},
{
  "url": "https://www.allrecipes.com/recipe/246456/gluten-free-turkey-meatballs/",
  "name": "Gluten-Free Turkey Meatballs",
  "rating": "4.8",
  "ratingcount": "22",
  "ingredients": "¾ pound ground turkey; ½ pound chicken sausage, casings removed; ⅔ cup gluten-free bread crumbs; 3 tablespoons chopped fresh basil; 3 tablespoons milk; 2 teaspoons minced garlic; ¼ cup grated Parmesan cheese; 1 teaspoon kosher salt; ½ teaspoon ground black pepper; 1  egg, lightly beaten",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Combine ground turkey, chicken sausage, bread crumbs, basil, milk, garlic, Parmesan cheese, kosher salt, and black pepper in a bowl; mix gently with a fork. Drop mixture, about 1 1/4-inch diameter per meatball, onto the prepared baking sheet using a spoon. 3. Bake in the preheated oven until cooked through and lightly browned, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "32"
},
{
  "url": "https://www.allrecipes.com/recipe/203392/turkey-picadillo-ii/",
  "name": "Turkey Picadillo II",
  "rating": "4.7",
  "ratingcount": "84",
  "ingredients": "1 tablespoon olive oil; 1 pound ground turkey; 1 ½ teaspoons olive oil; 1 large yellow onion, chopped; 1  green bell pepper, chopped; 4 cloves garlic, minced; 2  bay leaves; ½ cup white wine; 1 (8 ounce) can tomato sauce; ⅓ cup chopped green olives; ⅓ cup raisins; ½ cup canned black beans; 1 tablespoon olive brine; 1 tablespoon capers; 2 teaspoons cayenne pepper, or to taste; 2 teaspoons ground cumin",
  "directions": "1. Heat 1 tablespoon olive oil in a large skillet over medium-high heat and stir in the ground turkey. Cook and stir until the turkey is crumbly, evenly browned, and no longer pink. Remove the turkey and drain and discard any excess grease. 2. Heat 1 1/2 teaspoons olive oil in the skillet over medium heat. Add the onions, bell pepper, garlic, and bay leaves; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the cooked turkey, wine, tomato sauce, olives, raisins, black beans, olive brine, capers, cayenne, and cumin. Simmer about 15 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "246"
},
{
  "url": "https://www.allrecipes.com/recipe/222087/healthier-worlds-best-lasagna/",
  "name": "Healthier World's Best Lasagna",
  "rating": "4.6",
  "ratingcount": "72",
  "ingredients": "1 pound turkey sausage; ¾ pound lean ground turkey; ½ cup minced onion; 2 cloves garlic, crushed; 1 (28 ounce) can crushed tomatoes; 2 (6 ounce) cans tomato paste; 2 (6.5 ounce) cans canned tomato sauce; ½ cup water; 1 ½ teaspoons dried basil leaves; ½ teaspoon fennel seeds; 1 teaspoon Italian seasoning; ¼ teaspoon ground black pepper; 2 tablespoons chopped fresh parsley; 12  lasagna noodles; 16 ounces ricotta cheese; ¾ pound low fat mozzarella cheese, sliced; ¾ cup grated Parmesan cheese",
  "directions": "1. Heat a Dutch oven or large skillet over medium heat; cook and stir turkey sausage, ground turkey, onion, and garlic until well browned, about 15 minutes. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with basil, fennel seeds, Italian seasoning, pepper, and 2 tablespoons parsley. Simmer, uncovered, for about 1 1/2 hours, stirring occasionally. 2. Preheat oven to 375 degrees F (190 degrees C). 3. Bring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain. 4. Spread 1 1/2 cups turkey sauce in bottom of 9x13 baking dish. Arrange 6 noodles lengthwise over sauce. Spread half the ricotta over noodles. Top with a third of the mozzarella cheese slices. Spoon 1 1/2 cups turkey sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. Repeat layers and top with remaining mozzarella and Parmesan cheese. Cover with aluminum foil; make sure foil does not touch cheese to prevent sticking. 5. Bake in preheated oven until sauce is hot and cheese is melted, about 25 minutes more. Remove foil and bake until cheese is golden brown, about 25 minutes. Cool 15 minutes before serving.",
  "prep": "30 mins",
  "cook": "2 hrs 30 mins",
  "total": "3 hrs 15 mins",
  "calories": "390"
},
{
  "url": "https://www.allrecipes.com/recipe/274968/taco-lettuce-wraps/",
  "name": "Taco Lettuce Wraps",
  "rating": "4.7",
  "ratingcount": "27",
  "ingredients": "1 pound ground turkey; 1 (16 ounce) package frozen corn; 1 (15 ounce) can black beans, rinsed and drained; 1 (14.5 ounce) can diced tomatoes; 1 (1 ounce) package taco seasoning mix; 6 romaine leaves, or as needed, rinsed and dried",
  "directions": "1. Heat a large nonstick skillet over medium-high heat. Cook and stir ground turkey in the hot skillet until browned and crumbly, 5 to 7 minutes. Stir in corn, black beans, diced tomatoes, and taco seasoning. Bring to a simmer and cook until heated through, 10 to 12 minutes. 2. Lay lettuce leaves on a flat surface and fill with turkey and bean mixture.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "275"
},
{
  "url": "https://www.allrecipes.com/recipe/276832/low-carb-turkey-stuffed-peppers/",
  "name": "Low Carb Turkey-Stuffed Peppers",
  "rating": "4.9",
  "ratingcount": "14",
  "ingredients": "nonfat cooking spray; 1 tablespoon olive oil; 1 pound ground turkey; ½ cup diced onion; 3 tablespoons diced fresh jalapeno pepper, or to taste; 2 cloves garlic, chopped; 2 cups frozen cauliflower rice (such as Green Giant®); 1 (14.5 ounce) can diced tomatoes, undrained; 1 (8 ounce) can tomato sauce; ½ cup water; 2 teaspoons sambal oelek chili paste; ½ teaspoon salt; ½ teaspoon freshly ground black pepper; 2 large bell peppers, any color - cut in half lengthwise, cored, and seeded; 4 (1 inch) cubes Colby-Jack cheese; aluminum foil; ⅓ cup shredded Colby-Jack cheese; 4 teaspoons reduced-fat sour cream; 8 slices pickled jalapeno peppers (Optional)",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Spray a baking dish with cooking spray. 2. Heat olive oil in a large skillet over medium heat. Stir in ground turkey, onion, jalapeno, and garlic. Cook and stir until turkey browns and vegetables are tender, 8 to 10 minutes. Drain grease from the skillet. Add frozen riced cauliflower, tomatoes, tomato sauce, water, chili paste, salt, and pepper; stir until well incorporated. Reduce heat and simmer for 5 minutes. 3. Place bell pepper halves in the prepared baking dish. Place 1 Colby-Jack cheese cube in each pepper half, and fill with turkey mixture. Spoon remaining turkey mixture into the dish around the peppers. 4. Cover dish with aluminum foil, and bake in the preheated oven for 30 minutes. Remove foil and sprinkle each pepper with shredded Colby-Jack cheese. Bake, uncovered, until peppers are soft and cheese has melted, about 10 minutes more. 5. To serve, spoon a little turkey mixture onto a plate, and place a bell pepper half on top of it. Top each serving with 1 teaspoon sour cream and 2 jalapeno slices.",
  "prep": "15 mins",
  "cook": "55 mins",
  "total": "1 hr 10 mins",
  "calories": "463"
},
{
  "url": "https://www.allrecipes.com/recipe/219082/turkey-cocktail-meatballs-with-orange-cranberry-glaze/",
  "name": "Turkey Cocktail Meatballs with Orange Cranberry Glaze",
  "rating": "4.6",
  "ratingcount": "92",
  "ingredients": "1 ¼ pounds ground turkey; ¼ teaspoon poultry seasoning; ½ teaspoon garlic salt; 1 teaspoon onion powder; 1 teaspoon salt; ½ teaspoon ground black pepper; ¼ teaspoon Worcestershire sauce; 1 pinch cayenne pepper; 1  large egg, beaten; ¼ cup milk; ½ cup plain bread crumbs; 1 tablespoon olive oil; 1 cup canned jellied cranberry sauce; ½ cup orange marmalade; ½ cup chicken broth; 1 tablespoon minced jalapeno pepper; 1 tablespoon minced Fresno pepper; 1 pinch salt and ground black pepper to taste",
  "directions": "1. Mix the turkey, poultry seasoning, garlic salt, onion powder, salt, pepper, Worcestershire sauce, and cayenne pepper together in a bowl. Stir in the egg, milk, and bread crumbs. Cover with plastic and refrigerate for 1 hour. 2. Heat olive oil in skillet over medium heat. Roll the turkey mixture into balls, about one tablespoon each. Place the meatballs in a single layer in the skillet. Brown meatballs on all sides, flipping occasionally. Place browned meatballs on a clean baking sheet. Set aside. 3. Combine cranberry sauce, marmalade, and chicken broth over medium heat in the skillet used to cook the meatballs. Stir in the jalapeno and Fresno peppers, then return meatballs to skillet. Reduce heat to medium-low, and continue to cook until the meatballs are no longer pink in the center and glaze is reduced. Season with salt and pepper.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "265"
},
{
  "url": "https://www.allrecipes.com/recipe/271046/roasted-spaghetti-squash-with-ground-turkey-and-vegetables/",
  "name": "Roasted Spaghetti Squash with Ground Turkey and Vegetables",
  "rating": "4.7",
  "ratingcount": "18",
  "ingredients": "aluminum foil; 1  spaghetti squash, halved and seeded; 2 tablespoons olive oil; 1 teaspoon salt, divided, or more to taste; 1 teaspoon freshly ground black pepper, divided, or more to taste; 1 pound ground turkey; 1 (16 ounce) can diced tomatoes; 8  fresh asparagus, trimmed and cut into 1/2 inch pieces; ½  yellow onion, diced; ¼ cup chopped fresh basil, or to taste; 4  garlic cloves, minced; 1 teaspoon dried oregano; 4 ounces chicken broth",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil. 2. Coat inside of each spaghetti squash half with olive oil and season with salt and pepper. Place spaghetti squash, skin-side up, on the prepared baking sheet. 3. Roast spaghetti squash in the preheated oven until skin can easily be pierced with a fork, 30 to 45 minutes. 4. Meanwhile, cook ground turkey in a skillet over medium heat until browned. Combine tomatoes, asparagus, onion, basil, garlic, oregano, salt, and pepper in a bowl and mix well. Add to browned ground turkey in the skillet. Cook, stirring occasionally, about 5 minutes. Pour in chicken broth and cook until asparagus is slightly tender, about 5 more minutes. 5. Remove cooked spaghetti squash from oven and let cool until easily handled. Scrape squash into spaghetti strands using a fork and place into a bowl. Try to maintain the integrity of the squash skin and you can using as a serving vessel. 6. Place 1/2 the spaghetti squash into a serving dish or the squash skin and top with turkey-vegetable mixture.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "661"
},
{
  "url": "https://www.allrecipes.com/recipe/219755/easy-turkey-taco-soup/",
  "name": "Easy Turkey Taco Soup",
  "rating": "4.6",
  "ratingcount": "70",
  "ingredients": "1 pound ground turkey; ½ cup chopped onion; 1 (12 ounce) package frozen mixed vegetables (peas, carrots, green beans, corn); 2 (10 ounce) cans diced tomatoes with green chile peppers; 1 (15 ounce) can ranch style chili beans; 1 (15 ounce) can chicken broth; 1 (1 ounce) package taco seasoning mix; 1 (1 ounce) package ranch dressing mix",
  "directions": "1. Heat a large pot over medium-high heat and stir in the ground turkey and onion. Cook and stir until the turkey is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Add the mixed vegetables, tomatoes with green chiles, ranch beans, chicken broth, taco seasoning, and ranch dressing mix. Bring to a boil, then reduce heat and simmer on low for 20 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "390"
},
{
  "url": "https://www.allrecipes.com/recipe/276450/baked-spinach-feta-and-turkey-meatballs/",
  "name": "Baked Spinach, Feta, and Turkey Meatballs",
  "rating": "4.6",
  "ratingcount": "12",
  "ingredients": "cooking spray; 1 pound lean ground turkey; 1 (10 ounce) package frozen chopped spinach, thawed and drained; 1 (6 ounce) container crumbled feta cheese; ½ teaspoon paprika; ½ teaspoon onion powder; salt and ground black pepper to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Spray a 24-cup mini muffin tin with cooking spray. 2. Mix together turkey, drained spinach, feta cheese, paprika, onion powder, salt, and pepper in a large bowl until well combined. Roll into 24 meatballs and place in the prepared muffin tin. 3. Bake in the preheated oven until meatballs are cooked through, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "50"
},
{
  "url": "https://www.allrecipes.com/recipe/275901/healthy-shepherds-pie-with-cauliflower-mash/",
  "name": "Healthy Shepherd's Pie with Cauliflower Mash",
  "rating": "4.5",
  "ratingcount": "16",
  "ingredients": "1 tablespoon avocado oil; 5 cups diced celery; 5 cups finely chopped mushrooms; ½ medium onion, diced; 3 pounds lean ground turkey; 1 tablespoon dried parsley; 1 tablespoon dried thyme; 2 teaspoons garlic powder; 1 teaspoon ground black pepper; ½ teaspoon crushed red pepper flakes, or to taste; ½ teaspoon sea salt; ¼ cup almond flour; 1 (8 ounce) can low-sodium tomato sauce; 2 medium zucchini, cut into 1/4-inch slices; 4 (10 ounce) packages frozen cauliflower rice (such as Green Giant®); ⅓ cup milk; 2 tablespoons butter, divided; ½ teaspoon paprika",
  "directions": "1. Heat avocado oil in a very large skillet over medium-high heat. Add celery, mushrooms, and onion; saute until onion is translucent, 5 to 7 minutes. Crumble turkey into the skillet. Add parsley, thyme, garlic powder, pepper, red pepper flakes, and salt. Cook until turkey is no longer pink and has absorbed most of the liquid in the skillet, about 15 minutes. 2. Sprinkle almond flour over the turkey mixture and cook for 1 minute. Stir in tomato sauce until combined; cook until thickened, about 5 minutes. Transfer to a 9x13-inch baking dish and top with sliced zucchini. 3. Preheat the oven to 350 degrees F (175 degrees C). 4. Cook cauliflower rice in a large nonstick skillet over medium heat, stirring occasionally, until hot, about 5 minutes. Set 1 cup aside in a large bowl. Transfer remaining cauliflower rice to a food processor with milk and 1 tablespoon butter; blend until smooth. Mix with reserved rice for added texture. 5. Spread cauliflower mixture over the meat and zucchini. Cut remaining 1 tablespoon butter into small pieces and dot over the cauliflower. Sprinkle with paprika. 6. Bake in the preheated oven until the cauliflower topping has a golden hue, 30 to 35 minutes.",
  "prep": "20 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 25 mins",
  "calories": "266"
},
{
  "url": "https://www.allrecipes.com/recipe/217899/mozzarella-stuffed-pesto-turkey-meatballs/",
  "name": "Mozzarella-Stuffed Pesto Turkey Meatballs",
  "rating": "4.8",
  "ratingcount": "376",
  "ingredients": "3 pounds ground turkey; 1 cup finely chopped onion; 4  garlic cloves, minced; 1  egg; 1 cup Italian-style bread crumbs; ½ cup grated Parmigiano-Reggiano cheese; ½ cup chopped fresh flat-leaf parsley; ¼ cup prepared pesto; ¼ cup milk; 1 tablespoon salt; 2 teaspoons fresh ground black pepper; 1 pound fresh mozzarella, cut into small cubes; 3 tablespoons extra-virgin olive oil; 2 (24 ounce) jars marinara sauce",
  "directions": "1. Preheat an oven to 375 degrees F (190 degrees C). 2. Place the ground turkey, onion, garlic, egg, bread crumbs, Parmigiano-Reggiano cheese, parsley, pesto, milk, salt, and black pepper in a bowl. Mix until evenly blended, then form into 1 3/4-inch meatballs. Make a hole in the meatball with your finger and place a cheese cube in the hole. Seal the meatball around the cheese and place on a nonstick baking sheet. Drizzle the olive oil over the meatballs. 3. Bake in the preheated oven until the meatballs are no longer pink in the center, about 30 minutes. Heat the marinara sauce in a saucepan over low heat. Bring to a simmer, and place the baked meatballs in the marinara sauce for about 2 minutes.",
  "prep": "35 mins",
  "cook": "35 mins",
  "total": "1 hr 10 mins",
  "calories": "486"
},
{
  "url": "https://www.allrecipes.com/recipe/228404/slow-cooker-pumpkin-turkey-chili/",
  "name": "Slow Cooker Pumpkin Turkey Chili",
  "rating": "4.5",
  "ratingcount": "257",
  "ingredients": "1 tablespoon olive oil; 1 pound ground turkey; 1  onion, chopped; 1 (28 ounce) can diced tomatoes; 2 cups cubed fresh pumpkin; 1 (15 ounce) can chili beans; 1 (15 ounce) can seasoned black beans; 3 tablespoons brown sugar; 1 tablespoon pumpkin pie spice; 1 tablespoon chili powder",
  "directions": "1. Heat olive oil in a large soup pot over medium heat; brown turkey, stirring often, until crumbly and no longer, pink, about 10 minutes. Drain and discard any fat. 2. Transfer turkey to a slow cooker and stir in onions, diced tomatoes, pumpkin, chili beans, black beans, brown sugar, pumpkin pie spice, and chili powder. Set cooker to Low, cover, and cook until pumpkin is tender and has started to break apart, at least 3 hours.",
  "prep": "15 mins",
  "cook": "3 hrs 10 mins",
  "total": "3 hrs 25 mins",
  "calories": "338"
}]