[{
  "url": "https://www.allrecipes.com/recipe/111291/frikadeller-danish-meatballs/",
  "name": "Frikadeller (Danish Meatballs)",
  "rating": "4.5",
  "ratingcount": "30",
  "ingredients": "½ pound ground veal; ½ pound ground pork; ¼ cup milk, or as needed; ¼ cup finely grated onion; 1 large egg; ¼ cup bread crumbs, or as needed; ¼ cup all-purpose flour; ¼ cup seltzer water; salt and pepper to taste; ¼ cup margarine",
  "directions": "1. Mix veal and pork together in a bowl until well combined. Stir in milk, onion, and egg. Mix in bread crumbs, then flour; knead well to mix. Mix in seltzer water, salt, and pepper until well combined. The mixture should be very moist, but not dripping. Cover and refrigerate for 15 to 30 minutes. 2. Form about 2 1/2 tablespoons meat mixture into a slightly flattened, oval meatball about the size of a small egg. Repeat to make remaining meatballs. 3. Melt margarine in a large skillet over medium heat. Fry meatballs in the hot skillet until no longer pink in the center and well browned on the outside, about 15 minutes per side. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).",
  "prep": "25 mins",
  "cook": "30 mins",
  "total": "1 hr 10 mins",
  "calories": "417"
},
{
  "url": "https://www.allrecipes.com/recipe/268289/instant-pot-basic-cabbage-rolls/",
  "name": "Instant Pot Basic Cabbage Rolls",
  "rating": "4.6",
  "ratingcount": "34",
  "ingredients": "1 ½ cups water, plus more for soaking; 3 pounds head of savoy cabbage; ½ cup uncooked long grain rice; 2 (28 ounce) cans tomato sauce (such as Hunt's®), divided; ⅓ pound ground beef; ⅓ pound ground pork; ⅓ pound ground veal; ½ cup finely chopped onion; 2 large cloves garlic, finely chopped; 2 teaspoons salt, divided; 1 teaspoon dried parsley; ½ teaspoon ground black pepper",
  "directions": "1. Pour 1 1/2 cups water into a multi-functional pressure cooker (such as Instant Pot). Insert the trivet. Remove tough outer leaves and core from cabbage. Place cabbage, core-side down, on the trivet. 2. Close and lock the lid; set the vent to Sealing. Select Manual function according to manufacturer's instructions; set the timer for 9 minutes. Allow 10 to 15 minutes for pressure to build. 3. While cabbage is cooking, place rice in a small bowl and cover with water; set aside to soak. Measure out 1/3 cup tomato sauce (from 1 can) and pour into a large bowl. Add beef, pork, veal, onion, garlic, 1 teaspoon salt, parsley, and pepper; set aside. 4. Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Transfer cabbage to a plate. Drain water from the pot insert. Add remaining tomato sauce from the open can and 1 teaspoon salt to the pot. Replace the trivet in the pot. 5. Drain rice and add to meat mixture; stir to combine. 6. Separate cooked cabbage leaves carefully and shave off tough veins. Place a cabbage leaf on a work surface; fill with 2 tablespoons meat mixture and roll up, tucking in the sides. Place rolled leaf on the trivet in the pot. Continue with remaining leaves and filling, placing the first layer facing the same way and the second layer facing the opposite way. Pour remaining 1 can tomato sauce over rolls. 7. Close and lock the lid. Select the Stew/Meat function according to manufacturer's instructions; set the timer for 22 minutes. Allow 10 to 15 minutes for pressure to build. 8. Release pressure using the natural-release method according to manufacturer's instructions, about 10 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "1 hr 35 mins",
  "calories": "316"
},
{
  "url": "https://www.allrecipes.com/recipe/232247/tennessee-meatloaf/",
  "name": "Tennessee Meatloaf",
  "rating": "4.6",
  "ratingcount": "158",
  "ingredients": "½ cup ketchup; ¼ cup brown sugar; 2 tablespoons cider vinegar; cooking spray; 1  onion, chopped; ½  green bell pepper, chopped; ⅔ cup quick cooking oats; ½ cup milk; 2 large eggs, lightly beaten; 2 cloves garlic, minced; 2 teaspoons prepared mustard; 2 teaspoons Worcestershire sauce; 1 teaspoon dried thyme; 1 teaspoon seasoned salt; ½ teaspoon ground black pepper; ½ teaspoon hot pepper sauce (such as Tabasco); 1 pound ground beef; ½ pound ground pork; ½ pound ground veal",
  "directions": "1. Make the glaze: Mix ketchup, brown sugar, and cider vinegar together in a bowl until well combined. 2. Make the meatloaf: Preheat the oven to 350 degrees F (175 degrees C). Spray two 9x5-inch loaf pans with cooking spray or line with aluminum foil for easier cleanup. 3. Combine onion and bell pepper in a microwave-safe container. Cover and microwave until softened, 1 to 2 minutes. Set aside to cool. 4. Mix oats, milk, eggs, garlic, mustard, Worcestershire sauce, thyme, seasoned salt, black pepper, and hot sauce together in a large bowl until well combined. Stir in cooked onion and bell pepper. Add ground beef, pork, and veal. With gloved hands, work all ingredients together until completely mixed and uniform. 5. Pat 1/2 of the meatloaf mixture into each prepared loaf pan. Brush each loaf with 1/4 of the glaze; set remaining glaze aside. 6. Bake in the preheated oven for 50 minutes. Remove the pans from the oven and carefully drain the fat. Brush remaining glaze over loaves, then return to the oven and bake for 10 more minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). 7. Remove from the oven and let stand for 15 minutes before slicing.",
  "prep": "35 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 55 mins",
  "calories": "402"
},
{
  "url": "https://www.allrecipes.com/recipe/35989/hot-italian-sausage/",
  "name": "Hot Italian Sausage",
  "rating": "4.4",
  "ratingcount": "116",
  "ingredients": "20 pounds ground pork; ½ cup ground paprika; ¼ cup garlic salt; 2 tablespoons salt; 1 tablespoon ground black pepper; 1 cup vegetable oil; 1 tablespoon anise seed; 1 tablespoon fennel seed; ⅛ cup red pepper flakes",
  "directions": "1. Combine pork, paprika, garlic salt, salt, and black pepper in a large bowl; set aside. 2. Place oil, anise seed, fennel seed, and red pepper flakes into a blender or food processor; blend well. Pour over pork mixture and mix until well combined. 3. Cover and refrigerate until flavors blend, about 24 hours. Freeze sausage in resealable plastic bags in desired portions.",
  "prep": "30 mins",
  "cook": "",
  "total": "1 day 30 mins",
  "calories": "326"
},
{
  "url": "https://www.allrecipes.com/recipe/12343/meat-pie-tourtiere/",
  "name": "Tourtière (French Canadian Meat Pie)",
  "rating": "4.6",
  "ratingcount": "284",
  "ingredients": "1 large baking potato; 1 ½ pounds ground pork; 1 large onion, minced; ½ teaspoon salt; ½ teaspoon ground black pepper; ½ teaspoon ground cinnamon; ¼ teaspoon ground cloves; 1 pinch ground allspice; ½ cup water; 1 (14.1 ounce) package double-crust pie pastry, thawed; 1 large egg, beaten; ¼ teaspoon paprika, or to taste",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). 2. Prick potato several times with a fork and place onto a baking sheet. Bake in the preheated oven until easily pierced with a fork, 50 minutes to 1 hour. Let cool for 10 minutes, then discard skin and mash flesh. Turn the oven off. 3. Place mashed potato into a large skillet with ground pork, onion, water, pepper, cinnamon, cloves, and allpsice. Bring to a boil, then reduce the heat and simmer until very thick, at least 1 hour. 4. Preheat the oven to 350 degrees F (175 degrees C). 5. Line a deep-dish pie plate with one pastry. Spoon in pork and potato filling, then cover with remaining pastry. Brush with beaten egg and sprinkle with paprika. Cut a steam vent in pastry. 6. Bake in the preheated oven for 50 minutes. If the edges brown too fast, cover them with a strip of foil. Serve warm.",
  "prep": "20 mins",
  "cook": "2 hrs 45 mins",
  "total": "3 hrs 15 mins",
  "calories": "485"
},
{
  "url": "https://www.allrecipes.com/recipe/55610/get-a-husband-brunswick-stew/",
  "name": "Brunswick Stew",
  "rating": "4.7",
  "ratingcount": "507",
  "ingredients": "1 tablespoon olive oil; 1 cup chopped onions; 2 stalks celery, chopped; 1 ½ pounds ground pork; 1 ½ pounds ground beef; 1 (3 pound) whole cooked chicken, deboned and shredded; 3 (14.5 ounce) cans whole peeled tomatoes with liquid, chopped; 1 cup ketchup; ½ cup hickory-flavored barbecue sauce; 1 teaspoon hot sauce to taste; salt and pepper to taste; 1 medium green bell pepper; 3 (14.75 ounce) cans cream style corn",
  "directions": "1. Heat oil in a large stockpot over medium heat. Add onions and celery; cook and stir until translucent, about 5 minutes. Mix in pork and beef; cook and stir until evenly browned and crumbly, about 10 minutes. Do not drain. 2. Add shredded chicken, tomatoes and their liquid, ketchup, barbecue sauce, hot sauce, salt, and pepper. Submerge whole green pepper in the mixture. Reduce the heat to low and cook, stirring occasionally, until thickened, about 2 hours. 3. Stir in corn and continue to cook for 1 hour, or to desired consistency. Remove green pepper; chop and return to the stew or discard.",
  "prep": "20 mins",
  "cook": "3 hrs 15 mins",
  "total": "3 hrs 35 mins",
  "calories": "380"
},
{
  "url": "https://www.allrecipes.com/recipe/25531/rye-bread-party-pizzas/",
  "name": "Rye Bread Party Pizzas",
  "rating": "4.5",
  "ratingcount": "52",
  "ingredients": "1 pound ground beef; 1 pound ground pork sausage; 1 pound processed cheese food; 1 teaspoon Worcestershire sauce; 1 tablespoon ketchup; 1 (1 pound) loaf cocktail rye bread, or as needed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a rimmed baking sheet with aluminum foil. 2. Cook beef and sausage in a large, deep skillet over medium-high heat until browned and crumbly, 5 to 7 minutes. 3. Meanwhile, microwave processed cheese food in a large microwave-safe bowl on high until melted, 3 to 4 minutes. 4. Stir Worcestershire sauce and ketchup into melted cheese, then stir in cooked meat until thoroughly combined. 5. Spoon about 2 tablespoons meat and cheese mixture onto each bread slice. Arrange bread in a single layer on the prepared baking sheet. 6. Bake in the preheated oven, in batches if necessary, until lightly browned and crisp, 10 to 15 minutes.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "193"
},
{
  "url": "https://www.allrecipes.com/recipe/17973/ham-loaf-i/",
  "name": "Ham Loaf",
  "rating": "4.6",
  "ratingcount": "98",
  "ingredients": "cooking spray; 2 pounds ground ham; 1 ½ pounds ground pork; 1 cup dried bread crumbs; 1 cup evaporated milk; 2 large eggs; ⅛ teaspoon salt; ⅛ teaspoon ground black pepper; 1 cup brown sugar; ¼ cup cider vinegar; 1 tablespoon mustard powder",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish with cooking spray. 2. Combine ham, pork, bread crumbs, evaporated milk, eggs, salt, and pepper in a large bowl; mix well. Form into a loaf and place into the prepared baking dish. 3. Bake in the preheated oven for 1 hour 15 minutes. 4. While loaf is baking, make glaze: Stir together brown sugar, vinegar, and mustard powder in a small bowl until combined. 5. Pour glaze over loaf and continue baking until an instant-read thermometer inserted into the center of loaf reads at least 160 degrees F (72 degrees C), about 15 minutes more.",
  "prep": "10 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 40 mins",
  "calories": "760"
},
{
  "url": "https://www.allrecipes.com/recipe/279205/air-fryer-potstickers/",
  "name": "Air Fryer Potstickers",
  "rating": "3.5",
  "ratingcount": "4",
  "ingredients": "½ pound ground pork; 1 (4 ounce) can water chestnuts, drained and chopped; 1 (4 ounce) can shiitake mushrooms, drained and chopped; 2 tablespoons sesame oil; 2 tablespoons soy sauce; 1 tablespoon Sriracha sauce; 1 (12 ounce) package round dumpling wrappers",
  "directions": "1. Preheat an air fryer to 400 degrees F (200 degrees C). 2. Combine pork, water chestnuts, mushrooms, sesame oil, soy sauce, and Sriracha in a large skillet over medium-high heat. Cook and stir until pork is crumbly and no longer pink, about 6 minutes. Remove from heat and let sit until cool enough to handle, about 5 minutes. 3. Lay 8 dumpling wrappers on a clean work surface. Place a heaping teaspoonful of pork mixture in the middle of each wrapper. Pull both sides up like a taco and pinch the tops until sealed. 4. Cook in the preheated air fryer for 3 minutes. Use tongs to flip potstickers and cook for 3 minutes more. Transfer to a paper towel-lined plate. Repeat steps 3 and 4 until pork mixture is used up.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "70"
},
{
  "url": "https://www.allrecipes.com/recipe/25370/habanero-hellfire-chili/",
  "name": "Habanero Hellfire Chili",
  "rating": "4.7",
  "ratingcount": "352",
  "ingredients": "½ pound bacon; 1 pound ground round; 1 pound ground pork; 1  green bell pepper, diced; 1  yellow onion, diced; 6  jalapeno peppers, seeded and chopped; 6  habanero peppers, seeded and chopped; 8  Anaheim peppers, seeded and diced; 2 cloves garlic, minced; 1 ½ tablespoons ground cumin; 1 tablespoon crushed red pepper flakes; 3 tablespoons chili powder; 2 tablespoons beef bouillon granules; 1 (28 ounce) can crushed tomatoes; 2 (16 ounce) cans whole peeled tomatoes, drained; 2 (16 ounce) cans chili beans, drained; 1 (12 fluid ounce) can beer; 3 ounces tomato paste; 1 ounce chile paste; 2 cups water",
  "directions": "1. Place bacon in a large soup pot. Cook over medium high heat until evenly brown. Drain excess grease, leaving enough to coat bottom of pot Remove bacon, drain on paper towels and chop. 2. Brown beef and pork in pot over medium high heat. When meat is browned, stir in the bell pepper, onion, jalapeno peppers, habanero peppers, Anaheim peppers, garlic, cumin, red pepper flakes, chili powder, bouillon, crushed tomatoes, whole tomatoes, beer, tomato paste, chile paste and water. 3. Reduce heat to low and simmer for 45 to 60 minutes, stirring occasionally. Add beans and bacon and continue simmering for another 30 minutes.",
  "prep": "30 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs",
  "calories": "595"
},
{
  "url": "https://www.allrecipes.com/recipe/9251/pork-pie/",
  "name": "Pork Pie",
  "rating": "4.2",
  "ratingcount": "31",
  "ingredients": "2 pounds lean ground pork; 1 pound lean ground beef; 1 ½ cups mashed potatoes; 1 teaspoon ground nutmeg; salt and ground black pepper to taste; 1 (14.1 ounce) package double-crust pie pastry, thawed; 1 large egg white, beaten",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Heat a large skillet over medium-high heat. Cook and stir pork and beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. 3. Mix together cooked meat, mashed potatoes, nutmeg, salt, and pepper in a large bowl until well combined. 4. Line a 9-inch pie dish with 1 pastry crust. Spoon meat mixture into crust. Cover with second pastry crust; seal and flute the edges. Brush top crust with beaten egg white. Shield the edges with aluminum foil to prevent crust from burning. 5. Bake in the preheated oven for 30 minutes. Remove aluminum foil and continue baking until edges brown, about 15 minutes more.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "712"
},
{
  "url": "https://www.allrecipes.com/recipe/33629/cretons/",
  "name": "Cretons",
  "rating": "4.3",
  "ratingcount": "49",
  "ingredients": "1 pound ground pork; 1 cup milk; 1  onion, chopped; 1 clove garlic, chopped, or to taste; 1 pinch ground cloves, or to taste; 1 pinch ground allspice, or to taste; salt and pepper, to taste; ¼ cup dry bread crumbs",
  "directions": "1. Cook ground pork, milk, onion, garlic, cloves, allspice, salt, and pepper in a large saucepan over medium heat for about 1 hour. Stir in bread crumbs and cook for 10 more minutes. Adjust seasonings to taste. Transfer to a small container and keep refrigerated.",
  "prep": "10 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 20 mins",
  "calories": "101"
},
{
  "url": "https://www.allrecipes.com/recipe/221351/german-hamburgers-frikadellen/",
  "name": "German Hamburgers (Frikadellen)",
  "rating": "4.4",
  "ratingcount": "63",
  "ingredients": "1 kaiser roll; ⅔ pound ground beef; ⅓ pound ground pork; 1  onion, finely chopped; ¼ cup chopped fresh parsley; 1 large egg; 1 teaspoon Hungarian hot paprika (Optional); salt and ground black pepper to taste",
  "directions": "1. Soak kaiser roll in a medium bowl of water for 10 minutes. Drain and squeeze out excess water; crumble into a large bowl. 2. Add ground meats, onion, parsley, egg, paprika, salt, and black pepper to crumbled roll; mix until well blended. Shape mixture into large flattened meatballs. 3. Heat a large nonstick skillet over medium heat. Fry meatballs in the hot skillet until browned and no longer pink in the center, about 5 minutes per side. An instant-read thermometer inserted into the center of a patty should read at least 160 degrees F (70 degrees C).",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "272"
},
{
  "url": "https://www.allrecipes.com/recipe/32010/filipino-lumpia/",
  "name": "Filipino Lumpia",
  "rating": "4.3",
  "ratingcount": "42",
  "ingredients": "1 (12 ounce) package lumpia wrappers; 1 pound ground beef; ½ pound ground pork; ⅓ cup finely chopped onion; ⅓ cup finely chopped green bell pepper; ⅓ cup finely chopped carrot; 1 quart oil for frying",
  "directions": "1. Make sure the lumpia wrappers are completely thawed. Lay several out on a clean dry surface and cover with a damp towel. The wrappers are very thin and the edges will dry out quickly. 2. In a medium bowl, blend together the ground beef and pork, onion, green pepper and carrot. Place about 2 tablespoons of the meat mixture along the center of the wrapper. The filling should be no bigger around than your thumb or the wrapper will burn before the meat is cooked. Fold one edge of the wrapper over to the other. Fold the outer edges in slightly, then continue to roll into a cylinder. Wet your finger, and moisten the edge to seal. Repeat with the remaining wrappers and filling, keeping finished lumpias covered to prevent drying. This is a good time to recruit a friend or loved one to make the job less repetitive!! 3. Heat oil in a 9 inch skillet at medium to medium high heat until oil is 365 to 375 degrees F (170 to 175 degrees C) Fry 3-4 lumpia at a time. It should only take about 2-3 minutes for each side. The lumpia will be nicely browned when done. Drain on paper towels. 4. You can cut each lumpia into thirds for parties, if you like. In the Philippines, lumpia was eaten with banana ketchup, but I've never seen it sold in America.",
  "prep": "1 hr",
  "cook": "10 mins",
  "total": "1 hr 10 mins",
  "calories": "550"
},
{
  "url": "https://www.allrecipes.com/recipe/234975/golabki-stuffed-cabbage-rolls/",
  "name": "Golabki (Stuffed Cabbage Rolls)",
  "rating": "4.4",
  "ratingcount": "38",
  "ingredients": "1 head cabbage, cored; 2 tablespoons butter; 1 large onion, chopped; 1 pound ground beef; ½ pound ground pork; 1 ½ cups cooked rice; 1 teaspoon finely chopped garlic; 1 teaspoon salt, plus more to taste; ¼ teaspoon ground black pepper, plus more to taste; 3 (10.5 ounce) cans  condensed tomato soup; 2 (12 fluid ounce) cans tomato juice, or more to taste; ½ cup ketchup",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Place cabbage head into the pot, cover, and cook until leaves are softened enough to remove from the head, about 3 minutes. Remove cabbage from the pot and let sit until leaves are cool enough to handle, about 10 minutes. 2. Remove 18 whole leaves from the cabbage head, cutting out any thick tough center ribs. Set whole leaves aside. Chop the remaining cabbage and spread it in the bottom of a casserole dish. 3. Melt butter in a large skillet over medium-high heat. Add onion and sauté until tender, 5 to 10 minutes. Remove from the heat and let cool, about 5 minutes. 4. Combine beef, pork, cooked rice, garlic, salt, and pepper in a large bowl. Add onion and mix until well combined. 5. Preheat the oven to 350 degrees F (175 degrees C). 6. Place about 1/2 cup beef mixture onto a cabbage leaf. Roll the leaf around beef mixture, tucking in the sides to create an envelope around the meat. Repeat to make remaining cabbage rolls. Place cabbage rolls in a layer over chopped cabbage in the casserole dish. Season with salt and pepper. 7. Whisk condensed soup, tomato juice, and ketchup together in a bowl; pour over cabbage rolls and cover the dish tightly with aluminum foil. 8. Bake in the preheated oven until cabbage is tender and meat is cooked through, about 1 hour. Uncover for the last 20 to 30 minutes of cooking. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).",
  "prep": "45 mins",
  "cook": "1 hr 15 mins",
  "total": "2 hrs 15 mins",
  "calories": "404"
},
{
  "url": "https://www.allrecipes.com/recipe/42967/fast-creamy-tomato-penne/",
  "name": "Fast Creamy Tomato Penne",
  "rating": "4.4",
  "ratingcount": "131",
  "ingredients": "1 (16 ounce) package penne pasta; 2 tablespoons butter; ¼ large white onion, chopped; ½ large green bell pepper, finely chopped; 1 pound ground pork; 1 (16 ounce) jar spaghetti sauce; 1 cup sour cream",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add penne and cook, stirring occasionally, until tender yet firm to the bite, 8 to 10 minutes. Drain and set aside. 2. While the pasta is cooking, melt butter in a large pot over medium heat. Add onion and bell pepper; sauté until translucent, about 5 minutes. Add ground pork and cook until evenly browned and crumbly, 7 to 10 minutes. Drain excess fat and transfer to a bowl. 3. Pour spaghetti sauce into the same pot and heat over medium heat until bubbling, 3 to 5 minutes. Add cooked penne and pork mixture, then stir in sour cream. Cook until heated through, about 5 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "287"
},
{
  "url": "https://www.allrecipes.com/recipe/18863/sarma-stuffed-cabbage/",
  "name": "Sarma (Stuffed Cabbage)",
  "rating": "4.5",
  "ratingcount": "44",
  "ingredients": "1 large head cabbage, frozen for 3 days, then thawed overnight in the refrigerator; 1 pound lean ground beef; ½ pound ground pork; ½ pound ground ham; 1 cup uncooked long-grain white rice; 1  onion, finely chopped; 1  egg; 1 teaspoon salt; 1 teaspoon coarse ground black pepper; ½ teaspoon garlic powder; 1 pound sauerkraut; 1 cup tomato juice; 1 cup water, or as needed to cover",
  "directions": "1. Remove the leaves from the head of cabbage. 2. Mix beef, pork, ham, uncooked rice, onion, egg, salt, pepper, and garlic powder together in a bowl until well combined. Form mixture into oblong balls, using 1/2 cup of the mixture at a time. Wrap a cabbage leaf around each ball. 3. Spread sauerkraut in the bottom of a large pot. Layer cabbage rolls on top, placing them seam-side down. Pour tomato juice over rolls, then add enough water to cover and bring to a boil. Reduce the heat to low and simmer for about 3 hours, adding more water as necessary.",
  "prep": "25 mins",
  "cook": "3 hrs 5 mins",
  "total": "3 hrs 30 mins",
  "calories": "315"
},
{
  "url": "https://www.allrecipes.com/recipe/27190/gyoza/",
  "name": "Gyoza",
  "rating": "4.4",
  "ratingcount": "203",
  "ingredients": "1 tablespoon sesame oil; 2 cups chopped cabbage; ¼ cup chopped onion; ¼ cup chopped carrot; 1 clove garlic, chopped; ½ pound ground pork; 1 large egg; 1 (10 ounce) package wonton wrappers; 1 tablespoon vegetable oil; ¼ cup water; ¼ cup soy sauce; 2 tablespoons rice vinegar",
  "directions": "1. Heat sesame oil in a large skillet over medium-high heat. Add cabbage, onion, carrot, and garlic; cook and stir until cabbage is limp, 3 to 4 minutes. Add ground pork and egg; cook and stir until pork is browned and crumbly, 5 to 7 minutes. 2. Make the gyoza: Place about 1 tablespoon pork mixture into the center of a wonton wrapper. Fold wrapper in half over filling, then seal the edges with moistened fingers. Repeat to make remaining gyoza. 3. Heat vegetable oil in a large skillet over medium-high heat. Cook gyoza in the hot skillet until lightly browned, about 1 minute per side. Add water to the skillet, reduce the heat, cover, and steam gyoza until water is gone. Remove from the heat. 4. Mix soy sauce and rice vinegar together in a small bowl. Serve as a dipping sauce with gyoza.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "184"
},
{
  "url": "https://www.allrecipes.com/recipe/24807/cheesy-meatloaf/",
  "name": "Cheesy Meatloaf",
  "rating": "4.5",
  "ratingcount": "210",
  "ingredients": "1 pound ground beef; 1 pound ground pork; 1 (1 ounce) envelope dry onion soup mix; 2  eggs, beaten; 1 ½ cups dry bread crumbs; ground black pepper to taste; ¾ cup water; 2 cups shredded mozzarella cheese, divided",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. In a large bowl combine the beef, pork, soup mix, eggs, bread crumbs, pepper and water. Stir in 1/2 cup of the cheese. Mix well and spread half of mixture into a 9x5 inch loaf pan. Spread remaining 1 1/2 cups cheese over meat loaf mixture. Top with remaining half of meat loaf mixture. 3. Bake in preheated oven for 60 minutes. Let cool 10 to 15 minutes before serving.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "408"
},
{
  "url": "https://www.allrecipes.com/recipe/57716/shrimp-with-lobster-sauce/",
  "name": "Shrimp with Lobster Sauce",
  "rating": "4.4",
  "ratingcount": "166",
  "ingredients": "1 ½ teaspoons cornstarch; 2 teaspoons cooking sherry; 1 pound medium shrimp - peeled and deveined; ¼ cup vegetable oil; 2 cloves garlic, minced; ¼ pound ground pork; 1 cup water; 2 tablespoons soy sauce; ¼ teaspoon sugar; ½ teaspoon salt; ¼ cup cold water; 1 ½ tablespoons cornstarch; 1 large egg, beaten",
  "directions": "1. Dissolve 1 1/2 teaspoons cornstarch in sherry in a medium bowl. Add shrimp and toss to coat. 2. Heat oil in a wok over medium-high heat. Add shrimp and stir-fry until pink, 3 to 5 minutes. Use a slotted spoon to transfer shrimp to a plate; leave as much oil in the wok as possible. 3. Add garlic to the wok and stir-fry for a few seconds, then add ground pork. Stir-fry until pork is no longer pink, 3 to 5 minutes. 4. Mix 1 cup water, soy sauce, sugar, and salt together in a small bowl; pour into the wok and stir to combine. Bring to a boil, then cover, reduce the heat to medium, and simmer for about 2 minutes. 5. Whisk 1/4 cup cold water and 1 1/2 tablespoons cornstarch together in a small bowl; pour into the wok. Add shrimp and bring to a simmer. Drizzle beaten egg into the wok, stirring quickly as it cooks. Serve immediately.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "308"
},
{
  "url": "https://www.allrecipes.com/recipe/18443/bolognese-sauce/",
  "name": "Bolognese Sauce",
  "rating": "4.4",
  "ratingcount": "328",
  "ingredients": "2 tablespoons olive oil; 1 large onion, minced; 4 slices bacon, cut into 1/2 inch pieces; 1 clove garlic, minced; 1 pound lean ground beef; ½ pound ground pork; 1 (28 ounce) can Italian plum tomatoes; ½ pound fresh mushrooms, sliced; 6 ounces tomato sauce; 2  carrots, shredded; 1 stalk celery, chopped; ½ cup dry white wine; ½ cup chicken stock; ½ teaspoon dried basil; ½ teaspoon dried oregano; salt and pepper to taste; 1 pound pasta",
  "directions": "1. Warm oil in a large skillet over medium heat. Sauté onion, bacon, and garlic in hot oil until bacon is browned and crisp, about 10 minutes. Use a slotted spoon to transfer bacon mixture to a paper towel-lined plate to drain; set aside. 2. Place the same large skillet over medium-high heat. Cook and stir ground beef and pork in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. 3. Stir bacon mixture, tomatoes, mushrooms, tomato sauce, carrots, celery, wine, stock, basil, oregano, salt, and pepper into meat mixture. Bring to a boil. Cover, reduce heat, and simmer sauce for 1 hour, stirring occasionally. 4. Meanwhile, bring a large pot of lightly salted water to a boil. Add pasta and cook in boiling water until al dente, 8 to 10 minutes; drain. 5. Serve sauce over hot pasta.",
  "prep": "10 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 30 mins",
  "calories": "472"
},
{
  "url": "https://www.allrecipes.com/recipe/16785/ham-balls/",
  "name": "Ham Balls",
  "rating": "4.6",
  "ratingcount": "63",
  "ingredients": "1 ¼ pounds ground smoked ham; 1 pound ground pork; 1 pound lean ground beef; 1 cup milk; 2  eggs; 1 ½ cups graham cracker crumbs; 1 (10.75 ounce) can  tomato soup; ¼ cup cider vinegar; 1 cup packed brown sugar; 1 teaspoon mustard powder",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. In a large bowl, combine the ham, pork OR sausage, and the ground beef. Stir in the milk, eggs and graham cracker crumbs and mix well. Form into large balls about 2 inches in diameter and place them in a 9x13 inch baking dish. 3. In a separate medium bowl, combine the soup, vinegar, brown sugar and mustard powder. Mix well and pour over the meatballs. 4. Bake at 350 degrees for 1 hour or until internal meat temperature reaches 160 degrees F (73 degrees C).",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "646"
},
{
  "url": "https://www.allrecipes.com/recipe/8498196/spicy-pumpkin-pork-noodles/",
  "name": "Spicy Pumpkin Pork Noodles",
  "rating": "5.0",
  "ratingcount": "8",
  "ingredients": "2 teaspoons vegetable oil; 8 ounces ground pork; salt and freshly ground black pepper to taste; ¼ teaspoon smoked paprika; 2 cloves minced garlic; ⅓ cup sliced green onions; 2 tablespoons hoisin sauce; 6 ounces bucatini (dry); 1 tablespoon reserved oil from cooking pork; ½ cup pumpkin puree; 2 tablespoons gochujang (Korean hot pepper paste); ½ cup sliced green onions; 1 teaspoon sesame oil; 2 tablespoons diced hot chile peppers; 1  lime, juiced; ¼ cup chopped fresh cilantro",
  "directions": "1. Heat oil in a skillet over medium high heat and cook pork, while breaking up into small pieces, 2 to 3 minutes. Season with salt, pepper, and smoked paprika and keep cooking and stirring until pork is crumble and is browned up, about 5 minutes. 2. Lower heat to medium and add garlic and green onions. Cook for 30 seconds until fragrant. Mix in hoisin sauce and cook until sauce has glazed over all the pork pieces, 1 to 2 minutes. Transfer pork topping to a bowl. 3. Pour out cooking grease but leave 1 tablespoon of grease in the skillet. Add pumpkin puree, gochujang, green onions, sesame oil, and chili peppers. Cook and stir over medium heat for 2 minutes. 4. Meanwhile, bring a large pot of lightly salted water to a boil. Cook bucatini the boiling water, stirring occasionally, until tender yet firm to the bite, about 10 minutes. Fish out noodles and drop into the skillet with the pumpkin sauce. Reserve about 1/2 cup pasta cooking water. 5. Squeeze lime juice on top of the noodles. Add about 2 tablespoons pasta water on top and mix noodles with the sauce until well combined. Keep adding pasta water, a little at a time, until sauce has reached your preferred consistency. 6. Turn off heat and stir in chopped cilantro. Transfer noodles to a plate and top with ground pork.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "787"
},
{
  "url": "https://www.allrecipes.com/recipe/8500479/ground-pork-tacos-with-pineapple-salsa/",
  "name": "Ground Pork Tacos with Pineapple Salsa",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 pound ground pork; 1 tablespoon soy-based liquid seasoning (such as Maggi® Jugo); ½ teaspoon chipotle powder; 1 clove garlic, minced; 1 cup diced fresh pineapple; ¼ cup minced red onion; 1 small jalapeno pepper, seeded and minced; 2 tablespoons minced fresh cilantro; ½  lime, juiced; salt to taste; 8 (6 inch) corn tortillas",
  "directions": "1. Combine ground pork, liquid seasoning, ground chipotle powder, and garlic in a bowl. Set aside for flavors to meld. 2. Combine pineapple, red onion, jalapeno, cilantro, lime juice, and salt in a bowl. Set pineapple salsa aside. 3. Preheat a large skillet over high heat. Crumble ground pork into the hot skillet. Cook and stir until pork is completely browned and edges begin to crisp, 7 to 10 minutes. Drain any excess grease. Place pork in a bowl and keep warm. Wipe out skillet. 4. Warm tortillas in skillet over medium-low heat, about 20 seconds per side. Divide meat mixture between tortillas and top with pineapple salsa",
  "prep": "30 mins",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "166"
},
{
  "url": "https://www.allrecipes.com/recipe/220854/chef-johns-italian-meatballs/",
  "name": "Chef John's Italian Meatballs",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "⅓ cup plain bread crumbs; ½ cup milk; 2 tablespoons olive oil; 1  onion, diced; 1 pound ground beef; 1 pound ground pork; 2  eggs; 2 tablespoons grated Parmesan cheese; ¼ bunch fresh parsley, chopped; 3 cloves garlic, crushed; 2 teaspoons salt; 1 teaspoon ground black pepper; 1 teaspoon dried Italian herb seasoning; ½ teaspoon red pepper flakes",
  "directions": "1. Cover a baking sheet with foil and spray lightly with cooking spray. Soak bread crumbs in milk in a small bowl for 20 minutes. 2. Meanwhile, heat olive oil in a skillet over medium heat. Add onion; cook and stir until onion has softened and turned translucent, about 5 minutes. Reduce heat to low and continue cooking and stirring until onion is very tender, about 15 minutes more. 3. Gently stir beef and pork together in a large bowl. Add onions, bread crumb mixture, eggs, Parmesan cheese, parsley, garlic, salt, black pepper, Italian herb seasoning, and red pepper flakes; mix together using a rubber spatula until combined. Cover and refrigerate for about one hour. 4. Preheat the oven to 425 degrees F (220 degrees C). 5. Form mixture into balls about 1 1/2 inches in diameter; arrange in a single layer on the prepared baking sheet. 6. Bake in the preheated oven until browned and cooked through, 15 to 20 minutes.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "2 hrs 15 mins",
  "calories": "390"
},
{
  "url": "https://www.allrecipes.com/recipe/19344/homemade-lasagna/",
  "name": "Homemade Lasagna",
  "rating": "4.6",
  "ratingcount": "348",
  "ingredients": "½ pound ground pork; ½ pound lean ground beef; ½ cup minced onion; 1 (28 ounce) can crushed tomatoes; 1 (8 ounce) can tomato sauce; 2 tablespoons chopped fresh parsley, divided; 1 clove garlic, crushed; 1 ½ teaspoons dried basil; 1 ½ teaspoons salt; ½ teaspoon dried oregano; ⅛ teaspoon white sugar; 1 (16 ounce) package lasagna noodles; 1 pound small-curd cottage cheese; ¾ cup grated Parmesan cheese; 3 large eggs; 2 teaspoons salt; ¼ teaspoon ground black pepper; 1 (16 ounce) package shredded mozzarella cheese",
  "directions": "1. Combine pork and ground beef in a large, deep skillet over medium-high heat; cook and stir until browned and crumbly, 5 to 7 minutes. Add onion and cook until translucent, about 5 minutes. 2. Stir in crushed tomatoes, tomato sauce, 1 tablespoon fresh parsley, garlic, basil, salt, oregano, and sugar. Reduce heat to medium-low and simmer, stirring occasionally, for 30 minutes. 3. While the sauce is simmering, bring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally, until tender yet firm to the bite, 8 to 10 minutes. Drain and set aside. 4. While the noodles are cooking, preheat the oven to 375 degrees F (190 degrees C). 5. Mix cottage cheese, Parmesan cheese, eggs, remaining 1 tablespoon fresh parsley, salt, and pepper in a large bowl until combined. 6. Assemble lasagna: Spread a spoon or two of sauce over the bottom of a 9x13-inch baking dish just to to coat it. Place two layers of noodles over the sauce to cover. Layer with 1/2 of the cheese mixture, 1/2 of the remaining sauce, and 1/2 of the mozzarella cheese. Repeat layers once more using the remaining noodles, cheese mixture, sauce, and mozzarella. Cover the baking dish with aluminum foil. 7. Bake in the preheated oven for 30 to 40 minutes. Remove the foil and bake until cheese is golden brown, 5 to 10 more minutes. 8. Remove from the oven and let stand for 10 minutes before cutting and serving.",
  "prep": "1 hr 25 mins",
  "cook": "1 hr 15 mins",
  "total": "2 hrs 50 mins",
  "calories": "638"
},
{
  "url": "https://www.allrecipes.com/recipe/35151/traditional-filipino-lumpia/",
  "name": "Traditional Filipino Lumpia",
  "rating": "4.8",
  "ratingcount": "507",
  "ingredients": "1 tablespoon vegetable oil; 1 pound ground pork; ½ cup chopped onion; 2 cloves garlic, crushed; ½ cup minced carrots; ½ cup chopped green onions; ½ cup thinly sliced green cabbage; 2 tablespoons chopped fresh cilantro (Optional); 1 teaspoon ground black pepper; 1 teaspoon salt; 1 teaspoon garlic powder; 1 teaspoon soy sauce; 30  lumpia wrappers; 2 cups vegetable oil for frying, or as needed",
  "directions": "1. Heat 1 tablespoon vegetable oil in a wok or large skillet over high heat. Add pork; cook and stir until crumbly and no pink is showing, 5 to 7 minutes. Remove pork from the pan and set aside. Drain grease from the pan, leaving just a thin coating. 2. Add onion and garlic to the pan; cook and stir until fragrant, about 2 minutes. Stir in the cooked pork, carrots, green onions, cabbage, and cilantro. Season with pepper, salt, garlic powder, and soy sauce. Remove from the heat, and set aside until cool enough to handle, about 5 minutes. 3. Assemble lumpia: Place 3 heaping tablespoons of filling diagonally near one corner of a lumpia wrapper, leaving a 1 1/2 inch space at both ends. Fold the side along the length of the filling over the filling, tuck in both ends, and roll neatly and tightly to close. Moisten the other side of the wrapper with water to seal the edge. Transfer to a plate and cover with plastic wrap to retain moisture. Repeat to assemble remaining lumpia. 4. Heat 1/2 inch vegetable oil in a heavy skillet over medium heat for 5 minutes. 5. Slide 3 to 4 lumpia into the hot oil, making sure the seams are facing down. Fry, turning occasionally, until all sides are golden brown, 1 to 2 minutes. Transfer to a paper towel-lined plate to drain. Repeat to fry remaining lumpia. Serve immediately.",
  "prep": "40 mins",
  "cook": "25 mins",
  "total": "1 hr 10 mins",
  "calories": "168"
},
{
  "url": "https://www.allrecipes.com/recipe/275548/air-fryer-meatballs/",
  "name": "Air Fryer Meatballs",
  "rating": "4.8",
  "ratingcount": "42",
  "ingredients": "16 ounces lean ground beef; 4 ounces ground pork; ½ cup grated Parmesan cheese; ⅓ cup Italian seasoned bread crumbs; 1  egg; 2 cloves garlic, minced; 1 teaspoon Italian seasoning; ½ teaspoon salt",
  "directions": "1. Preheat an air fryer to 350 degrees F (175 degrees C). 2. Combine beef, pork, Parmesan cheese, bread crumbs, egg, garlic, Italian seasoning, and salt in a large bowl. Mix until evenly combined. Form into 16 equal meatballs (a small ice cream scoop is helpful) and place on a baking sheet. 3. Place 1/2 of the meatballs in the basket of the air fryer and cook 8 minutes. Shake the basket and cook 2 minutes more. Transfer to a serving plate and let rest for 5 minutes. Repeat with remaining meatballs.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "457"
},
{
  "url": "https://www.allrecipes.com/recipe/231169/chef-johns-swedish-meatballs/",
  "name": "Chef John's Swedish Meatballs",
  "rating": "4.6",
  "ratingcount": "606",
  "ingredients": "2 tablespoons butter; ½  yellow onion, finely chopped; 1 ½ teaspoons fine salt; 2 large eggs; ⅓ cup plain bread crumbs; ¼ cup milk; ¾ teaspoon freshly ground black pepper; ¼ teaspoon ground nutmeg; ¼ teaspoon ground allspice; 1 pinch cayenne pepper, or to taste; 1 pound ground beef chuck; 1 pound ground pork; 2 tablespoons butter; 3 tablespoons all-purpose flour; 3 ¼ cups beef broth; ½ cup heavy cream; ½ teaspoon white sugar; ¼ teaspoon Worcestershire sauce; salt and freshly ground black pepper to taste; cooking spray",
  "directions": "1. Make meatballs: Melt butter in a large skillet over medium heat. Cook and stir onion and salt in hot butter until onion turns translucent, about 6 minutes. 2. Transfer onion mixture to a large bowl. Stir in eggs, bread crumbs, milk, black pepper, nutmeg, allspice, and cayenne. Mix in ground beef and pork until well combined. Cover the bowl with plastic wrap and refrigerate for 1 hour. 3. Make gravy: Melt butter in a large skillet over medium heat; whisk in flour and cook until golden brown, 4 to 5 minutes. Slowly whisk in beef broth. Increase heat to medium-high, whisk in cream, and bring to a simmer. Stir in sugar and Worcestershire. Simmer until slightly thickened, 6 to 7 minutes. Season with salt and black pepper. Remove from heat and set aside. 4. Preheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil and lightly coat with cooking spray. 5. Roll 2 to 3 tablespoons meatball mixture into a ball using wet hands; repeat with remaining meatball mixture. Place meatballs on the prepared baking sheet. 6. Bake in the preheated oven until browned and cooked through, about 20 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). 7. Transfer meatballs to gravy and cook over medium-low heat until warmed through, about 5 minutes.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "2 hrs 15 mins",
  "calories": "479"
},
{
  "url": "https://www.allrecipes.com/recipe/14704/best-egg-rolls/",
  "name": "Best Egg Rolls",
  "rating": "4.4",
  "ratingcount": "708",
  "ingredients": "1 pound ground pork; 1 teaspoon ground ginger, or more to taste; 1 teaspoon garlic powder, or more to taste; 2 cups shredded cabbage; 2 ounces shredded carrots; 2 tablespoons all-purpose flour; 2 tablespoons water; 1 quart peanut oil for frying, or as needed; 8 (7 inch square) egg roll wrappers; 2 tablespoons sesame seeds (Optional)",
  "directions": "1. Season pork with ginger and garlic powder in a large bowl; mix until thoroughly combined. 2. Place pork in a medium skillet over medium heat. Cook and stir until pork is browned and crumbly, 5 to 7 minutes. 3. Combine cooked pork, cabbage, and carrots in a large bowl; mix until egg roll filling is well combined. Mix four and water together in a small bowl until a paste forms. 4. Heat oil in a large skillet to about 375 degrees F (190 degrees C) or medium high heat. 5. While oil is heating, prepare egg rolls: Lay one egg roll wrapper on a work surface with one corner pointed toward you like a diamond. Place about 1/4 to 1/3 cup of the filling in the center of the wrapper. 6. Fold the bottom corner up and over the filling. Fold the left and right corners in toward the center. Push the egg roll away from you and roll toward the top corner. 7. Brush a bit of the flour paste over the inside of that corner to help seal the egg roll. 8. Fry egg rolls in the hot oil, turning occasionally, until golden brown and crispy, 5 to 8 minutes. Remove from oil and drain on paper towels or rack. 9. Place egg rolls on a serving plate and sprinkle sesame seeds over top.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "40 mins",
  "calories": "334"
},
{
  "url": "https://www.allrecipes.com/recipe/216319/homemade-sweet-italian-sausage-mild-or-hot/",
  "name": "Homemade Sweet Italian Sausage (Mild or Hot)",
  "rating": "4.7",
  "ratingcount": "241",
  "ingredients": "3 pounds ground pork; 3 tablespoons red wine vinegar; 1 ¼ tablespoons dried parsley; 1 tablespoon garlic powder; 1 tablespoon onion powder; 1 tablespoon dried basil; 1 tablespoon salt; 1 tablespoon freshly cracked black pepper; 2 teaspoons paprika; 2 teaspoons crushed red pepper flakes, or to taste; ¾ teaspoon ground fennel seed; ¼ teaspoon brown sugar; ⅛ teaspoon dried oregano; ⅛ teaspoon dried thyme",
  "directions": "1. Place pork and red wine vinegar in a large mixing bowl. Sprinkle with parsley, garlic powder, onion powder, basil, salt, black pepper, paprika, red pepper flakes, fennel seed, brown sugar, oregano, and thyme. Knead until flecks of spice are evenly distributed throughout meat. 2. Divide sausage into thirds. Form each into a 3-inch diameter log, wrap securely in plastic wrap, and place in a zip-top bag. Refrigerate for at least 12 hours before cooking. 3. When ready to cook, remove logs from the zip-top bags and place on a cutting board. Use a finely serrated knife to cut logs right through the plastic wrapping into 1/4- to 1/2-inch-thick patties. Carefully remove and discard any plastic. 4. Heat a large skillet over medium heat. Working in batches, cook sausage patties in the hot skillet until no longer pink in the center, 2 to 6 minutes per side, depending on thickness. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "12 hrs 35 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/76296/meat-pie/",
  "name": "Meat Pie",
  "rating": "4.5",
  "ratingcount": "104",
  "ingredients": "1 medium potato, peeled and cubed; ½ pound ground beef; ½ pound ground pork; ½ cup chopped onion; ⅓ clove garlic, chopped; ½ teaspoon mustard powder; ½ teaspoon dried thyme; ¼ teaspoon dried sage; ¼ teaspoon ground cloves; 1 teaspoon salt; ¼ teaspoon ground black pepper; ¼ cup water; 1 (15 ounce) package refrigerated pie crusts",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Place potato in a saucepan with enough water to cover. Bring to a boil, and cook until tender, about 5 minutes. Drain, mash, and set aside. 3. Meanwhile, crumble ground beef and pork into a large saucepan. Add onion, garlic, mustard powder, thyme, sage, cloves, salt, and black pepper. Stir in water. Cook over medium heat, stirring, until meat is evenly browned. 4. Remove from the heat and mix in mashed potato. 5. Ease one pie crust into a 9-inch pie plate. Fill with meat mixture, then top with the remaining pie crust. Trim any excess dough, then crimp the edges with the tines of a fork to seal. Prick top crust a few times with a knife to vent steam. Cover the edges of the crust with aluminum foil. 6. Bake in the preheated oven until crust is browned, about 25 minutes.",
  "prep": "25 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "381"
},
{
  "url": "https://www.allrecipes.com/recipe/261153/perfect-pot-stickers/",
  "name": "Perfect Pot Stickers",
  "rating": "4.7",
  "ratingcount": "111",
  "ingredients": "1 pound ground pork; 4 cloves minced garlic; ½ cup finely chopped green onions; 3 tablespoons very finely minced fresh ginger; 2 tablespoons soy sauce; 1 teaspoon soy sauce; 1 teaspoon sesame oil; 1 pinch cayenne pepper; 1 ½ cups finely chopped green cabbage; 2 ½ cups all-purpose flour, or more as needed; ¾ teaspoon kosher salt; 1 cup hot water, about 130 -150 F (55-65 C); ¼ cup seasoned rice vinegar; ¼ cup soy sauce; 6 tablespoons vegetable oil for frying, or as needed - divided; 8 tablespoons water for steaming, divided",
  "directions": "1. Place ground pork, green onions, garlic, ginger, 2 tablespoon plus 1 teaspoon soy sauce, sesame oil, and cayenne in a mixing bowl. Top with chopped green cabbage. Mix with fork until thoroughly combined. Tamp down lightly; cover with plastic. Refrigerate until chilled, about an hour. 2. Place 2 1/2 cups of flour and kosher salt in a mixing bowl. Slowly pour in hot water. Stir with a wooden spoon until mixture forms a shaggy dough. Flour your hands and transfer dough to a work surface. Knead dough until it becomes smooth and elastic, about 3 to 5 minutes. If dough seems too sticky, sprinkle with a bit more flour, up to an additional 1/2 cup, and continue to knead. Wrap dough ball in plastic, and let it rest about 30 minutes. 3. When dough has rested, divide into 4 equal pieces. Cover 3 pieces with a dish cloth while you work the first piece. Roll into a small log about the thickness of a thumb, about 3/4 inch. Divide each log into 6 equal pieces. Roll each piece into a thin 3 1/2-inch circle on a lightly floured surface to form the pot sticker wrappers. Repeat with the remaining dough pieces. 4. Lightly moisten the edges of a wrapper with your wet finger. Place a small scoop of the ground pork mixture onto the center of a wrapper. Fold up the 2 sides and pinch together in the center. Pinch together the remaining edges, forming \"pleats\" along one side. Tap the pot sticker on the work surface to slightly flatten the bottom; form a slight curve in it so it stands upright in the pan. Transfer to a well-floured plate. Repeat with remaining dough and filling. 5. Mix together seasoned rice vinegar and soy sauce in a small mixing bowl for the dipping sauce. 6. Heat oil in skillet over medium-high heat. Place about 6 or 7 pot stickers in the hot oil, flat side down. Cook until bottoms are golden brown, about 2 minutes. Drizzle in water and quickly cover the pan; steam for 3 minutes. Uncover; reduce heat to medium. Continue cooking until water evaporates and bottoms are browned and crunchy, 1 or 2 minutes. Transfer to a warm serving dish. Repeat with remaining pot stickers. Serve with dipping sauce. 7. Serve hot and enjoy!",
  "prep": "25 mins",
  "cook": "5 mins",
  "total": "1 hr",
  "calories": "439"
},
{
  "url": "https://www.allrecipes.com/recipe/269743/poblano-and-ground-pork-tacos/",
  "name": "Phenomenal Pork Tacos",
  "rating": "4.8",
  "ratingcount": "13",
  "ingredients": "1  red onion, halved and thinly sliced; 1  Roma tomato, seeded and finely chopped; 1  ripe kiwi, diced; 1  lime, quartered, divided; 2 tablespoons chopped cilantro, divided; salt and ground black pepper to taste; 4 tablespoons sour cream; olive oil; 1  poblano pepper - cored, seeded, and finely chopped; 10 ounces ground pork; 1 tablespoon Mexican seasoning; 2 tablespoons chicken stock; 1 tablespoon tomato paste; 6  flour tortillas",
  "directions": "1. Mince a few slices of onion to get 1 tablespoon. Add minced onion, tomato, kiwi, juice from 2 lime wedges, 3/4 of the cilantro, salt, and pepper to a small bowl. Mix into a salsa. 2. Juice 1/4 of the lime into another small bowl; mix in sour cream to make the crema. 3. Heat olive oil in a large pan over medium-high heat. Add sliced onion and poblano pepper. Cook, tossing occasionally, until softened and lightly charred, 3 to 4 minutes. Add pork and Mexican seasoning. Cook until pork is browned throughout, 4 to 5 minutes. Reduce heat to medium-low. Add chicken stock, tomato paste, salt, and pepper. Cook and stir until everything is coated, 1 to 2 minutes. 4. Wrap tortillas in a damp cloth and microwave for 30 seconds. Divide tortillas over plates; spread lime crema on top. Top tortillas with pork mixture and salsa. Garnish with remaining cilantro.",
  "prep": "30 mins",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "392"
},
{
  "url": "https://www.allrecipes.com/recipe/26706/baked-pork-spring-rolls/",
  "name": "Baked Pork Spring Rolls",
  "rating": "4.5",
  "ratingcount": "373",
  "ingredients": "½ pound ground pork; 1 cup finely shredded cabbage; ¼ cup finely shredded carrot; 2  green onions, thinly sliced; 2 tablespoons chopped fresh cilantro; 2 teaspoons grated fresh ginger root; 1 ½ teaspoons oyster sauce; 1 ½ teaspoons minced garlic; 1 teaspoon chile sauce; ½ teaspoon sesame oil; 1 tablespoon cornstarch; 1 tablespoon water; 12 (7 inch square) spring roll wrappers; 4 teaspoons vegetable oil",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil. 2. Cook pork in a medium saucepan over medium-high heat until browned and crumbly, 5 to 7 minutes. Drain. 3. Transfer pork to a medium bowl. Mix in cabbage, carrot, green onions, ginger, oyster sauce, garlic, chile sauce, and sesame oil until well combined. 4. Mix cornstarch and water together in a small bowl. 5. Place about 1 tablespoon pork mixture into the center of a wrapper. Roll wrapper around pork, folding edges inward to close. Moisten fingers in the cornstarch and water mixture, and brush wrapper seams to seal. Repeat to make remaining spring rolls. 6. Place spring rolls, seam-side down, onto the prepared baking sheet. Brush with vegetable oil. 7. Bake in the preheated oven until hot and golden brown, about 20 minutes, turning halfway through if desired for crispier rolls.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "154"
},
{
  "url": "https://www.allrecipes.com/recipe/228052/chinese-pork-dumplings/",
  "name": "Chinese Pork Dumplings",
  "rating": "4.8",
  "ratingcount": "214",
  "ingredients": "½ cup soy sauce; 1 tablespoon seasoned rice vinegar; 1 tablespoon finely chopped Chinese chives; 1 tablespoon sesame seeds; 1 teaspoon chile-garlic sauce (such as Sriracha®); 1 pound ground pork; 3 cloves garlic, minced; 1 large egg, beaten; 2 tablespoons finely chopped Chinese chives; 2 tablespoons soy sauce; 1 ½ tablespoons sesame oil; 1 tablespoon minced fresh ginger; 50  dumpling wrappers; ½ cup vegetable oil for frying, or as needed",
  "directions": "1. Prepare dipping sauce: Combine soy sauce, rice vinegar, chives, sesame seeds, and chile sauce in a small bowl. Set aside. 2. Prepare dumplings: Mix pork, garlic, egg, chives, soy sauce, sesame oil, and ginger in a large bowl until thoroughly combined. 3. Place a dumpling wrapper on a lightly floured work surface and spoon about 1 tablespoon of the filling in the middle. 4. Wet the edge with a little water and crimp together forming small pleats to seal the dumpling. Repeat to form remaining dumplings. 5. Heat 1 to 2 tablespoons vegetable oil in a large skillet over medium-high heat. Place 8 to 10 dumplings in the pan and cook until browned, about 2 minutes per side. 6. Pour in 1 cup of water; cover and cook until the dumplings are tender and pork is cooked through, about 5 minutes. 7. Repeat to cook remaining dumplings, adding more oil and water for each batch. 8. Serve dumplings with dipping sauce.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "540"
},
{
  "url": "https://www.allrecipes.com/recipe/14759/pork-dumplings/",
  "name": "Pork Dumplings",
  "rating": "4.6",
  "ratingcount": "378",
  "ingredients": "100  (3.5 inch square) wonton wrappers; 1 ¾ pounds ground pork; 1 tablespoon minced fresh ginger root; 4 cloves garlic, minced; 2 tablespoons thinly sliced green onion; 4 tablespoons soy sauce; 3 tablespoons sesame oil; 1  egg, beaten; 5 cups finely shredded Chinese cabbage",
  "directions": "1. In a large bowl, combine the pork, ginger, garlic, green onion, soy sauce, sesame oil, egg and cabbage. Stir until well mixed. 2. Place 1 heaping teaspoon of pork filling onto each wonton skin. Moisten edges with water and fold edges over to form a triangle shape. Roll edges slightly to seal in filling. Set dumplings aside on a lightly floured surface until ready to cook. 3. Arrange dumplings in a covered bamboo or metal steamer so they don't touch to prevent them from sticking together; steam for 15 minutes, or until pork is cooked through. 4. Serve hot and enjoy!",
  "prep": "45 mins",
  "cook": "15 mins",
  "total": "1 hr",
  "calories": "752"
},
{
  "url": "https://www.allrecipes.com/recipe/141171/grandmas-crispy-pork-wontons/",
  "name": "Grandma's Crispy Pork Wontons",
  "rating": "4.7",
  "ratingcount": "61",
  "ingredients": "1 pound ground pork; 1 cup diced celery; 1 cup shredded carrot; 1 cup diced onion; 3 cloves garlic, minced; 1 teaspoon salt; 1 tablespoon ground black pepper; ¼ cup soy sauce; 1 (14 ounce) package wonton wrappers; 2  eggs, beaten; 1 quart canola oil for frying",
  "directions": "1. Mix together the ground pork, celery, carrot, onion, and garlic in a bowl. Season with salt, pepper, and soy sauce; mix with your hands until well blended. 2. Separate the wonton wrappers and lay them out on a clean surface. Spoon 1 teaspoon of the pork mixture into the center of each wrapper. Moisten the edges of the wonton wrappers with beaten egg, fold over the filling to form a triangle, and press together to seal. Place the finished wontons on a baking sheet. 3. Heat the canola oil in a deep fryer or large saucepan to 365 degrees F (180 degrees C). 4. Fry the wontons, about 6 at a time, until they turn golden brown and float to the top, 3 to 4 minutes. Remove, and drain on a paper towel-lined plate.",
  "prep": "1 hr",
  "cook": "24 mins",
  "total": "1 hr 24 mins",
  "calories": "266"
},
{
  "url": "https://www.allrecipes.com/recipe/216564/swedish-meatballs-svenska-kottbullar/",
  "name": "Swedish Meatballs (Svenska Kottbullar)",
  "rating": "4.7",
  "ratingcount": "802",
  "ingredients": "2 slices day-old white bread, crumbled; ½ cup heavy cream; 1 teaspoon butter; 1 small onion, minced; ⅔ pound ground beef; ⅓ pound finely ground pork; 1  egg; 1 tablespoon brown sugar (Optional); 1 teaspoon salt; ¼ teaspoon ground black pepper; ¼ teaspoon ground nutmeg; ¼ teaspoon ground allspice; ⅛ teaspoon ground ginger (Optional); 1 tablespoon butter; ¼ cup chicken broth; 3 tablespoons all-purpose flour, or as needed; 2 cups beef broth, or as needed; ½ (8 ounce) container sour cream",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Place bread crumbs into a small bowl; mix in cream. Allow to stand until crumbs absorb cream, about 10 minutes. 3. Meanwhile, melt 1 teaspoon butter in a skillet over medium heat; cook and stir onion until light brown, about 10 minutes. Transfer onion to a mixing bowl. 4. Mix ground beef, ground pork, egg, brown sugar, salt, black pepper, nutmeg, allspice, and ginger with onion in the mixing bowl. Lightly mix in bread crumbs and cream. 5. Melt 1 tablespoon butter in a large skillet over medium heat. Pinch off about 1 1/2 tablespoon meat mixture per meatball; form into balls. Place meatballs into the skillet and cook, turning often, until browned, about 5 minutes. Insides of meatballs will still be pink. 6. Place browned meatballs into a baking dish, pour in chicken broth, and cover with foil. 7. Bake in the preheated oven until meatballs are tender, about 40 minutes. Remove meatballs to a serving dish. 8. Pour pan drippings into a saucepan over medium heat. Whisk flour into drippings until smooth. 9. Gradually whisk in enough beef broth to total about 2 1/2 cups liquid. 10. Bring gravy to a simmer, whisking constantly, until thickened, about 5 minutes. 11. Just before serving, whisk in sour cream. Season with salt and black pepper. Serve gravy with meatballs.",
  "prep": "25 mins",
  "cook": "1 hr",
  "total": "1 hr 35 mins",
  "calories": "309"
},
{
  "url": "https://www.allrecipes.com/recipe/111822/bulk-venison-breakfast-sausage/",
  "name": "Bulk Venison Breakfast Sausage",
  "rating": "4.6",
  "ratingcount": "67",
  "ingredients": "6 pounds ground venison; 2 pounds ground pork; ¼ cup sugar-based curing mixture (such as Morton® Tender Quick®); ¼ cup packed brown sugar; 3 tablespoons dried sage; 1 tablespoon crushed red pepper flakes; 1 tablespoon  fresh-ground black pepper",
  "directions": "1. Gather all ingredients. 2. Place venison and pork in a very large bowl or plastic tub; sprinkle with curing mixture, sugar, sage, red pepper flakes, and black pepper. Mix well until evenly combined. 3. Divide into 1-pound portions and freeze.",
  "prep": "45 mins",
  "cook": "",
  "total": "45 mins",
  "calories": "93"
},
{
  "url": "https://www.allrecipes.com/recipe/261983/tourtiere-french-canadian-meat-pie/",
  "name": "Tourtière (French Canadian Meat Pie)",
  "rating": "4.8",
  "ratingcount": "123",
  "ingredients": "3 cups all-purpose flour; 2 sticks unsalted butter, sliced, frozen; 1 teaspoon kosher salt; 7 tablespoons ice-cold water, or as needed; 2 teaspoons distilled white vinegar; 2 teaspoons kosher salt; 1 teaspoon freshly ground black pepper; 1 teaspoon dried thyme; ½ teaspoon dried sage; ½ teaspoon ground cinnamon; ½ teaspoon ground ginger; ¼ teaspoon freshly grated nutmeg; ¼ teaspoon ground allspice; ¼ teaspoon ground mustard; ⅛ teaspoon ground cloves; 1 pinch cayenne pepper; 1 large russet potato, peeled, quartered; 1 teaspoon kosher salt; 1 tablespoon butter; 1 large onion, finely chopped; 1 pinch salt; ½ cup finely diced celery; 4 cloves garlic, crushed; 1 pound ground pork; 1 pound ground beef; 1 cup potato cooking water, plus more as needed; 1 large egg; 1 tablespoon water",
  "directions": "1. Make crust: Place flour, frozen butter, and salt into the bowl of a food processor. Pulse on and off until butter breaks down to pea size, about 30 seconds. Stir together cold water and vinegar; drizzle over flour mixture. Pulse on and off until mixture is crumbly and holds together when pinched, about 10 seconds. Drizzle in more cold water if mixture is too dry. 2. Transfer mixture to a work surface. Press together until it forms a ball. Flatten to a disc, wrap in plastic wrap, and refrigerate until chilled, about 1 hour. 3. Make spice blend: Mix together salt, black pepper, thyme, sage, cinnamon, ginger, nutmeg, allspice, mustard, clove, and cayenne in a small bowl; set aside. 4. Make filling: Place potatoes and 1 teaspoon kosher salt in a saucepan; cover with cold water. Bring to a boil, reduce heat, and simmer until tender, 10 to 15 minutes. Use a slotted spoon to transfer potatoes to a bowl, reserving potato cooking water in the saucepan. Mash potatoes with a potato masher until smooth; set aside. 5. Melt butter in a skillet over medium heat. Add chopped onion and a pinch of salt. Cook and stir until onions turn golden, 10 to 15 minutes. Stir celery, garlic, and spice blend into the skillet with onions. Stir until onion mixture is evenly coated with spices, about 30 seconds. 6. Add ground pork, ground beef, and about 3/4 cup potato cooking water to the skillet. Cook, stirring occasionally, until meat is brown and tender and most of the liquid has evaporated, about 45 minutes. Stir in mashed potatoes, turn off heat, and let cool to room temperature. 7. Preheat the oven to 375 degrees F (190 degrees C). 8. Divide chilled dough into 2 pieces, one just slightly larger than the other. Roll the larger piece out on a lightly floured work surface into a 12-inch circle. Place in a 9-inch deep-dish pie plate. Roll top crust out into an 11-inch circle; set aside. 9. Fill bottom crust with meat mixture; smooth out the surface. 10. Make egg wash: Whisk together egg and water in a small bowl. Brush egg wash over the edges of the bottom crust. Cover with top crust; press lightly around the edges to seal. Trim excess dough and crimp the edges. Cut small slits in the top crust to allow steam to escape. Brush entire surface of pie with egg wash. 11. Bake in the preheated oven until crust is well browned, about 1 hour. Let cool to almost room temperature before serving.",
  "prep": "20 mins",
  "cook": "2 hrs",
  "total": "2 hrs 25 mins",
  "calories": "663"
},
{
  "url": "https://www.allrecipes.com/recipe/40351/lumpia-shanghai-version/",
  "name": "Lumpia (Shanghai Version)",
  "rating": "4.4",
  "ratingcount": "129",
  "ingredients": "1 pound ground pork; 1 pound ground beef; 1  medium onion, finely chopped; 1  carrot, grated; ¼ cup soy sauce; 2 tablespoons salt; 1 ½ tablespoons garlic powder; 2 ½ teaspoons black pepper; 1 (16 ounce) package spring roll wrappers; ¼ cup water, or as needed; 1 ½ quarts oil for frying",
  "directions": "1. Combine ground pork, ground beef, onion, and carrot in a large bowl; mix well with hands. Gradually blend in soy sauce, salt, garlic powder, and pepper until incorporated. 2. Working one at a time, lay a wrapper on a flat surface with a corner pointing at you. Place about 2 tablespoons filling in a line, no thicker than your thumb, across the center of the wrapper. Moisten the edges of wrapper with water. Fold the bottom edge of wrapper snugly over filling. Fold in the left and right sides of wrapper towards the center. Roll up tightly to seal in filling. 3. Heat oil in a deep fryer or heavy skillet to 375 degrees F (190 degrees C). 4. Working in batches, fry lumpia in hot oil, turning once, until golden brown, 3 to 4 minutes. Drain on a paper towel-lined plate. Cut lumpia in half, or serve as-is with dipping sauce.",
  "prep": "1 hr",
  "cook": "20 mins",
  "total": "1 hr 20 mins",
  "calories": "262"
},
{
  "url": "https://www.allrecipes.com/recipe/80398/serbian-cevapcici/",
  "name": "Serbian Ćevapčići",
  "rating": "4.6",
  "ratingcount": "79",
  "ingredients": "1 ½ pounds ground pork; 1 pound lean ground beef; ½ pound ground lamb; 1  egg white; 4 cloves garlic, minced; 2 teaspoons ground black pepper; 1 teaspoon salt; 1 teaspoon baking soda; 1 teaspoon cayenne pepper; ½ teaspoon paprika",
  "directions": "1. Gather all ingredients. 2. Preheat an outdoor grill for medium heat and lightly oil the grate. 3. Combine ground pork, ground beef, ground lamb, and egg white in a large bowl. 4. Add garlic, black pepper, salt, baking soda, cayenne pepper, and paprika. Mix well using your hands; form into finger-length sausages about 3/4-inch thick. 5. Cook sausages on the preheated grill, turning occasionally, until no longer pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "690"
},
{
  "url": "https://www.allrecipes.com/recipe/40399/the-best-meatballs/",
  "name": "The Best Meatballs",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 pound ground beef; ½ pound ground veal; ½ pound ground pork; 1 cup freshly grated Romano cheese; 2  eggs; 2 cloves garlic, minced; 1 ½ tablespoons chopped Italian flat leaf parsley; salt and ground black pepper to taste; 2 cups stale Italian bread, crumbled; 1 ½ cups lukewarm water; 1 cup olive oil",
  "directions": "1. Combine beef, veal, and pork in a large bowl. Mix in cheese, eggs, garlic, parsley, salt, and pepper. 2. Add bread crumbs and slowly mix in water, 1/2 cup at a time, until mixture is moist but still holds its shape (I usually use about 1 1/4 cups of water); shape into meatballs. 3. Heat olive oil in a large skillet; add meatballs in batches and cook until browned on all sides, slightly crisp, and cooked through, about 10 to 15 minutes. Drain on paper towels.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "613"
},
{
  "url": "https://www.allrecipes.com/recipe/46968/southern-grits-casserole/",
  "name": "Southern Grits Casserole",
  "rating": "4.5",
  "ratingcount": "268",
  "ingredients": "6 cups water; 2 cups uncooked grits; 3 cups shredded Cheddar cheese, divided; ½ cup butter, cut into pieces, divided; 1 pound ground pork sausage; 12 large eggs; ½ cup milk; salt and pepper to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a large baking dish. 2. Bring water to a boil in a large saucepan; stir in grits. Reduce the heat, cover, and simmer until liquid has been absorbed, about 5 minutes. Mix in 2 cups Cheddar cheese and 1/2 of the butter until melted. 3. Cook sausage in a skillet over medium-high heat until browned and crumbly, 5 to 7 minutes. Drain and add to grits mixture. 4. Whisk eggs and milk together in a bowl. Pour into the skillet used to cook the sausage. Lightly scramble eggs over medium-low heat, then mix into grits mixture. 5. Pour grits mixture into the prepared baking dish. Dot with remaining butter, sprinkle with remaining 1 cup Cheddar, and season with salt and pepper. 6. Bake in the preheated oven until lightly browned, about 30 minutes.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "403"
},
{
  "url": "https://www.allrecipes.com/recipe/233007/maple-breakfast-sausage/",
  "name": "Maple Breakfast Sausage",
  "rating": "4.5",
  "ratingcount": "32",
  "ingredients": "2 ½ pounds ground pork; ¼ cup maple syrup; 1 ½ tablespoons chopped fresh sage; 1 tablespoon salt; 2 ½ teaspoons fennel seed; 2 ½ teaspoons red pepper flakes; 2 ½ teaspoons garlic powder; 2 ½ teaspoons onion powder; 1 teaspoon anise seed; 1 tablespoon olive oil",
  "directions": "1. Mix pork, maple syrup, sage, salt, fennel seed, red pepper flakes, garlic powder, onion powder, and anise seed in a large bowl until evenly blended. Shape pork mixture into small patties. 2. Heat olive oil in a large skillet over medium heat; fry patties in batches until pork is browned and no longer pink in the center, 4 to 5 minutes per side.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/16359/breakfast-sausage/",
  "name": "Homemade Breakfast Sausage",
  "rating": "4.7",
  "ratingcount": "804",
  "ingredients": "1 tablespoon brown sugar; 2 teaspoons dried sage; 2 teaspoons salt; 1 teaspoon ground black pepper; ¼ teaspoon dried marjoram; ⅛ teaspoon crushed red pepper flakes; 1 pinch ground cloves; 2 pounds ground pork",
  "directions": "1. Gather all ingredients. 2. Mix together brown sugar, sage, salt, black pepper, marjoram, red pepper flakes, and cloves in a small bowl until well combined. 3. Place pork in a large bowl. Add spice mixture and mix with your hands until well combined. Form mixture into 6 patties. 4. Heat a large skillet over medium-high heat. Add patties and saute until browned and crispy, about 5 minutes per side. An instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C). 5. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "409"
},
{
  "url": "https://www.allrecipes.com/recipe/86755/garlic-rice/",
  "name": "Garlic Rice",
  "rating": "4.4",
  "ratingcount": "89",
  "ingredients": "2 tablespoons vegetable oil; 2 tablespoons ground pork; 1 ½ tablespoons chopped garlic; 4 cups cooked white rice; 1 ½ teaspoons garlic salt; ground black pepper to taste",
  "directions": "1. Heat oil in a large skillet over medium-high heat. Cook and stir ground pork and garlic in hot oil until garlic is golden brown; do not allow garlic to burn, or it will taste bitter. 2. Stir in cooked rice; season with garlic salt and black pepper. Cook and stir until heated through and well blended, about 3 minutes.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "293"
},
{
  "url": "https://www.allrecipes.com/recipe/135367/chinese-lions-head-soup/",
  "name": "Chinese Lion's Head Soup",
  "rating": "4.6",
  "ratingcount": "137",
  "ingredients": "1 pound ground pork; 1  egg; 1 tablespoon cornstarch; 2 teaspoons sesame oil; 1 tablespoon minced fresh ginger root; ¼ teaspoon monosodium glutamate (MSG) (Optional); 1 teaspoon salt; 2  green onions, chopped and divided; 1 tablespoon vegetable oil; 1 head napa cabbage, cored and cut into chunks; 2 cups low-sodium chicken broth; 2 cups water, or as needed; 1 tablespoon soy sauce; 2 teaspoons sesame oil",
  "directions": "1. Mix the ground pork, egg, cornstarch, 2 teaspoons of sesame oil, ginger, monosodium glutamate, salt, and half of the chopped green onions together in a bowl. Use your hands to mix until the ingredients are evenly distributed. Set aside. 2. Heat the vegetable oil in a wok or large skillet over high heat. When the oil is hot, fry the napa cabbage, stirring constantly, until cabbage begins to wilt, 2 to 3 minutes. Pour in the chicken broth, water, and soy sauce. Bring to a boil, then lower the heat to medium. 3. Use a spoon to form the meat mixture into 1 inch balls. Drop them into the boiling soup. When the last ball has been added, cover with a lid and simmer for 10 minutes. Taste, and adjust salt before serving. Garnish with remaining green onions and a drizzle of sesame oil.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "431"
},
{
  "url": "https://www.allrecipes.com/recipe/20752/french-canadian-tourtiere/",
  "name": "French Canadian Tourtière",
  "rating": "4.4",
  "ratingcount": "205",
  "ingredients": "1 pound lean ground pork; ½ pound lean ground beef; 1  onion, diced; 1 clove garlic, minced; ½ cup water; 1 ½ teaspoons salt; ½ teaspoon dried thyme, crushed; ¼ teaspoon ground sage; ¼ teaspoon ground black pepper; ⅛ teaspoon ground cloves; 1 (14.1 ounce) package double-crust pie pastry, thawed",
  "directions": "1. Combine pork, beef, onion, garlic, water, salt, thyme, sage, black pepper, and cloves in a saucepan. Cook, stirring occasionally, over medium heat until mixture boils. Reduce heat to low and simmer until meat is cooked, about 5 minutes. Allow to cool to room temperature. 2. Preheat the oven to 425 degrees F (220 degrees C). 3. Spoon meat mixture into pie crust. Cover with top crust and pinch edges to seal. Cut slits in top crust so steam can escape. Cover edges of pie with strips of aluminum foil. 4. Bake in the preheated oven for 20 minutes; remove foil and return to the oven. Bake until golden brown, 15 to 20 minutes. Let cool 10 minutes before slicing.",
  "prep": "40 mins",
  "cook": "40 mins",
  "total": "2 hrs",
  "calories": "405"
},
{
  "url": "https://www.allrecipes.com/recipe/17507/slow-cooker-sauerkraut-and-sausage/",
  "name": "Slow Cooker Sauerkraut and Sausage",
  "rating": "4.4",
  "ratingcount": "155",
  "ingredients": "1 (20 ounce) can sauerkraut; ¼ cup brown sugar; 1 ½ pounds bratwurst sausages; 1 medium onion, sliced; ½ cup water, or as needed (Optional)",
  "directions": "1. Mix sauerkraut and brown sugar together in a medium bowl. 2. Pour sauerkraut mixture into a slow cooker; arrange sausages and onion over top. Cook on High for 2 hours. Check for dryness, adding water as necessary. 3. Reduce the heat to Low and cook for 2 more hours.",
  "prep": "15 mins",
  "cook": "4 hrs",
  "total": "4 hrs 15 mins",
  "calories": "526"
},
{
  "url": "https://www.allrecipes.com/recipe/14597/slovak-stuffed-cabbage/",
  "name": "Slovak Stuffed Cabbage",
  "rating": "4.5",
  "ratingcount": "265",
  "ingredients": "1 pound ground beef; 1 pound ground pork; 1  onion, chopped; 1 teaspoon salt; black pepper to taste; 1 teaspoon chopped fresh parsley; ½ cup cooked brown rice; 1 ¼ teaspoons garlic salt; 2 (10.75 ounce) cans  condensed tomato soup; 27 ounces sauerkraut, drained; 1 (29 ounce) can diced tomatoes; 1 medium head cabbage; 5 slices bacon; 2 tablespoons white sugar; 3 cups water",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Bring a pot of water to a boil. 2. Mix beef and pork together. Stir in onion, cooked rice, parsley, salt, pepper, garlic salt and 1/2 can of tomato soup. Mix well. 3. Core head of cabbage, place in boiling water and boil until partly cooked. Separate leaves and trim stems. Reserve about 24 to 32 whole leaves. Cut remaining leaves and line the bottom of large roasting pan. 4. Lightly pack a small handful of the meat mixture and place in the center of a cabbage leaf. Fold top part of leaf over mixture, then fold in the sides and roll until mixture is completely encased. Lay rolls on top of torn cabbage leaves in pan. Place sauerkraut evenly over rolls. Lay bacon on top of sauerkraut. Sprinkle with 1 to 2 tablespoons of sugar. Mix chopped tomatoes and soup with water and pour over rolls. Add additional water to reach top of cabbage rolls. 5. Bake at 350 degrees F (175 degrees C) for 1 1/2 hours or until cooked through.",
  "prep": "30 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs",
  "calories": "556"
},
{
  "url": "https://www.allrecipes.com/recipe/284116/egg-roll-in-a-bowl/",
  "name": "Egg Roll in a Bowl",
  "rating": "4.6",
  "ratingcount": "29",
  "ingredients": "6  (3.5 inch square) wonton wrappers; 2 teaspoons vegetable oil; 3 ½ cups shredded green cabbage; 1 cup julienned carrot; ¼ cup julienned red bell pepper; ⅓ cup thinly sliced green onions; 2 cloves garlic, finely minced; 2 tablespoons soy sauce; 1 tablespoon rice vinegar; 1 tablespoon sake; ¼ teaspoon sesame oil; 1 teaspoon white sugar; ½ teaspoon freshly grated ginger; 1 pinch cayenne pepper; ¼ teaspoon white pepper; 1 teaspoon ketchup; ½ teaspoon cornstarch; ½ pound ground pork",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Cut wonton wrappers into 1/4-inch strips. Transfer cut wonton wrappers to a baking pan and toss with oil. Spread out evenly. 3. Bake in the preheated oven until browned, about 12 minutes. Let cool and reserve. 4. Combine cabbage, carrot, bell pepper, green onions, and garlic for the bowl. Set aside. 5. Mix soy sauce, rice vinegar, sake, sesame oil, sugar, ginger, cayenne, pepper, ketchup, and cornstarch together for sauce in a bowl and reserve. 6. Add pork to a large skillet set over medium-high heat. Brown the meat well, while breaking up into small crumbles as it cooks, 5 to 7 minutes. Add the vegetable mixture and toss with the meat to combine. Cook, stirring, just until the veggies start to soften, about 2 minutes. 7. Stir in the sauce and toss everything to combine. Cook and stir until the sauce has coated everything evenly, and the vegetables are cooked to desired doneness, 1 to 2 minutes more. Serve in a bowl with crispy wonton strips on top.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "463"
},
{
  "url": "https://www.allrecipes.com/recipe/61913/authentic-chinese-egg-rolls-from-a-chinese-person/",
  "name": "Authentic Chinese Egg Rolls (from a Chinese person)",
  "rating": "4.7",
  "ratingcount": "240",
  "ingredients": "4 teaspoons vegetable oil, divided; 3 large eggs, beaten; 1 medium head cabbage, finely shredded; ½  carrot, julienned; 1 pound Chinese barbequed or roasted pork, cut into matchsticks; 1 (8 ounce) can shredded bamboo shoots; 1 cup dried, shredded wood ear mushroom, rehydrated; 2  green onions, thinly sliced; 2 ½ teaspoons soy sauce; 1 teaspoon salt; 1 teaspoon sugar; ½ teaspoon monosodium glutamate (MSG); 1 (14 ounce) package egg roll wrappers; 1  egg white, beaten; 4 cups oil for frying, or as needed",
  "directions": "1. Heat 1 teaspoon vegetable oil in a wok or large skillet over medium heat. Pour in beaten eggs and cook, without stirring, until firmed up. Flip eggs over and cook for an additional 20 seconds to firm the other side. Set egg pancake aside to cool, then slice into thin strips. 2. Heat remaining vegetable oil in a wok or large skillet over high heat. Stir in cabbage and carrot; cook for 2 minutes to wilt. Add pork, bamboo shoots, mushroom, green onions, soy sauce, salt, sugar, and MSG; continue cooking until vegetables soften, about 6 minutes. Stir in sliced egg, then spread the mixture out onto a pan, and refrigerate until cold, about 1 hour. 3. To assemble the egg rolls: Place a wrapper onto your work surface with one corner pointing towards you. Place about 3 tablespoons of cooled filling in a heap onto the bottom third of the wrapper. Brush a little beaten egg white onto the top two edges of the wrapper, then fold the bottom corner over the filling and roll firmly to the halfway point. Fold the left and right sides snugly over the egg roll, then continue rolling until the top corners seal the egg roll with the egg white. Repeat with remaining egg roll wrappers, covering finished egg rolls with plastic wrap to keep from drying out. 4. Heat about 6 inches of oil in a wok or deep-fryer to 350 degrees F (175 degrees C). 5. Fry egg rolls 3 or 4 at a time until golden brown, 5 to 7 minutes. Drain on paper towels.",
  "prep": "1 hr",
  "cook": "30 mins",
  "total": "2 hrs 30 mins",
  "calories": "169"
},
{
  "url": "https://www.allrecipes.com/recipe/17151/old-italian-meat-sauce/",
  "name": "Old Italian Meat Sauce",
  "rating": "4.6",
  "ratingcount": "116",
  "ingredients": "2 pounds lean ground beef; 1 pound ground pork; 2 tablespoons olive oil; 2  onions, chopped; 1 clove garlic, crushed; 3 cups red wine, divided; 2 pounds fresh mushrooms, sliced; 4 tablespoons chopped fresh oregano; ¼ teaspoon dried rosemary; ¼ teaspoon chopped fresh thyme; 3 (29 ounce) cans tomato sauce; 1 (6 ounce) can tomato paste",
  "directions": "1. Heat a large skillet over medium heat. Cook beef and pork in the hot skillet until crumbly and no longer pink, 5 to 7 minutes. Remove from the heat and set aside. 2. Warm olive oil in another large skillet over medium heat. Sauté onions and garlic in hot oil until onions are tender, about 5 minutes. Pour in 1/2 cup wine; mix well. 3. Add mushrooms, oregano, rosemary, and thyme to onion mixture. Pour in another 1/2 cup wine; cook and stir until mushrooms are tender, about 5 minutes. 4. Add browned meat, tomato sauce, and tomato paste to mushroom mixture. Reduce the heat and simmer for 1 hour. 5. Pour in remaining 2 cups wine. Continue simmering for 2 to 3 hours, stirring occasionally; serve.",
  "prep": "30 mins",
  "cook": "3 hrs 15 mins",
  "total": "3 hrs 45 mins",
  "calories": "296"
},
{
  "url": "https://www.allrecipes.com/recipe/16539/italian-style-sausage/",
  "name": "Italian Style Sausage",
  "rating": "4.7",
  "ratingcount": "158",
  "ingredients": "1 teaspoon ground black pepper; 1 teaspoon dried parsley; 1 teaspoon Italian-style seasoning; ½ teaspoon garlic powder; ⅛ teaspoon crushed red pepper flakes; ¾ teaspoon crushed anise seeds; ½ teaspoon paprika; ½ teaspoon dried minced onion; 2 teaspoons salt; 2 pounds ground pork",
  "directions": "1. In a small bowl, combine the ground black pepper, parsley, Italian-style seasoning, garlic powder, crushed red pepper flakes, anise, paprika, minced onion flakes and salt; mix well. 2. Place pork in a separate large bowl and add the spice mix to it. Mix this thoroughly with your hands. 3. In a large skillet over medium high heat, saute the seasoned pork for 10 minutes, or until well browned and crumbly.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "315"
},
{
  "url": "https://www.allrecipes.com/recipe/157593/pork-and-bamboo-shoots/",
  "name": "Pork and Bamboo Shoots",
  "rating": "4.0",
  "ratingcount": "5",
  "ingredients": "1 tablespoon peanut oil; 1 (14 ounce) can thinly sliced bamboo shoots; 2 tablespoons peanut oil; 2 cloves garlic, minced; 1  fresh red chile pepper, seeded and minced; ½ teaspoon crushed red pepper flakes; 3 ounces ground pork; 1 teaspoon Shaoxing rice wine; salt to taste; 2 teaspoons rice vinegar; 2 teaspoons soy sauce; 3 tablespoons chicken broth; 3  green onions, thinly sliced; 1 teaspoon sesame oil",
  "directions": "1. Heat one tablespoon peanut oil in a wok set over medium heat. Add the bamboo shoots to the pan; stir-fry until dry and fragrant, about 3 minutes. Remove from wok and reserve. 2. Increase temperature to high, and pour in the remaining peanut oil. Quickly fry the garlic, red chile, and red pepper flakes in the hot oil until fragrant. Stir in the pork, and continue to stir-fry until it is cooked through. Pour in the wine; season with salt to taste. 3. Return the bamboo shoots to the wok, and heat until sizzly. Stir in the rice vinegar, soy sauce, chicken broth, and additional salt to taste. Cook and stir for 1 to 2 minutes to allow the flavor to penetrate the bamboo shoots. At the end of cooking, stir in green onions. Remove wok from heat; stir in sesame oil before serving.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "353"
},
{
  "url": "https://www.allrecipes.com/recipe/84858/hawaiian-pork-hash/",
  "name": "Hawaiian Pork Hash",
  "rating": "4.7",
  "ratingcount": "30",
  "ingredients": "¼ pound ground pork; ¼ pound shrimp - peeled, deveined and minced to a paste; 1  egg white; 2 tablespoons chopped water chestnuts; 2 tablespoons chopped green onion; 2 tablespoons cornstarch; 2 teaspoons soy sauce; 1 teaspoon white sugar; 1 teaspoon minced garlic; 1 teaspoon oyster sauce; ¼ teaspoon salt; ¼ teaspoon ground black pepper; ¼ teaspoon sesame oil; 1 (14 ounce) package round dumpling skins",
  "directions": "1. In a medium bowl, mix together the ground pork, shrimp, egg white, water chestnuts, green onion, cornstarch, soy sauce, sugar, garlic, oyster sauce, salt, pepper, and sesame oil. 2. Place about 1 tablespoon of this filling onto the center of each dumpling wrapper, and bring the sides up to the top. Do not seal the top, as these dumplings are left open. Place dumplings in a steamer. 3. Set the steamer basket over a pan or wok of boiling water. Steam for 30 minutes.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "64"
},
{
  "url": "https://www.allrecipes.com/recipe/278812/instant-pot-cabbage-roll-soup/",
  "name": "Instant Pot Cabbage Roll Soup",
  "rating": "4.6",
  "ratingcount": "29",
  "ingredients": "2 tablespoons olive oil; 1 pound ground beef; 1 pound ground pork; 1 cup diced onion; 1 teaspoon minced garlic; 2 tablespoons brown sugar; 2 tablespoons Worcestershire sauce; 1 tablespoon apple cider vinegar; 1 teaspoon paprika; 1 teaspoon salt; 1 teaspoon ground black pepper; 2  bay leaves; 6 cups beef broth; 1 medium head cabbage, shredded; 1 (15 ounce) can tomato sauce; 1 (14.5 ounce) can diced tomatoes; 1 cup uncooked jasmine rice",
  "directions": "1. Turn on a multi-functional pressure cooker (such as Instant Pot) and select Saute function. Heat olive oil and cook ground beef, ground pork, and onion until meat is crumbly and onions are soft and translucent, about 5 minutes. Stir in garlic. Turn off Saute function and drain grease. 2. Season with brown sugar, Worcestershire sauce, apple cider vinegar, paprika, salt, pepper, and bay leaves. Mix in beef broth, cabbage, tomato sauce, diced tomatoes, and rice. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 15 minutes. Allow 10 to 15 minutes for pressure to build. 3. Release pressure using the natural-release method according to manufacturer's instructions, about 15 minutes. Unlock and remove the lid. Stir soup and serve.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "55 mins",
  "calories": "356"
},
{
  "url": "https://www.allrecipes.com/recipe/259373/chiles-en-nogada-mexican-stuffed-poblano-peppers-in-walnut-sauce/",
  "name": "Chiles en Nogada (Mexican Stuffed Poblano Peppers in Walnut Sauce)",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "8  poblano peppers; 1 tablespoon olive oil; 1  onion, chopped; 2 cloves garlic, finely chopped; 1 ¾ pounds ground pork; 2 cups peeled, seeded, and chopped tomatoes; 1  ripe plantain, chopped; 1  apple, chopped; 1  fresh peach, chopped; 1 bunch fresh parsley, chopped; 2 tablespoons chopped candied orange peel; 2 tablespoons pine nuts; 2 tablespoons raisins; 2 tablespoons blanched almonds, chopped; 4  whole cloves, ground; salt and pepper to taste; 2 ½ cups chopped walnuts; 1 ¾ cups milk; ¾ cup soft goat cheese; 1 tablespoon white sugar; 1 (1 inch) piece cinnamon stick; 1 ½ cups pomegranate seeds; ½ cup chopped fresh parsley",
  "directions": "1. Roast poblano chiles over an open flame on a gas stove or grill until the skin is black and charred on all sides, turning often, 10 to 15 minutes. 2. Place the charred chiles in a plastic bag or in a large bowl covered with plastic wrap. Allow to sit for 5 to 10 minutes, then open and peel off the skin. Cut a slit in each chile lengthwise and remove the seeds. 3. Heat olive oil in a large pot over medium heat. Add onion and garlic and cook until soft and translucent, 3 to 4 minutes. Add ground pork and cook until browned, breaking up with a spoon while cooking, about 7 minutes. Mix in tomatoes, plantain, apple, peach, parsley, candied orange peel, pine nuts, raisins, almonds, cloves, salt, and pepper. Simmer until filling is cooked through and flavors are well combined, about 10 minutes. 4. Combine walnuts, milk, goat cheese, sugar, and cinnamon stick in a blender; blend until walnut sauce is smooth and creamy. 5. Fill each poblano chile with the pork filling and place on a plate. Spoon walnut sauce over chile and sprinkle with pomegranate seeds and parsley.",
  "prep": "1 hr",
  "cook": "30 mins",
  "total": "1 hr 35 mins",
  "calories": "724"
},
{
  "url": "https://www.allrecipes.com/recipe/204129/dim-sum-asian-dumplings/",
  "name": "Dim Sum Asian Dumplings",
  "rating": "4.5",
  "ratingcount": "13",
  "ingredients": "1 pound ground pork; 1 large onion, chopped; ½ bunch cilantro, chopped; ½ teaspoon crushed red pepper flakes; 2 teaspoons red curry paste; ½ teaspoon garam masala; ½ teaspoon chili powder; ¼ teaspoon onion powder; ¼ teaspoon garlic powder; 1 cup all-purpose flour; ¼ cup water as needed; 3 tablespoons peanut butter; ½ teaspoon cayenne pepper; 1 teaspoon white sugar; 1 teaspoon vegetable oil",
  "directions": "1. Combine pork, onion, cilantro, red pepper flakes, red curry paste, garam masala, chili powder, onion powder, and garlic powder in a bowl. Mix well, then set aside. Place flour into a separate bowl. Slowly stir in the water as needed until a soft dough is achieved. There may be some water left over. Roll out walnut-sized balls of dough into thin circles. 2. Fill each of the wrappers with about 1 tablespoon of the pork mixture. Moisten the edges of the wrapper, then fold in half, sealing to create a half moon shape. Repeat with the remaining wrappers and filling. Place the dumplings in a steamer over 1 inch of boiling water, and cover. Steam until the dough becomes glossy, about 10 minutes. 3. To make sauce: Combine peanut butter, cayenne pepper, sugar, and vegetable oil in a microwave-safe glass or ceramic bowl. Cook in the microwave on High for 30 seconds and stir. Serve with the dumplings.",
  "prep": "40 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "344"
},
{
  "url": "https://www.allrecipes.com/recipe/160241/my-favorite-pork-turkey-meatloaf/",
  "name": "My Favorite Pork Turkey Meatloaf",
  "rating": "4.6",
  "ratingcount": "70",
  "ingredients": "1 pound ground turkey; 1 pound ground pork; 1 tablespoon cooking oil; 1  carrot, minced; ½  red bell pepper, minced; ½  onion, minced; 2 cloves garlic, minced; ⅓ cup thawed frozen chopped spinach; ½ cup bread crumbs; ½ cup wheat germ (Optional); 2  eggs, room temperature; 2 tablespoons ketchup; 2 teaspoons salt; 1 teaspoon ground black pepper; 1 tablespoon honey; 1 tablespoon ketchup",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil. 2. Set the ground turkey and ground pork out at room temperature to warm slightly. 3. Heat the oil in a skillet over medium heat; cook the carrot, bell pepper, onion, garlic, and spinach in the heated oil until soft; set aside to cool. 4. Mix together the turkey, pork, bread crumbs, wheat germ, eggs, 2 tablespoons ketchup, salt, and pepper in a large bowl. Add the vegetable mixture and continue to mix until evenly combined; shape into a loaf; lay on the prepared baking sheet. 5. Whisk together the honey and 1 tablespoon ketchup in a small bowl; spread over the meatloaf. 6. Bake in the preheated oven until no longer pink in the center, 60 to 70 minutes; remove to a serving platter and allow to rest 5 minutes before slicing.",
  "prep": "25 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 40 mins",
  "calories": "310"
},
{
  "url": "https://www.allrecipes.com/recipe/45652/the-sarges-goetta-german-breakfast-treat/",
  "name": "The Sarge's Goetta - German Breakfast Treat",
  "rating": "4.6",
  "ratingcount": "107",
  "ingredients": "3 quarts water; 2 tablespoons salt; 2 teaspoons ground black pepper; 5 cups steel cut oats; 2 pounds ground beef; 2 pounds ground pork sausage; 2 large onions, finely chopped; ¼ cup cooking oil",
  "directions": "1. Bring water, salt, and pepper to boil in a slow cooker set to High. Stir in steel cut oats, cover, and cook 90 minutes. 2. In a large bowl, mix beef, pork, and onions. Stir into the oat mixture, and reduce heat to Low. Cover, and continue cooking 3 hours, stirring occasionally. 3. Transfer the mixture to a medium baking pan, and cool until semi-solid. Turn out onto wax paper, and chill 1 hour in the refrigerator, or until firm. 4. Heat oil in a large, heavy skillet over medium high heat. Cut the refrigerated mixture into thin slices. Cook slices one at a time in the heated oil until evenly brown.",
  "prep": "5 hrs",
  "cook": "10 mins",
  "total": "6 hrs 30 mins",
  "calories": "511"
}]