[{
  "url": "https://www.allrecipes.com/recipe/213268/classic-goulash/",
  "name": "Classic Goulash",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "1 tablespoon olive oil; 1 large yellow onion, chopped; 2 pounds lean ground beef; 3 cloves garlic, chopped; 3 cups water; 2 (15 ounce) cans tomato sauce; 2 (14.5 ounce) cans diced tomatoes; 3 tablespoons soy sauce; 2 tablespoons dried Italian herb seasoning; 1 tablespoon seasoned salt, or to taste; 3  bay leaves; 2 cups uncooked elbow macaroni",
  "directions": "1. Heat olive oil in a large Dutch oven over medium-high heat. Add onion and cook 3 minutes, stirring often. Add ground beef and cook, breaking up the meat until it is evenly browned, about 5 minutes. Add garlic and cook 3 minutes, stirring often. 2. Stir in water, tomato sauce, diced tomatoes, soy sauce, Italian seasoning, seasoned salt, and bay leaves. Bring to a simmer, cover and cook 5 minutes, stirring halfway through. 3. Stir in uncooked macaroni, cover, and simmer over medium heat until pasta is tender, 11 to 13 minutes, stirring occasionally. Remove from heat, discard bay leaves, and serve.",
  "prep": "8 mins",
  "cook": "27 mins",
  "total": "35 mins",
  "calories": "476"
},
{
  "url": "https://www.allrecipes.com/recipe/71722/asian-lettuce-wraps/",
  "name": "Asian Lettuce Wraps",
  "rating": "4.7",
  "ratingcount": "2",
  "ingredients": "16  Boston Bibb or butter lettuce leaves; 1 pound lean ground beef; 1 tablespoon cooking oil; 1 large onion, chopped; ¼ cup hoisin sauce; 2 cloves fresh garlic, minced; 1 tablespoon soy sauce; 1 tablespoon rice wine vinegar; 2 teaspoons minced pickled ginger; 1 dash Asian chile pepper sauce, or to taste (Optional); 1 (8 ounce) can water chestnuts, drained and finely chopped; 1 bunch green onions, chopped; 2 teaspoons Asian (dark) sesame oil",
  "directions": "1. Rinse whole lettuce leaves and pat dry, being careful not to tear them; set aside. 2. Heat oil in a large skillet over medium-high heat. Add beef; cook and stir until browned and crumbly, 5 to 7 minutes. Drain and discard grease; transfer beef to a bowl. Add onion to the same skillet; cook and stir until just tender, 5 to 7 minutes. 3. Stir in hoisin sauce, garlic, soy sauce, vinegar, ginger, and chile pepper sauce until well combined. Add water chestnuts, green onions, sesame oil, and cooked beef; cook and stir until the onions just begin to wilt, about 2 minutes. 4. Arrange lettuce leaves around the outer edge of a large serving platter; spoon beef mixture in the center.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "388"
},
{
  "url": "https://www.allrecipes.com/recipe/16248/easy-homemade-chili/",
  "name": "Easy Homemade Chili",
  "rating": "4.3",
  "ratingcount": "464",
  "ingredients": "1 pound ground beef; 1  onion, chopped; 1 (15 ounce) can tomato sauce; 1 (15 ounce) can kidney beans; 1 (14.5 ounce) can stewed tomatoes; 1 ½ cups water; 1 pinch chili powder; 1 pinch garlic powder; salt and pepper to taste",
  "directions": "1. Place ground beef and onion in a large saucepan over medium heat; cook and stir until meat is browned and onion is tender, about 5 to 7 minutes. 2. Stir in tomato sauce, kidney beans, stewed tomatoes with juice, and water. Season with chili powder, garlic powder, salt, and black pepper. Bring to a boil, reduce heat to low, cover and let simmer for 15 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "394"
},
{
  "url": "https://www.allrecipes.com/recipe/26661/stuffed-cabbage-rolls/",
  "name": "Stuffed Cabbage Rolls",
  "rating": "4.4",
  "ratingcount": "1",
  "ingredients": "⅔ cup water; ⅓ cup uncooked white rice; 8  cabbage leaves; 1 pound lean ground beef; ¼ cup chopped onion; 1  egg, slightly beaten; 1 (10.5 ounce) can condensed tomato soup, divided; 1 teaspoon salt; ¼ teaspoon ground black pepper",
  "directions": "1. Bring water and rice to a boil in a saucepan. Reduce heat to low, cover, and simmer until rice is tender and liquid has been absorbed, about 20 minutes. 2. Meanwhile, bring a large, wide saucepan of lightly salted water to a boil. Add cabbage leaves and cook for 2 to 4 minutes or until softened; drain. 3. Combine ground beef, 1 cup of cooked rice, onion, egg, 2 tablespoons of tomato soup, salt, and pepper in a large bowl; mix thoroughly. 4. Spoon about 2 tablespoons of beef mixture onto each cabbage leaf; bring one end of the cabbage leaf over the mixture, rolling and tucking in the ends to prevent the filling from falling out. 5. Place cabbage rolls in a large skillet over medium heat; pour remaining tomato soup on top. Cover and bring to a boil; reduce heat to low and simmer for about 40 minutes, stirring and basting with the liquid often.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "223"
},
{
  "url": "https://www.allrecipes.com/recipe/275548/air-fryer-meatballs/",
  "name": "Air Fryer Meatballs",
  "rating": "4.8",
  "ratingcount": "42",
  "ingredients": "16 ounces lean ground beef; 4 ounces ground pork; ½ cup grated Parmesan cheese; ⅓ cup Italian seasoned bread crumbs; 1  egg; 2 cloves garlic, minced; 1 teaspoon Italian seasoning; ½ teaspoon salt",
  "directions": "1. Preheat an air fryer to 350 degrees F (175 degrees C). 2. Combine beef, pork, Parmesan cheese, bread crumbs, egg, garlic, Italian seasoning, and salt in a large bowl. Mix until evenly combined. Form into 16 equal meatballs (a small ice cream scoop is helpful) and place on a baking sheet. 3. Place 1/2 of the meatballs in the basket of the air fryer and cook 8 minutes. Shake the basket and cook 2 minutes more. Transfer to a serving plate and let rest for 5 minutes. Repeat with remaining meatballs.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "457"
},
{
  "url": "https://www.allrecipes.com/recipe/222582/baked-spaghetti/",
  "name": "Baked Spaghetti",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 (16 ounce) package spaghetti; 1 pound ground beef; 1  onion, chopped; 1 (32 ounce) jar meatless spaghetti sauce; ½ teaspoon seasoned salt; 2  eggs; ⅓ cup grated Parmesan cheese; 5 tablespoons butter, melted; 2 cups small curd cottage cheese; 5 cups shredded mozzarella cheese, divided",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish. 2. Bring a large pot of lightly salted water to a boil. Cook spaghetti in boiling water, stirring occasionally, until tender but firm to the bite, about 12 minutes. Drain. 3. Meanwhile, heat a large skillet over medium heat. Cook and stir beef and onion in the hot skillet until meat is browned and onion is soft and translucent, about 5 to 7 minutes. Drain excess oil from the pan; stir in spaghetti sauce and seasoned salt. 4. Whisk eggs, Parmesan, and butter in a large bowl. Add spaghetti and toss to coat. 5. Place 1/2 of the spaghetti mixture in the prepared baking dish. Top with 1/2 of the cottage cheese, 2 cups mozzarella, and 1/2 of the meat sauce. Repeat layers. Cover with aluminum foil. 6. Bake in the preheated oven for 40 minutes. Remove the foil and sprinkle with remaining 1 cup mozzarella. Continue to bake until cheese is melted and lightly browned, 20 to 25 minutes.",
  "prep": "15 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 30 mins",
  "calories": "797"
},
{
  "url": "https://www.allrecipes.com/recipe/268091/easy-korean-ground-beef-bowl/",
  "name": "Easy Korean Ground Beef Bowl",
  "rating": "4.7",
  "ratingcount": "586",
  "ingredients": "1 pound lean ground beef; 5 cloves garlic, crushed; 1 tablespoon freshly grated ginger; 2 teaspoons toasted sesame oil; ½ cup reduced-sodium soy sauce; ⅓ cup light brown sugar; ¼ teaspoon crushed red pepper; 6  green onions, chopped, divided; 4 cups hot cooked brown rice; 1 tablespoon toasted sesame seeds",
  "directions": "1. Heat a large skillet over medium-high heat. Add beef and cook, stirring and crumbling into small pieces until browned, 5 to 7 minutes. Drain excess grease. 2. Stir in garlic, ginger, and sesame oil and cook until fragrant, about 2 minutes. Stir in soy sauce, brown sugar, and red pepper. Cook until beef absorbs some sauce, about 7 minutes. Add 1/2 of chopped green onions. 3. Serve over hot cooked rice; garnish with sesame seeds and remaining green onions.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "574"
},
{
  "url": "https://www.allrecipes.com/recipe/72657/best-hamburger-ever/",
  "name": "Best Hamburger Ever",
  "rating": "4.3",
  "ratingcount": "787",
  "ingredients": "1 ½ pounds lean ground beef; ½  onion, finely chopped; ½ cup shredded Colby Jack or Cheddar cheese; 1  egg; 1 (1 ounce) envelope dry onion soup mix; 1 clove garlic, minced; 1 tablespoon garlic powder; 1 teaspoon soy sauce; 1 teaspoon Worcestershire sauce; 1 teaspoon dried parsley; 1 teaspoon dried basil; 1 teaspoon dried oregano; ½ teaspoon crushed dried rosemary; salt and pepper to taste",
  "directions": "1. Preheat an outdoor grill for high heat and lightly oil the grate. 2. Meanwhile, combine ground beef, onion, cheese, egg, onion soup mix, minced garlic, garlic powder, soy sauce, Worcestershire sauce, parsley, basil, oregano, rosemary, salt, and pepper in a large bowl. Use your hands to form the mixture into 4 patties. 3. Cook patties on the preheated grill until no longer pink in the center and the juices run clear, about 4 to 5 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "445"
},
{
  "url": "https://www.allrecipes.com/recipe/16678/slow-cooker-taco-soup/",
  "name": "Slow Cooker Taco Soup",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "1 pound ground beef; 1  onion, chopped; 1 (16 ounce) can chili beans, with liquid; 1 (15 ounce) can kidney beans with liquid; 1 (15 ounce) can whole kernel corn, with liquid; 1 (8 ounce) can tomato sauce; 2 cups water; 2 (14.5 ounce) cans peeled and diced tomatoes; 1 (4 ounce) can diced green chile peppers; 1 (1.25 ounce) package taco seasoning mix",
  "directions": "1. Gather all ingredients. 2. In a medium skillet, cook the ground beef until browned over medium heat. Drain, and set aside. 3. Place the ground beef, onion, chili beans, kidney beans, corn, tomato sauce, water, diced tomatoes, green chile peppers and taco seasoning mix in a slow cooker. 4. Mix to blend, and cook on Low setting for 8 hours.",
  "prep": "10 mins",
  "cook": "8 hrs",
  "total": "8 hrs 10 mins",
  "calories": "362"
},
{
  "url": "https://www.allrecipes.com/recipe/21353/italian-spaghetti-sauce-with-meatballs/",
  "name": "Italian Spaghetti Sauce with Meatballs",
  "rating": "4.6",
  "ratingcount": "3",
  "ingredients": "1 pound lean ground beef; 1 cup fresh bread crumbs; 1 tablespoon dried parsley; 1 tablespoon grated Parmesan cheese; ¼ teaspoon ground black pepper; ⅛ teaspoon garlic powder; 1  egg, beaten; ¾ cup chopped onion; 5 cloves garlic, minced; ¼ cup olive oil; 2 (28 ounce) cans whole peeled tomatoes; 2 teaspoons salt; 1 teaspoon white sugar; 1  bay leaf; 1 (6 ounce) can tomato paste; ¾ teaspoon dried basil; ½ teaspoon ground black pepper",
  "directions": "1. Gather all ingredients. 2. In a large bowl, combine ground beef, bread crumbs, parsley, Parmesan, 1/4 teaspoon black pepper, garlic powder and beaten egg. Mix well and form into 12 balls. Store, covered, in refrigerator until needed. 3. In a large saucepan over medium heat, saute onion and garlic in olive oil until onion is translucent. 4. Stir in tomatoes, salt, sugar and bay leaf. Cover, reduce heat to low, and simmer 90 minutes. 5. Stir in tomato paste, basil, 1/2 teaspoon pepper and meatballs and simmer 30 minutes more. 6. Serve hot and enjoy!",
  "prep": "20 mins",
  "cook": "2 hrs",
  "total": "2 hrs 20 mins",
  "calories": "347"
},
{
  "url": "https://www.allrecipes.com/recipe/231082/just-like-wendys-chili/",
  "name": "Just Like Wendy's Chili",
  "rating": "4.8",
  "ratingcount": "823",
  "ingredients": "2 tablespoons olive oil; 2 pounds ground beef; 2 stalks celery, chopped; 1  onion, chopped; 1  green bell pepper, chopped; 3 (14 ounce) cans stewed tomatoes; 1 (14 ounce) can tomato sauce; 1 (10 ounce) can diced tomatoes with green chiles (such as RO*TEL); 1 cup water; 2 (1.25 ounce) packages chili seasoning (such as McCormick® Mild Chili Seasoning Mix); 1 (14 ounce) can kidney beans, undrained; 1 (14 ounce) can pinto beans, undrained; salt and ground black pepper to taste; 1 tablespoon white vinegar, or more to taste",
  "directions": "1. Heat olive oil in a large pot over medium-high heat. Press ground beef into the hot oil to form one large patty; let the bottom brown, 8 to 10 minutes. 2. Stir and break browned beef into crumbles. Continue to cook until no longer pink, about 5 minutes longer. 3. Stir celery, onion, and bell pepper into beef and cook until onion is translucent, about 5 minutes. 4. Pour in stewed tomatoes, tomato sauce, diced tomatoes with green chiles, and water. Break apart large chunks of stewed tomatoes. Stir in chili seasoning. Stir in kidney and pinto beans. Season with salt and pepper. 5. Bring to a boil, then reduce heat to low, and simmer for 1 hour. 6. Mix vinegar into chili just before serving.",
  "prep": "15 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 35 mins",
  "calories": "326"
},
{
  "url": "https://www.allrecipes.com/recipe/11959/slow-cooker-lasagna/",
  "name": "Slow Cooker Lasagna",
  "rating": "4.2",
  "ratingcount": "1",
  "ingredients": "1 pound lean ground beef; 1 medium onion, chopped; 2 teaspoons minced garlic; 1 (29 ounce) can tomato sauce; 1 (6 ounce) can tomato paste; 1 ½ teaspoons salt; 1 teaspoon dried oregano; 16 ounces shredded mozzarella cheese; 12 ounces cottage cheese; ½ cup grated Parmesan cheese; 1 (12 ounce) package lasagna noodles",
  "directions": "1. Cook ground beef, onion, and garlic in a large skillet over medium heat until the meat is browned. Add tomato sauce, tomato paste, salt, and oregano and stir until well combined and heated through. 2. Stir mozzarella, cottage cheese, and Parmesan together in a large bowl. 3. Spoon a layer of the meat mixture onto the bottom of a slow cooker. Add a double layer of uncooked lasagna noodles, breaking noodles to fit into cooker as needed. Top noodles with a portion of cheese mixture. Repeat the layering of sauce, noodles, and cheese until all the ingredients are used. 4. Cover and cook on Low for 4 to 6 hours.",
  "prep": "20 mins",
  "cook": "4 hrs 10 mins",
  "total": "4 hrs 30 mins",
  "calories": "446"
},
{
  "url": "https://www.allrecipes.com/recipe/20680/easy-mexican-casserole/",
  "name": "Easy Mexican Casserole",
  "rating": "4.4",
  "ratingcount": "2",
  "ingredients": "1 pound lean ground beef; 2 cups salsa; 1 (16 ounce) can chili beans, drained; 3 cups tortilla chips, crushed; 2 cups sour cream; 1 (2 ounce) can sliced black olives, drained; ½ cup chopped green onion; ½ cup chopped fresh tomato; 2 cups shredded Cheddar cheese",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Spray a 9x13-baking dish with cooking spray. 2. Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 8 to 10 minutes. 3. Stir in salsa, reduce heat, and simmer until liquid is absorbed, about 20 minutes. Stir in beans; cook until heated through. 4. Spread crushed tortilla chips over the bottom of the baking dish; spoon beef mixture on top. Spread sour cream over beef, then sprinkle olives, green onion, and tomatoes on top. Cover with Cheddar cheese. 5. Bake in the preheated oven until hot and bubbly, about 30 minutes.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "632"
},
{
  "url": "https://www.allrecipes.com/recipe/25473/the-perfect-basic-burger/",
  "name": "The Perfect Basic Burger",
  "rating": "4.4",
  "ratingcount": "231",
  "ingredients": "1 large egg; ½ teaspoon salt; ½ teaspoon ground black pepper; 1 pound ground beef; ½ cup fine dry bread crumbs",
  "directions": "1. Preheat an outdoor grill for high heat and lightly oil grate. 2. Whisk together egg, salt, and pepper in a medium bowl. 3. Add ground beef and bread crumbs and mix with your hands or a fork until well blended. 4. Form into four 3/4-inch-thick patties. 5. Place patties on the preheated grill. Cover and cook 6 to 8 minutes per side, or to desired doneness. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). 6. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "317"
},
{
  "url": "https://www.allrecipes.com/recipe/12011/easy-lasagna-ii/",
  "name": "Easy Lasagna",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 pound lean ground beef; 1 (32 ounce) jar spaghetti sauce; 32 ounces cottage cheese; 3 cups shredded mozzarella cheese, divided; 2  eggs; ½ cup grated Parmesan cheese; 2 teaspoons dried parsley; salt to taste; ground black pepper to taste; 9  lasagna noodles; ½ cup water",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 8 to 10 minutes. Drain and discard grease. Stir in spaghetti sauce and simmer for 5 minutes. 3. Combine cottage cheese, 2 cups of mozzarella cheese, eggs, 1/2 of the grated Parmesan cheese, dried parsley, salt, and pepper in a large bowl. 4. Spread 3/4 cup of sauce in a 9x13-inch baking dish. Cover with 3 uncooked lasagna noodles, 1 3/4 cups of cheese mixture, and 1/4 cup sauce; repeat layers once more. Top with remaining 3 noodles, sauce, mozzarella, and Parmesan cheese. Pour 1/2 cup water along the edges of the dish. Cover tightly with aluminum foil. 5. Bake in the preheated oven for 45 minutes. Uncover and bake for an additional 10 minutes. Let stand 10 minutes before serving.",
  "prep": "10 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 30 mins",
  "calories": "377"
},
{
  "url": "https://www.allrecipes.com/recipe/255259/homemade-chili/",
  "name": "Homemade Chili",
  "rating": "4.7",
  "ratingcount": "75",
  "ingredients": "2 tablespoons olive oil; 1 large onion, chopped; 2 cloves garlic, minced, or more to taste; 2 pounds lean ground beef; 2 (16 ounce) cans kidney beans, rinsed and drained; 1 (28 ounce) can diced tomatoes; 1 (15 ounce) can tomato puree; 1 cup water; 1 (4 ounce) can chopped green chile peppers; 2 tablespoons mild chili powder; 2 teaspoons salt; 2 teaspoons ground cumin; 1 teaspoon ground black pepper",
  "directions": "1. Heat oil in a large skillet over medium-low heat. Add onion and garlic; cook and stir until onion is translucent, about 5 minutes. Add ground beef; cook and stir until browned, 8 to 10 minutes. 2. Transfer beef mixture to a 6-quart slow cooker. Stir in kidney beans, diced tomatoes, tomato puree, water, green chile peppers, chili powder, salt, cumin, and black pepper. 3. Cook on Low until flavors combine, 4 to 6 hours.",
  "prep": "10 mins",
  "cook": "4 hrs 15 mins",
  "total": "4 hrs 25 mins",
  "calories": "274"
},
{
  "url": "https://www.allrecipes.com/recipe/24202/shepherds-pie-vi/",
  "name": "Shepherd's Pie",
  "rating": "4.5",
  "ratingcount": "3",
  "ingredients": "4 large potatoes, peeled and cubed; 1 tablespoon butter; 1 tablespoon finely chopped onion; ¼ cup shredded Cheddar cheese; salt and pepper to taste; 5  carrots, chopped; 1 tablespoon vegetable oil; 1  onion, chopped; 1 pound lean ground beef; 2 tablespoons all-purpose flour; 1 tablespoon ketchup; ¾ cup beef broth; ¼ cup shredded Cheddar cheese",
  "directions": "1. Gather all ingredients. 2. Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain and mash. Mix in butter, finely chopped onion and 1/4 cup shredded cheese. Season with salt and pepper to taste; set aside. 3. Bring a large pot of salted water to a boil. Add carrots and cook until tender but still firm, about 15 minutes. Drain, mash and set aside. Preheat oven to 375 degrees F (190 degrees C.) 4. Heat oil in a large frying pan. Add onion and cook until clear. Add ground beef and cook until well browned. Pour off excess fat, then stir in flour and cook 1 minute. Add ketchup and beef broth. Bring to a boil, reduce heat and simmer for 5 minutes. 5. Spread the ground beef in an even layer on the bottom of a 2 quart casserole dish. Next, spread a layer of mashed carrots. Top with the mashed potato mixture and sprinkle with remaining shredded cheese. 6. Bake in the preheated oven for 20 minutes, or until golden brown.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "452"
},
{
  "url": "https://www.allrecipes.com/recipe/90321/meatball-sandwich/",
  "name": "Meatball Sandwich",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 pound ground beef; ¾ cup bread crumbs; 1 large egg, beaten; 2 cloves garlic, minced; 2 tablespoons grated Parmesan cheese; 2 tablespoons chopped fresh parsley; 2 teaspoons dried Italian seasoning; 1  French baguette; 1 tablespoon extra-virgin olive oil; ½ teaspoon garlic powder; 1 pinch salt, or to taste; 1 (14 ounce) jar spaghetti sauce; 4 slices provolone cheese",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine ground beef, bread crumbs, egg, garlic, Parmesan cheese, parsley, and Italian seasoning in a large bowl. Mix with your hands until well combined. Shape mixture into 12 meatballs, and place in a baking dish. 3. Bake meatballs in the preheated oven until cooked through, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C). 4. While the meatballs are cooking, cut baguette in half lengthwise and open like a book. Remove and discard some of the bread from the inside to make a well for the meatballs. 5. Brush baguette with olive oil and season with garlic powder and salt. Place baguette on a baking tray, open and with the oiled sides facing up. 6. When the meatballs have 5 minutes left, slip the baguette into the oven and cook until lightly toasted. 7. Meanwhile, warm spaghetti sauce in a saucepan over medium heat. 8. Remove meatballs from the oven. Use a slotted spoon to transfer them to the hot sauce; mix gently to coat with sauce. 9. Spoon meatballs and sauce into one side of the baguette, nestling meatballs in the well. Top with slices of provolone cheese. 10. Return to the oven until cheese is melted, 2 to 3 minutes. 11. Cool slightly, then cut into 4 sandwiches.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "781"
},
{
  "url": "https://www.allrecipes.com/recipe/266164/air-fryer-meatloaf/",
  "name": "Air Fryer Meatloaf",
  "rating": "4.3",
  "ratingcount": "58",
  "ingredients": "1 pound lean ground beef; 1 small onion, finely chopped; 1 large egg, lightly beaten; 3 tablespoons dry bread crumbs; 1 tablespoon chopped fresh thyme; 1 teaspoon salt; ground black pepper to taste; 2  mushrooms, thickly sliced; 1 tablespoon olive oil, or as needed",
  "directions": "1. Preheat an air fryer to 392 degrees F (200 degrees C). 2. Combine ground beef, onion, bread crumbs, thyme, egg, salt, and pepper in a bowl. Knead and mix thoroughly. Transfer mixture to a small loaf pan. Smooth the top, press in mushrooms, and coat with olive oil. 3. Roast meatloaf in the preheated air fryer until nicely browned, about 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (72 degrees C). 4. Let meatloaf rest at least 10 minutes before slicing into wedges and serving.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/14690/cabbage-roll-casserole/",
  "name": "Cabbage Roll Casserole",
  "rating": "4.3",
  "ratingcount": "1",
  "ingredients": "2 pounds ground beef; 3 ½ pounds chopped cabbage; 1 (29 ounce) can tomato sauce; 1 cup chopped onion; 1 cup uncooked white rice; 1 teaspoon salt; 2 (14 ounce) cans beef broth",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C) and gather all ingredients. 2. Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. 3. Combine cabbage, tomato sauce, onion, rice, and salt in a large mixing bowl. Stir in cooked ground beef. Pour mixture into a 9x13-inch baking dish, then pour beef broth over top. 4. Cover and bake in the preheated oven for 1 hour. 5. Stir, re-cover, and bake until cabbage is tender and rice is done, 20 to 30 minutes more. 6. Serve hot and enjoy!",
  "prep": "20 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 40 mins",
  "calories": "352"
},
{
  "url": "https://www.allrecipes.com/recipe/76296/meat-pie/",
  "name": "Meat Pie",
  "rating": "4.5",
  "ratingcount": "104",
  "ingredients": "1 medium potato, peeled and cubed; ½ pound ground beef; ½ pound ground pork; ½ cup chopped onion; ⅓ clove garlic, chopped; ½ teaspoon mustard powder; ½ teaspoon dried thyme; ¼ teaspoon dried sage; ¼ teaspoon ground cloves; 1 teaspoon salt; ¼ teaspoon ground black pepper; ¼ cup water; 1 (15 ounce) package refrigerated pie crusts",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Place potato in a saucepan with enough water to cover. Bring to a boil, and cook until tender, about 5 minutes. Drain, mash, and set aside. 3. Meanwhile, crumble ground beef and pork into a large saucepan. Add onion, garlic, mustard powder, thyme, sage, cloves, salt, and black pepper. Stir in water. Cook over medium heat, stirring, until meat is evenly browned. 4. Remove from the heat and mix in mashed potato. 5. Ease one pie crust into a 9-inch pie plate. Fill with meat mixture, then top with the remaining pie crust. Trim any excess dough, then crimp the edges with the tines of a fork to seal. Prick top crust a few times with a knife to vent steam. Cover the edges of the crust with aluminum foil. 6. Bake in the preheated oven until crust is browned, about 25 minutes.",
  "prep": "25 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "381"
},
{
  "url": "https://www.allrecipes.com/recipe/220182/homemade-sloppy-joes/",
  "name": "Homemade Sloppy Joes",
  "rating": "4.7",
  "ratingcount": "690",
  "ingredients": "1 ½ pounds extra-lean ground beef; ½  onion, diced; 1  green pepper, diced; 2 cloves garlic, minced; 2 cups water, divided; ¾ cup ketchup; 2 tablespoons brown sugar; 1 teaspoon Dijon mustard; 1 ½ teaspoons salt, or to taste; ½ teaspoon ground black pepper; 1 dash Worcestershire sauce; 1 pinch cayenne pepper, or to taste",
  "directions": "1. Place ground beef and onion in a large skillet over medium heat; cook and stir until beef is browned and crumbled, about 10 minutes. 2. Stir in green pepper and garlic; cook and stir until softened, 2 to 3 minutes. Add 1 cup water and stir, scraping the pan to dissolve any brown flavor bits from the bottom of the skillet. 3. Stir in ketchup, brown sugar, Dijon mustard, salt, black pepper, and Worcestershire sauce. Add remaining 1 cup water and bring mixture to a boil. Reduce heat to low and simmer, stirring occasionally, until liquid has evaporated and mixture is thick, about 40 minutes. 4. Season with salt, black pepper, Worcestershire sauce, and cayenne pepper.",
  "prep": "15 mins",
  "cook": "55 mins",
  "total": "1 hr 10 mins",
  "calories": "251"
},
{
  "url": "https://www.allrecipes.com/recipe/235997/unstuffed-cabbage-roll/",
  "name": "Unstuffed Cabbage Roll",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "2 pounds ground beef; 1 large onion, chopped; 1 small head cabbage, chopped; 2 (14.5 ounce) cans diced tomatoes; 1 (8 ounce) can tomato sauce; ½ cup water; 2 cloves garlic, minced; 2 teaspoons salt; 1 teaspoon ground black pepper",
  "directions": "1. Gather all ingredients. 2. Heat a Dutch oven or large skillet over medium-high heat. Cook and stir beef and onion in the hot Dutch oven until browned and crumbly, 5 to 7 minutes; drain and discard grease. 3. Add cabbage, tomatoes, tomato sauce, water, garlic, salt, and pepper and bring to a boil. Cover Dutch oven, reduce heat, and simmer until cabbage is tender, about 30 minutes. 4. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "398"
},
{
  "url": "https://www.allrecipes.com/recipe/48449/slow-cooker-chili-ii/",
  "name": "Slow Cooker Chili",
  "rating": "4.3",
  "ratingcount": "993",
  "ingredients": "1 pound ground beef; ¾ cup diced onion; ¾ cup diced celery; ¾ cup diced green bell pepper; 2 cloves garlic, minced; 2 (10.75 ounce) cans  tomato puree; 1 (15 ounce) can kidney beans with liquid; 1 (15 ounce) can kidney beans, drained; 1 (15 ounce) can cannellini beans with liquid; ½ tablespoon chili powder; 1 teaspoon salt; ¾ teaspoon dried basil; ¾ teaspoon dried oregano; ½ teaspoon dried parsley; ¼ teaspoon ground black pepper; ⅛ teaspoon hot pepper sauce",
  "directions": "1. Place beef in a skillet over medium heat and cook until evenly brown, 8 to 10 minutes. Drain grease. 2. Transfer beef to a slow cooker and mix in onion, celery, bell pepper, garlic, tomato puree, kidney beans, and cannellini beans. Season with chili powder, salt, basil, oregano, parsley, black pepper, and hot pepper sauce. 3. Cover and cook on Low for 8 hours. 4. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "8 hrs 10 mins",
  "total": "8 hrs 25 mins",
  "calories": "273"
},
{
  "url": "https://www.allrecipes.com/recipe/83196/hamburger-jazz/",
  "name": "Cheesy Hamburger Rice Casserole",
  "rating": "4.0",
  "ratingcount": "151",
  "ingredients": "1 pound ground beef; 1 (10.75 ounce) can  cream of mushroom soup; 1 (14.5 ounce) can diced tomatoes with juice; ½ cup long grain white rice; ¾ cup shredded mozzarella cheese; salt and pepper to taste",
  "directions": "1. Crumble the ground beef into a skillet over medium-high heat. Cook and stir until evenly browned. Drain off grease, and stir in the cream of mushroom soup, tomatoes, and uncooked rice. Cover, and simmer over low heat, stirring occasionally, until rice is cooked, about 15 minutes. 2. Preheat the oven's broiler. When the rice is done cooking, transfer the contents of the skillet to a casserole dish. Cover with a layer of cheese. 3. Broil until the cheese is melted and toasty. Season with salt and pepper to taste, and enjoy!",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "425"
},
{
  "url": "https://www.allrecipes.com/recipe/8459987/chili-topped-potato-soup/",
  "name": "Chili-Topped Potato Soup",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "3 pounds baking potatoes; 1 pound lean ground beef; ½ cup chopped onion; 3 cloves garlic, minced; 1 (15 ounce) can tomato sauce; 1 (15 ounce) can chili beans; 1 (1.25 ounce) package chili seasoning mix; 1 cup low-sodium chicken broth; ¼ cup butter; 4 cups milk; 1 cup buttermilk; 1 teaspoon salt; ½ teaspoon ground black pepper; 1 ½ cups shredded white Cheddar cheese; ½ cup sour cream; chopped fresh chives (Optional)",
  "directions": "1. Preheat oven to 425 degrees F (220 degrees C). Prick potatoes with a fork. Transfer to a 10x15-inch baking pan. 2. Bake in the preheated oven, turning once, until tender, about 1 hour. 3. Meanwhile, for chili, add ground beef, onion, and garlic to a large saucepan. Cook over medium heat, stirring to break up lumps, until meat is browned and onion is tender, about 10 minutes. Drain grease. 4. Add tomato sauce, chili beans, and chili seasoning mix to saucepan. Bring to a boil. Reduce heat to low and simmer, covered, at least 10 minutes to let flavors meld. 5. When potatoes are cool enough to handle, use a spoon to scoop potato pulp into large bowl. (You should have about 4 cups pulp). Discard skins. Add broth to bowl. Mash potatoes until smooth. 6. Melt butter in a 4- to 5-quart Dutch oven over medium heat. Stir in flour and cook, whisking constantly to make a light roux, about 2 minutes. Gradually whisk in milk, 1 cup at a time. Cook, whisking constantly, until lightly thickened. Stir in potato mixture, buttermilk, salt, and pepper. Cook, stirring frequently, until heated through, 3 to 5 minutes (soup will be very thick). Remove from heat and gradually stir in 1 cup cheese. 7. Divide soup among bowls. Top with chili, sour cream, remaining 1/2 cup cheese, and chives (if using).",
  "prep": "25 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 30 mins",
  "calories": "618"
},
{
  "url": "https://www.allrecipes.com/recipe/8526807/ground-beef-stroganoff-noodles/",
  "name": "Ground Beef Stroganoff Noodles",
  "rating": "4.8",
  "ratingcount": "37",
  "ingredients": "1 tablespoon unsalted butter; 1 tablespoon vegetable oil; 1 cup thinly sliced mushrooms; 1 teaspoon salt, plus more to taste; ½ cup diced onion; 1 pound ground beef; freshly ground black pepper; 1 pinch cayenne pepper; 2 cloves minced garlic; 1 ⅓ tablespoons flour; 2 tablespoons vodka (Optional); 2 ½ cups beef broth, or as needed; 1 cup water; 2 ½ cups egg noodles; ½ cup sour cream, plus more for serving; 2 tablespoons fresh sliced chives or green onions",
  "directions": "1. Melt butter and oil in a skillet over medium-high heat. Add mushrooms, season with salt, and saute, stirring occasionally, until they turn golden brown, 5 to 10 minutes. Add onion and ground beef. Cook, stirring, until meat is browned and crumbly, and onions turn soft and translucent, about 5 minutes. Season with black pepper and cayenne. 2. Stir in minced garlic and flour, and cook for 1 minute. Pour in vodka and allow to evaporate, about 30 seconds. Stir in beef broth and water and bring to a simmer. Cook, stirring occasionally, for 10 minutes. 3. Reduce heat to medium, and mix in noodles. Cover with a tight-fitting lid and simmer for 5 minutes. Uncover and stir thoroughly. Cover again and cook until noodles are just tender, about 3 minutes. (See Cook's Note.) 4. Once noodles are cooked, reduce heat to low, and stir in sour cream. Serve immediately with additional sour cream and green onions or chives if so desired.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "598"
},
{
  "url": "https://www.allrecipes.com/recipe/8468509/one-pot-tortellini-bake/",
  "name": "One Pot Tortellini Bake",
  "rating": "5.0",
  "ratingcount": "5",
  "ingredients": "1 pound ground beef; 1 teaspoon Italian seasoning; ½ teaspoon salt; ½ teaspoon granulated garlic; 1 (28 ounce) jar marinara sauce; 1 (14.5 ounce) can diced tomatoes; 1 cup water; ¼ cup Cabernet Sauvignon (or other dry red wine); 1 (16 ounce) package tortellini; 1 (8 ounce) package cream cheese, cubed; 4 ounces shredded mozzarella cheese",
  "directions": "1. Heat a Dutch oven over medium-high heat. Add ground beef and cook until brown and crumbly, 5 to 10 minutes. Add Italian seasoning, salt, and granulated garlic; mix to combine. 2. Stir in marinara sauce, diced tomatoes with liquid, water, and red wine until well combined. Reduce heat to low; add tortellini and cook until warmed through, about 10 to 15 minutes. 3. Meanwhile, preheat the oven to 375 degrees F (190 degrees C). 4. Add cream cheese to tortellini mixture and stir gently to blend; sprinkle mozzarella cheese over the surface. 5. Bake in the preheated oven until cheese is melted and golden brown, about 15 minutes. Serve immediately.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "783"
},
{
  "url": "https://www.allrecipes.com/recipe/8489146/homemade-smash-burgers/",
  "name": "Homemade Smash Burgers",
  "rating": "5.0",
  "ratingcount": "5",
  "ingredients": "4  hamburger buns; 2 tablespoons butter, softened, or as needed; 1 pound ground chuck beef (80% lean); 4 6-inch squares parchment paper; salt to taste; 4 slices American cheese; burger toppings of choice",
  "directions": "1. Preheat an outdoor grill for high heat and lightly oil the grate. Set a cast iron flat-top griddle or large cast iron skillet onto the grill and preheat until smoking. 2. Spread butter on the inside of the buns and toast on the flat-top until lightly browned. Set aside. 3. Form meat into 8 loosely-packed balls, 2 ounces each. Do not pack the meat tightly, as this will prevent it from smashing properly. Place each ball on the hot flat-top, cover with a piece of parchment (to prevent sticking to the spatula; re-use each parchment square on a second patty) and immediately smash down to a 1/4 inch thickness using 2 stiff, sturdy spatulas that are criss-crossed to get proper leverage as you press down. You may also use the bottom of small skillet. Sprinkle the meat with salt. 4. Grill for about 45 seconds, until the edges are dark brown and the centers are a light pink color. Using a bench scraper or firm spatula, gently scrape up the patties, flip over and immediately cover 4 of them with cheese. Grill an additional 15 to 20 seconds; stack the plain patties over the cheese-covered patties so you have 4 stacks. Move each stack to a bun and serve with your favorite toppings.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "20 mins",
  "calories": "632"
},
{
  "url": "https://www.allrecipes.com/recipe/8491621/manti-armenian-dumplings/",
  "name": "Manti (Armenian Dumplings)",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 ⅔ cups all-purpose flour, or more as needed; 1 large egg; 1 ½ teaspoons olive oil; ½ teaspoon kosher salt; 2 tablespoons water, or as needed; ½ pound ground beef; ¼ cup finely diced onion; 2 tablespoons minced fresh parsley; 1 teaspoon smoked paprika; 1 teaspoon kosher salt; ½ teaspoon freshly ground black pepper; 1 pinch cayenne pepper; 1 tablespoon olive oil; 1 clove crushed garlic; ½ cup tomato sauce; 2 cups chicken or beef broth; salt and freshly ground black pepper to taste; cayenne pepper to taste",
  "directions": "1. Combine 3/4 of the flour, egg, olive oil, salt, and water in a bowl. Mix with a fork, just like when making a pasta dough, until ingredients just come together. Continue mixing everything with your hands into a shaggy dough. Turn out mixture onto a floured surface and keep kneading until dough is nice and smooth. Add additional flour as needed. Cover and allow dough to rest on the counter for 30 minutes. 2. Combine ground beef, onion, parsley, smoked paprika, kosher salt, pepper, and Armenian cayenne in a bowl. Mix with a fork at first, then use your hands until filling is well combined. Cover and chill in the refrigerator. 3. Preheat the oven to 400 degrees C (200 degrees C). Grease a cast-iron skillet with olive oil. 4. Lightly flour a work surface and set the dough on top. Cut dough in half and roll out one half as thin as possible into a large rectangle. Cut dough first into strips, then into 20 small rectangles, about 1.5 x 1.75 inches each. Reserve dough scraps in case there is left over filling to make extra manti. Repeat with second half. 5. Use a teaspoon to portion out the filling, about 1/2 to 1 teaspoon per manti, and set into the middle of each dough rectangle (you can also use your hands to portion out the filling as shown in the video). 6. Moisten the outer, shorter edges of each rectangle with a little bit of water on your fingertips, pick up a rectangle, and trap the filling inside by pinching both ends of the dough together, creating the classic \"little man in the boat\" design. Press dumpling together so manti will sit up straight in the skillet, making sure the dough at the ends is as thin as it is around the filling. 7. Set manti inside the prepared skillet in such a way that there is still a little room between the dumplings as the dough will expand to about twice its size during cooking. 8. Bake in the preheated oven on the center rack for 40 minutes. 9. Meanwhile, heat olive oil in a pot over medium-high heat and cook garlic until fragrant, 20 to 30 seconds. Add tomato sauce and stir quickly. Add chicken broth and season with salt, pepper, and cayenne. 10. Bring tomato broth to a simmer and turn off the heat. 11. Ladle tomato broth over the manti and return to the oven for 15 more minutes.",
  "prep": "40 mins",
  "cook": "",
  "total": "2 hrs 5 mins",
  "calories": "257"
},
{
  "url": "https://www.allrecipes.com/recipe/8494716/lasagna-casserole/",
  "name": "Lasagna Casserole",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1 (12 ounce) box jumbo pasta shells; ¼ cup extra-virgin olive oil, divided; 1 pound ground sirloin; 1 pound Italian sausage, hot or sweet; 1 small yellow onion, finely chopped; 6 cloves garlic, thinly sliced; 1 (26 ounce) jar prepared marinara sauce; 1 cup loosely packed fresh basil leaves; ½ teaspoon crushed red pepper flakes; 1 (15 ounce) container whole milk ricotta cheese; ¼ cup finely grated Parmigiano-Reggiano plus additional for serving; ¼ cup heavy whipping cream; 1 teaspoon kosher salt; 1 ½ cups shredded part-skim mozzarella cheese; cooking spray",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Set a rack in the center of the oven, about 10 inches from the heat source. 2. Bring a large pot of salted water to a boil. Add shells and cook, stirring occasionally, until almost tender, about 7 minutes. Drain pasta in a colander. Return to pot and toss with 1 tablespoon oil. 3. Meanwhile, heat remaining 3 tablespoons oil in a large Dutch oven over medium-high heat. Add sirloin and sausage and cook, undisturbed, until bottom side is lightly browned, about 6 minutes. Stir, and continue to cook, stirring and breaking up meat into smaller pieces with a wooden spoon, until cooked through, about 4 minutes. 4. Reduce heat to medium. Add onion and garlic, and cook, stirring often, until softened, about 4 minutes. 5. Stir in marinara sauce, basil, and crushed red pepper. Remove ragu from heat. 6. Stir together ricotta, Parmigiano-Reggiano, cream, and salt in a bowl. 7. To assemble, spread about 2 cups of the ragu in the bottom of a 13- x 9-inch baking dish. Spoon 1/2 of the pasta over sauce. Dollop half of the ricotta mixture over pasta, and sprinkle with 1 cup mozzarella cheese. Spoon remaining pasta over mozzarella cheese. Spread remaining ragu over pasta mixture, and dollop with remaining ricotta mixture. Top with remaining 1/2 cup mozzarella cheese. Cover lasagna with a large sheet of aluminum foil that's been lightly sprayed with cooking spray (to prevent the cheese from sticking to it). 8. Bake in preheated oven for 30 minutes. Remove from oven and remove foil. Increase oven temperature to broil with rack about 10 inches from heat source; preheat 5 minutes. Return baking dish to oven. Broil until cheese is browned in spots, 5 to 8 minutes.",
  "prep": "35 mins",
  "cook": "50 mins",
  "total": "1 hr 25 mins",
  "calories": "914"
},
{
  "url": "https://www.allrecipes.com/recipe/215231/empanadas-beef-turnovers/",
  "name": "Empanadas (Beef Turnovers)",
  "rating": "4.8",
  "ratingcount": "155",
  "ingredients": "1 tablespoon Goya Extra Virgin Olive Oil; ½ pound ground beef; ½ medium yellow onion, finely chopped; ¼ cup Goya Tomato Sauce; 6  Goya Spanish Olives Stuffed with Minced Pimientos, thinly sliced; 2 tablespoons Goya Sofrito; 1 packet Sazon Goya with Coriander and Annatto; 1 teaspoon Goya Minced Garlic; ½ teaspoon Goya Dried Oregano; Goya Ground Black Pepper, to taste; 1 (14 ounce) package yellow or white Goya Discos empanada discs, thawed; 1 quart Goya Corn Oil, for frying",
  "directions": "1. Heat olive oil in a large skillet over medium heat. Add ground beef; cook and stir until browned and crumbly, about 10 minutes. Add onions and cook until soft, about 5 minutes. Stir in tomato sauce, olives, sofrito, sazón, garlic, oregano, and pepper. Reduce the heat to medium-low and simmer until mixture thickens, about 15 minutes. 2. Roll empanada disks on a lightly floured surface until 1/2 inch larger in diameter. Spoon about 1 tablespoon meat mixture into the middle of each disk. Moisten the disk edges with water, fold in half over filling to form a half-moon, and pinch to seal (or seal with a fork). 3. Heat 2 1/2 inches corn oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Working in batches, fry empanadas until crisp and golden brown, flipping once, 4 to 6 minutes. Transfer to paper towels to drain.",
  "prep": "45 mins",
  "cook": "50 mins",
  "total": "1 hr 35 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/158140/spaghetti-sauce-with-ground-beef/",
  "name": "Homemade Spaghetti Sauce with Ground Beef",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 pound ground beef; 1 medium onion, chopped; 4 cloves garlic, minced; 1 small green bell pepper, diced; 1 (28 ounce) can diced tomatoes; 1 (16 ounce) can tomato sauce; 1 (6 ounce) can tomato paste; 2 teaspoons dried oregano; 2 teaspoons dried basil; 1 teaspoon salt; ½ teaspoon ground black pepper",
  "directions": "1. Gather all ingredients. 2. Combine ground beef, onion, garlic, and green pepper in a large saucepan over medium-high heat. Cook and stir until meat is browned and crumbly and vegetables are tender, 5 to 7 minutes. Drain grease. 3. Stir diced tomatoes, tomato sauce, and tomato paste into the pan. Season with oregano, basil, salt, and pepper. Simmer spaghetti sauce for 1 hour, stirring occasionally. 4. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 15 mins",
  "calories": "185"
},
{
  "url": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/",
  "name": "World's Best Lasagna",
  "rating": "4.8",
  "ratingcount": "20",
  "ingredients": "1 pound sweet Italian sausage; ¾ pound lean ground beef; ½ cup minced onion; 2 cloves garlic, crushed; 1 (28 ounce) can crushed tomatoes; 2 (6.5 ounce) cans canned tomato sauce; 2 (6 ounce) cans tomato paste; ½ cup water; 2 tablespoons white sugar; 4 tablespoons chopped fresh parsley, divided; 1 ½ teaspoons dried basil leaves; 1 ½ teaspoons salt, divided, or to taste; 1 teaspoon Italian seasoning; ½ teaspoon fennel seeds; ¼ teaspoon ground black pepper; 12  lasagna noodles; 16 ounces ricotta cheese; 1  egg; ¾ pound mozzarella cheese, sliced; ¾ cup grated Parmesan cheese",
  "directions": "1. Gather all your ingredients. 2. Cook sausage, ground beef, onion, and garlic in a Dutch oven over medium heat until well browned. 3. Stir in crushed tomatoes, tomato sauce, tomato paste, and water. Season with sugar, 2 tablespoons parsley, basil, 1 teaspoon salt, Italian seasoning, fennel seeds, and pepper. Simmer, covered, for about 1 1/2 hours, stirring occasionally. 4. Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. 5. In a mixing bowl, combine ricotta cheese with egg, remaining 2 tablespoons parsley, and 1/2 teaspoon salt. 6. Preheat the oven to 375 degrees F (190 degrees C). 7. To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with 1/2 of the ricotta cheese mixture. Top with 1/3 of the mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. 8. Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray or make sure the foil does not touch the cheese. 9. Bake in the preheated oven for 25 minutes. Remove the foil and bake for an additional 25 minutes. 10. Rest lasagna for 15 minutes before serving.",
  "prep": "30 mins",
  "cook": "2 hrs 30 mins",
  "total": "3 hrs 15 mins",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/16354/easy-meatloaf/",
  "name": "Easy Meatloaf",
  "rating": "4.6",
  "ratingcount": "8",
  "ingredients": "1 ½ pounds ground beef; 1  egg; 1  onion, chopped; 1 cup milk; 1 cup dried bread crumbs; salt and pepper to taste; ⅓ cup ketchup; 2 tablespoons brown sugar; 2 tablespoons prepared mustard",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan. 2. Combine ground beef, onion, milk, bread crumbs and egg in a large bowl; season with salt and pepper. Transfer into prepared loaf pan. 3. Mix ketchup, brown sugar, and mustard together in a small bowl until well combined; pour over meatloaf and spread it evenly over the top. 4. Bake in the preheated oven until no longer pink in the center, about 1 hour.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "372"
},
{
  "url": "https://www.allrecipes.com/recipe/24264/sloppy-joes-ii/",
  "name": "Sloppy Joes",
  "rating": "4.7",
  "ratingcount": "7",
  "ingredients": "1 pound lean ground beef; ¼ cup chopped onion; ¼ cup chopped green bell pepper; ¾ cup ketchup, or to taste; 1 tablespoon brown sugar, or to taste; 1 teaspoon yellow mustard, or to taste; ½ teaspoon garlic powder; salt and ground black pepper to taste; 6  hamburger buns, split",
  "directions": "1. Heat a large skillet over medium heat. Cook and stir lean ground beef in the hot skillet until some of the fat starts to render, 3 to 4 minutes. Add onion and bell pepper; continue to cook until vegetables have softened and beef is cooked through, 3 to 5 more minutes. 2. Stir in ketchup, brown sugar, mustard, and garlic powder; season with salt and pepper. Reduce heat to low and simmer for 20 to 30 minutes. 3. Divide meat mixture evenly among hamburger buns.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "35 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/74360/the-best-meatloaf-ive-ever-made/",
  "name": "Best Meatloaf",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "1 tablespoon butter; ¼ cup minced onion; 2 cloves garlic, minced; 1 ½ teaspoons salt; 1 ½ teaspoons freshly ground black pepper; 2 pounds extra-lean ground beef; 3 slices bread, toasted and crumbled; 7  buttery round crackers, crushed; 1  egg, lightly beaten; 3 ½ tablespoons sour cream; 1 ½ tablespoons Worcestershire sauce; 1 (15 ounce) can tomato sauce, divided; ¼ cup milk, or as needed (Optional); 3 tablespoons ketchup",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Gather all ingredients. 2. Melt butter in a skillet over medium heat, and cook onion and garlic until onion is soft and translucent, about 5 minutes. Remove from heat, and season with salt and pepper. 3. Combine onion and garlic mixture, beef, crumbled bread, crushed crackers, egg, sour cream, Worcestershire sauce, and 1/2 can tomato sauce in a large bowl. Mix until well combined. Gradually stir in milk, 1 teaspoon at a time, until mixture is moist, but not soggy. 4. Transfer the mixture to a 5x9-inch loaf pan. 5. Bake uncovered in the preheated oven for 40 minutes. Increase oven temperature to 400 degrees F (200 degrees C). Continue baking 15 minutes, to an internal temperature of 160 degrees F (70 degrees C). 6. Mix the remaining tomato sauce and ketchup in a small bowl. Pour over the top of the meatloaf, and continue baking for 10 minutes. 7. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 25 mins",
  "calories": "213"
},
{
  "url": "https://www.allrecipes.com/recipe/14595/salisbury-steak/",
  "name": "Salisbury Steak",
  "rating": "4.4",
  "ratingcount": "4",
  "ingredients": "1 ½ pounds ground beef; 1 (10.5 ounce) can condensed French onion soup; ½ cup dry bread crumbs; 1  egg; ¼ teaspoon salt; ⅛ teaspoon ground black pepper; 1 tablespoon all-purpose flour; ¼ cup ketchup; ¼ cup water; 1 tablespoon Worcestershire sauce; ½ teaspoon mustard powder",
  "directions": "1. Combine ground beef, 1/3 cup condensed soup, bread crumbs, egg, salt, and black pepper in a large bowl. Shape into 6 oval patties. 2. Heat a large skillet over medium-high heat; add patties and brown on both sides. Drain excess fat. 3. Blend remaining soup and flour together in a small bowl until smooth; mix in ketchup, water, Worcestershire sauce, and mustard. Pour soup mixture over patties in the skillet. Cover, and cook for 20 minutes, stirring occasionally.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "440"
},
{
  "url": "https://www.allrecipes.com/recipe/220854/chef-johns-italian-meatballs/",
  "name": "Chef John's Italian Meatballs",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "⅓ cup plain bread crumbs; ½ cup milk; 2 tablespoons olive oil; 1  onion, diced; 1 pound ground beef; 1 pound ground pork; 2  eggs; 2 tablespoons grated Parmesan cheese; ¼ bunch fresh parsley, chopped; 3 cloves garlic, crushed; 2 teaspoons salt; 1 teaspoon ground black pepper; 1 teaspoon dried Italian herb seasoning; ½ teaspoon red pepper flakes",
  "directions": "1. Cover a baking sheet with foil and spray lightly with cooking spray. Soak bread crumbs in milk in a small bowl for 20 minutes. 2. Meanwhile, heat olive oil in a skillet over medium heat. Add onion; cook and stir until onion has softened and turned translucent, about 5 minutes. Reduce heat to low and continue cooking and stirring until onion is very tender, about 15 minutes more. 3. Gently stir beef and pork together in a large bowl. Add onions, bread crumb mixture, eggs, Parmesan cheese, parsley, garlic, salt, black pepper, Italian herb seasoning, and red pepper flakes; mix together using a rubber spatula until combined. Cover and refrigerate for about one hour. 4. Preheat the oven to 425 degrees F (220 degrees C). 5. Form mixture into balls about 1 1/2 inches in diameter; arrange in a single layer on the prepared baking sheet. 6. Bake in the preheated oven until browned and cooked through, 15 to 20 minutes.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "2 hrs 15 mins",
  "calories": "390"
},
{
  "url": "https://www.allrecipes.com/recipe/222037/tater-tots-r-casserole/",
  "name": "Tater Tot Casserole",
  "rating": "4.5",
  "ratingcount": "534",
  "ingredients": "1 pound ground beef; 1 (10.5 ounce) can condensed cream of mushroom soup; salt and ground black pepper to taste; 1 (16 ounce) package frozen tater tots; 2 cups shredded Cheddar cheese",
  "directions": "1. Gather the ingredients. Preheat the oven to 350 degrees F (175 degrees C). 2. Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until completely browned and crumbly, 7 to 10 minutes. Stir in condensed soup; season with salt and black pepper. 3. Transfer beef mixture to a 9x13-inch baking dish; layer tater tots evenly on top and sprinkle with Cheddar cheese. 4. Bake in the preheated oven until tater tots are golden brown and hot, 30 to 45 minutes. 5. Serve and enjoy!",
  "prep": "5 mins",
  "cook": "40 mins",
  "total": "45 mins",
  "calories": "345"
},
{
  "url": "https://www.allrecipes.com/recipe/11758/baked-ziti-i/",
  "name": "Baked Ziti",
  "rating": "4.7",
  "ratingcount": "8",
  "ingredients": "1 pound dry ziti pasta; 1  onion, chopped; 1 pound lean ground beef; 2 (26 ounce) jars spaghetti sauce; 6 ounces provolone cheese, sliced; 1 ½ cups sour cream; 6 ounces mozzarella cheese, shredded; 2 tablespoons grated Parmesan cheese",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add ziti pasta, and cook until al dente, about 8 minutes; drain. 2. Meanwhile, brown ground beef and onion in a large skillet over medium heat; stir in spaghetti sauce and simmer for 15 minutes. 3. Preheat the oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish. 4. Spread 1/2 of the ziti in the bottom of the prepared dish; top with Provolone cheese, sour cream, 1/2 of the meat sauce, remaining ziti, mozzarella cheese, and remaining meat sauce. Top with grated Parmesan cheese. 5. Bake in the preheated oven until heated through and cheeses have melted, about 30 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "578"
},
{
  "url": "https://www.allrecipes.com/recipe/16330/stuffed-peppers/",
  "name": "Stuffed Peppers",
  "rating": "4.4",
  "ratingcount": "2",
  "ingredients": "1 cup cold water; ½ cup uncooked long grain white rice; 1 tablespoon vegetable oil; 1 pound ground beef; 6 medium green bell peppers; 16 ounces tomato sauce, divided; 1 tablespoon Worcestershire sauce; ¼ teaspoon garlic powder; ¼ teaspoon onion powder; salt and ground black pepper to taste; 1 teaspoon Italian seasoning",
  "directions": "1. Gather all ingredients, and preheat the oven to 350 degrees F (175 degrees C). 2. Bring water and rice to a boil in a covered saucepan. Reduce heat to low and simmer until rice is tender, about 20 minutes. 3. Meanwhile, heat oil in a skillet over medium heat. Add ground beef and cook until evenly browned and crumbly, 7 to 9 minutes. 4. Hollow out bell peppers by removing and discarding the tops, seeds, and membranes. Slice the bottoms of the peppers if necessary to make sure they stand up straight. 5. Arrange peppers in a baking dish with the hollowed sides facing upward. 6. Prepare filling by mixing cooked beef, cooked rice, 1/2 of the tomato sauce, Worcestershire sauce, garlic powder, onion powder, salt, and pepper. Spoon an equal amount of filling into each hollowed pepper. 7. Mix remaining tomato sauce and Italian seasoning in a bowl, and pour over the stuffed peppers. 8. Bake in the preheated oven, basting with sauce every 15 minutes, until peppers are tender, about 1 hour. 9. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "1 hr 25 mins",
  "total": "1 hr 30 mins",
  "calories": "248"
},
{
  "url": "https://www.allrecipes.com/recipe/49404/juiciest-hamburgers-ever/",
  "name": "Juiciest Hamburgers Ever",
  "rating": "4.4",
  "ratingcount": "1",
  "ingredients": "2 pounds ground beef; 1  egg, beaten; ¾ cup dry bread crumbs; 3 tablespoons evaporated milk; 2 tablespoons Worcestershire sauce; ⅛ teaspoon cayenne pepper; 2 cloves garlic, minced",
  "directions": "1. Gather all ingredients. 2. Preheat a grill for high heat. 3. Mix the ground beef, egg, bread crumbs, evaporated milk, Worcestershire sauce, cayenne pepper, and garlic in a large bowl using your hands. 4. Form the mixture into 8 hamburger patties. 5. Lightly oil the grill grate. Grill patties until browned and no longer pink, about 5 minutes per side. 6. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "35 mins",
  "calories": "288"
},
{
  "url": "https://www.allrecipes.com/recipe/78370/hamburger-steak-with-onions-and-gravy/",
  "name": "Hamburger Steak with Onions and Gravy",
  "rating": "4.6",
  "ratingcount": "4",
  "ingredients": "1 pound ground beef; ¼ cup bread crumbs; 1  egg; 1 teaspoon Worcestershire sauce; ½ teaspoon seasoned salt; ½ teaspoon onion powder; ½ teaspoon garlic powder; ⅛ teaspoon ground black pepper; 1 tablespoon vegetable oil; 1 cup thinly sliced onion; 2 tablespoons all-purpose flour; 1 cup beef broth; 1 tablespoon cooking sherry; ½ teaspoon seasoned salt",
  "directions": "1. Mix ground beef, bread crumbs, egg, Worcestershire sauce, salt, onion powder, garlic powder, and pepper together in a large bowl until combined. Form into 8 balls and flatten into patties. 2. Heat oil in a large skillet over medium heat. Add patties and onion; fry until patties are nicely browned, about 4 minutes per side. Transfer beef patties to a plate, and keep warm. 3. Sprinkle flour over onions and drippings in the skillet. Stir in flour with a fork, scraping bits of beef off of the bottom of the skillet as you stir. Gradually mix in beef broth and sherry. Season with seasoned salt. Simmer and stir over medium-low heat until gravy thickens, about 5 minutes. 4. Reduce heat to low, return patties to the gravy, cover, and simmer until cooked through, about 15 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "319"
},
{
  "url": "https://www.allrecipes.com/recipe/16311/simple-beef-stroganoff/",
  "name": "Simple Beef Stroganoff",
  "rating": "4.1",
  "ratingcount": "973",
  "ingredients": "1 (8 ounce) package egg noodles; 1 pound ground beef; 1 (10.5 ounce) can fat-free condensed cream of mushroom soup; 1 tablespoon garlic powder; ½ cup sour cream; salt and ground black pepper to taste",
  "directions": "1. Gather all ingredients. 2. Sauté ground beef in a large skillet over medium heat until browned and crumbly; 5 to 10 minutes. 3. At the same time, fill a large pot with lightly salted water and bring to a rapid boil. Cook egg noodles at a boil until tender yet firm to the bite, 7 to 9 minutes. Drain and set aside. 4. Drain and discard any fat from the cooked beef. Stir condensed soup and garlic powder into the beef. Simmer for 10 minutes, stirring occasionally. 5. Remove beef from the heat. Add egg noodles and stir to combine. Stir in sour cream and season with salt and pepper. 6. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "679"
},
{
  "url": "https://www.allrecipes.com/recipe/19344/homemade-lasagna/",
  "name": "Homemade Lasagna",
  "rating": "4.6",
  "ratingcount": "348",
  "ingredients": "½ pound ground pork; ½ pound lean ground beef; ½ cup minced onion; 1 (28 ounce) can crushed tomatoes; 1 (8 ounce) can tomato sauce; 2 tablespoons chopped fresh parsley, divided; 1 clove garlic, crushed; 1 ½ teaspoons dried basil; 1 ½ teaspoons salt; ½ teaspoon dried oregano; ⅛ teaspoon white sugar; 1 (16 ounce) package lasagna noodles; 1 pound small-curd cottage cheese; ¾ cup grated Parmesan cheese; 3 large eggs; 2 teaspoons salt; ¼ teaspoon ground black pepper; 1 (16 ounce) package shredded mozzarella cheese",
  "directions": "1. Combine pork and ground beef in a large, deep skillet over medium-high heat; cook and stir until browned and crumbly, 5 to 7 minutes. Add onion and cook until translucent, about 5 minutes. 2. Stir in crushed tomatoes, tomato sauce, 1 tablespoon fresh parsley, garlic, basil, salt, oregano, and sugar. Reduce heat to medium-low and simmer, stirring occasionally, for 30 minutes. 3. While the sauce is simmering, bring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally, until tender yet firm to the bite, 8 to 10 minutes. Drain and set aside. 4. While the noodles are cooking, preheat the oven to 375 degrees F (190 degrees C). 5. Mix cottage cheese, Parmesan cheese, eggs, remaining 1 tablespoon fresh parsley, salt, and pepper in a large bowl until combined. 6. Assemble lasagna: Spread a spoon or two of sauce over the bottom of a 9x13-inch baking dish just to to coat it. Place two layers of noodles over the sauce to cover. Layer with 1/2 of the cheese mixture, 1/2 of the remaining sauce, and 1/2 of the mozzarella cheese. Repeat layers once more using the remaining noodles, cheese mixture, sauce, and mozzarella. Cover the baking dish with aluminum foil. 7. Bake in the preheated oven for 30 to 40 minutes. Remove the foil and bake until cheese is golden brown, 5 to 10 more minutes. 8. Remove from the oven and let stand for 10 minutes before cutting and serving.",
  "prep": "1 hr 25 mins",
  "cook": "1 hr 15 mins",
  "total": "2 hrs 50 mins",
  "calories": "638"
},
{
  "url": "https://www.allrecipes.com/recipe/40399/the-best-meatballs/",
  "name": "The Best Meatballs",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 pound ground beef; ½ pound ground veal; ½ pound ground pork; 1 cup freshly grated Romano cheese; 2  eggs; 2 cloves garlic, minced; 1 ½ tablespoons chopped Italian flat leaf parsley; salt and ground black pepper to taste; 2 cups stale Italian bread, crumbled; 1 ½ cups lukewarm water; 1 cup olive oil",
  "directions": "1. Combine beef, veal, and pork in a large bowl. Mix in cheese, eggs, garlic, parsley, salt, and pepper. 2. Add bread crumbs and slowly mix in water, 1/2 cup at a time, until mixture is moist but still holds its shape (I usually use about 1 1/4 cups of water); shape into meatballs. 3. Heat olive oil in a large skillet; add meatballs in batches and cook until browned on all sides, slightly crisp, and cooked through, about 10 to 15 minutes. Drain on paper towels.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "613"
},
{
  "url": "https://www.allrecipes.com/recipe/141125/easy-bacon-onion-and-cheese-stuffed-burgers/",
  "name": "Easy Bacon, Onion, and Cheese-Stuffed Burgers",
  "rating": "4.5",
  "ratingcount": "111",
  "ingredients": "3 pounds ground beef; 3 tablespoons barbecue sauce; ½ teaspoon garlic powder; ½ teaspoon ground black pepper; ¼ teaspoon salt; ½ pound bacon, cut into 1/4 inch pieces; 1 medium onion, finely chopped; ¾ cup shredded Cheddar cheese; 6  hamburger buns, split",
  "directions": "1. Mix ground beef, barbecue sauce, garlic powder, black pepper, and salt in a large mixing bowl, using your hands. Shape a small handful at a time (approximately 1/4 pound) into 12 thin patties. Lay patties out on a cookie sheet and cover with plastic wrap; place patties in the refrigerator. 2. Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 5 minutes. Remove bacon from skillet with a slotted spoon and drain on paper towels. Reduce the heat to medium and cook onions in remaining bacon drippings until soft and just beginning to brown. Mix onions and bacon in a small bowl. 3. Preheat an outdoor grill for medium heat and lightly oil the grate. 4. Meanwhile, remove beef patties from the refrigerator; top 6 patties with 1- 1/2 tablespoons of bacon and onion mixture, and sprinkle with shredded cheese. Top each with one of the remaining patties and press the edges together to seal. 5. Grill stuffed patties until beef is no longer pink in the center, about 4 to 5 minutes per side. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Serve on hamburger buns with condiments of your choice.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "669"
},
{
  "url": "https://www.allrecipes.com/recipe/268249/italian-baked-meatballs/",
  "name": "Italian Baked Meatballs",
  "rating": "4.6",
  "ratingcount": "118",
  "ingredients": "1 cup Italian-seasoned bread crumbs; ¼ cup grated Romano cheese; 2 tablespoons chopped fresh parsley; ½ teaspoon salt; ½ teaspoon ground black pepper; ½ teaspoon garlic powder; ½ teaspoon onion powder; ½ cup water; 2  eggs, beaten; 1 ½ pounds ground beef",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix bread crumbs, Romano cheese, parsley, salt, pepper, garlic powder, and onion powder together in a large bowl; stir in water and eggs. Add ground beef and mix until well combined. Form mixture into balls and place on a nonstick baking sheet. 3. Bake in the preheated oven cooked through and evenly browned, about 30 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "343"
},
{
  "url": "https://www.allrecipes.com/recipe/26609/hamburger-potato-casserole/",
  "name": "Hamburger Potato Casserole",
  "rating": "4.3",
  "ratingcount": "1",
  "ingredients": "1 pound lean ground beef; 1 (10.5 ounce) can condensed cream of mushroom soup; ¾ cup milk; ½ cup chopped onion; salt and ground black pepper to taste; 3 cups peeled and thinly sliced potatoes; 1 cup shredded Cheddar cheese",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Heat a large skillet over medium-high heat. Cook and stir ground beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease. 3. Mix condensed soup, milk, onion, salt, and pepper in a medium bowl until combined. Alternately layer the potatoes, soup mixture, and browned ground beef in a 2-quart baking dish. 4. Bake in the preheated oven until potatoes are tender, about 1 to 1 1/2 hours. Top with Cheddar cheese, and continue baking until cheese is melted.",
  "prep": "20 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 40 mins",
  "calories": "403"
},
{
  "url": "https://www.allrecipes.com/recipe/233613/best-damn-chili/",
  "name": "Best Damn Chili",
  "rating": "4.7",
  "ratingcount": "716",
  "ingredients": "4 tablespoons olive oil; 1  yellow onion, chopped; 1  red bell pepper, chopped; 1  Anaheim chile pepper, chopped; 2  red jalapeno pepper, chopped; 4  garlic cloves, minced; 2 ½ pounds lean ground beef; ¼ cup Worcestershire sauce; 1 pinch garlic powder, or to taste; 2  beef bouillon cubes; 1 (12 fluid ounce) can or bottle light beer (such as Coors®); 1 (28 ounce) can crushed San Marzano tomatoes; 1 (14.5 ounce) can fire-roasted diced tomatoes; 1 (12 ounce) can tomato paste; ½ cup white wine; 2 tablespoons chili powder; 2 tablespoons ground cumin; 1 tablespoon brown sugar; 1 tablespoon chipotle pepper sauce; 2 ½ teaspoons dried basil; 1 ½ teaspoons smoked paprika; 1 teaspoon salt; ½ teaspoon dried oregano; ½ teaspoon ground black pepper; 2 (16 ounce) cans dark red kidney beans (such as Bush's®); 1 cup sour cream; 3 tablespoons chopped fresh cilantro; ½ teaspoon ground cumin",
  "directions": "1. Gather all ingredients. 2. Heat oil in a large pot over medium heat; cook and stir onion, bell pepper, Anaheim pepper, jalapeno peppers, and garlic in the hot oil until softened. 3. Meanwhile, heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes. 4. Add Worcestershire sauce and garlic powder. Crumble bouillon cubes over beef and add beer. Continue to cook , scraping any browned bits from the bottom of the skillet, until liquid is hot, about 3 minutes. 5. Stir beef mixture into pepper mixture. 6. Stir crushed tomatoes, diced tomatoes, tomato paste, and wine to the beef mixture. Season with chili powder, 2 tablespoons cumin, brown sugar, pepper sauce, basil, paprika, salt, oregano, and black pepper. 7. Bring to a boil and reduce heat to medium-low. Cover and simmer until meat and vegetables are very tender and flavors have developed in the chili, about 90 minutes, stirring occasionally. 8. Mix kidney beans into beef and vegetables. Continue to simmer until beans are hot, about 30 minutes more. 9. Blend sour cream, cilantro, and remaining 1/2 teaspoon cumin in a food processor until smooth. Serve sour cream mixture with chili. 10. Serve hot and enjoy!",
  "prep": "30 mins",
  "cook": "2 hrs 15 mins",
  "total": "2 hrs 45 mins",
  "calories": "406"
},
{
  "url": "https://www.allrecipes.com/recipe/78299/boilermaker-tailgate-chili/",
  "name": "Boilermaker Tailgate Chili",
  "rating": "4.8",
  "ratingcount": "8",
  "ingredients": "2 pounds ground beef chuck; 1 pound bulk Italian sausage; 3 (15 ounce) cans chili beans, drained; 1 (15 ounce) can chili beans in spicy sauce; 2 (28 ounce) cans diced tomatoes with juice; 1 (6 ounce) can tomato paste; 3 stalks celery, chopped; 1 large yellow onion, chopped; 1  green bell pepper, seeded and chopped; 1  red bell pepper, seeded and chopped; 2  green chile peppers, seeded and chopped; 1 tablespoon bacon bits; 4 cubes beef bouillon; ½ cup beer; ¼ cup chili powder, or more to taste; 1 tablespoon minced garlic; 1 tablespoon Worcestershire sauce; 1 tablespoon dried oregano; 2 teaspoons ground cumin; 2 teaspoons hot pepper sauce (such as Tabasco®); 1 teaspoon dried basil; 1 teaspoon cayenne pepper; 1 teaspoon paprika; 1 teaspoon white sugar; 1 teaspoon salt, or more to taste; 1 teaspoon ground black pepper, or more to taste; 1 (10.5 ounce) bag corn chips (such as Fritos®); 1 (8 ounce) package shredded Cheddar cheese",
  "directions": "1. Heat a large stock pot over medium-high heat. Crumble ground chuck and sausage into the hot pan. Cook, stirring frequently, until meat is evenly browned. Drain off excess grease. 2. Pour in chili beans, spicy chili beans, diced tomatoes, and tomato paste. Add celery, onion, bell peppers, chile peppers, bacon bits, bouillon, beer, 1/4 cup chili powder, garlic, Worcestershire sauce, oregano, cumin, hot pepper sauce, basil, cayenne, paprika, sugar, 1 teaspoon salt, and 1 teaspoon black pepper. Stir to blend, then cover and simmer over low heat for at least 2 hours, stirring occasionally. 3. Taste and season with more salt, pepper, and chili powder if necessary. The longer the chili simmers, the better it will taste. Remove from the heat and serve, or cool, refrigerate, and reheat the next day. 4. To serve, ladle hot chili into bowls and top with corn chips and Cheddar cheese.",
  "prep": "30 mins",
  "cook": "2 hrs",
  "total": "2 hrs 30 mins",
  "calories": "600"
},
{
  "url": "https://www.allrecipes.com/recipe/130358/worlds-best-pasta-sauce/",
  "name": "World's Best Pasta Sauce!",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 pound sweet Italian sausage, sliced; ¾ pound lean ground beef; ½ cup minced onion; 2 cloves garlic, crushed; 1 (28 ounce) can crushed tomatoes; 2 (6.5 ounce) cans tomato sauce; 2 (6 ounce) cans tomato paste; ½ cup water; 2 tablespoons white sugar; 1 ½ teaspoons dried basil; 1 teaspoon Italian seasoning; ½ teaspoon fennel seed; ½ teaspoon salt; ¼ teaspoon ground black pepper",
  "directions": "1. Cook sausage, beef, onion, and garlic in a large pot or Dutch oven over medium heat until browned; drain fat. 2. Stir in crushed tomatoes, tomato sauce, tomato paste, and water. Mix in sugar, basil, Italian seasoning, fennel seed, salt, and pepper. 3. Cover and simmer, stirring occasionally, until cooked through, about 1 1/2 hours.",
  "prep": "15 mins",
  "cook": "1 hr 40 mins",
  "total": "1 hr 55 mins",
  "calories": "157"
},
{
  "url": "https://www.allrecipes.com/recipe/223538/jeffs-hot-dog-chili/",
  "name": "Jeff's Hot Dog Chili",
  "rating": "4.6",
  "ratingcount": "426",
  "ingredients": "1 pound ground beef; ⅓ cup water; ½ (10 ounce) can tomato sauce; ½ cup ketchup; 2 ½ teaspoons chili powder; ½ teaspoon salt; ½ teaspoon ground black pepper; ½ teaspoon white sugar; ½ teaspoon onion powder; 1 dash Worcestershire sauce",
  "directions": "1. Place ground beef and water in a large saucepan; use a potato masher to break apart beef. 2. Stir in tomato sauce, ketchup, chili powder, salt, black pepper, sugar, onion powder, and Worcestershire sauce. 3. Bring to a boil, then simmer over medium heat until beef is cooked and chili thickens, about 20 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "168"
},
{
  "url": "https://www.allrecipes.com/recipe/229123/best-beef-enchiladas/",
  "name": "Best Beef Enchiladas",
  "rating": "4.6",
  "ratingcount": "502",
  "ingredients": "2 pounds ground beef; ¼ medium onion, finely chopped; 1 ¼ cups shredded Cheddar cheese, divided; ½ cup sour cream; 1 tablespoon dried parsley; 1 tablespoon taco seasoning; 1 teaspoon dried oregano; ½ teaspoon ground black pepper; 2 ½ cups enchilada sauce; 1 ½ teaspoons chili powder; 1 clove garlic, minced; ½ teaspoon salt; 8  flour tortillas; 1 (15 ounce) can black beans, rinsed and drained; 1 (4 ounce) can sliced black olives, drained",
  "directions": "1. Gather ingredients and preheat the oven to 350 degrees F (175 degrees C). 2. Heat a large skillet over medium-high heat. Cook and stir ground beef and onion in the hot skillet until beef is browned and crumbly, 5 to 7 minutes. Drain and discard grease. 3. Stir 1 cup Cheddar cheese, sour cream, parsley, taco seasoning, oregano, and black pepper into ground beef until cheese is melted. Mix in enchilada sauce, chili powder, garlic, and salt; bring to a boil, reduce heat to low, and simmer until sauce is slightly thickened, about 5 minutes. 4. Lay a tortilla onto a work surface and spoon about 1/4 cup meat sauce down the center of tortilla. Top meat sauce with 1 tablespoon black beans and a sprinkling of black olives. Roll up tortilla, enclosing filling; lay seam-side down in a 9x13-inch baking dish. Repeat with remaining tortillas. 5. Spoon any remaining meat sauce over rolled tortillas. Scatter any remaining black beans and black olives over the top. Sprinkle with remaining 1/4 cup Cheddar cheese. 6. Bake in the preheated oven until cheese is melted and sauce is bubbling, 20 to 22 minutes. Let stand 5 minutes before serving. 7. Serve hot and enjoy!",
  "prep": "25 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "583"
},
{
  "url": "https://www.allrecipes.com/recipe/173420/traditional-gyro-meat/",
  "name": "Traditional Gyro Meat",
  "rating": "4.2",
  "ratingcount": "388",
  "ingredients": "½  onion, cut into chunks; 1 pound ground lamb; 1 pound ground beef; 1 tablespoon minced garlic; 1 teaspoon dried oregano; 1 teaspoon ground cumin; 1 teaspoon dried marjoram; 1 teaspoon ground dried rosemary; 1 teaspoon ground dried thyme; 1 teaspoon ground black pepper; ¼ teaspoon sea salt",
  "directions": "1. Pulse onion in a food processor until finely chopped. Scoop onions onto the center of a towel, gather up the towel ends, and squeeze to remove liquid. 2. Combine onions, lamb, beef, garlic, oregano, cumin, marjoram, rosemary, thyme, pepper, and salt in a large bowl. Mix with your hands until well combined. Cover and refrigerate 1 to 2 hours to allow the flavors to blend. 3. Preheat the oven to 325 degrees F (165 degrees C). 4. Place the meat mixture into a food processor and pulse until finely chopped and the texture feels tacky, about 1 minute. Transfer to a 7x4-inch loaf pan, and pack down to make sure there are no air pockets. 5. Line a large roasting pan with a damp kitchen towel. Place the loaf pan in the center of the towel-lined roasting pan, and transfer it into the preheated oven. Carefully pour boiling water into the roasting pan until it comes halfway up the sides of the loaf pan. 6. Bake in the preheated oven until gyro meat is no longer pink in the center, about 45 minutes to 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). 7. Pour off any accumulated fat, and allow to cool slightly before slicing thinly and serving.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "2 hrs",
  "calories": "179"
},
{
  "url": "https://www.allrecipes.com/recipe/8444531/john-wayne-casserole/",
  "name": "John Wayne Casserole",
  "rating": "4.6",
  "ratingcount": "41",
  "ingredients": "1 (16.3 ounce) can refrigerated biscuits; 2 pounds ground beef; 1 (1 ounce) package taco seasoning; ¾ cup water; 1 medium onion, halved and sliced; 1 medium red bell pepper, halved and sliced (1 1/2 cups); ½ cup sour cream; ½ cup mayonnaise; 8 ounces shredded Cheddar cheese, divided; 2 medium tomatoes, sliced; 1 (4 ounce) jar sliced jalapeno peppers, drained (Optional)",
  "directions": "1. Gather the ingredients. Preheat the oven to 350 degrees F (175 degrees C) and lightly grease a 9x13-inch baking pan. 2. Place and press biscuit dough into the bottom of the baking pan and halfway up the sides. 3. Bake in the preheated oven until lightly browned, 15 to 20 minutes. Leave the oven on. 4. Meanwhile, heat a nonstick skillet over medium-high heat and cook ground beef until browned and crumbly, about 5 minutes. Drain fat. Stir in taco seasoning and water. Bring to a boil, reduce heat, and simmer, stirring occasionally, for 5 minutes. Transfer cooked meat to a bowl and wipe out the skillet. 5. Add onion and bell peppers to the same skillet and cook over medium heat until slightly tender, about 5 minutes. 6. Combine sour cream, mayonnaise, 1/2 of the Cheddar cheese, and 1/2 of the onion-pepper mixture in a bowl. 7. Layer browned meat, tomatoes, onion-pepper mixture, jalapeño peppers, and sour cream mixture on top of prebaked biscuit dough. Sprinkle with remaining Cheddar cheese. 8. Bake uncovered in the preheated oven until cheese is lightly browned and bubbly, 30 to 40 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "538"
},
{
  "url": "https://www.allrecipes.com/recipe/8470679/korean-barbecue-style-meatballs/",
  "name": "Korean Barbecue-Style Meatballs",
  "rating": "4.7",
  "ratingcount": "22",
  "ingredients": "1 pound ground beef; 2 teaspoons gochujang (Korean hot pepper paste); 1 teaspoon kosher salt; 1 teaspoon freshly ground black pepper; 1 tablespoon soy sauce; 2 teaspoons grated fresh ginger (heated to 150 F degrees (65 degrees C) to deactivate enzymes, or soaked in 1 tablespoon vinegar for 5 minutes); 4 cloves garlic, finely minced; ⅓ cup thinly sliced green onions, plus more for garnish; ½ cup finely crushed buttery round crackers (such as Ritz®); toasted sesame seeds for garnish; 4 cloves garlic, minced; 2 tablespoons rice wine vinegar; ¾ cup beef broth or water; ⅓ cup brown sugar; ⅓ cup soy sauce; 1 tablespoon gochujang (Korean hot pepper paste); 1 teaspoon sesame oil; 1 teaspoon Sriracha hot sauce; 2 teaspoons cornstarch; 1 tablespoon water",
  "directions": "1. Add ground beef to a bowl and spread gochujang evenly over the surface of the meat. Season evenly with kosher salt, pepper, and soy sauce. Spreading out the seasoning will reduce the time you need to handle the meat. Spread fresh ginger and garlic evenly over the surface. Add green onions and cracker crumbs. Mix in quickly with a fork until well combined. 2. Cover and refrigerate for about 30 minutes. 3. Preheat the oven to 450 degrees C (220 degrees C). 4. Form mixture into 12 equal-sized balls using wet hands. Add to a cast iron skillet. 5. Bake meatballs in the preheated oven until nicely browned, about 20 minutes. 6. Transfer meatballs to a plate while preparing the sauce in the same skillet. 7. Drain most of the grease but 1 teaspoon out of the skillet and set onto stove over medium-high heat. Add garlic and stir until fragrant, about 1 minute. Deglaze skillet with rice vinegar and soy sauce. Stir in brown sugar, beef broth, and gochujang. Season with sesame oil and Sriracha. Stir sauce and bring to a simmer. Cook until reduced by a third. 8. Meanwhile stir together cornstarch and water in a small bowl to create a slurry. Reduce heat to medium-low and mix in slurry while whisking constantly. Keep simmering sauce until it has reduced to about half. Add meatballs back into the skillet and baste with the sauce. Allow to simmer, basting generously, until meatballs are heated through and are well soaked with sauce, 3 to 5 minutes. 9. Serve garnished with toasted sesame seeds and green onions.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "1 hr 20 mins",
  "calories": "558"
}]