[{
  "url": "https://www.allrecipes.com/recipe/168138/greek-lamb-stew/",
  "name": "Greek Lamb Stew",
  "rating": "4.3",
  "ratingcount": "20",
  "ingredients": "2 tablespoons olive oil; 1 pound lamb shoulder blade chops; salt and pepper to taste; 1 large onion, chopped; 3 cloves garlic, minced; ½ cup dry red wine; 2 cups chopped tomatoes; 1 (15 ounce) can tomato sauce; 1 cup lamb stock; ½  lemon, zested and juiced; ½ teaspoon dried oregano; ½ teaspoon ground cinnamon; 1  bay leaf; 1 pound fresh green beans, trimmed; ¼ cup chopped fresh parsley",
  "directions": "1. Heat the olive oil in a large, heavy bottomed pot over medium-high heat. Season the lamb with salt and pepper, add to the pot, and cook until deeply browned, about 5 minutes on each side. Stir in the onions and garlic, and cook until lightly browned, about 2 minutes. 2. Pour the wine into the pot, and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Stir in the tomatoes, tomato sauce, lamb stock, lemon zest and juice, oregano, cinnamon, and bay leaf. Bring back to a boil over high heat, then reduce the heat to medium-low, cover, and simmer until the lamb is very tender, about 1 1/2 hours. Stir in the green beans and cook until they are tender, about 20 additional minutes. 3. Remove the bay leaf and any bones from the stew. Garnish stew with chopped fresh parsley.",
  "prep": "15 mins",
  "cook": "2 hrs 20 mins",
  "total": "2 hrs 35 mins",
  "calories": "365"
},
{
  "url": "https://www.allrecipes.com/recipe/258848/american-gyros/",
  "name": "American Gyros",
  "rating": "4.9",
  "ratingcount": "90",
  "ingredients": "1 pound ground lamb; 1 pound ground beef; ½ cup finely diced yellow onion; 4 cloves garlic, crushed; 1 tablespoon minced fresh rosemary; 2 teaspoons dried oregano; 2 teaspoons kosher salt, or to taste; 1 teaspoon fresh ground black pepper; 1 teaspoon cumin; 1 teaspoon paprika; ⅛ teaspoon ground cinnamon; ⅛ teaspoon cayenne pepper; 2 tablespoons dry bread crumbs; 1 tablespoon olive oil",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x13-inch baking dish. Line with parchment paper that extends up the sides. Turn the parchment paper over so the oiled side is up. 2. Place ground lamb and beef in a mixing bowl. Add onions, garlic, rosemary, oregano, salt, pepper, cumin, paprika, cinnamon, cayenne pepper, and bread crumbs. Mix until well combined. Transfer to prepared baking dish and press the meat mixture firmly into the dish in an even layer that extends to the edges. Meat mixture should be packed and fairly dense. 3. Bake in preheated oven until nicely browned, 40 to 45 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Cool to room temperature. Transfer to a plate. Cover with plastic wrap and refrigerate until chilled, 1 to 2 hours. 4. Transfer meat to a cutting board. Cut into 3 pieces crosswise. Slice each piece into 1/8-inch thick slices as you need them. 5. Heat oil in a skillet over medium-high heat. Cook slices until browned, about 2 minutes per side.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "1 hr 55 mins",
  "calories": "255"
},
{
  "url": "https://www.allrecipes.com/recipe/217187/mamas-oh-so-savory-lamb-and-eggplant-casserole/",
  "name": "Mama's Oh-So-Savory Lamb and Eggplant Casserole",
  "rating": "4.6",
  "ratingcount": "54",
  "ingredients": "1 (1 pound) eggplant, cut into 1-inch cubes; salt; 1 tablespoon olive oil; 1 large sweet onion, coarsely chopped; 2 large stalks  celery, sliced; ½ teaspoon ground cumin; 2 pinches dried oregano; 2 pinches ground dried rosemary; 2 pinches paprika; ⅛ teaspoon dried mint; 1 pinch salt and ground black pepper to taste; 1 ½ teaspoons garlic, minced; 3  tomatoes, coarsely chopped; 1 cup chicken broth; 1 (15 ounce) can tomato sauce; 1 pound ground lamb; 1 tablespoon olive oil; 1  lemon, juiced, or to taste",
  "directions": "1. Place eggplant in a colander set in a bowl or the sink; sprinkle with 1 teaspoon salt and toss to coat. Let eggplant stand for at least 1 hour. Rinse off the bitter liquid and excess salt and drain well. 2. Heat 1 tablespoon olive oil in a skillet over medium heat. Stir in onion and celery; cook and stir until onion has softened and turned translucent and celery is fragrant, about 5 minutes. 3. While vegetables are cooking, combine ground cumin, oregano, rosemary, paprika, mint, salt, and black pepper in a small bowl or mortar and pestle and mix well; this is the lamb seasoning (see Cook's Note). Set seasoning aside. 4. Stir eggplant cubes and garlic into the vegetables in the skillet, mixing well, and cook for an additional 5 minutes. Add chopped tomatoes and sprinkle with half of the lamb seasoning mixture. Reserve remaining seasoning. Stir gently and cook for 5 minutes more. 5. Preheat oven to 375 degrees F (190 degrees C). Grease a 2-quart casserole dish. 6. Pour chicken broth and half the can of tomato sauce into the skillet and simmer for 10 minutes; add a little water if the sauce starts to get dry. Transfer the sauce to the prepared casserole dish. 7. Return the skillet to the stove over medium-high heat and heat the reserved tablespoon of olive oil over medium heat. Place ground lamb into skillet and sprinkle with remaining seasoning mixture. Brown lamb in the hot oil, stirring frequently, until the meat is evenly browned; it should look like imperfect meatballs. 8. Gently transfer the lamb to the casserole dish, pushing it down into the vegetable mixture so that it is at least partially submerged. Stir fresh lemon juice into the remaining tomato sauce and pour the sauce over the casserole. 9. Bake uncovered for 45 minutes to 1 hour, depending upon how tender you like your vegetables.",
  "prep": "35 mins",
  "cook": "1 hr",
  "total": "2 hrs 35 mins",
  "calories": "385"
},
{
  "url": "https://www.allrecipes.com/recipe/45641/roasted-rack-of-lamb/",
  "name": "Roasted Rack of Lamb",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "½ cup fresh bread crumbs; 2 tablespoons minced garlic; 2 tablespoons chopped fresh rosemary; 1 teaspoon salt; ¼ teaspoon black pepper; 2 tablespoons olive oil; 1 (7 bone) rack of lamb, trimmed and frenched; 1 teaspoon salt; 1 teaspoon black pepper; 2 tablespoons olive oil; 1 tablespoon Dijon mustard",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). Move the oven rack to the center position. 2. Combine bread crumbs, garlic, rosemary, 1 teaspoon salt, and 1/4 teaspoon pepper in a small bowl; stir in 2 tablespoons olive oil to moisten the mixture. Set aside. 3. Season rack of lamb all over with 1 teaspoon salt and 1 teaspoon pepper. Heat 2 tablespoons olive oil in a large heavy oven-proof skillet over high heat. Add lamb and sear on all sides, about 1 to 2 minutes: set lamb aside for a few minutes. Brush lamb with mustard and roll in bread crumb mixture until evenly coated. Cover the ends of the bones with foil to prevent charring. 4. Arrange the breaded rack of lamb bone-side down in the same skillet. Roast in preheated oven for 12 to 18 minutes for medium; an instant-read thermometer inserted into the center should read at least 130 degrees F (54 degrees C), or continue to cook to desired doneness. Remove lamb from the skillet and allow to rest for 5 to 7 minutes, loosely covered with foil, before carving between the ribs.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "481"
},
{
  "url": "https://www.allrecipes.com/recipe/233230/gyros/",
  "name": "Gyros",
  "rating": "4.8",
  "ratingcount": "31",
  "ingredients": "¼ cup chopped red onion; 1 tablespoon minced garlic; 1 tablespoon dried marjoram; 1 tablespoon ground dried rosemary; 2 teaspoons kosher salt; ½ teaspoon freshly ground black pepper; 1 pound 93%-lean ground beef; 1 pound ground lamb",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Process red onion in a food processor until finely minced. Scoop onion into a piece of cheesecloth and squeeze it to release as much moisture as possible. 3. Return onion to the food processor. Add garlic and process until the garlic is well integrated. Blend in marjoram, rosemary, salt, and pepper. 4. Gradually blend ground beef and ground lamb with the onion and seasoning mixture by alternately adding small amounts of each meat to the mixture and processing until well incorporated before adding the next batch. 5. Firmly pack the meat mixture into a 9x5-inch loaf pan, assuring no air pockets are trapped in the meat. 6. Bake in the preheated oven until no longer pink in the center, about 1 hour 15 minutes. An instant-read thermometer inserted into the center should read at least 175 degrees F (80 degrees C). 7. Drain grease and slice thinly to serve.",
  "prep": "20 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 35 mins",
  "calories": "224"
},
{
  "url": "https://www.allrecipes.com/recipe/150812/butter-lamb-gravy/",
  "name": "Butter Lamb Gravy",
  "rating": "4.5",
  "ratingcount": "92",
  "ingredients": "2 pounds boneless lamb shoulder, cut into 1 inch pieces; ½ teaspoon garam masala; salt to taste; 2 tablespoons butter, divided; 1  onion, chopped; ½ teaspoon ground turmeric (Optional); ½ teaspoon minced ginger; ½ teaspoon minced garlic; ½ teaspoon cayenne pepper, or to taste; 1 tablespoon tomato paste; 1 cup water; ½ cup heavy cream; 1 tablespoon honey; 1 cup chopped fresh cilantro",
  "directions": "1. Season the lamb with garam masala and salt. Heat 1 tablespoon of butter in a large skillet over medium heat. Fry the lamb cubes until browned, stirring constantly. Remove from the skillet and set aside. 2. Melt the remaining butter in the same skillet over medium heat. Add the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. 3. Stir in the turmeric, ginger, and garlic. Cook and stir for 1 minute. Stir in the cayenne and tomato paste until well blended, then stir in the water. Bring to a simmer and return lamb to the skillet. Simmer over low heat for about 20 minutes, or until lamb is tender. 4. Stir in the cream and honey. Transfer to a serving dish and garnish with cilantro.",
  "prep": "25 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "321"
},
{
  "url": "https://www.allrecipes.com/recipe/206640/stuffed-leg-of-lamb/",
  "name": "Stuffed Leg of Lamb",
  "rating": "4.7",
  "ratingcount": "33",
  "ingredients": "1 (5 pound) boneless leg of lamb; salt and black pepper to taste; 1 (10 ounce) bag fresh spinach leaves; 6 ounces goat cheese, or more if needed; 2 teaspoons pine nuts; kitchen twine; 1 cup all-purpose flour; 1 tablespoon salt; 1 tablespoon ground black pepper; 1 teaspoon dried thyme; 1 teaspoon fennel seeds; 1 tablespoon sesame oil",
  "directions": "1. Remove plastic netting or twine from around the leg of lamb, if any, and open up the roast on a cutting board. Place the boned side of the roast up. With a sharp paring knife, cut away any excess fatty areas. Use a sharp knife to cut 1/2-inch deep slits in the meat about 2 inches apart, to help the meat lie flat. Cover the meat with a sturdy piece of plastic wrap or a cut-apart food storage bag, and pound the meat with a mallet or the edge of a small plate until the roast is about 3/4 inch thick everywhere, and 10 to 14 inches square. 2. Preheat an oven to 400 degrees F (200 degrees C). 3. Sprinkle the upper side of the meat with salt and pepper, and then spread spinach leaves over the top of the roast to within 1/2 inch of the edges. Break up the goat cheese and sprinkle it evenly over the spinach, then sprinkle the pine nuts over the cheese. 4. Roll the roast up into a tight cylinder, and tie the roast together with kitchen twine at 2 inch intervals. It's okay if a little stuffing protrudes from the sides of the roast. 5. In a flat dish, mix together the flour, 1 tablespoon of salt, 1 tablespoon of pepper, the thyme, and the fennel seeds, and press the tied roast firmly into the flour mixture to coat all sides. 6. Heat the sesame oil in a heavy oven-proof or cast-iron skillet over medium-high heat until the oil shimmers, and sear all sides of the roast, including the ends, to a golden brown color. Lay the roast into the skillet, place into the preheated oven, and roast to your desired degree of doneness, or an internal temperature of 145 degrees F (65 degrees C) for medium, about 40 minutes. Remove from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 10 to 15 minutes before slicing.",
  "prep": "35 mins",
  "cook": "40 mins",
  "total": "1 hr 25 mins",
  "calories": "485"
},
{
  "url": "https://www.allrecipes.com/recipe/24805/lancashire-hot-pot/",
  "name": "Lancashire Hot Pot",
  "rating": "4.3",
  "ratingcount": "34",
  "ingredients": "1 tablespoon vegetable oil; 12 ounces chopped onion; 1 ½ pounds cubed leg of lamb meat; 2 ½ pounds potatoes, peeled and thinly sliced; 2 tablespoons chopped fresh thyme; 1 ounce butter; 2 cups chicken or lamb stock",
  "directions": "1. Heat oil in a large skillet over medium high heat. Saute onion until soft and deep golden in color. Remove from skillet and set aside. Add lamb to skillet and fry (in batches if necessary) until rich chestnut brown in color, 12 to 15 minutes. Drain fat and reserve. 2. Preheat oven to 375 degrees F (190 degrees C). 3. Spread 1/2 of the potatoes in the bottom of a 9x13 inch baking dish. Season with salt and pepper to taste. Place browned lamb and onions on top, then sprinkle with thyme and season to taste. Cover with remaining potatoes, season to taste and dot with butter. Pour stock over all. 4. Bake in the preheated oven for 1 1/2 to 2 hours. Note: If casserole is drying out while cooking, add more stock as needed. If casserole is browning too quickly, cover with aluminum foil.",
  "prep": "20 mins",
  "cook": "2 hrs",
  "total": "2 hrs 20 mins",
  "calories": "365"
},
{
  "url": "https://www.allrecipes.com/recipe/141395/mediterranean-lamb-and-lentil-stew/",
  "name": "Mediterranean Lamb and Lentil Stew",
  "rating": "4.7",
  "ratingcount": "70",
  "ingredients": "1 tablespoon olive oil; 1 ½ pounds lamb shoulder arm chops, cubed, round bones reserved; 1 teaspoon salt; ½ teaspoon ground black pepper; 1  onion, chopped; 4 cloves garlic, minced; 1 cup lentils, picked over and rinsed; 2 cups chicken broth, or more as needed; 1 (14 ounce) can diced tomatoes; 3  carrots, peeled and sliced; ½ teaspoon dried thyme; ½ teaspoon dried sage; ½ teaspoon dried basil; 2 cups coarsely chopped fresh spinach; 1  lemon, juiced and zested; ½ cup ricotta salata cheese, crumbled",
  "directions": "1. Heat oil in a heavy pot over medium-high heat. Add the lamb cubes and bones and brown on all sides, about 3 minutes. Sprinkle with salt and pepper. Add onion and garlic and continue cooking about 2 minutes, stirring frequently. 2. Stir in the lentils, 2 cups of the chicken broth, tomatoes, carrots and the thyme, sage and basil. Bring to a boil, reduce the heat to low and simmer, covered, until the lentils are tender but not quite done, stirring occasionally. Depending on the type and freshness of the lentils, this will take from 15 to 30 minutes. If the stew seems dry, add more broth (up to one cup additional). Discard the lamb bones. 3. Add the spinach and cook 5 minutes more. Stir in the lemon zest and juice. Garnish individual servings with some of the crumbled cheese.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "572"
},
{
  "url": "https://www.allrecipes.com/recipe/9380/roast-leg-of-lamb/",
  "name": "Roast Leg of Lamb",
  "rating": "4.8",
  "ratingcount": "134",
  "ingredients": "5 pounds leg of lamb; 4 cloves garlic, sliced; salt and ground black pepper to taste; 2 tablespoons fresh rosemary",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Cut deep slits on the top of leg of lamb every 3 to 4 inches; push slices of garlic down into the slits. Generously season with salt and pepper. 3. Place lamb on a roasting pan; arrange several sprigs of fresh rosemary under and on top of the lamb. 4. Roast in the preheated oven for 1 3/4 to 2 hours, or until an instant-read thermometer inserted into the center of the lamb reads at least 135 degrees F (57 degrees C) for medium-rare to medium doneness. 5. Cover lamb with aluminum foil and let rest for at least 10 minutes before carving. 6. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "1 hr 45 mins",
  "total": "2 hrs 10 mins",
  "calories": "382"
},
{
  "url": "https://www.allrecipes.com/recipe/36927/rosemary-braised-lamb-shanks/",
  "name": "Rosemary Braised Lamb Shanks",
  "rating": "4.7",
  "ratingcount": "512",
  "ingredients": "6  lamb shanks; salt and pepper to taste; 2 tablespoons olive oil; 3 large carrots, cut into 1/4 inch rounds; 2  onions, chopped; 10 cloves garlic, minced; 1 (750 milliliter) bottle red wine; 1 (28 ounce) can whole peeled tomatoes with juice; 1 (10.5 ounce) can condensed chicken broth; 1 (10.5 ounce) can beef broth; 5 teaspoons chopped fresh rosemary; 2 teaspoons chopped fresh thyme",
  "directions": "1. Season lamb shanks with salt and pepper. 2. Heat oil in a large, heavy pot or Dutch oven over medium-high heat. Working in batches, cook shanks until brown on all sides, about 8 minutes. Transfer shanks to a plate; set aside. 3. Add carrots, onions, and garlic to the pot and sauté over medium heat until golden brown, about 10 minutes. Stir in wine, tomatoes, chicken broth, beef broth, rosemary, and thyme. 4. Return shanks to the pot, pressing down to submerge. Bring to a boil, then reduce heat to medium-low. Cover and simmer until meat is tender, about 2 hours. 5. Remove the lid and simmer to allow flavors to concentrate, about 20 minutes. Transfer shanks to a platter; cover with foil to keep warm. Continue boiling sauce until thickened, about 15 minutes. Spoon sauce over shanks before serving.",
  "prep": "20 mins",
  "cook": "3 hrs 5 mins",
  "total": "3 hrs 25 mins",
  "calories": "481"
},
{
  "url": "https://www.allrecipes.com/recipe/173420/traditional-gyro-meat/",
  "name": "Traditional Gyro Meat",
  "rating": "4.2",
  "ratingcount": "388",
  "ingredients": "½  onion, cut into chunks; 1 pound ground lamb; 1 pound ground beef; 1 tablespoon minced garlic; 1 teaspoon dried oregano; 1 teaspoon ground cumin; 1 teaspoon dried marjoram; 1 teaspoon ground dried rosemary; 1 teaspoon ground dried thyme; 1 teaspoon ground black pepper; ¼ teaspoon sea salt",
  "directions": "1. Pulse onion in a food processor until finely chopped. Scoop onions onto the center of a towel, gather up the towel ends, and squeeze to remove liquid. 2. Combine onions, lamb, beef, garlic, oregano, cumin, marjoram, rosemary, thyme, pepper, and salt in a large bowl. Mix with your hands until well combined. Cover and refrigerate 1 to 2 hours to allow the flavors to blend. 3. Preheat the oven to 325 degrees F (165 degrees C). 4. Place the meat mixture into a food processor and pulse until finely chopped and the texture feels tacky, about 1 minute. Transfer to a 7x4-inch loaf pan, and pack down to make sure there are no air pockets. 5. Line a large roasting pan with a damp kitchen towel. Place the loaf pan in the center of the towel-lined roasting pan, and transfer it into the preheated oven. Carefully pour boiling water into the roasting pan until it comes halfway up the sides of the loaf pan. 6. Bake in the preheated oven until gyro meat is no longer pink in the center, about 45 minutes to 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). 7. Pour off any accumulated fat, and allow to cool slightly before slicing thinly and serving.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "2 hrs",
  "calories": "179"
},
{
  "url": "https://www.allrecipes.com/recipe/158799/stout-braised-lamb-shanks/",
  "name": "Stout-Braised Lamb Shanks",
  "rating": "4.5",
  "ratingcount": "47",
  "ingredients": "1 tablespoon vegetable oil; 4  lamb shanks; 1  onion, chopped; 4 cloves garlic, chopped; 2  carrots, chopped; 2  celery ribs, chopped; 2 tablespoons tomato paste; 1 (14 ounce) can beef broth; 1 (12 fluid ounce) bottle stout (such as Guinness®) or porter; 3 sprigs fresh thyme; 3 sprigs fresh parsley; 1  bay leaf; 1 sprig fresh rosemary; salt and pepper to taste",
  "directions": "1. Heat oil in a Dutch oven or large, wide pot over medium-high heat until oil begins to smoke. Sear lamb shanks in hot oil on all sides until browned, about 10 minutes. Remove lamb shanks and set aside. Drain excess grease. 2. Add onion and garlic to the Dutch oven over medium heat. Cook and stir until onion is softened and translucent, about 5 minutes. Stir in carrots, celery, and tomato paste; cook for 5 minutes more. 3. Return lamb shanks to the Dutch oven and pour in broth and stout beer. Use kitchen twine to tie together thyme, parsley, and bay leaf into a secure bundle; add to lamb shanks. Bring to a boil. 4. Reduce heat to medium-low, cover, and simmer, stirring occasionally, until lamb is tender and nearly falls off the bone, 2 to 3 hours. Stir in rosemary sprig and season with salt and pepper during the last 10 minutes of cooking. Remove rosemary sprig and herb bundle before serving.",
  "prep": "25 mins",
  "cook": "2 hrs 25 mins",
  "total": "2 hrs 50 mins",
  "calories": "348"
},
{
  "url": "https://www.allrecipes.com/recipe/105044/lamb-tagine/",
  "name": "Lamb Tagine",
  "rating": "4.7",
  "ratingcount": "369",
  "ingredients": "2 pounds lamb meat, cut into 1 1/2 inch cubes; 3 tablespoons olive oil, divided; 2 teaspoons paprika; 1 teaspoon ground cinnamon; 1 teaspoon kosher salt; ¾ teaspoon garlic powder; ¾ teaspoon ground coriander; ½ teaspoon ground cumin; ½ teaspoon ground cardamom; ½ teaspoon ground ginger; ¼ teaspoon ground turmeric; ¼ teaspoon cayenne pepper; ¼ teaspoon ground cloves; 1 pinch saffron; 2 medium onions, cut into 1-inch cubes; 5  carrots, peeled, cut into fourths, then sliced lengthwise into thin strips; 3 cloves garlic, minced; 1 tablespoon freshly grated ginger; 1  lemon, zested; 1 (14.5 ounce) can homemade chicken broth or low-sodium canned broth; 1 tablespoon sun-dried tomato paste; 1 tablespoon honey; 1 tablespoon cornstarch (Optional); 1 tablespoon water (Optional)",
  "directions": "1. Place lamb and 2 tablespoons olive oil in a large bowl and toss to coat; set aside. 2. Mix together paprika, cinnamon, salt, garlic powder, coriander, cumin, cardamom, ginger, turmeric, cayenne, cloves, and saffron in a large resealable bag. Add lamb to the bag and toss around to coat well. Refrigerate for at least 8 hours, preferably overnight. 3. Heat remaining 1 tablespoon olive oil in a large, heavy-bottomed pot over medium-high heat. Add 1/3 of the lamb and brown well, 5 to 7 minutes. Remove to a plate and repeat to cook remaining two batches of lamb. 4. Add onions and carrots to the pot and cook for 5 minutes. Stir in garlic and ginger; continue cooking for an additional 5 minutes. Return lamb to the pot and stir in lemon zest, chicken broth, tomato paste, and honey. Bring to a boil, then reduce heat to low. Cover and simmer, stirring occasionally, until meat is tender, 1 1/2 to 2 hours. 5. If the consistency of tagine is too thin, you may thicken it with cornstarch and water slurry during the last 5 minutes. 6. Serve over couscous.",
  "prep": "45 mins",
  "cook": "2 hrs",
  "total": "10 hrs 45 mins",
  "calories": "423"
},
{
  "url": "https://www.allrecipes.com/recipe/240559/traditional-gyros/",
  "name": "Traditional Gyros",
  "rating": "4.5",
  "ratingcount": "32",
  "ingredients": "1 small onion, cut into chunks; 1 pound ground lamb; 1 pound ground beef; 1 tablespoon minced garlic; 1 teaspoon dried oregano; 1 teaspoon ground cumin; 1 teaspoon dried marjoram; 1 teaspoon dried thyme; 1 teaspoon dried rosemary; 1 teaspoon freshly ground black pepper; ¼ teaspoon sea salt; 12 tablespoons hummus; 12  pita bread rounds; 1 small head lettuce, shredded; 1 large tomato, sliced; 1 large red onion, sliced; 6 ounces crumbled feta cheese; 24 tablespoons tzatziki sauce",
  "directions": "1. Place onion in a food processor and finely chop. Transfer onion to a piece of cheesecloth and squeeze out the liquid. Place onion in a large bowl. 2. Mix lamb, beef, garlic, oregano, cumin, marjoram, thyme, rosemary, black pepper, and salt with the onion using your hands until well mixed. Cover bowl with plastic wrap and refrigerate until flavors blend, about 2 hours. 3. Preheat the oven to 325 degrees F (165 degrees C). 4. Place meat mixture in a food processor and pulse until finely chopped and tacky, about 1 minute. Pack meat mixture into a 7x4-inch loaf pan, ensuring there are no air pockets. Place the loaf pan into a roasting pan and pour enough boiling water around the loaf pan to reach halfway up the sides for a water bath. 5. Bake in the preheated oven until no longer pink in the center, 45 to 60 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Pour off any accumulated fat and cool slightly. 6. Thinly slice the cooked gyro meat loaf. 7. Spread 1 tablespoon hummus onto each pita bread. Then top each with some of the gyro meat slices, shredded lettuce, tomato slices, red onion slices, feta cheese crumbles, and 2 tablespoons tzatziki sauce to complete each sandwich.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "3 hrs 15 mins",
  "calories": "425"
},
{
  "url": "https://www.allrecipes.com/recipe/262546/authentic-turkish-doner-kebab/",
  "name": "Turkish Doner Kebab",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 teaspoon all-purpose flour; 1 teaspoon dried oregano; ½ teaspoon salt; ½ teaspoon garlic powder; ½ teaspoon onion powder; ½ teaspoon dried Italian herb seasoning; ¼ teaspoon ground black pepper; ¼ teaspoon cayenne pepper; 1 ¼ pounds ground lamb",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine flour, oregano, salt, garlic powder, onion powder, Italian seasoning, black pepper, and cayenne pepper in a large bowl. Add ground lamb and knead until thoroughly mixed together, about 3 minutes. 3. Shape seasoned lamb mixture and place into a loaf pan; set on top of a baking sheet. 4. Bake in the preheated oven, turning halfway to ensure even browning, for about 1 hour and 20 minutes. 5. Wrap loaf in aluminum foil and let rest for about 10 minutes. Slice as thinly as possible to make doner kebab pieces.",
  "prep": "10 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 40 mins",
  "calories": "284"
},
{
  "url": "https://www.allrecipes.com/recipe/137917/simple-grilled-lamb-chops/",
  "name": "Simple Grilled Lamb Chops",
  "rating": "4.7",
  "ratingcount": "363",
  "ingredients": "1  onion, thinly sliced; ¼ cup distilled white vinegar; 2 tablespoons olive oil; 1 tablespoon minced garlic; 2 teaspoons salt; ½ teaspoon black pepper; 6 (6 ounce) lamb chops",
  "directions": "1. Mix together onion, vinegar, oil, garlic, salt, and pepper in a large resealable bag. Add lamb, seal bag, and toss to coat. Marinate in the refrigerator for 2 hours. 2. Preheat an outdoor grill for medium-high heat. 3. Remove lamb from marinade and leave any onions on that stick to meat; discard marinade. Wrap exposed ends of bones with aluminum foil to keep them from burning. 4. Cook on the preheated grill to desired doneness, about 3 minutes per side for medium. An instant-read thermometer inserted into the center should read at least 130 degrees F (54 degrees C). 5. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "6 mins",
  "total": "2 hrs 16 mins",
  "calories": "519"
},
{
  "url": "https://www.allrecipes.com/recipe/8479335/moroccan-harira-soup/",
  "name": "Moroccan Harira Soup",
  "rating": "5.0",
  "ratingcount": "7",
  "ingredients": "2 tablespoons extra-virgin olive oil, plus more for garnish; 12 ounces boneless lamb shoulder, cut into 1/2 -inch pieces (Optional); 1 large yellow onion, diced; 1 teaspoon kosher salt, divided, or to taste; 1 ½ teaspoons smoked paprika; 1 teaspoon ground coriander; 1 teaspoon ground cumin; ½ teaspoon ground ginger; ½ teaspoon freshly ground black pepper; ¼ teaspoon ground cinnamon; 4 cloves garlic, minced; 1 tablespoon tomato paste; 4 cups chicken broth; 1 (15 ounce) can crushed tomatoes; 2 ribs celery with leaves, chopped; 2 cups water, or to taste; 1 (15 ounce) can chickpeas, drained; ¾ cup green lentils, rinsed; 1 tablespoon all-purpose flour; 2 tablespoons cold water; ½ cup chopped fresh cilantro, divided; ½ cup chopped fresh parsley, divided; ½ cup vermicelli, broken into 1/2-inch pieces; ⅛ teaspoon cayenne pepper; 1  lemon, juiced",
  "directions": "1. Gather all ingredients. 2. Heat olive oil in a stock pot over medium-high heat and cook cubed lamb until nicely browned and some of the fat has rendered, about 5 minutes. 3. Toss in diced onion and a generous pinch of salt. Cook, stirring often, until onion is soft and lightly browned, 4 to 5 minutes. Season with smoked paprika, coriander, cumin, ground ginger, black pepper, and cinnamon. Add minced garlic and cook and stir until fragrant, 30 seconds to 1 minute. 4. Add tomato paste and cook and stir for about 1 minute. 5. Add chicken broth, crushed tomatoes, and celery; stir until well combined. Add water and bring to a boil over high heat. 6. Once soup is boiling, add chickpeas and green lentils; season with salt to taste. Reduce heat to medium-low and simmer for 30 minutes, stirring occasionally. 7. Mix flour and 2 tablespoons cold water in a small bowl and drizzle slurry into the soup to thicken. 8. Bring back to a simmer and add 1/2 of the cilantro and 1/2 of the parsley; stir to combine. 9. Simmer on medium-low heat until meat and lentils are perfectly tender and soup has thickened, about 20 more minutes. 10. Stir in vermicelli and cook until tender, 10 to 15 minutes. Taste and adjust seasoning with cayenne and salt. Add remaining chopped cilantro and parsley and finish by drizzling lemon juice to taste into the soup. 11. Serve immediately with a drizzle of olive oil.",
  "prep": "20 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 40 mins",
  "calories": "214"
},
{
  "url": "https://www.allrecipes.com/recipe/236679/lamb-burgers/",
  "name": "Lamb Burgers",
  "rating": "4.8",
  "ratingcount": "35",
  "ingredients": "1 pound ground lamb; 1 tablespoon garlic powder; 1  4-inch sprig rosemary, chopped; 4 sprigs thyme, chopped; 1 pinch salt; 1 pinch ground black pepper; 3 tablespoons mayonnaise; 1 tablespoon Dijon mustard; 4  hamburger buns, split and toasted; 4 thick slices tomato; 1 cup baby mixed salad greens",
  "directions": "1. Preheat an outdoor grill for medium heat and lightly oil the grate. 2. Mix ground lamb, garlic powder, rosemary, thyme, salt, and pepper together in a large bowl until thoroughly combined. 3. Shape mixture into 4 patties. 4. Place patties on the preheated grill and cook until firm and slightly pink in the center, about 5 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Alternately, you can cook the patties to your desired degree of doneness. Rest patties while assembling toppings. 5. Mix mayonnaise and mustard together in a small bowl. 6. Spread 1 tablespoon on bottom of each hamburger bun; top each one with a lamb patty, tomato slice, and some greens. Sandwich with top bun to serve.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "439"
},
{
  "url": "https://www.allrecipes.com/recipe/269632/slow-cooker-lamb-stew/",
  "name": "Slow Cooker Lamb Stew",
  "rating": "4.7",
  "ratingcount": "21",
  "ingredients": "1 tablespoon olive oil; 1 pound cubed lamb stew meat; 1 large onion, sliced into petals; 1 pound red potatoes, cut into large cubes; 2 large carrots, sliced; 2 stalks celery, sliced; 4  fresh button mushrooms, sliced; 2 cups beef broth; 1 (6 ounce) can tomato paste; ½ cup beer; 3 tablespoons Worcestershire sauce; 1  large sprig fresh rosemary; salt and pepper to taste; 1 ½ cups frozen peas",
  "directions": "1. Heat oil in a large skillet over medium-high heat. Add lamb and onions; cook and stir until lamb is browned and onions are starting to soften, about 5 minutes. Transfer lamb mixture to a slow cooker. 2. Add potatoes, carrots, celery, and mushrooms. Stir in beef broth, tomato paste, beer, Worcestershire sauce, rosemary, salt, and pepper; cover. 3. Cook on High for 7 hours. Add peas and cook for an additional 15 minutes. Season with salt and pepper.",
  "prep": "15 mins",
  "cook": "7 hrs 25 mins",
  "total": "7 hrs 40 mins",
  "calories": "438"
},
{
  "url": "https://www.allrecipes.com/recipe/106030/kofta-kebabs/",
  "name": "Kofta Kebabs",
  "rating": "4.7",
  "ratingcount": "424",
  "ingredients": "4 cloves garlic, minced; 1 teaspoon kosher salt; 1 pound ground lamb; 3 tablespoons grated onion; 3 tablespoons chopped fresh parsley; 1 tablespoon ground coriander; 1 teaspoon ground cumin; ½ tablespoon ground cinnamon; ½ teaspoon ground allspice; ¼ teaspoon cayenne pepper; ¼ teaspoon ground ginger; ¼ teaspoon ground black pepper; 28  bamboo skewers, soaked in water for 30 minutes",
  "directions": "1. Mash garlic into a paste with salt using a mortar and pestle or the flat side of a chef's knife on your cutting board. 2. Mix garlic into lamb with onion, parsley, coriander, cumin, cinnamon, allspice, cayenne pepper, ginger, and pepper in a mixing bowl until well blended. 3. Form mixture into 28 balls. Form each ball around the tip of a skewer, flattening it into a 2-inch oval; repeat with remaining skewers. Place kebabs onto a baking sheet, cover, and refrigerate for at least 30 minutes, or up to 12 hours. 4. Preheat an outdoor grill for medium heat and lightly oil the grate. 5. Cook skewers on the preheated grill, turning occasionally, until browned and cooked through, about 5 to 6 minutes. An instant-read thermometer inserted into the center of a kebab should read at least 145 degrees F (63 degrees C). 6. Serve hot and enjoy!",
  "prep": "45 mins",
  "cook": "5 mins",
  "total": "1 hr 20 mins",
  "calories": "35"
},
{
  "url": "https://www.allrecipes.com/recipe/16035/irish-lamb-stew/",
  "name": "Irish Lamb Stew",
  "rating": "4.7",
  "ratingcount": "606",
  "ingredients": "1 ½ pounds thickly sliced bacon, diced; 6 pounds boneless lamb shoulder, cut into 2 inch pieces; ½ cup all-purpose flour; ½ teaspoon salt; ½ teaspoon ground black pepper; 1 large onion, chopped; 3 cloves garlic, minced; ½ cup water; 4 cups beef stock; 2 teaspoons white sugar; 4 cups diced carrots; 3  potatoes, peeled and cubed; 2 large onions, cut into bite-size pieces; 1 cup white wine; 1 teaspoon dried thyme; 2  bay leaves",
  "directions": "1. Place bacon in a large skillet and cook over medium-high heat, stirring occasionally, until evenly browned, about 10 minutes. Use a slotted spoon to transfer bacon to a paper towel-lined plate to drain. Reserve bacon fat in the skillet. 2. Place lamb, flour, salt, and pepper in a large mixing bowl; toss to coat evenly. Brown lamb in bacon fat in the skillet over medium-high heat. Transfer browned meat into a stockpot, leaving 1/4 cup of fat in the skillet. 3. Cook onion and garlic in reserved fat in the skillet over medium heat until onion is golden. Deglaze the skillet with water, then pour onion mixture into the stockpot. Add bacon, beef stock, and sugar to the stockpot. Cover and simmer for 1 1/2 hours. 4. Add carrots, potatoes, onions, wine, thyme, and bay leaves to the stockpot. Reduce heat and simmer, covered, until vegetables are tender, about 20 minutes.",
  "prep": "20 mins",
  "cook": "2 hrs 25 mins",
  "total": "2 hrs 45 mins",
  "calories": "672"
},
{
  "url": "https://www.allrecipes.com/recipe/241480/braised-lamb-shoulder-chops/",
  "name": "Braised Lamb Shoulder Chops",
  "rating": "4.7",
  "ratingcount": "148",
  "ingredients": "1 tablespoon olive oil; 2 pounds lamb shoulder chops, or more to taste; salt and ground black pepper to taste; 1 small yellow onion, sliced; 4 cloves garlic, minced; 2 tablespoons chopped fresh rosemary; 1 cup beef broth; 1 cup red wine; ½ cup water; 2 tablespoons cornstarch; 1 tablespoon Worcestershire sauce",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Heat olive oil in a skillet over medium-high heat. Season lamb chops with salt and pepper. Sear lamb in hot oil until browned, 1 to 2 minutes per side. Remove chops to a plate, reserving drippings in the skillet. 3. Sauté onion and garlic in reserved drippings over medium heat until onion is tender, about 5 minutes. Remove from heat. 4. Transfer lamb chops to a baking dish; add onion mixture. Sprinkle rosemary over chops. Pour beef broth and red wine into the baking dish. Cover the dish with aluminum foil. 5. Bake in the preheated oven for 3 hours. Remove lamb chops to a serving platter. 6. Carefully pour liquid from the baking dish into a saucepan. Whisk together water and cornstarch in a bowl until no lumps remain; stir into liquid in the saucepan. Add Worcestershire sauce and cook over medium heat until thickened, about 5 minutes. 7. Spoon sauce over lamb chops and serve.",
  "prep": "20 mins",
  "cook": "3 hrs 10 mins",
  "total": "3 hrs 30 mins",
  "calories": "360"
},
{
  "url": "https://www.allrecipes.com/recipe/262939/slow-cooker-lamb-chops/",
  "name": "Slow Cooker Lamb Chops",
  "rating": "4.9",
  "ratingcount": "15",
  "ingredients": "½  sweet onion, roughly chopped; ½ cup red wine; 3 tablespoons honey; 2 tablespoons Dijon mustard; 2 tablespoons lemon juice; 4  garlic cloves, minced; 1 tablespoon ground thyme; 1 tablespoon dried rosemary; 2 teaspoons ground basil; 1 teaspoon salt; 1 teaspoon coarse ground black pepper; ¼ cup tapioca starch; 1 ½ pounds sirloin lamb chops, room temperature",
  "directions": "1. Combine onion and red wine in a slow cooker. 2. Whisk honey, mustard, lemon juice, garlic, thyme, rosemary, basil, salt, and pepper together in a small bowl until well blended. Add tapioca starch and whisk until well combined. Let sit until mixture is thickened, at least 5 minutes. 3. Dip lamb chops in the honey-mustard mixture and massage until fully coated. 4. Place chops in a single layer over the red wine and onion mixture in the slow cooker. Pour remaining honey-mustard mixture on top. 5. Cover slow cooker and cook on Low for 4 1/2 hours.",
  "prep": "15 mins",
  "cook": "4 hrs 30 mins",
  "total": "4 hrs 50 mins",
  "calories": "209"
},
{
  "url": "https://www.allrecipes.com/recipe/221996/roasted-lamb-breast/",
  "name": "Roasted Lamb Breast",
  "rating": "4.5",
  "ratingcount": "77",
  "ingredients": "2 tablespoons olive oil; 2 teaspoons ground cumin; 2 teaspoons salt; 1 teaspoon freshly ground black pepper; 1 teaspoon dried Italian herb seasoning; 1 teaspoon ground cinnamon; 1 teaspoon ground coriander; 1 teaspoon paprika; 4 pounds lamb breast, separated in two pieces; aluminum foil; ½ cup chopped Italian flat leaf parsley; ⅓ cup white wine vinegar, more as needed; 1  lemon, juiced; 2 cloves garlic, crushed; 1 teaspoon honey; ½ teaspoon red pepper flakes; 1 pinch salt",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Whisk olive oil, cumin, salt, black pepper, Italian herb seasoning, cinnamon, coriander, and paprika in a large bowl until combined. 3. Coat lamb breasts in spice mixture, then place fat-side-up in a roasting pan. Tightly cover the roasting pan with aluminum foil. 4. Bake in the preheated oven until meat is tender when pierced with a fork, about 2 hours. 5. Meanwhile, combine chopped parsley, vinegar, fresh lemon juice, garlic, honey, red pepper flakes, and salt in a bowl. Mix well and set aside. 6. Remove meat from the oven. 7. Increase oven temperature to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil. 8. Remove lamb from the roasting pan and cut into 4 pieces. Place lamb pieces on the prepared baking sheet. Brush tops with fat drippings from the roasting pan. 9. Roast in the preheated oven until meat is browned and edges are crispy, about 20 minutes. 10. Turn the oven broiler to high and brown meat until top is golden brown, about 4 minutes. Serve lamb topped with parsley-vinegar sauce.",
  "prep": "30 mins",
  "cook": "2 hrs 25 mins",
  "total": "2 hrs 55 mins",
  "calories": "622"
},
{
  "url": "https://www.allrecipes.com/recipe/220519/irish-shepherds-pie/",
  "name": "Irish Shepherd's Pie",
  "rating": "4.6",
  "ratingcount": "539",
  "ingredients": "1 tablespoon olive oil; 1 tablespoon butter; 2 pounds lean ground lamb; 1  onion, diced; ⅓ cup all-purpose flour; 3 cloves garlic, minced; 1 tablespoon ketchup; 2 teaspoons minced fresh rosemary; 1 teaspoon paprika; ⅛ teaspoon ground cinnamon; salt and ground black pepper to taste; 2 ½ cups water, or as needed; 1 (12 ounce) package frozen peas and carrots, thawed; 2 ½ pounds Yukon Gold potatoes, peeled and halved; ¼ pound Irish cheese (such as Dubliner®), shredded; ¼ cup cream cheese; 1 tablespoon butter; 1 pinch ground cayenne pepper; 1 large egg yolk; 2 tablespoons milk",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Place olive oil and butter in a Dutch oven over medium heat. Stir in ground lamb and onion; cook and stir until meat is brown and crumbly, about 10 minutes. 3. Stir in flour until incorporated. Mix in garlic, ketchup, rosemary, paprika, cinnamon, salt, and pepper; cook and stir until garlic is fragrant, 2 to 3 minutes. 4. Stir in water, scraping up any brown bits from the bottom of the Dutch oven. Reduce heat to medium-low and bring mixture to a simmer; cook and stir until thick, 5 to 6 minutes. 5. Remove lamb mixture from heat, then stir in peas and carrots until combined. 6. Spread lamb mixture into the bottom of a 9x13-inch baking dish; set aside. 7. Place potatoes into a large pot of salted water. Bring to a boil, reduce heat to medium, and cook until tender, about 15 minutes. Drain well and return potatoes to the pot. 8. Mash Irish cheese, cream cheese, butter, and cayenne pepper into potatoes until smooth. Season with salt and black pepper. 9. Whisk together egg yolk and milk in a small bowl; stir into mashed potato mixture. 10. Top lamb mixture in the baking dish with mashed potatoes; spread evenly to cover. 11. Bake in the preheated oven until the top is golden brown and sauce is bubbling up around the edges, 25 to 30 minutes.",
  "prep": "25 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 35 mins",
  "calories": "517"
},
{
  "url": "https://www.allrecipes.com/recipe/284800/oven-roasted-lamb-chops/",
  "name": "Oven-Roasted Lamb Chops",
  "rating": "4.5",
  "ratingcount": "6",
  "ingredients": "4 (4 ounce) lamb chops; 1 tablespoon olive oil, or as needed; 1 clove garlic, minced; ½ tablespoon crushed fresh rosemary leaves; sea salt and freshly ground black pepper to taste; ¼ cup mint jelly",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Cut away excess fat from lamb chops (some fat does add flavor). Coat each chop lightly in olive oil. Season lamb chops with garlic, rosemary, salt, and pepper. Place lamb chops in a cast iron skillet. 3. Bake uncovered in the preheated oven until cooked through, 8 to 10 minutes. An instant-read thermometer inserted into the center should read at least 140 degrees F (60 degrees C) for medium-well doneness. 4. Remove from the oven and cover tightly with foil; let rest for 8 to 10 minutes. Serve with mint jelly on the side.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "289"
},
{
  "url": "https://www.allrecipes.com/recipe/18870/roast-leg-of-lamb-with-rosemary/",
  "name": "Roast Leg of Lamb with Rosemary",
  "rating": "4.6",
  "ratingcount": "723",
  "ingredients": "¼ cup honey; 3 cloves garlic, minced; 2 tablespoons chopped fresh rosemary; 2 tablespoons prepared Dijon-style mustard; 1 teaspoon lemon zest; 1 teaspoon freshly ground black pepper; 5 pounds whole leg of lamb; 1 teaspoon coarse sea salt",
  "directions": "1. Mix honey, garlic, rosemary, mustard, lemon zest, and pepper together in a small bowl. Place lamb in a flat dish; rub mixture over lamb. Cover with plastic wrap and marinate in the refrigerator 8 hours to overnight. 2. Preheat the oven to 450 degrees F (230 degrees C). Transfer lamb onto a rack in a roasting pan and sprinkle with salt to taste. 3. Bake in the preheated oven for 20 minutes, then reduce heat to 400 degrees F (200 degrees C) and roast for 55 to 60 more minutes for medium rare. An instant-read thermometer inserted into the center should read at least 120 degrees F (50 degrees C). Let lamb rest for about 10 minutes before carving.",
  "prep": "15 mins",
  "cook": "1 hr 20 mins",
  "total": "9 hrs 45 mins",
  "calories": "553"
},
{
  "url": "https://www.allrecipes.com/recipe/283435/traditional-shepherds-pie/",
  "name": "Traditional Shepherd's Pie",
  "rating": "4.8",
  "ratingcount": "9",
  "ingredients": "3 pounds Yukon Gold potatoes; 1 tablespoon kosher salt; ¼ cup milk; 3 tablespoons salted butter, divided; 1 cup shredded white Cheddar cheese; ¼ cup sour cream; 1 large egg yolk; 2 teaspoons kosher salt, divided; 1 teaspoon ground black pepper, divided; 1 tablespoon olive oil; 1 cup diced onion; 1 cup diced carrot; 1 pound ground lamb; 1 pound ground beef sirloin; 3 tablespoons all-purpose flour; 1 teaspoon finely chopped fresh rosemary; 1 teaspoon finely chopped fresh thyme; 1 cup beef stock; 1 tablespoon tomato paste; 1 tablespoon Worcestershire sauce; 1 cup frozen green peas; 1 tablespoon chopped fresh parsley, or to taste",
  "directions": "1. Place potatoes in large saucepan and add enough water to cover by 2 inches. Stir in 1 tablespoon salt and place pot over medium-high heat; bring to a boil. Cook until potatoes are fork tender, about 10 minutes. Turn off the heat and drain. 2. Return potatoes to the hot pan and set over the same burner. Add milk and 2 tablespoons butter; allow butter to melt from the residual heat. Mash potatoes with a potato masher until smooth. Stir in Cheddar cheese, sour cream, egg yolk, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Set aside while you prepare the filling. 3. Preheat the oven to 375 degrees F (190 degrees C). Grease a 9x13-inch casserole dish. 4. Heat olive oil and remaining 1 tablespoon butter in a large skillet over medium-high heat. Add onion and carrot and cook, stirring constantly, until onion begins to turn translucent, about 5 minutes. 5. Add lamb and beef and cook, crumbling with a spoon and stirring often until browned, about 5 minutes. Sprinkle meat mixture with flour, remaining salt and pepper, rosemary, and thyme. Cook, stirring constantly, for 2 minutes. 6. Add beef stock, tomato paste, and Worcestershire; cook, scraping any flavorful bits from the bottom of the skillet. Bring mixture to a simmer. Cook until thickened and vegetables are tender, about 8 minutes. Stir in peas. Transfer mixture to the prepared casserole dish and top with the prepared mashed potatoes. 7. Bake in the preheated oven until golden and bubbly around the edges, 25 to 30 minutes. Sprinkle with parsley and serve.",
  "prep": "20 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 25 mins",
  "calories": "502"
},
{
  "url": "https://www.allrecipes.com/recipe/80398/serbian-cevapcici/",
  "name": "Serbian Ćevapčići",
  "rating": "4.6",
  "ratingcount": "79",
  "ingredients": "1 ½ pounds ground pork; 1 pound lean ground beef; ½ pound ground lamb; 1  egg white; 4 cloves garlic, minced; 2 teaspoons ground black pepper; 1 teaspoon salt; 1 teaspoon baking soda; 1 teaspoon cayenne pepper; ½ teaspoon paprika",
  "directions": "1. Gather all ingredients. 2. Preheat an outdoor grill for medium heat and lightly oil the grate. 3. Combine ground pork, ground beef, ground lamb, and egg white in a large bowl. 4. Add garlic, black pepper, salt, baking soda, cayenne pepper, and paprika. Mix well using your hands; form into finger-length sausages about 3/4-inch thick. 5. Cook sausages on the preheated grill, turning occasionally, until no longer pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "690"
},
{
  "url": "https://www.allrecipes.com/recipe/274989/grilled-lamb-loin-chops/",
  "name": "Grilled Lamb Loin Chops",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "2 tablespoons herbes de Provence; 1 ½ tablespoons olive oil; 2 cloves garlic, minced; 2 teaspoons lemon juice; 8 (5 ounce) lamb loin chops; salt and ground black pepper to taste",
  "directions": "1. Combine herbes de Provence, oil, garlic, and lemon juice in a small bowl. Rub mixture over lamb chops; cover and refrigerate for at least 1 hour, or up to 4 hours for maximum flavor. 2. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 3. Season chops with salt and pepper. 4. Place chops on the preheated grill and cook until browned on the outside and an instant-read thermometer inserted into the center reads at least 125 degrees F (52 degrees C) for medium-rare, 3 to 4 minutes per side. 5. Transfer chops to an aluminum foil-covered plate; let rest for 5 minutes before serving.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "1 hr 20 mins",
  "calories": "579"
},
{
  "url": "https://www.allrecipes.com/recipe/68735/tomato-bredie/",
  "name": "Tomato Bredie",
  "rating": "4.8",
  "ratingcount": "23",
  "ingredients": "1 tablespoon vegetable oil; 3 ½ pounds lamb or mutton breast chops, chopped into portions; 2 tablespoons cake flour; 1 large onion, chopped; 2 ¼ pounds fresh tomatoes, chopped; 1 tablespoon white vinegar; 2  bay leaves; 1 cube beef bouillon cube; 1 teaspoon salt; 1 teaspoon brown sugar; 6  whole white peppercorns; ½ teaspoon freshly ground black pepper; 1 dash Worcestershire sauce; 2 medium potatoes, quartered (Optional)",
  "directions": "1. Heat oil in a large, heavy-bottomed saucepan over medium-high heat. 2. Dredge lamb in flour; shake off excess. 3. Cook lamb in hot oil until browned all over. Transfer lamb to a plate, reserving drippings in the pan. 4. Cook and stir onion in drippings until soft, about 5 minutes. Mix in tomatoes. Return lamb chops to the saucepan; season with bay leaves, bouillon, salt, brown sugar, white peppercorns, black pepper, and Worcestershire sauce. Cover, reduce heat, and simmer for 1 hour and 15 minutes. Stir occasionally, making sure nothing sticks to the bottom of the pan. 5. Stir in potatoes; continue cooking until potatoes are cooked and meat is tender, about 45 minutes more.",
  "prep": "30 mins",
  "cook": "2 hrs 15 mins",
  "total": "2 hrs 45 mins",
  "calories": "531"
},
{
  "url": "https://www.allrecipes.com/recipe/222394/pistachio-crusted-rack-of-lamb/",
  "name": "Pistachio-Crusted Rack of Lamb",
  "rating": "4.9",
  "ratingcount": "122",
  "ingredients": "2  racks of lamb, trimmed; 1 teaspoon herbes de Provence; salt and ground black pepper to taste; 1 tablespoon vegetable oil; ⅔ cup chopped pistachio nuts; 2 tablespoons dry bread crumbs; 1 tablespoon melted butter; 1 teaspoon olive oil; 3 tablespoons Dijon mustard",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil. 2. Generously season each rack of lamb with herbes de Provence, salt, and pepper. 3. Heat vegetable oil in a large skillet over high heat. Place lamb into the skillet and cook until browned on all sides, 6 to 8 minutes. Transfer to the prepared baking sheet. 4. Stir pistachios, bread crumbs, melted butter, and olive oil together in a small bowl; season with salt and pepper. Spread mustard over the fatty side of lamb, then press pistachio mixture into mustard. 5. Bake in the preheated oven until crust is golden and lamb is pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 130 degrees F (54 degrees C) for medium doneness. 6. Transfer lamb to a plate and let rest for 10 minutes before slicing.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "619"
},
{
  "url": "https://www.allrecipes.com/recipe/33252/indian-style-sheekh-kabab/",
  "name": "Indian-Style Seekh Kebab",
  "rating": "4.7",
  "ratingcount": "136",
  "ingredients": "2 pounds lean ground lamb; 2 medium onions, finely chopped; ½ cup fresh mint leaves, finely chopped; ½ cup cilantro, finely chopped; 1 tablespoon ginger paste; 1 tablespoon green chile paste; 2 teaspoons ground cumin; 2 teaspoons ground coriander; 2 teaspoons paprika; 2 teaspoons salt; 1 teaspoon cayenne pepper; 8  skewers; ¼ cup vegetable oil for brushing, or as needed",
  "directions": "1. Mix ground lamb, onions, mint, cilantro, ginger paste, and chile paste together in a large bowl. Season with cumin, coriander, paprika, salt, and cayenne. Cover and chill in the refrigerator for 2 hours. Soak skewers in cold water. 2. Divide lamb mixture into 8 equal portions; mold portions onto skewers to form a sausage shape. Refrigerate skewers until you are ready to grill. 3. Preheat an outdoor grill for high heat and brush the grate liberally with oil. 4. Cook skewers on the preheated grill, turning frequently, until nicely browned on all sides and meat is no longer pink in the center, about 10 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C).",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "2 hrs 25 mins",
  "calories": "311"
},
{
  "url": "https://www.allrecipes.com/recipe/74037/lamb-chops-with-balsamic-reduction/",
  "name": "Lamb Chops with Balsamic Reduction",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "¾ teaspoon dried rosemary; ½ teaspoon dried thyme; ¼ teaspoon dried basil; salt and pepper to taste; 4  lamb chops (3/4 inch thick); 1 tablespoon olive oil; ¼ cup minced shallots; ⅓ cup aged balsamic vinegar; ¾ cup chicken broth; 1 tablespoon butter",
  "directions": "1. Mix rosemary, thyme, basil, salt, and pepper together in a small bowl; rub onto chops, coating both sides. Place chops onto a plate, cover, and let sit for 15 minutes. 2. Heat oil in a large skillet over medium-high heat. Cook chops in the hot skillet until no longer pink in the center, about 3 1/2 minutes per side for medium-rare. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Transfer to a serving platter and keep warm. 3. Add shallots to the skillet; cook and stir until just browned, 2 to 3 minutes. Pour vinegar into the pan and bring to a boil while scraping the browned bits of food off the bottom of the pan with a wooden spoon. Add broth; cook and stir until sauce has reduced by half, about 5 minutes. 4. Remove sauce from the heat and stir in butter until melted. Serve over chops.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "255"
},
{
  "url": "https://www.allrecipes.com/recipe/112150/heavenly-lamb-shanks/",
  "name": "Heavenly Lamb Shanks",
  "rating": "4.4",
  "ratingcount": "62",
  "ingredients": "½ cup olive oil; 4 (1 pound) lamb shanks; ⅔ cup all-purpose flour; 2  stalks celery, chopped; 2  carrots, chopped; 2  onions, cut into chunks; 1  leek, halved and cut into 1/2-inch pieces; 12 cloves garlic, unpeeled; 1  bay leaf; 1 teaspoon whole black peppercorns; 1 sprig thyme; 1 sprig rosemary; 3 cups chicken stock; 1 ½ cups red wine; 1 pinch sea salt to taste",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Heat olive oil in a heavy, metal roasting pan on the stove over medium-high heat. Toss shanks with flour to coat well; then shake off excess. Sear shanks in hot oil until well browned on all sides, then remove from the pan and set aside. 3. Add celery, carrots, onion, leek, and garlic to the roasting pan. Cook until softened and lightly browned, stirring constantly; about 5 minutes. Season with bay leaf, peppercorns, thyme, and rosemary. Pour in chicken stock and red wine, increase heat to high, and bring to a simmer. Season to taste with salt. Place the lamb shanks on top of the vegetables. 4. Cover the roasting pan tightly with heavy aluminum foil and place into the preheated oven. Bake gently until meat is tender and falls off the bone, 2 1/2 to 3 hours. 5. Remove bay leaf and herb stems before serving shanks with vegetables and sauce.",
  "prep": "20 mins",
  "cook": "3 hrs",
  "total": "3 hrs 20 mins",
  "calories": "824"
},
{
  "url": "https://www.allrecipes.com/recipe/18810/baked-lamb-chops/",
  "name": "Baked Lamb Chops",
  "rating": "4.2",
  "ratingcount": "185",
  "ingredients": "3 large eggs; 3 teaspoons Worcestershire sauce; 2 cups dry bread crumbs; 12 (5.5 ounce) lamb chops",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Beat together eggs and Worcestershire sauce in a shallow bowl. Place bread crumbs in a second shallow bowl. Dip each lamb chop in egg mixture, then lightly dredge in bread crumbs to coat. Arrange lamb chops in a 9x13-inch baking dish. 3. Bake in the preheated oven for 20 minutes. Turn lamb chops over and continue cooking to desired doneness, about 20 more minutes. An instant-read thermometer inserted into the center of chops should read 130 degrees F (55 degrees C) for medium doneness.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "738"
},
{
  "url": "https://www.allrecipes.com/recipe/257284/grilled-leg-of-lamb-steaks/",
  "name": "Grilled Leg of Lamb Steaks",
  "rating": "4.8",
  "ratingcount": "13",
  "ingredients": "4  bone-in lamb steaks; ¼ cup olive oil; 4 large cloves garlic, minced; 1 tablespoon chopped fresh rosemary; salt and ground black pepper to taste",
  "directions": "1. Place lamb steaks in a single layer in a shallow dish. Cover with olive oil, garlic, rosemary, salt, and pepper. Flip steaks to coat both sides. Cover and marinate for 30 minutes. 2. Preheat an outdoor grill for high heat and lightly oil the grate. 3. Cook steaks on the preheated grill until nicely browned on the outside and slightly pink in the center, about 5 minutes per side for medium. An instant-read thermometer inserted into the center should read at least 140 degrees F (60 degrees C).",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "50 mins",
  "calories": "327"
},
{
  "url": "https://www.allrecipes.com/recipe/236603/chef-johns-irish-stew/",
  "name": "Chef John's Irish Stew",
  "rating": "4.8",
  "ratingcount": "120",
  "ingredients": "3 pounds lamb shoulder chops; salt and ground black pepper to taste; 1 tablespoon vegetable oil; 1  onion, chopped; 1 tablespoon butter; 2 tablespoons all-purpose flour; 3 cups chicken stock; ½ teaspoon dried rosemary; 2  carrots, chopped; 2 stalks celery, chopped; water as needed; 1 ½ pounds baby Dutch yellow potatoes; ¼ cup chopped green onions",
  "directions": "1. Season lamb shoulder chops with salt and black pepper. 2. Heat oil in a large heavy skillet over high heat. Working in batches, cook lamb shoulder chops until browned on both sides, 3 to 5 minutes per side. Transfer chops to a stock pot. 3. Cook and stir onion with a pinch of salt in the same skillet over medium heat until slightly softened and edges are browning, about 5 minutes. Stir butter into onion until melted; add flour and stir until onions are coated, about 1 minute. 4. Pour stock into onion mixture; bring to a boil, add rosemary, and stir until mixture thickens, 5 to 10 minutes. 5. Stir carrots and celery into pot with lamb shoulder chops and pour chicken stock mixture over the top. Add water as needed to cover meat completely. Bring mixture to a simmer, reduce heat to low, cover the pot with a lid, and cook until meat is almost falling off the bone, about 1 1/2 hours. 6. Transfer meat to a plate. Stir potatoes into stew and return meat to stew, placing on top of vegetables. Simmer, covered, until potatoes are tender and meat is falling off the bone, about 30 minutes. 7. Transfer meat to a plate using a slotted spoon. Bring stew to a boil and cook, skimming off fat, until stew is reduced and thick, 10 to 12 minutes. 8. Remove meat from bones; discard bones and any pieces of fat. Stir meat back into stew. Stir green onions into stew and season with salt and pepper to taste.",
  "prep": "20 mins",
  "cook": "2 hrs 25 mins",
  "total": "2 hrs 45 mins",
  "calories": "508"
},
{
  "url": "https://www.allrecipes.com/recipe/241514/slow-cooker-roasted-leg-of-lamb/",
  "name": "Slow Cooker Roasted Leg of Lamb",
  "rating": "4.3",
  "ratingcount": "38",
  "ingredients": "1 (3 pound) bone-in leg of lamb, or more to taste; ½ cup red wine; 1  lemon, juiced; 2 tablespoons raw honey; 2 tablespoons Dijon mustard; 3 cloves garlic, minced; 1 tablespoon apple cider vinegar; 1 tablespoon dried rosemary; 1 teaspoon dried thyme; 1 teaspoon sea salt; ½ teaspoon fresh cracked pepper",
  "directions": "1. Bring lamb to room temperature, about 2 hours. 2. Pour wine into a slow cooker. Mix together lemon juice, honey, mustard, garlic, vinegar, rosemary, thyme, sea salt, and pepper in a medium bowl until a thick paste forms. Massage paste into lamb using your hands; gently place into the slow cooker. 3. Cook on Low for 5 hours. An instant-read thermometer inserted near the bone should read 145 degrees F (65 degrees C). Let lamb rest for 15 to 20 minutes before serving.",
  "prep": "10 mins",
  "cook": "5 hrs",
  "total": "7 hrs 25 mins",
  "calories": "285"
},
{
  "url": "https://www.allrecipes.com/recipe/214016/uzbek-plov-lamb-and-rice-pilaf/",
  "name": "Uzbek Plov (Lamb and Rice Pilaf)",
  "rating": "4.5",
  "ratingcount": "44",
  "ingredients": "2 cups basmati rice; 4 heads  garlic, whole; ½ cup vegetable oil; 2 pounds boneless leg of lamb, cut into 3-inch pieces; 2 large onions, thinly sliced; 5 large carrots, coarsely grated; 2 tablespoons cumin seeds; 2 tablespoons coriander seed; ½ cup fresh barberries; 1 teaspoon whole black peppercorns; 2 cups boiling water to cover; 2 tablespoons salt",
  "directions": "1. Place basmati rice in a large bowl and cover with warm water. Set aside. Wash heads of garlic. Set aside. 2. Heat vegetable oil in a dutch oven or large skillet over high heat until smoking, then add lamb, turning occasionally until the lamb is evenly browned, about 10 minutes. Stir in the onions; cook and stir until the onion has softened and browned, about 10 minutes. Stir in the carrots; cook and stir until the carrots have softened, about 10 minutes. Sprinkle with cumin, coriander, barberries, and peppercorns. Drop whole garlic heads into the mixture, stirring to evenly distribute ingredients. Reduce heat to medium. Cover and cook for 30 minutes. 3. Wash and drain basmati rice with hot water. Pour cleaned rice over the lamb mixture in an even layer. Slowly pour in the boiling water. The rice should be covered with about 3/4 inch of water. Do not stir. Season with salt, and reduce heat to medium-low. Cover and cook until rice is tender, and the liquid has been absorbed, about 20 minutes. Stir rice and lamb together, and serve with the garlic heads on top.",
  "prep": "20 mins",
  "cook": "1 hr 40 mins",
  "total": "2 hrs",
  "calories": "497"
},
{
  "url": "https://www.allrecipes.com/recipe/272362/instant-pot-lamb-shoulder-chops/",
  "name": "Instant Pot Lamb Shoulder Chops",
  "rating": "4.8",
  "ratingcount": "16",
  "ingredients": "2 pounds lamb shoulder chops; salt and ground black pepper to taste; 1 tablespoon vegetable oil; 1 medium onion, sliced; 2 tablespoons garlic, minced; 1 cup red wine; 1 cup beef consomme; 1 sprig chopped fresh rosemary; 2 tablespoons cornstarch; 2 tablespoons water",
  "directions": "1. Turn on a multi-functional pressure cooker (such as Instant Pot), select Saute function, and let pot heat up. Meanwhile, season pork chops with salt and pepper. 2. Add oil to hot pot. Brown chops 1 to 2 minutes per side and set aside on a plate. Add onion and garlic to the drippings in the pot and cook until tender, about 3 minutes. Pour in red wine and cook, scraping bits from the bottom of the pot, until most of the alcohol has cooked off, about 5 minutes. Pour in beef consomme. Add rosemary and stir around. Return browned chops to the pot. 3. Close and lock the lid. Set vent to sealing and select high pressure according to manufacturer's instructions. Set timer for 40 minutes. Allow 10 to 15 minutes for pressure to build. 4. Release pressure using the natural-release method according to manufacturer's instructions for 15 minutes. Release any remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. 5. Transfer chops to a plate. Choose Saute function on the pot and bring liquid to a boil. Combine cornstarch and water in a bowl to create a slurry and add to the pot. Cook and stir until thickened, about 5 minutes. 6. Return chops to the pot and stir to coat.",
  "prep": "10 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 40 mins",
  "calories": "189"
},
{
  "url": "https://www.allrecipes.com/recipe/230327/easy-leg-of-lamb/",
  "name": "Easy Leg of Lamb",
  "rating": "4.8",
  "ratingcount": "42",
  "ingredients": "1 (5 1/2 pound) boneless leg of lamb, tied in netting; 20 cloves garlic, peeled, or more to taste; garlic powder, or to taste; 10  fresh rosemary sprigs",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Cut 20 deep slits evenly spaced around the leg of lamb without cutting the netting. Stuff one garlic clove into each slit. Rub garlic powder over lamb. Slice rosemary sprigs; place under the netting evenly around lamb. Transfer lamb to a roasting pan. 3. Roast in the preheated oven until pink and juicy in the center for medium, about 2 to 2 1/2 hours. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove from the oven and cover with aluminum foil; lest rest until thermometer reads 135 degrees F (57 degrees C) before carving, about 20 minutes.",
  "prep": "10 mins",
  "cook": "2 hrs",
  "total": "2 hrs 30 mins",
  "calories": "346"
},
{
  "url": "https://www.allrecipes.com/recipe/279047/kabob-koobideh-persian-ground-meat-kabobs/",
  "name": "Kabob Koobideh (Persian Ground Meat Kabobs)",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "2  onions, peeled; cheesecloth; 1 pound ground lamb; 1 pound ground beef; 1  green onion, diced; 2 teaspoons baking powder; 1 teaspoon salt; 1 teaspoon ground black pepper; 1 teaspoon sumac powder; ½ teaspoon ground turmeric; 2  eggs; 8 (10 inch) metal skewers",
  "directions": "1. Shave onions with a grater into a fine mesh strainer. Gently press pulp into the strainer to remove juices. Place pulp into the center of the cheesecloth and gently press until no further juice drips out. 2. Place lamb and beef in a pot. Add green onion and onion pulp; mix until thoroughly combined. Mix in baking powder, salt, pepper, sumac, and turmeric. Add eggs and mix thoroughly. Cover the pot and place in the refrigerator until flavors have melded, at least 30 minutes. 3. Preheat an outdoor grill for medium heat and lightly oil the grate. 4. Mold meat mixture onto the skewers. 5. Cook on the preheated grill, rotating every minute, until nicely browned on all sides, and meat is no longer pink in the center, about 25 minutes.",
  "prep": "30 mins",
  "cook": "25 mins",
  "total": "1 hr 25 mins",
  "calories": "260"
},
{
  "url": "https://www.allrecipes.com/recipe/25885/lamb-ribs-with-honey-and-wine/",
  "name": "Lamb Ribs with Honey and Wine",
  "rating": "4.4",
  "ratingcount": "108",
  "ingredients": "3 ½ pounds lamb ribs; 2  onions, chopped; 1 cup dry white wine; ¼ cup soy sauce; ¼ cup fresh lemon juice; 1 tablespoon honey; 1 tablespoon olive oil; 2 teaspoons minced garlic; 1 teaspoon ground cinnamon; 1 teaspoon salt; 1 teaspoon ground black pepper",
  "directions": "1. Place lamb in a 9x13-inch baking dish. 2. Combine onions, white wine, soy sauce, lemon juice, honey, olive oil, garlic, cinnamon, salt, and pepper in a small bowl. Mix well and pour mixture all over lamb. Cover with plastic wrap and marinate in the refrigerator for 1 hour. 3. Preheat oven to 400 degrees F (200 degrees C). 4. Roast lamb in the preheated oven until browned and tender, about 1 hour 10 minutes.",
  "prep": "10 mins",
  "cook": "1 hr 10 mins",
  "total": "2 hrs 20 mins",
  "calories": "508"
},
{
  "url": "https://www.allrecipes.com/recipe/274173/lamb-souvlaki/",
  "name": "Lamb Souvlaki",
  "rating": "4.6",
  "ratingcount": "7",
  "ingredients": "⅓ cup olive oil; 1 ½ tablespoons freshly squeezed lemon juice; 1 ½ tablespoons red wine vinegar; 1 ½ tablespoons chopped fresh oregano; 2 cloves garlic, minced; ½ teaspoon salt; ¼ teaspoon ground black pepper; 1 ½ pounds boneless leg of lamb, trimmed of all fat and cut into 1-inch cubes",
  "directions": "1. Whisk olive oil, lemon juice, red wine vinegar, oregano, garlic, salt, and pepper together in a medium bowl. Add cubed lamb and stir until lamb is coated with marinade. Cover and refrigerate 3 hours, or overnight. 2. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 3. Thread marinated lamb onto skewers, reserving any remaining marinade. Grill skewers until desired doneness, 10 to 12 minutes, basting with the reserved marinade and turning occasionally for even cooking.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "3 hrs 25 mins",
  "calories": "346"
},
{
  "url": "https://www.allrecipes.com/recipe/214625/grilled-lamb-burgers/",
  "name": "Grilled Lamb Burgers",
  "rating": "4.6",
  "ratingcount": "25",
  "ingredients": "1 ¼ pounds ground lamb; 1  egg; 1 teaspoon dried oregano; 1 teaspoon dry sherry; 1 teaspoon white wine vinegar; ½ teaspoon crushed red pepper flakes; 4 cloves garlic, minced; ½ cup chopped green onions; 1 tablespoon chopped fresh mint, or to taste; 2 tablespoons chopped fresh cilantro; 2 tablespoons dry bread crumbs; ⅛ teaspoon salt; ¼ teaspoon ground black pepper; 5  hamburger buns",
  "directions": "1. Preheat an outdoor grill for medium-high heat, and lightly oil the grate. 2. Mix the lamb, egg, oregano, sherry, vinegar, red pepper flakes, garlic, green onions, mint, cilantro, bread crumbs, salt, and pepper together in a mixing bowl with your hands until evenly blended. Form into five patties. 3. Cook on the preheated grill until the burgers are cooked to your desired degree of doneness, about 4 minutes per side for medium-rare. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Serve on buns.",
  "prep": "25 mins",
  "cook": "10 mins",
  "total": "35 mins",
  "calories": "376"
},
{
  "url": "https://www.allrecipes.com/recipe/268252/baked-lamb-meatballs/",
  "name": "Baked Lamb Meatballs",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "1 pound ground lamb; 2 slices bread, torn into small pieces; ¼ cup yogurt; ¼ cup raisins; ¼ cup fresh cilantro; 1 clove garlic, minced; ¼ teaspoon dried oregano; ¼ teaspoon dried basil; ⅛ teaspoon salt; ⅛ teaspoon ground black pepper",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Mix lamb, bread, yogurt, raisins, cilantro, garlic, oregano, basil, salt, and pepper together in a bowl. Shape into 1-inch balls and place on a greased baking sheet. 3. Bake in the preheated oven until meatballs are browned on the outsides and only slightly pink in the centers, about 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "298"
},
{
  "url": "https://www.allrecipes.com/recipe/238511/chef-johns-grilled-lamb-steaks/",
  "name": "Chef John's Grilled Lamb Steaks",
  "rating": "4.7",
  "ratingcount": "14",
  "ingredients": "1 bunch fresh tarragon leaves, torn; ½ bunch fresh mint leaves, torn; 2 tablespoons plain yogurt; 1 tablespoon olive oil; 4 cloves garlic, chopped; 1 teaspoon ground cumin; 1 teaspoon freshly ground black pepper; 4  center-cut lamb leg steaks, 1 1/2-inch thick; ¼ cup olive oil; 3 tablespoons sherry vinegar; 2 tablespoons honey; salt and freshly ground black pepper to taste; 2 tablespoons chopped fresh mint; 1 tablespoon olive oil, or as needed; salt and ground black pepper to taste",
  "directions": "1. Whisk tarragon, 1/2 bunch mint, yogurt, 1 tablespoon olive oil, garlic, cumin, and 1 teaspoon black pepper together in a bowl; pour marinade into a resealable plastic bag. Add lamb steaks, coat with marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator, 8 hours to overnight. 2. Preheat an outdoor grill for high heat, and lightly oil the grate. 3. Whisk 1/4 cup olive oil, sherry vinegar, honey, salt, and pepper together in a bowl. Add 2 tablespoons chopped mint and stir to combine vinaigrette. 4. Remove steaks from marinade and scrape off all herbs and garlic; discard marinade. Drizzle steaks with 1 tablespoon olive oil and season with salt and pepper. 5. Cook steaks on the preheated grill until browned on the outside and slightly pink in the center, about 6 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Transfer steaks to a plate, drizzle 1/2 of the vinaigrette over the steaks, cover the steaks with foil, and let rest for 10 minutes. Transfer steaks to individual plates and drizzle remaining vinaigrette over each.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "8 hrs 40 mins",
  "calories": "467"
},
{
  "url": "https://www.allrecipes.com/recipe/230207/lamb-shank/",
  "name": "Lamb Shank",
  "rating": "4.2",
  "ratingcount": "5",
  "ingredients": "1 (4 pound) lamb shank; 3 tablespoons olive oil; 1 teaspoon dried rosemary; ¼ teaspoon ground thyme; ¼ teaspoon dried basil; ¼ teaspoon dried parsley; ½ teaspoon dried mint; 2 tablespoons ground black pepper; 1 pinch salt to taste; 1 pinch cayenne pepper, or to taste (Optional); ¼ cup lemon juice; 3 tablespoons honey",
  "directions": "1. Cut slits into lamb shank in a criss-cross pattern about 1 inch apart and 1/2 inch deep; place into a shallow dish. 2. Whisk olive oil, rosemary, thyme, basil, parsley, mint, black pepper, salt, and cayenne pepper together in a bowl; brush evenly over the lamb shank. Refrigerate lamb at least 1 hour. 3. Preheat grill for medium heat and lightly oil the grate. 4. Stir lemon juice and honey together in a small bowl until smooth. 5. Cook lamb shank on preheated grill, basting every 15 minutes with the lemon juice mixture, until browned on the outside and red in the center, about 30 minutes per side. An instant-read thermometer inserted into the center should read 125 degrees F (52 degrees C).",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "2 hrs 15 mins",
  "calories": "342"
},
{
  "url": "https://www.allrecipes.com/recipe/77005/broiled-and-slow-roasted-butterflied-leg-of-lamb-with-cumin-and-garlic/",
  "name": "Broiled and Slow-Roasted Butterflied Leg of Lamb With Cumin and Garlic",
  "rating": "4.6",
  "ratingcount": "39",
  "ingredients": "¼ cup olive oil; 8 cloves garlic, minced; 2 ½ teaspoons salt; 1 teaspoon pepper; 2 tablespoons ground cumin; 1 tablespoon dried oregano; 1 (8 pound) leg of lamb, boned and butterflied to a more or less even thickness, 4 3/4 to 5 1/2 pounds trimmed weight, fell and most fat removed; 1  lemon, juiced; ½ cup Minced fresh parsley, cilantro or mint",
  "directions": "1. Mix oil, garlic, salt, pepper, cumin and oregano; spread paste on both sides of the lamb and let stand for an hour until meat comes to room temperature. 2. Adjust oven rack to upper or upper-middle position (depending on lamb's thickness) and preheat broiler on high for at least 10 minutes. 3. Place lamb, cut side up, on a large wire rack set over a foil-lined roasting pan. Broil, moving pan so entire surface browns evenly, about 8 minutes. Turn lamb over; continue to broil until well browned on the other side, about 8 minutes longer. Turn off broiler, remove lamb from oven and let rest for 10 minutes. 4. Heat oven to 325 degrees. Stick a meat thermometer into the thickest portion of the lamb; return it to the oven. Roast for a total of 50 minutes to 1 hour, until thermometer registers a rosy-pink 140 degrees. Check lamb several times after 30 minutes. If lamb gets done sooner, simply turn down oven to 170 degrees until ready to serve. 5. As soon as lamb comes out of the oven, squeeze on lemon juice and sprinkle with fresh herbs. Carve, slicing across the grain when possible. Arrange on a platter, drizzle with accumulated juices, and serve.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "336"
},
{
  "url": "https://www.allrecipes.com/recipe/20871/samosas/",
  "name": "Samosas",
  "rating": "4.1",
  "ratingcount": "45",
  "ingredients": "2 cups all-purpose flour; ½ teaspoon salt; 2 tablespoons butter; ¼ cup water; 1 quart oil for deep frying; 2 tablespoons butter; 1 small onion, chopped; 2 cloves garlic, chopped; 2  green chile peppers, chopped; 1 tablespoon fresh ginger root, chopped; ½ teaspoon ground turmeric; ½ teaspoon chili powder; ¾ pound ground lamb; 1 teaspoon salt; 2 teaspoons garam masala; 1 ½ tablespoons fresh lemon juice",
  "directions": "1. In a medium bowl, mix flour, salt and butter until the mixture resembles fine bread crumbs. Pour in water, using more (up to approximately 1/4 cup) if necessary to make a smooth dough. Pat into a ball. Place on a lightly floured surface and knead 10 minutes, or until dough is smooth and elastic. Return to the bowl, cover and set aside. 2. Heat oil in a large, deep skillet to 375 degrees F (190 degrees C). 3. Melt butter in a medium saucepan over medium high heat. Stir in onion, garlic, green chile peppers and ginger. Cook 5 minutes, or until onions are golden brown. Stir in turmeric, chili powder, ground lamb and salt. Cook until the lamb meat is evenly brown, about 10 minutes. Stir in garam masala and lemon juice. Continue cooking 5 minutes, then remove from heat. 4. Divide dough into 15 equal portions. Roll portions into balls, then flatten into 4 inch circles. Cut each circle in half. Dampen edges and form semicircles into cones. Fill cones with equal portions of the lamb meat mixture. Dampen top and bottom edges of cones, and pinch to seal. 5. Carefully lower cones into preheated oil a few at a time. Fry until golden brown, 2 to 3 minutes. Drain on paper towels. Serve warm.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "105"
},
{
  "url": "https://www.allrecipes.com/recipe/257075/oven-roasted-lamb-ribs/",
  "name": "Oven-Roasted Lamb Ribs",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "4 pounds lamb ribs; ½ cup lemon juice; 3 tablespoons molasses; 3 tablespoons white vinegar; 2 tablespoons mustard; 2 tablespoons ketchup; 1 tablespoon ground cinnamon; 1 tablespoon curry powder; 1 tablespoon ground cumin; 1 tablespoon salt; 1 tablespoon ground black pepper; 1  onion, quartered; 2 small tomatoes, quartered; 2 small thin-skinned sweet peppers, cored and seeded; 1 cup finely chopped parsley; 9 cloves garlic, minced; 1 ½ teaspoons cayenne pepper",
  "directions": "1. Wash ribs thoroughly. Soak in a large bowl of water, changing the water every 30 minutes, to remove excess fat, about 2 hours. Drain and pat dry with paper towels. 2. Mix lemon juice, molasses, vinegar, mustard, ketchup, cinnamon, curry powder, cumin, salt, and pepper in a large, deep bowl. 3. Combine onion, tomatoes, sweet peppers, parsley, garlic, and cayenne pepper in a food processor; pulse to form a paste. 4. Stir onion paste into the lemon juice mixture in the bowl. Add lamb ribs; turn to coat. Cover with plastic wrap. Marinate in the refrigerator, at least 10 hours. 5. Preheat oven to 300 degrees F (150 degrees C). 6. Line a large baking sheet with aluminum foil and set a rack on top. Arrange ribs on the rack. 7. Bake ribs in the preheated oven until fat has rendered and meat is tender, 1 1/2 to 2 hours. Cover ribs with aluminum foil and let rest for 5 minutes before serving.",
  "prep": "35 mins",
  "cook": "1 hr 30 mins",
  "total": "14 hrs 10 mins",
  "calories": "819"
},
{
  "url": "https://www.allrecipes.com/recipe/212487/lamb-gosht-biryani/",
  "name": "Lamb (Gosht) Biryani",
  "rating": "4.5",
  "ratingcount": "37",
  "ingredients": "2 ½ cups basmati rice; ¼ cup cooking oil; 8  whole cloves; 4  black cardamom pods; 4  cinnamon sticks; 4 large onions, sliced thin; 1 tablespoon garlic paste; 1 tablespoon ginger paste; ¼ cup chopped fresh cilantro leaves; 3 tablespoons chopped fresh mint leaves; 1 pound lamb chops; salt to taste; 3  tomatoes, chopped; 4  green chile peppers, halved lengthwise; 2 teaspoons ground red pepper; 2 tablespoons plain yogurt; 2 tablespoons lemon juice; 7 ½ cups water; 1 teaspoon salt; 1 tablespoon vegetable oil; 1  onion, sliced; ½ teaspoon saffron; 2 tablespoons warm milk",
  "directions": "1. Place the basmati rice in a large container and cover with several inches of cool water; let stand 30 minutes. Drain. 2. Heat 1/4 cup oil in a large skillet over medium heat; fry the cloves, cardamom pods, and cinnamon sticks in the hot oil until fragrant, about 1 minute. Add the onions; cook and stir until the onions are lightly browned, about 5 minutes. Stir the garlic paste and ginger paste into the onion mixture; cook until the garlic and ginger is fragrant, about 1 minute more. Sprinkle the cilantro and mint over the mixture and cook 1 minute more. 3. Add the lamb chops to the skillet; season with salt. Cook and stir the lamb until the meat begins to brown, about 20 minutes. 4. Stir the tomatoes, green chile peppers, and ground red pepper into the mixture; continue cooking until the oil begins to separate from the gravy, about 10 minutes. Add the yogurt and lemon juice; cover and cook until the lamb is tender, about 15 minutes. Add water as needed to keep the mixture from getting too dry. 5. Bring the rice, 7 1/2 cups water, and 1 teaspoon salt to a boil in a saucepan until the rice is nearly done yet a little chewy, 10 to 15 minutes; drain any excess water. 6. Heat 1 tablespoon oil in a small skillet; fry the sliced onion in the hot oil until lightly browned. 7. Layer about half the rice in the bottom of a deep pot with a lid. Spoon the lamb masala over the rice. Spread the fried onion over the lamb masala. Top with the remaining rice. Stir the saffron and warm milk together in a small bowl; pour over the top layer of rice. Cover the pot with the lid and place the pot over low heat; cook until the rice is thoroughly cooked, about 15 minutes.",
  "prep": "25 mins",
  "cook": "1 hr",
  "total": "1 hr 25 mins",
  "calories": "544"
},
{
  "url": "https://www.allrecipes.com/recipe/214029/lamb-shawarma/",
  "name": "Lamb Shawarma",
  "rating": "4.7",
  "ratingcount": "60",
  "ingredients": "½ cup plain yogurt; ¼ cup water; 2 tablespoons fresh lemon juice; 1 tablespoon distilled white vinegar; 1 tablespoon olive oil; ½ cup chopped onion; 2 cloves garlic, minced; 1 tablespoon salt; ½ teaspoon ground black pepper; ½ teaspoon ground cumin; ⅛ teaspoon ground nutmeg; ⅛ teaspoon ground cloves; ¾ teaspoon ground mace; 1 teaspoon cayenne pepper; 5 pounds boneless lamb shoulder, cut into 1/4-inch-thick strips",
  "directions": "1. Place the yogurt, water, lemon juice, vinegar, olive oil, onion, and garlic into a large mixing bowl. Whisk in the salt, black pepper, cumin, nutmeg, clove, mace, and cayenne pepper until evenly blended. Mix in the lamb strips to coat. Cover the bowl with plastic wrap, and marinate in the refrigerator 12 to 24 hours (the longer the better). 2. Heat a large skillet over high heat. Cook the lamb strips in a single layer in batches until the fat melts and the meat has browned and is no longer pink on the inside, about 5 minutes, turning occasionally.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "12 hrs 50 mins",
  "calories": "376"
},
{
  "url": "https://www.allrecipes.com/recipe/235985/a-scotsmans-shepherd-pie/",
  "name": "A Scotsman's Shepherd Pie",
  "rating": "4.8",
  "ratingcount": "384",
  "ingredients": "5 cups mashed, boiled potatoes; ½ cup sour cream; 2 ounces cream cheese; 2 tablespoons butter, softened, divided; 1  egg yolk; ½ teaspoon kosher salt; ½ teaspoon freshly ground black pepper; 1 ½ teaspoons olive oil; 1 pound ground lamb; 1 pinch salt and ground black pepper to taste; 1 (16 ounce) can stewed tomatoes with juice, chopped; 1 small onion, chopped; 1 small carrot, peeled and chopped; ½ cup peas; 1 cup Irish stout beer (such as Guinness®); 1 cube beef bouillon; 1 tablespoon all-purpose flour; 1 tablespoon Worcestershire sauce; ¾ cup shredded sharp Cheddar cheese; 2 teaspoons chopped fresh parsley; 2 teaspoons smoked paprika",
  "directions": "1. Stir potatoes, sour cream, cream cheese, 1 tablespoon butter, egg yolk, 1/2 teaspoon salt, and 1/2 teaspoon black pepper together in a bowl until smooth. 2. Heat olive oil in a cast iron skillet or nonstick pan over medium-high heat. Add ground lamb, reduce heat to medium, and cook, stirring frequently, until browned and crumbly, 4 to 5 minutes. Pour off excess grease and season lamb with salt and black pepper to taste. 3. Stir tomatoes with juice, onion, and carrot into ground lamb; simmer until vegetables are tender, 5 to 10 minutes. Add peas, reduce heat to low, and cook, stirring frequently, until peas are warmed, 2 to 3 minutes. 4. Heat beer in a saucepan over medium heat; add beef bouillon. Cook and stir beer mixture until bouillon is dissolved, about 5 minutes. 5. Heat remaining 1 tablespoon butter in a separate pan over medium-low heat until sizzling. Whisk flour into butter until thick and paste-like, about 1 minute. Stir beer mixture and Worcestershire sauce into flour mixture until gravy is smooth and thickened, 2 to 3 minutes. Stir gravy into lamb mixture and simmer until mixture is thickened, at least 5 minutes. 6. Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Grease a 9x12-inch baking dish. 7. Pour lamb mixture into the prepared baking dish. Carefully spoon mashed potatoes over lamb mixture, covering like a crust. Sprinkle Cheddar cheese, parsley, and paprika over mashed potatoes. 8. Broil in the preheated oven until crust is browned and cheese is melted, 4 to 5 minutes. Cool for about 5 minutes before serving.",
  "prep": "45 mins",
  "cook": "25 mins",
  "total": "1 hr 15 mins",
  "calories": "386"
},
{
  "url": "https://www.allrecipes.com/recipe/47822/grilled-lamb-with-brown-sugar-glaze/",
  "name": "Grilled Lamb with Brown Sugar Glaze",
  "rating": "4.7",
  "ratingcount": "377",
  "ingredients": "¼ cup brown sugar; 2 teaspoons ground ginger; 2 teaspoons dried tarragon; 1 teaspoon ground cinnamon; 1 teaspoon ground black pepper; 1 teaspoon garlic powder; ½ teaspoon salt; 4  lamb chops",
  "directions": "1. In a medium bowl, mix brown sugar, ginger, tarragon, cinnamon, pepper, garlic powder, and salt. Rub lamb chops with the seasonings, and place on a plate. Cover, and refrigerate for 1 hour. 2. Preheat grill for high heat. 3. Brush grill grate lightly with oil, and arrange lamb chops on grill. Cook 5 minutes on each side, or to desired doneness.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "1 hr 25 mins",
  "calories": "241"
}]