[{
  "url": "https://www.allrecipes.com/recipe/238205/mango-cilantro-slaw/",
  "name": "Mango Cilantro Slaw",
  "rating": "4.7",
  "ratingcount": "39",
  "ingredients": "3 tablespoons white wine vinegar; 2 tablespoons canola oil; 2 tablespoons honey; 2 tablespoons mayonnaise; ½ teaspoon celery seed (Optional); ½ teaspoon poppy seeds (Optional); ½ teaspoon salt; ¼ teaspoon ground black pepper; 1 (10 ounce) package finely shredded cabbage; 1  firm, ripe mango - peeled, seeded, and cut into 1/2-inch pieces; ⅓ cup chopped cilantro; 3  green onions, chopped",
  "directions": "1. Whisk vinegar, oil, honey, mayonnaise, celery seed, poppy seeds, salt, and black pepper together in a bowl until smooth and creamy. Add cabbage, mango, cilantro, and green onions; toss until well-combined. Cover the bowl with plastic wrap and refrigerate until flavors blend, about 1 hour.",
  "prep": "15 mins",
  "cook": "",
  "total": "1 hr 15 mins",
  "calories": "177"
},
{
  "url": "https://www.allrecipes.com/recipe/241023/mango-oatmeal-breakfast-smoothie/",
  "name": "Mango Oatmeal Breakfast Smoothie",
  "rating": "4.6",
  "ratingcount": "23",
  "ingredients": "½ cup orange juice; ½ cup frozen mango chunks; ½  banana, cut into chunks; ⅓ cup plain yogurt; ¼ cup oats",
  "directions": "1. Blend orange juice, mango, banana, yogurt, and oats together in a blender until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "290"
},
{
  "url": "https://www.allrecipes.com/recipe/238068/mango-watermelon-smoothie/",
  "name": "Mango Watermelon Smoothie",
  "rating": "3.3",
  "ratingcount": "13",
  "ingredients": "5 cups cubed seeded watermelon; 1  mango - peeled, seeded, and diced; ½ cup water; 1 tablespoon white sugar; 4 cubes  ice cubes",
  "directions": "1. Blend watermelon, mango, water, and sugar together in a blender until smooth. 2. Place ice into glasses and pour smoothie over ice.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "103"
},
{
  "url": "https://www.allrecipes.com/recipe/232577/fresh-mango-muffins/",
  "name": "Fresh Mango Muffins",
  "rating": "3.8",
  "ratingcount": "18",
  "ingredients": "1 ½ cups all-purpose flour; ¼ cup white sugar; 2 teaspoons baking powder; 1 pinch salt; 3  eggs; ¼ cup heavy whipping cream; ¼ cup unsalted butter, melted; 3 cups mango - peeled, seeded, and cubed",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or line with paper muffin liners. 2. Combine flour, sugar, baking powder, and salt in a bowl. Beat eggs, cream, and butter until smooth in another large bowl. Stir flour mixture into egg mixture until batter is moistened. Fold mango into batter until just combined. Evenly divide batter into prepared muffin cups. 3. Bake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, about 25 minutes.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "169"
},
{
  "url": "https://www.allrecipes.com/recipe/238642/peanut-butter-mango-smoothie/",
  "name": "Peanut Butter Mango Smoothie",
  "rating": "4.4",
  "ratingcount": "7",
  "ingredients": "1 cup vanilla yogurt; 1  banana, broken into chunks; ½ cup frozen mango chunks; 2 tablespoons peanut butter, or to taste",
  "directions": "1. Blend yogurt, banana, mango, and peanut butter together in a blender until smooth.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "279"
},
{
  "url": "https://www.allrecipes.com/recipe/268086/smoked-salmon-poke-bowl/",
  "name": "Smoked Salmon Poke Bowl",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "¼ cup soy sauce; 3  green onions, thinly sliced; 1 tablespoon black sesame oil; 1 tablespoon rice vinegar; 1 teaspoon grated ginger; ½ teaspoon garlic, minced; 12 ounces smoked salmon, chopped; 2 cups cooked brown rice; ¼ cup diced mango; ¼ cup diced cucumber; ¼ cup diced avocado; ¼ cup sliced fresh strawberries; 1 teaspoon black sesame seeds, or to taste",
  "directions": "1. Combine soy sauce, green onions, sesame oil, rice vinegar, ginger, and garlic in a bowl. Mix until thoroughly combined. Add salmon and marinate in the refrigerator for 30 minutes to 1 hour. 2. Divide brown rice among 4 serving bowls. Top with salmon, mango, cucumber, avocado, and strawberries. Sprinkle black sesame seeds on top.",
  "prep": "15 mins",
  "cook": "",
  "total": "45 mins",
  "calories": "283"
},
{
  "url": "https://www.allrecipes.com/recipe/19842/mango-chutney/",
  "name": "Mango Chutney",
  "rating": "4.4",
  "ratingcount": "83",
  "ingredients": "6 cups white sugar; 6 cups brown sugar; 3 cups distilled white vinegar; 5  small red hot chile peppers, seeded and chopped; 4 teaspoons ground allspice; 2 teaspoons ground ginger; 2 teaspoons ground nutmeg; 1 teaspoon ground cinnamon; 1 teaspoon ground cloves; 1 teaspoon kosher salt; 2 large onions, chopped; 1 cup golden raisins; 1 cup raisins; ½ cup fresh ginger root, chopped; 3 cloves garlic, chopped; 16 cups sliced, semi-ripe mangos; ½ cup sliced almonds (Optional)",
  "directions": "1. Combine white sugar, brown sugar, vinegar, chile peppers, allspice, ground ginger, nutmeg, cinnamon, cloves, and salt in a large saucepan. Bring to a boil; boil for 30 minutes. 2. Stir in onions, golden raisins, raisins, fresh ginger, and garlic; boil for another 30 minutes. 3. Stir in mangos (and almonds if using); reduce heat to low and simmer for 30 minutes. 4. Pack chutney into hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe rims with a moist paper towel to remove any residue. Top with lids and screw rings on tightly.",
  "prep": "10 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 40 mins",
  "calories": "46"
},
{
  "url": "https://www.allrecipes.com/recipe/166482/mango-peach-and-pineapple-salsa/",
  "name": "Mango, Peach, and Pineapple Salsa",
  "rating": "4.7",
  "ratingcount": "135",
  "ingredients": "2 mangos, peeled, seeded and chopped; 2 peaches, halved, pitted, and cut into 1/2-inch dice; 4 tomatoes, chopped; 1 cup diced fresh pineapple; 1 white onion, diced; 1 red bell pepper, diced; 1 yellow bell pepper, diced; 1 cup chopped fresh cilantro, or to taste; ¾ cup water; 2 tablespoons white sugar, or to taste; 2 tablespoons lime juice; 1 small jalapeño pepper, minced; 1 clove garlic, minced; 1 teaspoon salt",
  "directions": "1. Place chopped mango, peaches, tomatoes, pineapple, onion, red pepper, yellow pepper, and cilantro in a mixing bowl; stir in water, sugar, lime juice, jalapeño, garlic, and salt. 2. Cover and refrigerate at least 1 hour before serving.",
  "prep": "20 mins",
  "cook": "",
  "total": "1 hr 20 mins",
  "calories": "40"
},
{
  "url": "https://www.allrecipes.com/recipe/237069/real-indian-mango-chutney/",
  "name": "Real Indian Mango Chutney",
  "rating": "4.9",
  "ratingcount": "8",
  "ingredients": "2 ¼ cups diced fresh mango; ¼ cup salt; 2 ½ cups water; 2 ⅓ cups white sugar; 2 cups vinegar; ½ cup raisins; ½ cup chopped pitted dates; 2  cinnamon sticks; 2 teaspoons minced fresh ginger root; 2 teaspoons crushed garlic; 2 teaspoons ground dried chile pepper; 10  half-pint canning jars with lids and rings",
  "directions": "1. Put mango into a large bowl. Sprinkle salt over the mango. Pour water over the mango. Let mango soak for 1 hour to overnight. 2. Drain and discard liquid from the mango. 3. Stir sugar and vinegar together in a saucepan over medium heat; bring to a boil. Add drained mango to the liquid; stir to coat. Stir raisins, dates, cinnamon sticks, ginger, garlic, and ground dried chile pepper into the mango mixture; bring again to a boil, stirring occasionally. Reduce heat to low and simmer mixture until thickened, about 1 hour. Remove from heat to cool completely. 4. Sterilize jars and lids in boiling water for at least 5 minutes. Pack chutney into hot, sterilized jars, filling to within 1/4 inch of the top. Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings. 5. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes. 6. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
  "prep": "30 mins",
  "cook": "1 hr 10 mins",
  "total": "3 hrs 10 mins",
  "calories": "105"
},
{
  "url": "https://www.allrecipes.com/recipe/259088/summertime-mango-drink/",
  "name": "Summertime Mango Drink",
  "rating": "4.3",
  "ratingcount": "7",
  "ingredients": "2  mangoes, cut into cubes; 1 cup ice cubes; 1 teaspoon vanilla extract; 1 tablespoon white sugar; 1 ⅔ cups milk",
  "directions": "1. Combine mangoes, ice cubes, vanilla extract, and sugar in a blender; pour in milk. Blend until liquefied.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "115"
},
{
  "url": "https://www.allrecipes.com/recipe/47658/mango-salsa-salmon/",
  "name": "Mango Salsa Salmon",
  "rating": "4.4",
  "ratingcount": "107",
  "ingredients": "4 (6 ounce) salmon steaks; 3 tablespoons olive oil; 1 large red onion, diced; 2 cloves garlic, peeled and minced; 2  tomatoes, diced; 1 sprig fresh cilantro, chopped; 2  mangos - peeled, seeded, and diced",
  "directions": "1. Preheat the oven broiler. Line a broiler pan with foil. 2. Broil salmon steaks on the prepared pan 12 minutes, or until easily flaked with a fork. 3. Heat olive oil in a medium saucepan over medium heat, and saute onion until tender. Stir in garlic, tomatoes, and cilantro. Cook until heated through, 1 to 2 minutes, and remove from heat. Mix in the mangos. Serve over the salmon steaks.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "493"
},
{
  "url": "https://www.allrecipes.com/recipe/85165/spicy-mango-salad/",
  "name": "Spicy Mango Salad",
  "rating": "4.5",
  "ratingcount": "63",
  "ingredients": "4 medium mangos - peeled, seeded, and cubed; ¼ cup fresh lime juice; 2 tablespoons extra-virgin olive oil; 1 tablespoon red pepper flakes; 2 tablespoons chopped fresh cilantro; 2 tablespoons chopped shallots; salt and freshly ground black pepper to taste",
  "directions": "1. Place the mango cubes into a serving bowl. In a separate bowl, whisk together the lime juice and olive oil. Season with red pepper flakes, cilantro, shallots, salt and pepper. Whisk briefly, then pour over the mangos. Stir to coat, then cover and refrigerate for about 30 minutes to blend the flavors before serving.",
  "prep": "15 mins",
  "cook": "",
  "total": "45 mins",
  "calories": "140"
},
{
  "url": "https://www.allrecipes.com/recipe/166016/mango-pineapple-chutney/",
  "name": "Mango-Pineapple Chutney",
  "rating": "4.7",
  "ratingcount": "44",
  "ingredients": "2 tablespoons vegetable oil; 1 teaspoon crushed red pepper flakes; 1 large sweet onion, minced; 4 inch piece fresh ginger root, peeled and minced; 1 large yellow bell pepper, diced; 3 large ripe mangoes, peeled, pitted, and diced; 1 small pineapple, peeled and diced; ½ cup brown sugar; 1 ½ tablespoons curry powder; ½ cup apple cider vinegar",
  "directions": "1. Heat the vegetable oil in a large saucepan over medium heat. Stir in the red pepper flakes and cook until they begin to sizzle, then stir in the minced onion. Reduce the heat to low, cover, and cook, stirring occasionally until the onions have softened, about 20 minutes. 2. Remove the lid, increase the heat to medium, and stir in the ginger and yellow bell pepper. Cook and stir until the ginger is fragrant, 2 to 3 minutes. Stir in the mangoes, pineapple, brown sugar, curry powder, and vinegar. Bring to a simmer, and cook for 30 minutes, stirring occasionally. Cool the chutney completely when done and store in airtight containers in the refrigerator.",
  "prep": "35 mins",
  "cook": "1 hr 10 mins",
  "total": "3 hrs 45 mins",
  "calories": "68"
},
{
  "url": "https://www.allrecipes.com/recipe/263627/mexican-mango-and-white-fish-ceviche/",
  "name": "Mexican Mango and White Fish Ceviche",
  "rating": "4.2",
  "ratingcount": "6",
  "ingredients": "2 pounds white fish, cut into small cubes; 4  limes, juiced; ½  orange, juiced; 1 tablespoon olive oil; 1  green chile pepper, chopped; 2  mangoes, cut into cubes; 5  green onions, chopped; 3  tomatoes, seeded and chopped; ½ cup chopped fresh cilantro; salt and ground black pepper to taste",
  "directions": "1. Combine white fish, lime juice, orange juice, oil, and chile pepper in a glass or ceramic bowl. Cover with plastic wrap and refrigerate for 90 minutes. 2. Mix in mangoes and green onions, cover, and chill for 10 minutes more. 3. Gently fold in tomatoes and cilantro. Season with salt and pepper and serve immediately.",
  "prep": "15 mins",
  "cook": "",
  "total": "1 hr 55 mins",
  "calories": "148"
},
{
  "url": "https://www.allrecipes.com/recipe/66224/mango-peach-smoothie/",
  "name": "Mango-Peach Smoothie",
  "rating": "4.7",
  "ratingcount": "102",
  "ingredients": "1  peach, sliced; 1  mango, peeled and diced; ½ cup vanilla soy milk; ½ cup orange juice, or as needed",
  "directions": "1. Place peach, mango, soy milk, and orange juice into a blender. Cover, and puree until smooth. Pour into glasses to serve.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "105"
},
{
  "url": "https://www.allrecipes.com/recipe/238485/mommys-mango-cobbler/",
  "name": "Mommy's Mango Cobbler",
  "rating": "4.3",
  "ratingcount": "16",
  "ingredients": "8  mangoes - peeled, seeded, and sliced; 2 cups water; ½ cup white sugar; 2 cups white sugar; ½ cup butter, softened; 2 cups all-purpose flour; 4 teaspoons baking powder; ¼ teaspoon salt; 1 cup milk; 1 tablespoon vanilla extract",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Combine mangoes, water, and 1/2 cup white sugar in a saucepan over medium heat; simmer until sugar is dissolved, 5 to 6 minutes. Drain syrup from mangoes, reserving syrup. 3. Beat 2 cups sugar and butter together in a bowl using an electric mixer until smooth and creamy. Whisk flour, baking powder, and salt together in a separate bowl until combined. Slowly mix flour mixture, alternating with milk, into creamed butter mixture, beating well after each addition. Stir vanilla extract into batter; pour into a 9x13-inch baking dish. 4. Arrange mangoes on top of the batter and pour 2 cups reserved syrup over mangoes. 5. Bake in the preheated oven until a toothpick inserted in the center of the cobbler comes out clean, 40 to 45 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "384"
},
{
  "url": "https://www.allrecipes.com/recipe/277691/mangonada-jell-o-shots/",
  "name": "Mangonada Jell-O Shots",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "¼ cup water; 2 (.25 ounce) packages unflavored gelatin; 2 cups mango puree; ½ cup white sugar; 1 tablespoon lemon juice; 1 cup vodka; 1 teaspoon chamoy sauce, or to taste; 1 teaspoon chile-lime seasoning (such as Tajin®), or as needed",
  "directions": "1. Heat water and gelatin in a small saucepan over medium-high heat; whisk until dissolved, about 5 minutes. Add mango purée, sugar, and lemon juice; whisk until dissolved, about 5 minutes. Remove from heat to cool slightly, about 5 minutes. 2. Whisk vodka into cooled mango gelatin until combined. 3. Add a few drops chamoy and a sprinkle Tajin to twenty (2-ounce) cups. Fill each cup evenly with mango gelatin and sprinkle with more Tajin. Let set in the refrigerator for 4 hours.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "4 hrs 25 mins",
  "calories": "49"
},
{
  "url": "https://www.allrecipes.com/recipe/255086/simple-mango-pudding/",
  "name": "Simple Mango Pudding",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1 cup hot water; 1 cup white sugar; 2 (.25 ounce) packages powdered gelatin (such as Knox®); 26 ounces canned mango pulp; 1 ½ cups evaporated milk; 1 cup cold water",
  "directions": "1. Combine hot water, sugar, and powdered gelatin in a small bowl; stir until sugar and gelatin are dissolved. 2. Mix mango pulp, evaporated milk, and cold water together in a large bowl. Pour in hot water mixture and stir well. 3. Refrigerate until set, at least 4 hours.",
  "prep": "10 mins",
  "cook": "",
  "total": "4 hrs 10 mins",
  "calories": "340"
},
{
  "url": "https://www.allrecipes.com/recipe/221937/easy-fish-tacos-with-mango-pineapple-slaw/",
  "name": "Easy Fish Tacos with Mango-Pineapple Slaw",
  "rating": "4.2",
  "ratingcount": "62",
  "ingredients": "1 pound cod fillets; 1 tablespoon lemon juice; salt and ground black pepper to taste; ½ cup red wine vinegar; ¼ cup reduced-fat mayonnaise; 1 tablespoon white sugar; 1 tablespoon salt; 1 tablespoon ground black pepper; 1 teaspoon garlic powder; 3 cups shredded cabbage; ½ cup chopped fresh mango; ½ cup chopped fresh pineapple; ½ cup chopped red onion; ¼ cup chopped fresh cilantro; 1  fresh jalapeno pepper, chopped; 8 (8 inch) flour tortillas",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Place cod fillets on a large sheet of aluminum foil; pour lemon juice over fish and season with salt and black pepper. Fold foil around fish and seal to create a pouch; place pouch in a baking dish. 3. Bake in the preheated oven until fish flakes easily with a fork, about 20 minutes. 4. Meanwhile, whisk vinegar, mayonnaise, sugar, 1 tablespoon salt, 1 tablespoon black pepper, and garlic powder in a bowl until smooth. Combine cabbage, mango, pineapple, red onion, cilantro, and jalapeño in a large bowl. Pour dressing over vegetables and fruit; toss to combine. Cover and refrigerate slaw until ready to serve. 5. Divide fish evenly among flour tortillas. Spoon slaw over fish to serve.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "279"
},
{
  "url": "https://www.allrecipes.com/recipe/214465/coconut-lime-cheesecake-with-mango-coulis/",
  "name": "Coconut-Lime Cheesecake with Mango Coulis",
  "rating": "4.4",
  "ratingcount": "110",
  "ingredients": "¾ cup sweetened flaked coconut; ¾ cup crushed gingersnap cookies; 3 tablespoons melted butter; 2 (8 ounce) packages cream cheese, softened; 1 (10 ounce) can sweetened condensed milk; 2  eggs; 1 tablespoon lime zest; 2 tablespoons lime juice; 1 tablespoon coconut extract; 2 cups cubed fresh mango; 1 teaspoon white sugar, or more to taste",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a 9-inch springform pan. 2. Combine coconut, gingersnap cookies, and melted butter in a bowl; mix until evenly moistened. Press cookie mixture into the bottom and slightly up the sides of the prepared pan. 3. Bake crust in the preheated oven until browned and set, about 10 minutes. Set aside to cool. 4. Reduce oven heat to 300 degrees F (150 degrees C). 5. Beat softened cream cheese in a mixing bowl until smooth. With the beater set to medium-low, slowly pour condensed milk into the bowl, mixing only until just blended and stopping to scrape the sides of the bowl as necessary. 6. Add eggs, one at a time, beating well after each addition; scrape the sides of the bowl as necessary. 7. Pour about 1/2 of the cream cheese batter into a separate bowl. Stir lime zest and lime juice into portion in the new bowl; pour batter over crust in the springform pan, smoothing into an even layer. 8. Stir coconut extract through remaining cream cheese batter; pour over lime-flavored batter in the springform pan, smoothing into an even layer. 9. Bake in the preheated oven until top of cheesecake springs back when gently pressed, about 45 minutes. 10. Turn oven heat off, but leave cheesecake inside with the oven door slightly ajar until the oven cools completely. Refrigerate until thoroughly chilled. 11. Prepare mango coulis by puréeing mango with sugar in a blender until smooth. If too thick, add 1 teaspoon water at a time, using just enough to make it pourable. Drizzle over cheesecake when plated.",
  "prep": "35 mins",
  "cook": "55 mins",
  "total": "9 hrs 30 mins",
  "calories": "468"
},
{
  "url": "https://www.allrecipes.com/recipe/20612/mango-topping/",
  "name": "Mango Topping",
  "rating": "4.6",
  "ratingcount": "25",
  "ingredients": "3 cups mangos, peeled, seeded and chopped; 1 tablespoon butter; 1 tablespoon brown sugar; 1 teaspoon lemon juice; 1 teaspoon orange juice; 3 tablespoons water",
  "directions": "1. In a saucepan over medium heat, combine the mangoes, butter, brown sugar, lemon juice, orange juice, and water. Stir until the mixture thickens. Remove from heat and serve.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "120"
},
{
  "url": "https://www.allrecipes.com/recipe/218348/caribbean-fish-with-mango-salsa/",
  "name": "Caribbean Fish With Mango Salsa",
  "rating": "4.5",
  "ratingcount": "32",
  "ingredients": "1 tablespoon paprika; 2 teaspoons curry powder; 2 teaspoons ground cumin; 1 ½ teaspoons ground allspice; 1 teaspoon ground ginger; 1 teaspoon ground coriander; ¾ teaspoon salt; ½ teaspoon freshly ground black pepper; ¼ teaspoon ground fennel seed (Optional); ⅛ teaspoon cayenne pepper (Optional); 1  mango - peeled, seeded and diced; 1 cup chopped fresh pineapple; ½  red bell pepper, chopped; ½ cup black beans, rinsed and drained (Optional); ½  red onion, finely chopped; 3 tablespoons chopped fresh cilantro; 3 tablespoons fresh lime juice; 1 large egg; ⅓ cup milk; 1 cup panko bread crumbs; 1 tablespoon dried unsweetened coconut, or to taste (Optional); 1 tablespoon olive oil, or as needed; 5 (4 ounce) fillets tilapia",
  "directions": "1. Mix together paprika, curry powder, cumin, allspice, ginger, coriander, salt, black pepper, fennel, and cayenne pepper in a bowl; set aside. 2. In a bowl, lightly toss mango, pineapple, red bell pepper, black beans, red onion, and cilantro in a bowl; pour lime juice over mango mixture and toss again. Cover the bowl and refrigerate until chilled, at least 30 minutes. 3. Whisk together egg and milk in a bowl. In a separate shallow bowl, stir panko crumbs with coconut. Stir about 1 tablespoon of the spice mix, or to taste, into the panko crumb mixture. 4. Heat olive oil in a skillet over medium heat. Dip tilapia fillets into egg mixture, then press gently into panko crumb mixture to coat both sides of fillets. Brush off any loose crumbs, then lay fillets into the hot oil. Pan-fry until fish is opaque inside and golden brown outside, 3 to 5 minutes per side. Serve with mango salsa.",
  "prep": "45 mins",
  "cook": "10 mins",
  "total": "1 hr 25 mins",
  "calories": "312"
},
{
  "url": "https://www.allrecipes.com/recipe/238484/mango-cherry-smoothie/",
  "name": "Mango Cherry Smoothie",
  "rating": "4.6",
  "ratingcount": "10",
  "ingredients": "2 cups pitted cherries; 1 cup chopped mango; 1 cup water; 1 cup ice cubes",
  "directions": "1. Blend cherries, mango, water, and ice cubes in a blender until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "158"
},
{
  "url": "https://www.allrecipes.com/recipe/39583/macadamia-crusted-sea-bass-with-mango-cream-sauce/",
  "name": "Macadamia-Crusted Sea Bass with Mango Cream Sauce",
  "rating": "4.6",
  "ratingcount": "186",
  "ingredients": "½  mango - peeled, seeded and diced; ½ cup heavy cream; 1 teaspoon lemon juice; ½ cup chopped macadamia nuts; ¼ cup seasoned bread crumbs; 1 teaspoon olive oil; ½ teaspoon black pepper; 1 pinch red pepper flakes; 1 pound fresh sea bass; salt and ground black pepper to taste; 2 cloves minced garlic; 1 tablespoon extra virgin olive oil",
  "directions": "1. In a food processor, combine macadamia nuts, bread crumbs, 1 teaspoon olive oil, black pepper, and red pepper flakes. Process until smooth. Preheat oven to 350 degrees F (175 degrees C). 2. In a small saucepan over medium heat, combine mango, cream, and lemon juice. Bring to a boil, reduce heat, and simmer until thickened. 3. Season fish with salt and black pepper. Heat 1 tablespoon olive oil and crushed garlic in a large skillet over medium heat. Sear the sea bass on both sides, and remove from heat. 4. Transfer fish to preheated oven, and roast until cooked through. Cover the sea bass with macadamia crust, and return to the oven until crust browns. Top with the mango cream sauce.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "424"
},
{
  "url": "https://www.allrecipes.com/recipe/269709/jerk-chicken-egg-rolls-with-mango-habanero-sauce/",
  "name": "Jerk Chicken Egg Rolls with Mango-Habanero Sauce",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1  mango, peeled and diced; ¾ cup water; 1 tablespoon seasoned rice vinegar; 1 clove garlic, minced; 1 pinch salt; ½ cup brown sugar, divided; 2  habanero peppers, seeded and minced; 2 tablespoons water; 1 teaspoon cornstarch; 3 tablespoons vegetable oil, divided, or as needed; 6  chicken thighs, diced; 1 tablespoon jerk seasoning, or more to taste; 1  shallot, finely chopped; 1 clove garlic, minced; 1 head green cabbage, shredded; 1 (12 ounce) package shredded carrots; 2  very ripe yellow plantains, peeled and diced; 1 (16 ounce) package egg roll wrappers; 1  egg; 1 tablespoon water; vegetable oil for frying",
  "directions": "1. For the habanero sauce: Combine mango with 3/4 cup water, rice vinegar, garlic, and salt in a small saucepan. Add most of the brown sugar, reserving 1 teaspoon. Bring to a boil, then reduce heat to medium-low; cook for 5 minutes. Add habanero peppers and simmer for 2 minutes. Mix 2 tablespoon water with cornstarch; stir slurry into the saucepan. Cook over medium-high until thick, 3 to 5 minutes. Leave mixture chunky or blend for a smoother texture. 2. For the filling: Heat 1 tablespoon oil in a large saucepan over medium-high heat. Add chicken thighs and sauté until browned, 5 to 7 minutes; sprinkle jerk seasoning over chicken. Add shallot and garlic; cook and stir until shallot begins to soften, about 3 minutes. Reduce heat to medium; add cabbage, carrots, and reserved sugar. Cook until cabbage is translucent but still a little crunchy, 3 to 5 minutes. Taste for seasoning. Let mixture cool. 3. Heat remaining vegetable oil in a pan over medium-high heat. Fry plantains until they start to brown, about 5 minutes. Transfer plantains onto a paper towel and let cool. 4. Separate and place egg roll wrappers onto your work surface. Mix egg with water for egg wash. 5. Lay out one wrapper with a corner pointed toward you. Use a slotted spoon to add some of the chicken and cabbage mixtures across the center. Sprinkle plantain bits on top. Use your finger or a pastry brush to lightly moisten edges of wonton wrappers with egg wash. Fold one corner of the wrapper over filling onto the opposite corner to form a triangle. Press edges together to seal. Fill and fold remaining egg rolls. 6. Heat oil in a large saucepan over medium-high heat. Fry egg rolls in batches in hot oil, turning occasionally, until golden brown, about 5 minutes. Remove and drain on paper towels or a rack. Serve with mango-habanero sauce.",
  "prep": "45 mins",
  "cook": "40 mins",
  "total": "1 hr 25 mins",
  "calories": "252"
},
{
  "url": "https://www.allrecipes.com/recipe/256924/pineapple-mango-habanero-jam/",
  "name": "Pineapple Mango Habanero Jam",
  "rating": "5.0",
  "ratingcount": "5",
  "ingredients": "1 ½ pounds fresh mangos, cut into chunks; 1 pound fresh pineapple, cut into chunks; ½ cup cider vinegar; 4 cups white sugar; 1 (3 ounce) pouch liquid pectin; 4  habanero chiles - stemmed, halved, and seeded",
  "directions": "1. Combine mangos, pineapple, and cider vinegar in a stockpot over medium-high heat. Bring to a simmer; mash mangos and pineapple to a chunky consistency with a potato masher. Stir in sugar until dissolved. 2. Stir liquid pectin and habanero chile halves into the stockpot. Bring to a rolling boil, stirring frequently. Cook, stirring frequently, until jam thickens, about 2 minutes. Remove chile halves. Discard 6 chile halves; chop 2 halves and stir back into the stockpot. 3. Sterilize 8 half-pint jars and lids in boiling water for at least 5 minutes. 4. Ladle hot jam into the hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife around the insides of the jars to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with the lids and screw on the rings. 5. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into boiling water using a holder, spacing them 2 inches apart. Pour in more boiling water to cover jars by at least 1 inch. Bring water to a rolling boil, cover the pot, and process for 10 minutes. 6. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool, about 8 hours. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all).",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "9 hrs",
  "calories": "60"
},
{
  "url": "https://www.allrecipes.com/recipe/246845/blackened-salmon-tacos-with-chunky-mango-avocado-salsa/",
  "name": "Blackened Salmon Tacos with Chunky Mango Avocado Salsa",
  "rating": "4.7",
  "ratingcount": "102",
  "ingredients": "3  ripe mangoes - peeled, pitted, and diced; 1  avocado - peeled, pitted, and diced; 1  orange bell pepper, diced; 1  jalapeno pepper, seeded and diced; 1  lime, juiced; 2 tablespoons chopped fresh cilantro; 1 pinch salt; 1 tablespoon sweet and spicy seafood rub, or to taste; ½ teaspoon chili powder, or to taste; salt and ground black pepper to taste; 2  skin-on salmon fillets; 2 tablespoons olive oil, or as needed, divided; 6  corn tortillas; 3 large limes, cut into wedges",
  "directions": "1. Combine mangoes, avocado, orange bell pepper, and jalapeno in a large bowl to make salsa. Add lime juice, cilantro, and salt; mix to combine. Cover with plastic wrap and refrigerate. 2. Sprinkle seafood rub, chili powder, salt, and black pepper over 1 side of each salmon steak; rub in with your fingers until evenly distributed. 3. Coat the bottom of a large skillet with olive oil and heat over medium-high heat. Add salmon skin-side down and cook until skin is crisp, 4 to 5 minutes. Flip salmon and carefully peel off skin. Season top with seafood rub, chili powder, salt and black pepper. Continue cooking until lightly browned on the second side and salmon flakes easily with a fork, 4 to 5 minutes. 4. Slice each salmon fillet lengthwise to create 6 pieces. 5. Lightly oil another skillet over medium heat. Pan-fry corn tortillas, one at a time, until heated through and pliable, about 30 seconds per side. 6. Place 1 piece of salmon on each tortilla. Top with salsa. Squeeze a wedge of lime on top.",
  "prep": "40 mins",
  "cook": "9 mins",
  "total": "49 mins",
  "calories": "287"
},
{
  "url": "https://www.allrecipes.com/recipe/280507/chamoyada/",
  "name": "Chamoyada",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 cup fresh or frozen mango cubes; 1 (6 ounce) can pineapple juice; ½  lime; 2 teaspoons chili-lime seasoning (such as Tajin®); 2 tablespoons chamoy (Mexican chili fruit condiment)",
  "directions": "1. Combine mango and pineapple juice in a blender; blend until smooth. Set aside. 2. Rub lime wedge around the rim of a glass, then dip in 1 teaspoon chili-lime seasoning. Juice lime into the glass; add 1 tablespoon chamoy and remaining 1 teaspoon chili-lime seasoning. Pour 1/2 of the mango-pineapple mixture into the prepared glass. Add remaining 1 tablespoon chamoy sauce and top with remaining mango-pineapple mixture.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "233"
},
{
  "url": "https://www.allrecipes.com/recipe/257439/mango-overnight-oats/",
  "name": "Mango Overnight Oats",
  "rating": "4.7",
  "ratingcount": "16",
  "ingredients": "½ cup Quaker® Oats; ¼ cup low-fat milk; ⅓ cup low-fat plain yogurt; ⅛ teaspoon almond extract; ½ cup diced mango; 1 teaspoon honey; 1 teaspoon chia seeds",
  "directions": "1. Add oats to your container of choice. Pour in low-fat milk and yogurt. 2. Mix in almond extract. Add a layer of mango. Top off with a drizzle of honey and chia seeds. 3. Place in the refrigerator for 3 hours to overnight.",
  "prep": "10 mins",
  "cook": "",
  "total": "3 hrs 10 mins",
  "calories": "265"
},
{
  "url": "https://www.allrecipes.com/recipe/50188/mango-relish/",
  "name": "Mango Relish",
  "rating": "4.8",
  "ratingcount": "26",
  "ingredients": "1  mango - peeled, seeded and diced; 1 teaspoon extra virgin olive oil; ½  red bell pepper, chopped; 2  green onion, thinly sliced; 1 tablespoon chopped cilantro; 1  lime, juiced; ¼ teaspoon salt; 1 pinch cracked black pepper; 1 teaspoon honey",
  "directions": "1. Combine mango, oil, bell pepper, scallions, cilantro, and lime juice in a small bowl. Stir to combine. Season with salt, pepper, and honey. Refrigerate or serve immediately.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "63"
},
{
  "url": "https://www.allrecipes.com/recipe/238076/peach-mango-habanero-wing-sauce/",
  "name": "Peach-Mango-Habanero Wing Sauce",
  "rating": "4.4",
  "ratingcount": "11",
  "ingredients": "1 large mango, peeled and pitted; 1 small fresh peach, halved and pitted; 2  habanero peppers, stemmed; ¼ cup unsalted butter; 4 cloves garlic, minced; ½ cup brown sugar; 2 teaspoons Worcestershire sauce; 1 teaspoon minced fresh ginger root; salt and ground black pepper to taste",
  "directions": "1. Blend mango, peach, and habanero peppers in a food processor or blender until smooth. 2. Melt butter in a saucepan over medium heat; cook and stir garlic until fragrant, about 1 minute. Add mango mixture, brown sugar, Worcestershire sauce, ginger, salt, and pepper; reduce heat to low and simmer until sauce is smooth and slightly thickened, about 8 minutes.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "57"
},
{
  "url": "https://www.allrecipes.com/recipe/221288/savory-mango-guacamole/",
  "name": "Savory Mango Guacamole",
  "rating": "4.7",
  "ratingcount": "11",
  "ingredients": "3 large avocados, peeled and pitted; 1 small red onion, chopped; 1  mango - peeled, pitted, and chopped; 1  lime, juiced; 1 tablespoon minced garlic; 1 tablespoon salt; 3 tablespoons chopped fresh cilantro",
  "directions": "1. Mash avocados in a medium bowl to a lumpy consistency. Mix onion, mango, lime juice, garlic, salt, and cilantro into avocado.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "254"
},
{
  "url": "https://www.allrecipes.com/recipe/90041/strawberry-mango-mesclun-salad/",
  "name": "Strawberry Mango Mesclun Salad",
  "rating": "4.8",
  "ratingcount": "86",
  "ingredients": "½ cup sugar; ¾ cup canola oil; 1 teaspoon salt; ¼ cup balsamic vinegar; 8 cups mixed salad greens; 2 cups sweetened dried cranberries; ½ pound fresh strawberries, quartered; 1  mango - peeled, seeded, and cubed; ½ cup chopped onion; 1 cup slivered almonds",
  "directions": "1. Place sugar, oil, salt, and vinegar in a jar with a lid. Seal the jar and shake vigorously to mix. 2. In a large bowl, mix salad greens, sweetened dried cranberries, strawberries, mango, and onion. To serve, toss with dressing and sprinkle with almonds.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "320"
},
{
  "url": "https://www.allrecipes.com/recipe/270865/tropical-mango-pineapple-berry-smoothie/",
  "name": "Tropical Mango-Pineapple-Berry Smoothie",
  "rating": "4.5",
  "ratingcount": "6",
  "ingredients": "1  mango - peeled, seeded, and diced; 1 cup frozen strawberries; 1 cup low-fat vanilla yogurt; 6 ounces pineapple juice; ½ cup frozen blueberries",
  "directions": "1. Combine mango, frozen strawberries, yogurt, pineapple juice, and frozen blueberries in a blender; blend until smooth.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "261"
},
{
  "url": "https://www.allrecipes.com/recipe/163001/bourbon-mango-pulled-pork/",
  "name": "Bourbon Mango Pulled Pork",
  "rating": "4.7",
  "ratingcount": "376",
  "ingredients": "2  mangos; 1 (4 pound) pork shoulder roast; 2 tablespoons ground black pepper; 1 teaspoon kosher salt; 2 teaspoons chipotle chile powder, divided; ¼ cup balsamic vinegar; 2 cups water; 2 teaspoons honey; 1 (1.5 fluid ounce) jigger bourbon whiskey; 2 (12 ounce) bottles barbecue sauce",
  "directions": "1. Peel mangos and remove the pits. Place the pits into a slow cooker, then roughly chop the mango and set aside. Place pork shoulder into the slow cooker and season with pepper, salt, and 1 teaspoon chipotle powder. Pour in balsamic vinegar and water. 2. Cover and cook on Low until the meat is very tender, 5 to 8 hours. Once done, drain the pork, discarding the cooking liquid and mango pits, and shred with two forks. 3. While pork is cooking, purée chopped mango in a blender until smooth, then pour into a saucepan along with honey, remaining chipotle powder, and whiskey. Bring to a simmer. Reduce heat to medium-low and simmer, stirring frequently, until mango has reduced and darkened slightly, about 10 minutes. Stir in barbecue sauce and remove from the heat. 4. Return shredded pork to the slow cooker and stir in mango barbecue sauce. Cover and cook on High until pork absorbs the barbecue sauce, 1 to 2 hours.",
  "prep": "20 mins",
  "cook": "6 hrs",
  "total": "6 hrs 20 mins",
  "calories": "319"
},
{
  "url": "https://www.allrecipes.com/recipe/150313/thai-sweet-sticky-rice-with-mango-khao-neeo-mamuang/",
  "name": "Thai Sweet Sticky Rice With Mango (Khao Neeo Mamuang)",
  "rating": "4.5",
  "ratingcount": "294",
  "ingredients": "2 cups water; 1 ½ cups uncooked short-grain white rice; 1 ½ cups coconut milk, divided; 1 cup white sugar; ¾ teaspoon salt, divided; 1 tablespoon white sugar; 1 tablespoon tapioca starch; 3  mangos, peeled and sliced; 1 tablespoon toasted sesame seeds",
  "directions": "1. Combine water and rice in a saucepan. Bring to a boil, cover, and reduce heat to low. Simmer until water is absorbed, 15 to 20 minutes. 2. While the rice cooks, combine 1 1/2 cups coconut milk, 1 cup sugar, and 1/2 teaspoon salt in another saucepan. Bring to a boil over medium heat; remove from the heat and set aside. 3. Stir cooked rice into coconut milk mixture. Cover and allow to cool for 1 hour. 4. Make a sauce by combining 1/2 cup coconut milk, 1 tablespoon sugar, 1/4 teaspoon salt, and tapioca starch in another saucepan; bring to a boil. 5. Place coconut rice on a serving dish and arrange mangos on top. Pour sauce over mangos and rice. Sprinkle with sesame seeds.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr 30 mins",
  "calories": "817"
},
{
  "url": "https://www.allrecipes.com/recipe/231851/easy-mango-banana-smoothie/",
  "name": "Easy Mango Banana Smoothie",
  "rating": "4.5",
  "ratingcount": "42",
  "ingredients": "2  mangos - peeled, seeded, and sliced; 2  bananas; 2 cups vanilla yogurt; 2 cups milk",
  "directions": "1. Combine mangos, banana, vanilla yogurt, and milk in a blender; blend until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "133"
},
{
  "url": "https://www.allrecipes.com/recipe/214541/mahi-mahi-with-coconut-rice-and-mango-salsa/",
  "name": "Mahi Mahi with Coconut Rice and Mango Salsa",
  "rating": "4.7",
  "ratingcount": "242",
  "ingredients": "2 tablespoons olive oil; 1 ½ teaspoons soy sauce; 2 teaspoons lemon juice; 1 clove garlic, crushed; ½ teaspoon minced fresh ginger root; 2 teaspoons red pepper flakes; 1 teaspoon fresh ground black pepper; salt to taste; 2 tablespoons chopped green onion (Optional); 4 (4 ounce) mahi mahi fillets; 2 cups uncooked jasmine rice; 2 cups water; 1 cube chicken bouillon; 1 tablespoon butter (Optional); ¾ (14 ounce) can coconut milk; 2 tablespoons white sugar; 1 ½ tablespoons white sugar; 1 ½ teaspoons butter (Optional); 1 ½ cups fresh mango, cubed",
  "directions": "1. Prepare fish marinade: Whisk together olive oil, soy sauce, lemon juice, garlic, and ginger in a bowl. Season with red pepper flakes, black pepper, and salt. Stir in green onion. Add mahi mahi and toss to coat evenly. Cover the bowl with plastic wrap and marinate in the refrigerator for 1 hour. 2. Meanwhile, make coconut rice: Bring rice, water, chicken bouillon, and butter to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the liquid has been absorbed, about 20 minutes. Pour in coconut milk and sugar. Stir and simmer uncovered until the rice has absorbed most of the coconut milk. 3. Preheat the oven's broiler and set the oven rack in the middle of the oven. 4. Remove mahi mahi from the marinade and shake off excess. Discard remaining marinade. Place fish in a large baking dish in a single layer. Broil in the preheated oven until the fish flakes easily with a fork, 10 to 15 minutes. If fish browns too quickly, cover the baking dish with aluminum foil. 5. While fish cooks, make mango salsa: Melt sugar and butter in a skillet over medium-high heat. When mixture begins to bubble, stir in mango cubes. Cook and stir until mango is tender, about 5 minutes. 6. Serve by placing one mahi mahi fillet over a scoop of hot coconut rice, and top with mango salsa.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "2 hrs",
  "calories": "808"
},
{
  "url": "https://www.allrecipes.com/recipe/48032/mango-salsa/",
  "name": "Mango Salsa",
  "rating": "4.7",
  "ratingcount": "504",
  "ingredients": "1  mango - peeled, seeded, and chopped; ¼ cup finely chopped red bell pepper; 1  green onion, chopped; 1 fresh jalapeño chile pepper, finely chopped; 2 tablespoons chopped cilantro; 2 tablespoons lime juice; 1 tablespoon lemon juice",
  "directions": "1. Gather ingredients. 2. Place mango, red bell pepper, green onion, jalapeño, cilantro, lime juice, and lemon juice in a medium bowl. 3. Mix ingredients well to combine. Cover and let sit at least 30 minutes before serving. 4. Serve with chips.",
  "prep": "15 mins",
  "cook": "",
  "total": "45 mins",
  "calories": "21"
},
{
  "url": "https://www.allrecipes.com/recipe/233495/jicama-mango-salad-with-cilantro-and-lime/",
  "name": "Jicama Mango Salad with Cilantro and Lime",
  "rating": "4.9",
  "ratingcount": "79",
  "ingredients": "1 large jicama, peeled and cut into matchsticks; 1 small red bell pepper, cut into matchsticks; 1 large firm mango, peeled and cut into matchsticks; ½ medium red onion, thinly sliced; ½ cup chopped cilantro leaves; ¼ cup honey; 2 medium limes, juiced; 1 teaspoon salt; ⅛ teaspoon cayenne pepper, or more to taste",
  "directions": "1. Make the salad: Toss jicama, bell pepper, mango, and onion together in a large bowl. 2. Make the dressing: Stir cilantro, honey, lime juice, salt, and cayenne pepper together in a small bowl. 3. Pour dressing over salad and toss to coat. Cover and refrigerate for at least 15 minutes before serving.",
  "prep": "30 mins",
  "cook": "",
  "total": "45 mins",
  "calories": "126"
},
{
  "url": "https://www.allrecipes.com/recipe/142747/mango-jam/",
  "name": "Mango Jam",
  "rating": "4.7",
  "ratingcount": "70",
  "ingredients": "2 pounds ripe mangoes; 1 ½ cups white sugar; ¾ cup water; 3  saffron threads (Optional)",
  "directions": "1. Gather all ingredients. 2. Make 4 to 5 slits in mangoes and microwave on High until soft, 1 to 2 minutes. 3. Cool, then remove the peel and inner seed; place mango pulp in a large bowl. Use a fork or potato masher to mash the pulp well. 4. Stir together sugar and water in a large saucepan over low heat, and bring to a boil. When the mixture begins boiling, increase heat to medium-high. Continue boiling until fine, soft threads form, 270 degrees F (135 degrees C). 5. Stir in mango pulp, add saffron threads, and boil until the mixture thickens, about 5 minutes. 6. Pour cooked jam into sterilized jars and seal according to canning directions.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "73"
},
{
  "url": "https://www.allrecipes.com/recipe/261294/sweet-and-kickin-mango-habanero-hot-sauce/",
  "name": "Sweet and Kickin' Mango-Habanero Hot Sauce",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "2 tablespoons extra virgin olive oil; 1 large sweet onion, chopped; 7  ripe mangoes, cored and chopped; 1  fresh peach, chopped (Optional); ⅓ cup honey; 15  habanero peppers, stemmed, or more to taste; ¼ cup yellow mustard; 2 ½ tablespoons salt; 2 ½ tablespoons paprika; 1 ½ tablespoons ground white pepper; 1 tablespoon ground cumin; ⅓ teaspoon ground allspice; ¼ cup light brown sugar; 1 ½ cups white vinegar; ½ cup apple cider vinegar",
  "directions": "1. Heat olive oil in a skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. 2. Combine the onion, mangoes, peach, honey, habanero peppers, and mustard in a food processor. Process until smooth; mix in salt, paprika, white pepper, cumin, and allspice. Add brown sugar; continue to process until well combined. 3. Pour mango-habanero mixture into a large saucepan. Bring to a boil. Add white vinegar and apple cider vinegar, stirring frequently until thoroughly combined. Boil until thickened, 10 to 12 minutes. Pour sauce into jars or containers.",
  "prep": "25 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "13"
},
{
  "url": "https://www.allrecipes.com/recipe/233899/healthy-fish-tacos-with-mango-salsa/",
  "name": "Healthy Fish Tacos with Mango Salsa",
  "rating": "4.9",
  "ratingcount": "56",
  "ingredients": "1  mango - peeled, seeded, and chopped; 2  avocados - peeled, pitted, and chopped; 1 cup chopped tomato; ½ cup diced red onion; ½ cup diced red pepper; 2 tablespoons chopped fresh flat-leaf parsley; 2 tablespoons canola oil; 2 tablespoons brown sugar; 1  lime, juiced; 1 teaspoon cider vinegar; 1 dash hot pepper sauce, or to taste; salt and ground black pepper to taste; 8  taco shells; 4 (6 ounce) mahi mahi fillets, cut into 1-inch slices; 1 teaspoon ground black pepper; 1 teaspoon paprika; ½ teaspoon salt; 2 tablespoons olive oil",
  "directions": "1. Stir mango, avocado, tomato, red onion, red pepper, parsley, canola oil, brown sugar, lime juice, cider vinegar, hot pepper sauce, salt, and ground black pepper together in a bowl. Refrigerate salsa for at least 1 hour. 2. Preheat oven to 325 degrees F (165 degrees C). 3. Heat taco shells in preheated oven until crisp, about 5 minutes. 4. Season mahi mahi with 1 teaspoon ground black pepper, paprika, and 1/2 teaspoon salt. 5. Heat olive oil in a skillet over medium-high heat. Cook mahi mahi in olive oil until fish flakes easily, about 3 minutes per side. 6. Place mahi mahi slices in taco shells and top with mango salsa.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "1 hr 35 mins",
  "calories": "324"
},
{
  "url": "https://www.allrecipes.com/recipe/261293/mango-habanero-chicken-wings/",
  "name": "Mango Habanero Chicken Wings",
  "rating": "4.5",
  "ratingcount": "21",
  "ingredients": "30  chicken wing sections; 1 (12 ounce) can mango nectar; ¼ cup brown sugar; 6  habanero peppers, stemmed; 2 tablespoons soy sauce; 1 tablespoon Sriracha sauce; 1 tablespoon rice vinegar; ½ cup butter; 3 cloves garlic, minced; 2 tablespoons honey; 1 cup cornstarch; 2 cups vegetable oil for frying",
  "directions": "1. Rinse chicken wings and pat dry with paper towels. Place onto a baking sheet, cover, and refrigerate until sauce is finished. 2. Purée mango nectar, brown sugar, habanero peppers, soy sauce, Sriracha, and vinegar in a food processor (habanero seeds will still be visible). Remove the food processor lid carefully as the pepper fumes can be strong. 3. Melt butter in a saucepan over medium heat. Add garlic and cook until fragrant, about 30 seconds. Immediately add mango-habanero mixture and bring to a simmer, stirring frequently. Reduce the heat to medium-low and stir in honey. Simmer, stirring frequently, until sauce is reduced by 75% and thickened to a glaze, 45 minutes to 1 hour. 4. While the sauce is cooking, place a rimmed baking sheet in the oven and preheat to 200 degrees F (95 degrees C). Heat oil in a deep-fryer to 350 degrees F (175 degrees C). Place cornstarch in a resealable plastic bag. 5. Remove wings from the refrigerator and toss in small batches in cornstarch to lightly coat. Place in a single layer onto a plate. 6. Fry 5 to 6 wings at a time in hot oil until golden brown and crispy, about 8 minutes. Drain on paper towels, then place on the baking sheet in the preheated oven to keep warm while you fry remaining batches. 7. Remove wings from the oven and place into a large bowl. Pour 1/2 of the hot sauce over top and mix to coat. Continue adding sauce until wings are coated to your liking.",
  "prep": "30 mins",
  "cook": "1 hr 55 mins",
  "total": "2 hrs 25 mins",
  "calories": "450"
},
{
  "url": "https://www.allrecipes.com/recipe/223329/white-peachy-sangria/",
  "name": "White Peachy Sangria",
  "rating": "4.9",
  "ratingcount": "69",
  "ingredients": "4 (750 milliliter) bottles moscato wine; 4 (12 fluid ounce) cans or bottles lemon-lime soda (such as Sprite®); 1 cup brandy; 1 cup peach schnapps; 2  fresh peaches, pitted and sliced; 1 (16 ounce) package fresh strawberries, sliced; 2  mangos - peeled, seeded, and sliced; ½  fresh pineapple - peeled, cored, and cut into chunks; 1 (6 ounce) container fresh raspberries",
  "directions": "1. Stir moscato wine, lemon-lime soda, brandy, peach schnapps, peaches, strawberries, mangos, pineapple chunks, and raspberries together in a large container and chill 8 hours or overnight.",
  "prep": "30 mins",
  "cook": "",
  "total": "8 hrs 30 mins",
  "calories": "376"
},
{
  "url": "https://www.allrecipes.com/recipe/23537/white-sangria/",
  "name": "White Sangria",
  "rating": "4.7",
  "ratingcount": "162",
  "ingredients": "½ cup peach schnapps; ½ cup cognac; ¼ cup white sugar; 4  oranges, sliced into rounds; 2  mangos, peeled and sliced; 4 (750 milliliter) bottles dry white wine, chilled; 1 liter ginger ale, chilled",
  "directions": "1. Combine peach schnapps, cognac, sugar, sliced oranges, and sliced mangos in a pitcher; stir and chill for at least an hour. 2. Pour fruit mixture into a large punch bowl. Stir in chilled white wine and ginger ale. Ladle into glasses with some of the sliced fruit.",
  "prep": "30 mins",
  "cook": "",
  "total": "1 hr 30 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/222189/spicy-mango-sauce/",
  "name": "Spicy Mango Sauce",
  "rating": "4.9",
  "ratingcount": "26",
  "ingredients": "¾ cup finely minced mango; ¼ cup seasoned rice vinegar; juice from one lime; ½ small Thai chile pepper, minced; 1 clove garlic, crushed; 1 teaspoon hot chile paste (such as sambal oelek); 1 tablespoon chopped fresh cilantro",
  "directions": "1. Stir mango, rice vinegar, lime juice, Thai chile pepper, garlic, and hot chile paste in a bowl until well combined. Cover and let rest 30 minutes. Stir in cilantro.",
  "prep": "10 mins",
  "cook": "",
  "total": "40 mins",
  "calories": "82"
},
{
  "url": "https://www.allrecipes.com/recipe/166771/grilled-tilapia-with-mango-salsa/",
  "name": "Grilled Tilapia with Mango Salsa",
  "rating": "4.8",
  "ratingcount": "949",
  "ingredients": "⅓ cup extra-virgin olive oil; 1 tablespoon lemon juice; 1 tablespoon minced fresh parsley; 1 clove garlic, minced; 1 teaspoon dried basil; 1 teaspoon ground black pepper; ½ teaspoon salt; 2 (6 ounce) tilapia fillets; 1 large ripe mango, peeled, pitted and diced; ½  red bell pepper, diced; 1  jalapeno pepper, seeded and minced; 2 tablespoons minced red onion; 1 tablespoon chopped fresh cilantro; 2 tablespoons lime juice; 1 tablespoon lemon juice; salt and pepper to taste",
  "directions": "1. Prepare the fish: Whisk together olive oil, lemon juice, parsley, garlic, basil, black pepper, and salt in a bowl and pour into a resealable plastic bag. Add tilapia fillets, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 1 hour. 2. Meanwhile, make the salsa: Combine mango, bell pepper, jalapeño pepper, red onion, and cilantro in a bowl. Add lime and lemon juices and toss well. Season to taste with salt and pepper. Refrigerate until ready to serve. 3. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 4. Remove tilapia from the marinade and shake off excess. Discard remaining marinade. Grill fillets until fish is no longer translucent in the center and flakes easily with a fork, 3 to 4 minutes per side, depending on the thickness of the fillets. 5. Serve tilapia topped with mango salsa.",
  "prep": "45 mins",
  "cook": "10 mins",
  "total": "1 hr 55 mins",
  "calories": "634"
},
{
  "url": "https://www.allrecipes.com/recipe/219459/maui-girls-mango-pie/",
  "name": "Maui Girl's Mango Pie",
  "rating": "4.7",
  "ratingcount": "46",
  "ingredients": "pastry for a double-crust 9-inch pie; 4 cups peeled and sliced mango; ½ cup white sugar; 3 tablespoons cornstarch; 2 teaspoons lemon juice; 1 teaspoon ground cinnamon; 1 tablespoon butter, cut into small chunks",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Line a 9-inch pie pan with half of the pie pastry. Set aside. 2. Combine mango, sugar, cornstarch, lemon juice, and cinnamon in a bowl; stir until the sugar has dissolved. Transfer mango mixture into the prepared pie pan. Dot the mixture with the butter, then cover with the top crust. Pinch the edges of the top and bottom crusts together to seal. Cut several vents on the top crust. 3. Bake in the preheated oven until the crust is golden brown and the juices are bubbling, about 45 minutes.",
  "prep": "25 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "355"
},
{
  "url": "https://www.allrecipes.com/recipe/222325/mango-bread/",
  "name": "Mango Bread",
  "rating": "4.8",
  "ratingcount": "80",
  "ingredients": "2 cups all-purpose flour; 2 teaspoons baking soda; 2 teaspoons ground cinnamon; ½ teaspoon salt; 3  eggs; ¾ cup softened butter; 1 ¼ cups white sugar; 1 teaspoon vanilla extract; 2 cups chopped mango; ½ cup shredded coconut; ¼ cup chopped walnuts",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 loaf pans. 2. Sift flour, baking soda, cinnamon, and salt together in a large bowl; make a well in the center. 3. Whisk eggs, butter, sugar, and vanilla extract together in a separate bowl. Fold mango, coconut, and walnuts into the egg mixture; pour resulting mixture into the well in the center of the flour and mix well. Pour batter into prepared loaf pans and let sit at room temperature for 20 minutes. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "245"
},
{
  "url": "https://www.allrecipes.com/recipe/215631/fresh-mango-salsa/",
  "name": "Fresh Mango Salsa",
  "rating": "4.7",
  "ratingcount": "104",
  "ingredients": "2 cups diced Roma tomatoes; 1 ½ cups diced mango; ½ cup diced onion; 1 teaspoon white sugar; ½ cup chopped fresh cilantro; 2 tablespoons fresh lime juice; 1 tablespoon cider vinegar; ½ teaspoon salt; ½ teaspoon black pepper; 2 cloves garlic, minced",
  "directions": "1. Stir the tomatoes, mango, onion, sugar, cilantro, lime juice, cider vinegar, salt, pepper, and garlic together in a bowl; refrigerate 1 hour before serving.",
  "prep": "20 mins",
  "cook": "",
  "total": "1 hr 20 mins",
  "calories": "8"
},
{
  "url": "https://www.allrecipes.com/recipe/238647/lelas-protein-mango-smoothie/",
  "name": "Lela's Protein Mango Smoothie",
  "rating": "4.8",
  "ratingcount": "21",
  "ingredients": "½  mango, chopped, or more to taste; ½ cup low-fat vanilla yogurt; ½ cup almond milk; ½ cup ice; 1 scoop vanilla whey protein powder; 1 teaspoon honey, or to taste (Optional)",
  "directions": "1. Blend mango, yogurt, almond milk, ice, protein powder, and honey together in a blender until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "401"
},
{
  "url": "https://www.allrecipes.com/recipe/215171/creamy-mango-smoothie/",
  "name": "Creamy Mango Smoothie",
  "rating": "4.4",
  "ratingcount": "68",
  "ingredients": "¾ cup cold milk; ¼ cup vanilla yogurt; ¾ teaspoon vanilla extract; 1 ½ cups chopped fresh mango; 3  ice cubes",
  "directions": "1. Blend the milk, yogurt, vanilla extract, mango, and ice cubes in a blender until smooth and creamy.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "157"
},
{
  "url": "https://www.allrecipes.com/recipe/238047/easy-mango-salad/",
  "name": "Easy Mango Salad",
  "rating": "4.3",
  "ratingcount": "9",
  "ingredients": "2  firm green mangoes - peeled, pitted, and cut into matchsticks; ¼  purple onion, thinly sliced; ¼  red bell pepper, thinly sliced; 3 sprigs cilantro, or more to taste, leaves removed and stems discarded; 2 tablespoons lime juice; 2 tablespoons fish sauce; 1 tablespoon brown sugar; 1 tablespoon crushed peanuts",
  "directions": "1. Mix mangoes, onion, red bell pepper, and cilantro leaves together in a bowl. 2. Whisk lime juice, fish sauce, and brown sugar together in a separate bowl until the sugar is dissolved; pour over the mango mixture and toss to coat. Top salad with peanuts.",
  "prep": "20 mins",
  "cook": "",
  "total": "20 mins",
  "calories": "84"
},
{
  "url": "https://www.allrecipes.com/recipe/242236/easy-mango-cake/",
  "name": "Easy Mango Cake",
  "rating": "4.3",
  "ratingcount": "8",
  "ingredients": "1  ripe mango; 1 (18.25 ounce) box yellow cake mix; 3  eggs; ½ cup water; ¼ cup vegetable oil; 2 tablespoons lime zest; 1 tablespoon butter, melted; ½  lime, juiced; 1 tablespoon golden rum (Optional); 2 cups confectioners' sugar",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a fluted tube pan (such as Bundt®). 2. Peel mango with a vegetable peeler or paring knife. Cut flesh into small pieces and squeeze pit for juice. Collect all juice from chopping and squeezing pit and reserve for glaze. Smash mango in a bowl using a potato masher or fork. Measure 1 cup smashed mango, reserving the rest for the glaze. 3. Beat 1 cup smashed mango, cake mix, eggs, water, vegetable oil, and lime zest together in a bowl using an electric mixer for 2 minutes; pour into the prepared pan. 4. Bake in the preheated oven until a toothpick inserted in the center comes out clean, 40 to 50 minutes. Cool cake in pan for 5 minutes. Invert cake onto a wire rack to cool completely. 5. Combine butter, lime juice, about 1 tablespoon reserved juice from mango, and rum together in a bowl. Stir confectioners' sugar into butter mixture until desired consistency is reached; fold smashed mango into glaze. Spoon glaze over cooled cake.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "1 hr 25 mins",
  "calories": "346"
},
{
  "url": "https://www.allrecipes.com/recipe/86396/mango-sorbet/",
  "name": "Mango Sorbet",
  "rating": "4.7",
  "ratingcount": "112",
  "ingredients": "4  mangos - peeled, seeded, and cubed; 1 cup simple syrup; 3 tablespoons fresh lime juice",
  "directions": "1. Place cubed mango in a food processor, and puree. Pour in simple syrup and lime juice, and puree until smooth. 2. Place in an ice cream maker. Freeze thoroughly.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "94"
},
{
  "url": "https://www.allrecipes.com/recipe/242162/delightfully-exotic-mango-cake/",
  "name": "Delightfully Exotic Mango Cake",
  "rating": "4.4",
  "ratingcount": "13",
  "ingredients": "1 ½ cups canned sweetened mango pulp; 1 cup white sugar; ½ cup margarine; 2 medium eggs; 2 cups all-purpose flour; 1 teaspoon baking powder; 1 teaspoon baking soda; 2 tablespoons whole almonds, or as desired (Optional)",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish. 2. Beat mango pulp, sugar, margarine, and eggs together in a bowl using an electric mixer on medium speed until light and well mixed, 3 to 5 minutes. 3. Sift flour, baking powder, and baking soda together in a bowl. Stir mango mixture into flour mixture just until batter is combined. Pour batter into the prepared baking dish. 4. Bake in the preheated oven for 15 minutes. Gently press almonds into batter. Continue baking until a toothpick inserted in the middle comes out clean, about 20 minutes.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "306"
},
{
  "url": "https://www.allrecipes.com/recipe/103535/blackened-tuna-steaks-with-mango-salsa/",
  "name": "Blackened Tuna Steaks with Mango Salsa",
  "rating": "4.8",
  "ratingcount": "345",
  "ingredients": "2 tablespoons olive oil; 2 tablespoons lime juice; 2 cloves garlic, minced; 4  tuna steaks; 1  fresh mango - peeled, pitted, and chopped; ¼ cup finely chopped red bell pepper; ½  Spanish onion, finely chopped; 1  green onion, chopped; 2 tablespoons chopped fresh cilantro; 1  jalapeno pepper, seeded and minced; 2 tablespoons lime juice; 1 ½ teaspoons olive oil; 2 tablespoons paprika; 1 tablespoon cayenne pepper; 1 tablespoon onion powder; 2 teaspoons salt; 1 teaspoon ground black pepper; 1 teaspoon dried thyme; 1 teaspoon dried basil; 1 teaspoon dried oregano; 1 tablespoon garlic powder; 4 tablespoons olive oil",
  "directions": "1. Whisk together the olive oil, lime juice, and garlic in a bowl. Rub the tuna steaks with the mixture. Place the steaks in a sealable container and chill in refrigerator 3 hours. 2. Combine the mango, bell pepper, Spanish onion, green onion, cilantro, and jalapeno pepper in a bowl; stir. Add the lime juice and 1 1/2 teaspoons olive oil and toss to combine. Chill in refrigerator 1 hour. 3. Stir together the paprika, cayenne pepper, onion powder, salt, pepper, thyme, basil, oregano, and garlic powder in a bowl. Remove the tuna steaks from the refrigerator and gently rinse with water and then dip each side of each steak in the spice mixture to coat. 4. Heat 2 tablespoons olive oil in a large skillet over medium heat. Gently lay the tuna steaks into the hot oil. Cook the tuna on one side for 3 minutes; remove to a plate. Pour the remaining 2 tablespoons olive oil into the skillet and let it get hot. Lay the tuna with the uncooked side down into the skillet and cook another 3 minutes; remove from heat immediately. 5. Spoon about 1/2 cup of the mango salsa onto each of 4 plates. Lay the tuna steaks atop the salsa and serve immediately.",
  "prep": "45 mins",
  "cook": "10 mins",
  "total": "3 hrs 55 mins",
  "calories": "458"
}]