[{
  "url": "https://www.allrecipes.com/recipe/17907/ezekiel-bread-ii/",
  "name": "Ezekiel Bread II",
  "rating": "4.3",
  "ratingcount": "12",
  "ingredients": "1 cup lentils; 2 (.25 ounce) packages active dry yeast; 5 cups warm water (110 degrees F/45 degrees C), divided; 5 tablespoons olive oil; 1 tablespoon salt; 1 tablespoon honey; 8 cups whole wheat flour; 4 cups barley flour; 2 cups soy flour; ½ cup millet flour; ¼ cup rye flour",
  "directions": "1. Place lentils in a small saucepan, cover with water and cook until soft. Drain and set aside to cool. In a small bowl, dissolve yeast in 1/2 cup warm water. Let stand until creamy, about 10 minutes. 2. Place the cooled lentils in a bowl and mash. Mix in olive oil, honey, salt and remaining 4 1/2 cups warm water. In a large bowl, mix together whole wheat flour, barley flour, soy flour, millet flour and rye flour. 3. Stir the yeast mixture into the lentil mixture. Beat in 2 cups of the flour mixture. Stir in the remaining flour mixture, 1 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour. 4. Deflate the dough and turn it out onto a lightly floured surface. Briefly knead the dough and divide into four equal pieces and form into loaves. Place the loaves into four lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 375 degrees F (190 degrees C). 5. Bake in preheated oven for about 1 hour, or until bottom of a loaf sounds hollow when tapped.",
  "prep": "45 mins",
  "cook": "1 hr 20 mins",
  "total": "4 hrs",
  "calories": "162"
},
{
  "url": "https://www.allrecipes.com/recipe/186731/jian-bing-chinese-crepes/",
  "name": "Jian Bing (Chinese Crêpes)",
  "rating": "4.6",
  "ratingcount": "7",
  "ingredients": "2 tablespoons millet flour; 2 tablespoons soy milk; ½ teaspoon vegetable oil; 1 teaspoon water, if needed; 1 tablespoon Chinese black bean sauce; 1 teaspoon water; ½ teaspoon Asian chile pepper sauce, or to taste; 1 teaspoon water; cooking spray; 1  egg, beaten; ½  green onion, sliced; 1 tablespoon torn fresh cilantro leaves; 2  whole crackers",
  "directions": "1. Whisk millet flour, soy milk, and vegetable oil together in a bowl to make a batter with the consistency of heavy cream. Add a teaspoon of water to thin the batter, if necessary. 2. Mash black bean sauce in a small bowl with 1 teaspoon water to make it easy to spread. Mix hot chili sauce with 1 teaspoon of water in a separate small bowl. Set both sauces aside. 3. Spray a large skillet generously with cooking spray, and heat over medium-low heat. Pour batter into the skillet, and spread evenly to make a thin crêpe; cook until firm, about 1 to 2 minutes. Pour egg evenly over crêpe; cook an additional 1 to 2 minutes, until egg is set. Sprinkle crêpe with green onion slices and cilantro leaves, pressing them firmly into cooked egg. 4. Flip crêpe and spread with bean sauce and chili sauce. Place crackers in the center of crêpe, leaving about 1/4 inch of space between the two crackers. Flip top third of crêpe down over crackers; flip the bottom third up, and then fold the crêpe in half so the crackers are stacked on top of each other in a tidy package. Serve hot.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "20 mins",
  "calories": "220"
},
{
  "url": "https://www.allrecipes.com/recipe/228334/puffed-millet-squares/",
  "name": "Puffed Millet Squares",
  "rating": "4.9",
  "ratingcount": "8",
  "ingredients": "cooking spray; ½ cup natural peanut butter; ½ cup honey; ½ teaspoon salt; 1 teaspoon vanilla extract; 3 ½ cups puffed millet cereal; ½ cup chopped dried mixed fruit",
  "directions": "1. Grease an 8-inch square pan with cooking spray. 2. Combine peanut butter, honey, and salt in a large saucepan; mix to combine and bring to a boil. Stir in vanilla. 3. Remove from the heat and stir in millet and dried fruit. Press mixture into the prepared pan. Refrigerate until chilled, about 1 hour. 4. Cut into 16 squares.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "1 hr 15 mins",
  "calories": "114"
},
{
  "url": "https://www.allrecipes.com/recipe/242430/ultimate-gluten-free-cornbread/",
  "name": "Ultimate Gluten-Free Cornbread",
  "rating": "4.6",
  "ratingcount": "21",
  "ingredients": "3  eggs; 1 ½ cups milk; ½ cup butter, melted; 1 tablespoon white vinegar; 2 cups cornmeal; 1 cup millet flour; ¼ cup white sugar; 1 tablespoon baking powder; 1 teaspoon salt",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking dish. 2. Beat eggs in a bowl; stir in milk, butter, and vinegar. Stir cornmeal, millet flour, sugar, baking powder, and salt into egg mixture until combined; spread batter into prepared baking dish. 3. Bake in preheated oven until golden brown, 16 to 20 minutes. Cool on wire rack for 10 minutes.",
  "prep": "10 mins",
  "cook": "16 mins",
  "total": "36 mins",
  "calories": "233"
},
{
  "url": "https://www.allrecipes.com/recipe/17780/hearty-multigrain-bread/",
  "name": "Hearty Multigrain Bread",
  "rating": "4.5",
  "ratingcount": "154",
  "ingredients": "¾ cup water; 1 tablespoon butter, softened; 1 teaspoon salt; 2 tablespoons sunflower seeds; 1 tablespoon sesame seeds; 1 tablespoon flax seeds; 1 tablespoon millet; 1 tablespoon quinoa; 1 cup bread flour; 1 cup whole wheat flour; 1 tablespoon dry milk powder; ¼ cup packed brown sugar; 1 ½ tablespoons bread machine yeast",
  "directions": "1. Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select cycle; press Start.",
  "prep": "5 mins",
  "cook": "2 hrs 55 mins",
  "total": "3 hrs",
  "calories": "124"
},
{
  "url": "https://www.allrecipes.com/recipe/228333/cuban-inspired-millet/",
  "name": "Cuban Inspired Millet",
  "rating": "4.6",
  "ratingcount": "14",
  "ingredients": "1  carrot, chopped; 2 cloves garlic, crushed; 1 tablespoon olive oil; 1  onion, chopped; 1  green bell pepper, chopped; 1 cup millet; 2 cups vegetable broth; salt and ground black pepper to taste; ¼ cup chopped fresh cilantro, or more to taste",
  "directions": "1. Blend carrot and garlic in a food processor until finely chopped. 2. Heat olive oil in a pot over medium heat; cook and stir carrot mixture, onion, and green bell pepper until softened, about 10 minutes. Add millet; stir until fragrant and toasted, about 3 minutes. 3. Pour vegetable broth into millet mixture; season with salt and black pepper. Reduce heat and simmer until all the broth is absorbed and millet is tender, about 20 minutes. Stir in cilantro.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "130"
},
{
  "url": "https://www.allrecipes.com/recipe/77360/millet-muffins/",
  "name": "Millet Muffins",
  "rating": "4.6",
  "ratingcount": "124",
  "ingredients": "2 ¼ cups whole wheat flour; ⅓ cup millet; 1 teaspoon baking powder; 1 teaspoon baking soda; 1 teaspoon salt; 1 cup buttermilk; 1  egg, lightly beaten; ½ cup vegetable oil; ½ cup honey",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Grease 16 muffin cups. 2. In a large bowl, mix the whole wheat flour, millet flour, baking powder, baking soda, and salt. In a separate bowl, mix the buttermilk, egg, vegetable oil, and honey. Stir buttermilk mixture into the flour mixture just until evenly moist. Transfer batter to the prepared muffin cups. 3. Bake 15 minutes in the preheated oven, or until a toothpick inserted in the center of a muffin comes out clean.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "176"
},
{
  "url": "https://www.allrecipes.com/recipe/23287/alisons-gluten-free-bread/",
  "name": "Alison's Gluten-Free Bread",
  "rating": "4.5",
  "ratingcount": "111",
  "ingredients": "1  egg; ⅓ cup egg whites; 1 tablespoon apple cider vinegar; ¼ cup canola oil; ¼ cup honey; 1 ½ cups warm skim milk; 1 teaspoon salt; 1 tablespoon xanthan gum; ½ cup tapioca flour; ¼ cup garbanzo bean flour; ¼ cup millet flour; 1 cup white rice flour; 1 cup brown rice flour; 1 tablespoon active dry yeast",
  "directions": "1. Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select cycle; press Start. Five minutes into the cycle, check the consistency of the dough. Add additional rice flour or liquid if necessary. 2. When bread is finished, let cool for 10 to 15 minutes before removing from pan.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "225"
},
{
  "url": "https://www.allrecipes.com/recipe/239612/gluten-free-chicken-and-sausage-gumbo/",
  "name": "Gluten-Free Chicken and Sausage Gumbo",
  "rating": "4.5",
  "ratingcount": "6",
  "ingredients": "1 (3 pound) whole chicken, or more to taste; 6 cups water, or more as needed; 1 cup millet flour; ¾ cup vegetable oil; 1  white onion, chopped; 1  green bell pepper, chopped; 3 cloves garlic, chopped; 1 pound andouille sausage, cut into bite-size pieces; 3 stalks celery, chopped; ½ cup chopped green onion; 3  bay leaves; 2 teaspoons salt; ¼ teaspoon dried thyme; ¼ teaspoon cayenne pepper; 1 tablespoon file powder",
  "directions": "1. Place chicken in a 6- to 8-quart stockpot and pour in enough water to completely cover the chicken; bring to a boil, reduce heat to medium, and simmer until chicken is no longer pink at the bone and juices run clear, about 1 hour. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). 2. Remove chicken from water and place on a work surface to cool, retaining the resulting chicken stock in the stockpot. 3. Cook and stir millet flour and vegetable oil together in a large frying pan or skillet over medium heat until roux is smooth and slightly darker than peanut butter, about 10 minutes. 4. Mix onion, green bell pepper, and garlic into roux; cook and stir over low heat until fragrant, 2 to 3 minutes. Transfer onion-roux mixture to stockpot with chicken stock. 5. Bring chicken stock mixture to a simmer over medium heat; add andouille sausage, celery, green onion, bay leaves, salt, thyme, and cayenne pepper and simmer for 1 hour. 6. Remove skin from cooked chicken and discard. Pull meat from the bones and chop into bite-size pieces; discard carcass. Add chicken meat to broth mixture and simmer until chicken is heated through, 5 to 10 minutes. 7. Remove stockpot from heat, stir file powder into gumbo, and remove and discard bay leaves.",
  "prep": "20 mins",
  "cook": "2 hrs 20 mins",
  "total": "2 hrs 40 mins",
  "calories": "438"
},
{
  "url": "https://www.allrecipes.com/recipe/75785/millet-stuffed-peppers/",
  "name": "Millet-Stuffed Peppers",
  "rating": "4.3",
  "ratingcount": "28",
  "ingredients": "1 cup millet; 4 cups water; 4 cubes  vegetable bouillon; 5 medium bell peppers; 3 medium tomatoes, chopped; 1 (15 ounce) can black beans, drained",
  "directions": "1. Combine the millet, water and vegetable bouillon in a saucepan, and bring to a boil. Reduce heat to low, cover, and simmer for 15 minutes, or until the water is absorbed. 2. Slice the tops off of the peppers, and remove the seeds and cores. Set aside. When the millet is done, stir in the tomatoes and black beans. Spoon into the peppers until filled. Place the peppers into a glass baking dish, and cover with plastic wrap. 3. Cook in the microwave for 10 minutes, or until peppers are tender. Turn peppers every 2 to 3 minutes to ensure even cooking.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "189"
},
{
  "url": "https://www.allrecipes.com/recipe/228332/millet-pie/",
  "name": "Millet Pie",
  "rating": "4.5",
  "ratingcount": "6",
  "ingredients": "1 cup water; 1 cup oats; 1 ½ cups water; 1 cup millet; ½ cup diced onion; ½ cup diced carrot; ½ cup diced celery; ½ cup diced potato; ¼ cup safflower oil; ¼ cup tamari sauce; 1 teaspoon ground allspice; ¼ teaspoon ground nutmeg; 4  whole cloves; salt and ground black pepper to taste; 1 recipe pastry for a 9-inch double crust pie; 1  egg, beaten (Optional)",
  "directions": "1. Bring 1 cup water and oats to a boil in a saucepan; reduce heat and simmer until water is absorbed, 10 minutes. Bring 1 1/2 cups water and millet to a boil in a separate saucepan; reduce heat and simmer until water is absorbed and millet is tender, 20 minutes. 2. Preheat oven to 350 degrees F (175 degrees C). 3. Combine oats, millet, onion, carrot, celery, potato, safflower oil, tamari, allspice, nutmeg, cloves, salt, and black pepper together in a large bowl; mix well. 4. Press 1 pie crust pastry into a 9-inch pie pan. Pour filling into pie crust. Top with second pie crust pastry; pinch edges together. Pierce a few areas of the top crust to allow pie to ventilate during baking. Brush top crust with beaten egg. 5. Bake pie in the preheated oven until crust is golden brown, about 40 minutes.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "340"
},
{
  "url": "https://www.allrecipes.com/recipe/217895/fluffy-gluten-free-cornbread/",
  "name": "Fluffy Gluten Free Cornbread",
  "rating": "4.2",
  "ratingcount": "41",
  "ingredients": "2  eggs, lightly beaten; 1 ½ cups lukewarm water; ¼ cup vegetable oil; 1 ½ cups fine cornmeal; 1 cup millet flour; 1 cup rice flour; ¼ cup white sugar; 1 tablespoon baking powder; 1 teaspoon salt",
  "directions": "1. Preheat an oven to 400 degrees F (200 degrees C). Grease a 9x9 inch baking pan. 2. Whisk together the eggs, water, and vegetable oil in a bowl until evenly blended; set aside. Stir together the cornmeal, millet flour, rice flour, sugar, baking powder and salt in a separate large bowl, and make a well in the center. Pour the liquid mixture into the well and stir just until combined. 3. Pour the batter into the prepared baking pan and bake in the preheated oven until golden and the top springs back when lightly pressed, about 20 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "224"
},
{
  "url": "https://www.allrecipes.com/recipe/238169/microwave-gluten-free-fluffy-sponge-cake/",
  "name": "Microwave Gluten-Free Fluffy Sponge Cake",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "2  eggs; 2 tablespoons white sugar; 1 tablespoon baking powder; 1 tablespoon quinoa flour; 1 tablespoon sorghum flour; 1 tablespoon millet flour; 1 tablespoon olive oil; 1 tablespoon peanut butter, or more to taste; 1 ½ teaspoons butter; 1 ½ teaspoons ground cinnamon; ½ teaspoon vanilla extract",
  "directions": "1. Generously butter the inside of a large, microwave-safe cereal bowl. Whisk eggs, sugar, baking powder, quinoa flour, sorghum flour, millet flour, olive oil, peanut butter, butter, cinnamon, and vanilla extract together in the bowl until flour is evenly mixed into the batter. 2. Cook in microwave until cake is cooked through, 1 1/2 to 2 minutes.",
  "prep": "10 mins",
  "cook": "2 mins",
  "total": "12 mins",
  "calories": "309"
},
{
  "url": "https://www.allrecipes.com/recipe/272852/nut-and-date-millet-porridge/",
  "name": "Nut and Date Millet Porridge",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "½ cup hulled millet; 2 tablespoons slivered almonds; 2 tablespoons pumpkin seeds; 2 tablespoons shredded unsweetened coconut; 1 tablespoon flax seeds; 2 cups unsweetened almond milk, divided; 3  Medjool dates, pitted and diced; ½ teaspoon ground cinnamon; ¼ teaspoon ground nutmeg",
  "directions": "1. Pulse millet in a blender or food processor until it resembles coarse ground coffee. Set aside. 2. Heat a nonstick saucepan over medium-high heat. Add almonds and toast until golden brown, stirring occasionally, about 2 minutes. Add pepitas and continue to stir and toast until golden brown, about 3 minutes. Stir in coconut and flax seeds and toast until golden, about 5 minutes more. Pour mixture into a bowl and set aside. 3. Pour ground millet into the same pan. Toast until fragrant, about 3 minutes. Pour in 1 1/2 cups almond milk, stirring to ensure there are no lumps. Bring to a boil; add dates. Reduce heat to medium and simmer, stirring occasionally. 4. Add 2 tablespoons of the toasted seed mixture to the porridge. Sprinkle in cinnamon and nutmeg. Stir well. Continue simmering until thickened, 6 to 10 minutes. 5. Pour porridge into two bowls. Divide remaining seed mixture and 1/2 cup almond milk between bowls and serve.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "412"
},
{
  "url": "https://www.allrecipes.com/recipe/136471/gluten-free-chocolate-cupcakes/",
  "name": "Gluten Free Chocolate Cupcakes",
  "rating": "4.1",
  "ratingcount": "20",
  "ingredients": "1 ½ cups white rice flour; ¾ cup millet flour; ½ cup unsweetened cocoa powder; 1 teaspoon salt; 1 teaspoon baking soda; 1 tablespoon baking powder; 1 teaspoon xanthan gum; 4  eggs; 1 ¼ cups white sugar; ⅔ cup sour cream; 1 cup milk; 2 teaspoons vanilla extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease two 12 cup muffin pans or line with paper baking cups. 2. In a medium bowl, stir together the rice flour, millet flour, cocoa, salt, baking soda, baking powder and xanathan gum. In a separate large bowl, beat the eggs, sugar, sour cream, milk and vanilla. Stir in the dry ingredients until smooth. Spoon the batter into the prepared cups, dividing evenly. 3. Bake in the preheated oven until the tops spring back when lightly pressed, 20 to 25 minutes. Cool in the pan set over a wire rack. When cool, arrange the cupcakes on a serving platter.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "130"
},
{
  "url": "https://www.allrecipes.com/recipe/223019/millet-and-beef-stuffed-peppers/",
  "name": "Millet and Beef Stuffed Peppers",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "½ cup millet; 2 cups water; 2 cubes  vegetable bouillon; 2 tablespoons olive oil; 1  onion, chopped; 2  garlic cloves, crushed; ½ pound ground beef; 3 tablespoons tomato paste; 1 teaspoon paprika; 1 teaspoon cumin; ¼ teaspoon cayenne pepper; ¼ teaspoon ground black pepper; 1 tablespoon chopped fresh cilantro; ¼ cup chopped feta cheese; 4 large red bell peppers, tops removed and set aside and seeds removed",
  "directions": "1. Preheat an oven to 450 degrees F (230 degrees C). Grease a baking dish. 2. Combine millet, water, and vegetable bouillon in a saucepan; bring to a boil. Reduce heat to low, cover, and simmer until water is absorbed, about 15 minutes. 3. Heat olive oil in a skillet over medium heat; cook and stir onion and garlic until onion is tender, 8 to 10 minutes. Add ground beef and cook until beef is crumbly and browned, 8 to 10 minutes. Stir in tomato paste, paprika, cumin, cayenne pepper, and black pepper; stir and simmer to combine flavors, about 5 minutes. 4. Mix cooked millet, cilantro, and feta cheese into ground beef mixture. Spoon mixture into red bell peppers; place in prepared baking dish. 5. Bake in the preheated oven until peppers are slightly tender, 15 to 20 minutes. Place the tops back on the peppers; bake until peppers are tender, 10 to 15 more minutes.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "374"
},
{
  "url": "https://www.allrecipes.com/recipe/234223/baked-grains-pilaf/",
  "name": "Baked Grains Pilaf",
  "rating": "4.8",
  "ratingcount": "8",
  "ingredients": "1 tablespoon vegetable oil; 1  onion, chopped; 3 stalks celery, chopped; ½ cup chopped bell pepper; ½ cup corn kernels; ¾ cup millet; ¾ cup quinoa; 1 teaspoon salt; 3 cups low-sodium chicken stock",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Heat oil in a skillet over medium heat; cook and stir onion, celery, bell pepper, and corn in the hot oil until softened, about 10 minutes. 3. Mix onion mixture, millet, quinoa, and salt together in an 8x8-inch casserole dish; pour in chicken stock. Cover dish with aluminum foil. 4. Bake in the preheated oven until grains are tender and have absorbed all the liquid, about 30 minutes.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "176"
},
{
  "url": "https://www.allrecipes.com/recipe/231468/cornmeal-millet-poppy-seed-muffins/",
  "name": "Cornmeal Millet Poppy Seed Muffins",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "¾ cup millet; 1 ½ cups all-purpose flour; ½ cup yellow cornmeal; 1 ½ tablespoons poppy seeds; 3 tablespoons white sugar (Optional); 1 tablespoon grated lemon rind; 1 ¼ teaspoons baking powder; ½ teaspoon baking soda; ¼ teaspoon salt; 1 cup milk; ¼ cup honey; ¼ cup canola oil; 1  egg; ¾ teaspoon vanilla extract; 1 tablespoon white sugar, or as needed (Optional)",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Spread millet on a baking sheet. 3. Bake in the preheated oven, stirring often, until toasted and fragrant, about 10 minutes. Remove from oven and cool, about 5 minutes. 4. Increase oven temperature to 400 degrees F (200 degrees C). Grease 12 muffin cups. 5. Mix millet, flour, cornmeal, poppy seeds, 3 tablespoons sugar, lemon rind, baking powder, baking soda, and salt together in a bowl. 6. Whisk milk, honey, canola oil, egg, and vanilla extract together in a separate bowl. Stir milk mixture into flour mixture until just combined. Pour batter into the prepared muffin cups; sprinkle 1 tablespoon sugar over batter. 7. Bake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean and tops are golden, 12 to 15 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "227"
},
{
  "url": "https://www.allrecipes.com/recipe/259764/best-whole-grain-gluten-free-bread-for-a-bread-machine/",
  "name": "Best Whole Grain Gluten-Free Bread for a Bread Machine",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "1 cup cornstarch; ½ cup millet flour; ½ cup tapioca starch; ¼ cup sweet rice flour; ¼ cup teff flour; ¼ cup ground flax; 2 tablespoons psyllium husk; 2 ½ teaspoons guar gum; 2 large eggs; 1 ⅔ cups warm water; 3 tablespoons canola oil; 1 teaspoon white vinegar; 2 ¾ teaspoons active dry yeast; 1 ½ teaspoons salt; ½ cup milk powder; 3 tablespoons white sugar",
  "directions": "1. Mix cornstarch, millet flour, tapioca flour, rice flour, teff flour, ground flax, psyllium husk, and guar gum in a bowl. 2. Place eggs, warm water, canola oil, vinegar, sugar, yeast, cornstarch mixture, salt, and milk in a bread machine pan in the order listed, or in the order listed by the manufacturer. Stir gently with a wooden spoon to combine yeast with the rest of the ingredients. 3. Run \"rapid bake\" cycle for 2 hours. Select \"dark\" crust setting; bake for 50 minutes.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "3 hrs",
  "calories": "238"
},
{
  "url": "https://www.allrecipes.com/recipe/259359/bread-machine-ezekiel-bread/",
  "name": "Bread Machine Ezekiel Bread",
  "rating": "3.7",
  "ratingcount": "3",
  "ingredients": "1 tablespoon dry black beans; 1 tablespoon dry lentils; 1 tablespoon dry kidney beans; 1 tablespoon barley; ½ cup warm milk; ½ cup warm water; 1 large egg; 2 tablespoons olive oil; 1 tablespoon honey; 1 cup unbleached all-purpose flour; 1 cup whole wheat flour; ¼ cup millet flour; ¼ cup rye flour; ¼ cup cracked wheat; 2 tablespoons wheat germ; 1 teaspoon salt; 2 teaspoons bread machine yeast",
  "directions": "1. Grind black beans, lentils, kidney beans, and barley in a coffee grinder until fine. 2. Place warm milk, warm water, egg, oil, honey, all-purpose flour, whole wheat flour, millet flour, rye flour, cracked wheat, ground bean mixture, wheat germ, salt, and yeast into a bread machine in the order listed. Run Dough cycle. Remove dough from the machine after the cycle is done, about 90 minutes. 3. Roll dough out onto a pastry cloth, then form into a loaf. Place loaf into a greased pan; cover with a damp cloth and let rise until doubled in volume, about 40 minutes. 4. Preheat the oven to 375 degrees F (190 degrees C). 5. Bake in the preheated oven for 10 minutes. Lower the oven temperature to 350 degrees F (175 degrees C) and continue to bake until loaf is browned, 30 to 35 minutes more. Cool in the pan for 10 minutes, then transfer to a wire rack and let cool completely before slicing.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "3 hrs 15 mins",
  "calories": "192"
},
{
  "url": "https://www.allrecipes.com/recipe/7047/ezekiel-bread-i/",
  "name": "Ezekiel Bread",
  "rating": "4.2",
  "ratingcount": "46",
  "ingredients": "4 cups warm water (110 degrees F/45 degrees C); 1 cup honey; ½ cup olive oil; 2 (.25 ounce) packages active dry yeast; 2 ½ cups wheat berries; 1 ½ cups spelt flour; ½ cup barley; ½ cup millet; ¼ cup dry green lentils; 2 tablespoons dry great Northern beans; 2 tablespoons dry kidney beans; 2 tablespoons dried pinto beans; 2 tablespoons salt, or to taste",
  "directions": "1. Mix water, honey, olive oil, and yeast in a large bowl. Let sit for 3 to 5 minutes. 2. Meanwhile, stir together wheat berries, spelt flour, barley, millet, lentils, great northern beans, kidney beans, and pinto beans together until well mixed. Grind in a flour mill. 3. Add fresh milled flour mixture and salt to yeast mixture; stir until well mixed, about 10 minutes. The dough will be loose. 4. Pour dough into two greased 9x5-inch loaf pans. 5. Let rise in a warm place until dough has reached the top of the pan, about 1 hour. 6. Preheat the oven to 350 degrees F (175 degrees C). 7. Bake in the preheated oven until loaves are golden brown, 45 to 50 minutes.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "2 hrs 5 mins",
  "calories": "221"
},
{
  "url": "https://www.allrecipes.com/recipe/244874/vegetable-birdseed-pilaf/",
  "name": "Vegetable Birdseed Pilaf",
  "rating": "4.3",
  "ratingcount": "6",
  "ingredients": "1 ¼ cups millet, rinsed and drained; 2 ½ cups vegetable broth; 1 tablespoon olive oil; 1  onion, chopped; 6 cloves garlic, minced; 1 (10 ounce) package frozen chopped spinach; 1 cup frozen peas; ¾ cup white wine; 1 teaspoon minced fresh rosemary; 4  plum tomatoes, chopped; salt and ground black pepper to taste; ½ cup grated Parmesan cheese",
  "directions": "1. Cook and stir millet in a large saucepan over medium heat until fragrant and toasted, 5 to 8 minutes. 2. Bring vegetable broth to a boil in a large saucepan; add millet and return to a boil. Reduce heat to medium-low, cover saucepan, and simmer until liquid is absorbed, 18 to 22 minutes. 3. Heat olive oil in a skillet over medium heat; cook and stir onion and garlic until onion is translucent, 5 to 10 minutes. 4. Stir onion mixture, spinach, and peas into millet; add wine and rosemary and stir. Increase heat to medium, cover saucepan, and cook, stirring occasionally, for 7 to 10 minutes. Add tomatoes, salt, and pepper; return cover and cook until tomatoes soften, 2 to 3 minutes. Remove saucepan from heat and stir Parmesan cheese into millet mixture.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/278347/millet-breakfast-porridge-with-fruit/",
  "name": "Millet Breakfast Porridge with Fruit",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "4 ¼ cups hot water; 1 cup millet; ¾ cup milk; ¾ cup chopped dates; ½ cup dried blueberries, or more to taste; 1 teaspoon vanilla extract",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine hot water, millet, milk, dates, blueberries, and vanilla extract in a 9x13-inch glass or ceramic baking dish. Spread evenly. 3. Bake in the preheated oven for 30 minutes. Stir evenly, and continue to bake until millet is thick and no liquid remains, about 30 minutes more. 4. Cool slightly before serving.",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 5 mins",
  "calories": "145"
}]