[{
  "url": "https://www.allrecipes.com/recipe/220810/spinach-stuffed-portobello-mushrooms/",
  "name": "Spinach Stuffed Portobello Mushrooms",
  "rating": "4.6",
  "ratingcount": "270",
  "ingredients": "4 large portobello mushroom caps, stems and gills removed; 1 tablespoon reduced-fat Italian salad dressing; 1  egg; 1 clove garlic, minced; salt and ground black pepper to taste; 1 (10 ounce) bag fresh spinach, chopped; ¼ cup chopped pepperoni; ¼ cup grated Parmesan cheese; ¼ cup shredded mozzarella cheese, divided; ¼ cup seasoned bread crumbs, divided",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Brush both sides of portobello mushrooms with Italian dressing. Arrange mushroom on a baking sheet, gill-sides up. 3. Bake in the preheated oven until tender, about 12 minutes. Drain any juice that has accumulated in mushrooms. 4. Beat egg, garlic, salt, and black pepper together in a large bowl. 5. Stir spinach, pepperoni, Parmesan cheese, 3 tablespoons mozzarella cheese, and 3 tablespoons bread crumbs into eggs until evenly mixed. 6. Divide spinach mixture over mushroom caps; sprinkle mushrooms with remaining 1 tablespoon mozzarella cheese and 1 tablespoon bread crumbs. 7. Return mushrooms to the oven; bake until topping is golden brown and cheese is melted, about 10 minutes more.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "168"
},
{
  "url": "https://www.allrecipes.com/recipe/159391/easy-garlic-escargots/",
  "name": "Easy Garlic Escargots",
  "rating": "4.6",
  "ratingcount": "52",
  "ingredients": "1 (7 ounce) can escargots, drained; 6 tablespoons butter; 1 clove garlic, minced; 20  mushrooms, stems removed; ⅓ cup white wine; ⅓ cup cream; 1 tablespoon all-purpose flour; ¼ teaspoon dried tarragon; 1 pinch freshly ground black pepper, or to taste; ¼ cup grated Parmesan cheese",
  "directions": "1. Place escargots in a small bowl and cover with cold water. Let sit for 5 minutes to remove any canned flavor they may have. 2. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease an 8x8-inch baking dish. 3. Drain escargots and pat dry with a paper towel. 4. Melt butter with garlic in a large skillet over medium-high heat. Add escargots and mushroom caps; cook and stir until mushroom caps begin to soften, about 5 minutes. 5. Whisk together wine, cream, flour, tarragon, and pepper in a small bowl until well combined. Pour into the skillet and bring to a boil. Cook, stirring occasionally, until sauce thickens, about 10 minutes. Remove from the heat. 6. Place mushroom caps into the prepared baking dish, with the tops facing down. Spoon an escargot into each mushroom cap. Pour sauce from the skillet over mushroom caps, then sprinkle grated Parmesan cheese over top. 7. Bake in the preheated oven until cheese has turned golden brown, 10 to 15 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "405"
},
{
  "url": "https://www.allrecipes.com/recipe/58112/mushrooms-with-a-soy-sauce-glaze/",
  "name": "Mushrooms with a Soy Sauce Glaze",
  "rating": "4.8",
  "ratingcount": "958",
  "ingredients": "2 tablespoons butter; 1 (8 ounce) package sliced white mushrooms; 2 cloves garlic, minced; 2 teaspoons soy sauce; ground black pepper to taste",
  "directions": "1. Melt butter in a skillet over medium heat. Add mushrooms; cook and stir until mushrooms have softened and released their liquid, about 5 minutes. 2. Stir in garlic; continue to cook and stir for 1 minute. Pour in soy sauce; cook until liquid has evaporated, about 4 minutes. 3. Season with pepper. 4. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "135"
},
{
  "url": "https://www.allrecipes.com/recipe/273598/moo-shu-chicken/",
  "name": "Moo Shu Chicken",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "6 tablespoons cold water, divided; 3 teaspoons sesame oil, divided; 2 teaspoons cornstarch; 1 pound chicken breast tenderloins, cut into thin strips; 2 tablespoons hoisin sauce; 2 tablespoons oyster sauce; 2 teaspoons soy sauce; 2 teaspoons vegetable oil, divided; 2 large eggs, beaten; 3 cups shredded cabbage or coleslaw mix; 1 (4 ounce) can sliced shiitake mushrooms, drained; 2 cloves garlic, minced; 1 tablespoon sherry; 3  green onions, chopped",
  "directions": "1. Whisk 2 tablespoons water, 2 teaspoons sesame oil, and cornstarch together in a large bowl. Add chicken, toss to coat, and set aside. 2. Combine remaining 4 tablespoons water and 1 teaspoon sesame oil in a separate bowl. Whisk in hoisin sauce, oyster sauce, and soy sauce until well combined; set sauce aside. 3. Heat 1 teaspoon oil in a skillet over medium heat. Add eggs and cook for 3 minutes; flip and cook until firm and set, about 3 minutes more. Transfer to a cutting board and slice into thin strips. 4. Add marinated chicken to the skillet and cook over medium-high heat for 6 minutes. Flip and cook until golden brown on the outside and the juices run clear, about 6 minutes more; transfer to a plate. 5. Heat remaining 1 teaspoon oil in the skillet over medium-high heat. Add cabbage, shiitake mushrooms, garlic, and sherry; cook until cabbage starts to wilt, about 2 minutes. Add chicken, sliced egg, and reserved sauce to the skillet; cook, stirring occasionally, until sauce has thickened, about 5 minutes. Toss in green onions and serve immediately.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "319"
},
{
  "url": "https://www.allrecipes.com/recipe/8820/cream-of-mushroom-chicken/",
  "name": "Cream of Mushroom Chicken",
  "rating": "4.4",
  "ratingcount": "154",
  "ingredients": "2 tablespoons butter; 1 (12 fluid ounce) can evaporated milk; 1 (10.5 ounce) can condensed cream of mushroom soup; 1 ¼ cups water, or as needed; 1  onion, chopped; salt and pepper to taste; 2 pounds skinless, boneless chicken breast halves, cubed; 1 (6 ounce) can sliced mushrooms, drained",
  "directions": "1. Melt butter in a large saucepan over medium heat; stir in evaporated milk, condensed soup, and water. Add onion, salt, and pepper; bring to a boil. Stir in chicken and simmer until chicken is cooked through, about 15 minutes. 2. Stir in sliced mushrooms and simmer, stirring often, for 5 minutes more.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "251"
},
{
  "url": "https://www.allrecipes.com/recipe/18874/real-italian-calzones/",
  "name": "Real Italian Calzones",
  "rating": "4.5",
  "ratingcount": "889",
  "ingredients": "1 (.25 ounce) package active dry yeast; 1 cup warm water; 1 tablespoon olive oil; 1 teaspoon white sugar; 1 teaspoon salt; 2 ½ cups all-purpose flour, plus more for dusting; 1 teaspoon olive oil; 1 large egg, beaten; 1 ½ cups shredded Cheddar cheese; ½ cup ricotta cheese; ½ cup diced pepperoni; ½ cup sliced fresh mushrooms; 1 tablespoon dried basil leaves",
  "directions": "1. Make dough: Dissolve yeast in warm water in a mixing bowl; let sit until foamy, about 5 minutes. Add 1 tablespoon oil, sugar, and salt; mix in 1 cup flour until smooth. Gradually stir in remaining flour until dough is smooth and workable. 2. Turn dough out onto a lightly floured surface. Knead dough until it is elastic, about 5 minutes. Place 1 teaspoon olive oil in a large bowl; lay dough in the bowl and flip to coat with oil. Cover and let rise until almost doubled in size, about 40 minutes. 3. Make filling: Meanwhile, combine Cheddar cheese, ricotta cheese, pepperoni, mushrooms, and basil leaves in a medium bowl. Mix well, cover, and refrigerate to chill. 4. Preheat the oven to 375 degrees F (190 degrees C). Grease a baking sheet. 5. Punch down dough; divide into 2 equal pieces. Roll each piece out on a lightly floured surface into 1/8-inch-thick circles. Fill each circle with 1/2 of the cheese and meat filling; fold dough over filling to make a semicircle. Press edges down with the tines of a fork to seal. Brush the top of each calzone with beaten egg and place on the prepared baking sheet. 6. Bake in the preheated oven until golden brown, about 30 minutes. Serve hot.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "1 hr 35 mins",
  "calories": "335"
},
{
  "url": "https://www.allrecipes.com/recipe/280696/air-fryer-fried-mushrooms/",
  "name": "Air Fryer Fried Mushrooms",
  "rating": "4.0",
  "ratingcount": "8",
  "ingredients": "3 large eggs; 1 cup all-purpose flour; ½ cup plain bread crumbs; ½ cup panko bread crumbs; ½ tablespoon kosher salt; 1 teaspoon onion powder; 1 teaspoon garlic powder; 1 teaspoon ground black pepper; 1 teaspoon paprika; 1 teaspoon seafood seasoning (such as Old Bay®); 1 pound small cremini mushrooms; nonstick cooking spray",
  "directions": "1. Preheat the air fryer to 400 degrees F (200 degrees C). 2. Beat eggs in a bowl. Combine flour, plain bread crumbs, panko bread crumbs, kosher salt, onion powder, garlic powder, pepper, paprika, and seafood seasoning in a separate bowl. 3. Dip mushrooms in beaten eggs, then in seasoned crumb mixture. Dip back into eggs and into crumb mixture again. Place on a plate. 4. Place a batch of mushrooms in the air fryer basket, making sure none are overlapping. Spray with nonstick cooking spray. Cook in the preheated air fryer for 6 minutes. Shake the basket and spray any chalky spots with nonstick cooking spray. Cook for 6 minutes more. Repeat with remaining mushrooms.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "144"
},
{
  "url": "https://www.allrecipes.com/recipe/258468/beef-stroganoff-for-instant-pot/",
  "name": "Beef Stroganoff for Instant Pot",
  "rating": "4.5",
  "ratingcount": "955",
  "ingredients": "2 tablespoons canola oil; ½  onion, diced; 2 teaspoons salt, divided; 2 pounds beef stew meat, cut into 1-inch cubes; 1 teaspoon freshly ground black pepper; 3 cloves garlic, minced; ½ teaspoon dried thyme; 2 tablespoons soy sauce; 3 cups chopped mushrooms; 2 tablespoons all-purpose flour; 3 cups chicken broth; 1 (16 ounce) package wide egg noodles; ¾ cup sour cream, or to taste",
  "directions": "1. Turn on a multi-functional pressure cooker (such as an Instant Pot) and select Sauté function. Heat oil for 1 minute. 2. Add onion and 1/2 teaspoon salt to pot; cook and stir until onion begins to soften, 3 to 4 minutes. 3. Sprinkle beef with 1 teaspoon salt and the pepper. Add to the pot. Cook and stir until beef is evenly browned, about 2 minutes. 4. Add garlic and thyme; cook until fragrant, about 30 seconds. 5. Pour in soy sauce. Stir mushrooms into the pot. Stir in flour until incorporated. Stir in chicken broth and remaining 1/2 teaspoon salt. 6. Close and lock the lid. Set to high pressure according to manufacturer's instructions for 10 minutes. Allow 10 to 15 minutes for pressure to build. 7. Release pressure carefully using the quick-release method. 8. Open pot; stir in egg noodles. Close and lock the lid. Set to high pressure according to manufacturer's instructions for 5 minutes. 9. Release pressure naturally for 5 minutes according to manufacturer's instruction. Release remaining pressure using the quick-release method. 10. Open pressure cooker; stir in sour cream.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "536"
},
{
  "url": "https://www.allrecipes.com/recipe/158518/prime-rib-soup/",
  "name": "Prime Rib Soup",
  "rating": "4.5",
  "ratingcount": "96",
  "ingredients": "4  beef ribs, trimmed from a cooked prime rib roast; 2 cups beef stock; 1  potato, peeled and cut into 3/4 inch pieces; 1 (8 ounce) package sliced fresh mushrooms; 1 teaspoon salt; 1 teaspoon black pepper; ¼ cup chopped fresh chives",
  "directions": "1. Gather all ingredients. 2. Place ribs in a large pot and cover with water. Bring to a boil; reduce heat to medium-low, cover, and simmer until the meat is falling from the bones, about 2 hours. 3. Remove ribs and allow to cool. Trim the meat from the ribs and cut into bite-sized pieces; refrigerate. 4. Continue simmering broth until reduced to 1 cup; refrigerate until the fat congeals to the top. 5. Skim and discard congealed fat. 6. Pour broth into a saucepan along with meat trimmings, beef stock, potato, mushrooms, salt, and pepper. Bring to a boil; reduce heat to medium-low, cover, and simmer until potatoes are tender, about 20 minutes. Sprinkle with chives to serve.",
  "prep": "15 mins",
  "cook": "3 hrs",
  "total": "4 hrs 15 mins",
  "calories": "197"
},
{
  "url": "https://www.allrecipes.com/recipe/234667/chef-johns-creamy-mushroom-pasta/",
  "name": "Chef John's Creamy Mushroom Pasta",
  "rating": "4.7",
  "ratingcount": "305",
  "ingredients": "8 ounces fettuccine pasta; 2 tablespoons olive oil; ¾ pound fresh white mushrooms, sliced; ¼ pound fresh shiitake mushrooms, stemmed and sliced; salt and ground black pepper to taste; 2 cloves garlic, minced; 2 fluid ounces sherry; 1 cup chicken stock; 1 cup heavy whipping cream; 1 ½ teaspoons chopped fresh thyme; 1 ½ teaspoons chopped fresh chives; 1 ½ teaspoons chopped fresh tarragon; 9 tablespoons freshly shredded Parmigiano-Reggiano cheese, divided",
  "directions": "1. Fill a large pot with lightly salted water and bring to a rolling boil. Cook fettuccine at a boil until tender yet firm to the bite, about 8 minutes. Drain but do not rinse pasta; transfer to a large serving bowl and keep warm. 2. Heat olive oil in a large skillet over medium heat. Cook and stir white and shiitake mushrooms in hot oil with a pinch of salt until liquid from mushrooms evaporates and mushrooms are browned, about 10 minutes. 3. Stir garlic into mushrooms and cook for 1 minute; pour in sherry and cook until wine is nearly evaporated. Stir in chicken stock; season with salt and black pepper. Bring to a simmer, reduce heat, and cook until slightly thickened, about 5 minutes. 4. Pour cream into mushroom mixture, stir to combine, and simmer for 5 minutes. Mixture will foam and thicken slightly. 5. Stir thyme, chives, and tarragon into mushroom sauce and turn off heat; mix 1/2 cup Parmigiano-Reggiano cheese into sauce until cheese is melted. 6. Pour 1/2 of the mushroom sauce over pasta; toss to coat. Top with remaining mushroom sauce and 1 tablespoon Parmigiano-Reggiano cheese.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "375"
},
{
  "url": "https://www.allrecipes.com/recipe/231345/bacon-wrapped-venison-tenderloin-with-garlic-cream-sauce/",
  "name": "Bacon-Wrapped Venison Tenderloin with Garlic Cream Sauce",
  "rating": "4.8",
  "ratingcount": "121",
  "ingredients": "6 thick slices bacon; 2 (3/4 pound) venison tenderloin roasts; 2 teaspoons olive oil, divided; ¼ teaspoon onion powder, divided; kosher salt and ground black pepper to taste; 2 tablespoons butter; 1 (8 ounce) package sliced cremini mushrooms; 2 cloves garlic, chopped; 1 tablespoon chopped green onion, or more to taste; ½ cup heavy whipping cream, or more to taste",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Arrange bacon slices on a slotted baking pan. 2. Bake bacon in the preheated oven until partially cooked but still flexible, 6 to 8 minutes. 3. Brush venison tenderloins with olive oil and season with onion powder, salt, and black pepper. Place tenderloin roasts side by side and wrap them together in strips of partially cooked bacon. Place into a roasting pan. 4. Roast in the preheated oven until bacon is browned and an instant-read meat thermometer inserted into the thickest part of a tenderloin reads at least 145 degrees F (65 degrees C), about 1 hour. 5. Heat butter in a saucepan over medium heat. Add mushrooms and garlic; cook and stir until mushrooms are soft, 8 to 10 minutes. Stir in green onion. Stir in cream and cook, stirring often, until heated through. Serve sauce with tenderloins.",
  "prep": "15 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 25 mins",
  "calories": "310"
},
{
  "url": "https://www.allrecipes.com/recipe/234844/easy-sausage-stuffed-mushrooms/",
  "name": "Easy Sausage Stuffed Mushrooms",
  "rating": "4.4",
  "ratingcount": "60",
  "ingredients": "24 large mushrooms, stems removed, or more as needed; 1 pound bulk hot Italian sausage; 1  onion, diced; 4 ounces grated Parmesan cheese, divided; ¼ cup Italian bread crumbs; 1 teaspoon minced garlic; 1 teaspoon chopped fresh parsley",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Hollow out each mushroom cap, reserving the scrapings. 3. Heat a skillet over medium-high heat. Cook and stir sausage, onion, and reserved mushroom scrapings until sausage is browned and cooked through, 4 to 6 minutes. Drain and discard grease; return the sausage mixture to the skillet. 4. Stir 3 ounces Parmesan cheese, bread crumbs, garlic, and parsley into the sausage mixture. Cook and stir until heated through, 3 to 5 minutes. 5. Stuff each mushroom cap with the sausage mixture and place on a baking sheet. 6. Bake stuffed mushrooms in the preheated oven for 12 minutes. Sprinkle remaining 1 ounce Parmesan cheese over mushrooms and bake until mushrooms are cooked through and cheese is melted and bubbling, about 3 minutes.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "148"
},
{
  "url": "https://www.allrecipes.com/recipe/263037/instant-pot-best-beef-stew/",
  "name": "Instant Pot Best Beef Stew",
  "rating": "4.6",
  "ratingcount": "200",
  "ingredients": "1 tablespoon butter; 1 pound beef chuck, cut into 1-inch cubes; 4  Yukon Gold potatoes, cubed; 1 ½ cups mushrooms, halved; 1  onion, cut into 6 wedges; 2  carrots, cut into 1/2-inch thick slices; 2 cloves garlic, minced; 3 cups beef broth; 1 tablespoon Worcestershire sauce; 1 tablespoon tomato paste; 1 teaspoon salt; ½ teaspoon ground black pepper; ½ teaspoon dried rosemary",
  "directions": "1. Gather all ingredients. 2. Turn on a multi-functional pressure cooker (such as Instant Pot) and select the Sauté function. Melt butter in the pot. Cook beef chuck cubes in batches until browned on all sides, about 5 minutes per batch. 3. Return all beef chuck cubes to the pot. Add potatoes, mushrooms, onion, carrots, and garlic; cover with beef broth. Stir in Worcestershire sauce, tomato paste, salt, pepper, and rosemary. 4. Close and lock the lid. Select Meat/Stew function, according to the manufacturer's instructions; set the timer for 35 minutes. Allow 10 to 15 minutes for pressure to build. 5. Release pressure using the natural-release method, according to the manufacturer's instructions, 10 to 40 minutes. Unlock and remove the lid.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "1 hr 25 mins",
  "calories": "352"
},
{
  "url": "https://www.allrecipes.com/recipe/23695/pork-butt-roast-with-vegetables/",
  "name": "Pork Butt Roast with Vegetables",
  "rating": "4.7",
  "ratingcount": "221",
  "ingredients": "1 teaspoon garlic powder, or to taste; salt and pepper to taste; 6 pounds pork butt roast; 2  onion, sliced; 20  new potatoes, raw; 16  carrots, peeled; 2 cups mushrooms, halved",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Heat a large frying pan over medium-high heat. Sprinkle garlic powder, salt, and pepper over pork roast; rub into meat. Sear meat on all sides in the hot pan until lightly brown. Transfer to a roasting pan. 3. Place onion slices over meat and in the roasting pan. Fill the roasting pan 2/3 full with water. 4. Cover and bake in the preheated oven for 3 hours. Add potatoes and carrots; cover and continue baking for 45 minutes. Add mushrooms and bake, covered, for another 15 minutes. Remove and let stand at least 10 minutes before serving.",
  "prep": "20 mins",
  "cook": "4 hrs",
  "total": "4 hrs 30 mins",
  "calories": "549"
},
{
  "url": "https://www.allrecipes.com/recipe/149118/very-easy-mushroom-barley-soup/",
  "name": "Very Easy Mushroom Barley Soup",
  "rating": "4.6",
  "ratingcount": "289",
  "ingredients": "¼ cup olive oil; 1 cup chopped onion; ¾ cup diced carrots; ½ cup chopped celery; 1 teaspoon minced garlic; 1 pound sliced fresh mushrooms; 6 cups chicken broth; ¾ cup barley; salt and pepper to taste",
  "directions": "1. Heat oil in a large soup pot over medium heat. Add onion, carrots, celery and garlic; cook and stir until onion has softened and turned translucent, about 5 minutes. Stir in mushrooms and continue to cook for about 3 minutes. 2. Pour in chicken broth, add barley, and bring to a boil. Reduce heat to low, cover, and simmer until barley is tender, about 50 minutes. 3. Season with salt and pepper before serving.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "198"
},
{
  "url": "https://www.allrecipes.com/recipe/13571/slow-cooker-stuffing/",
  "name": "Slow Cooker Stuffing",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "1 cup butter; 2 cups chopped onion; 2 cups chopped celery; 12 ounces sliced mushrooms; ¼ cup chopped fresh parsley; 12 cups dry bread cubes; 1 ½ teaspoons salt; 1 ½ teaspoons dried sage; 1 teaspoon poultry seasoning; 1 teaspoon dried thyme; ½ teaspoon dried marjoram; ½ teaspoon ground black pepper; 4 ½ cups chicken broth, or as needed; 2 large eggs, beaten",
  "directions": "1. Melt butter in a skillet over medium heat. Cook and stir onion, celery, mushroom, and parsley in butter until slightly softened, 5 to 8 minutes. 2. Place bread cubes in a very large mixing bowl. Spoon cooked vegetables over bread cubes. Season with salt, sage, poultry seasoning, thyme, marjoram, and pepper. Pour in enough broth to moisten, then mix in eggs. Transfer mixture to a slow cooker. 3. Cover and cook on High for 45 minutes, then reduce heat to Low and cook for 4 to 8 hours.",
  "prep": "25 mins",
  "cook": "4 hrs 50 mins",
  "total": "5 hrs 15 mins",
  "calories": "197"
},
{
  "url": "https://www.allrecipes.com/recipe/88587/easy-portobello-mushroom-saute/",
  "name": "Easy Portobello Mushroom Saute",
  "rating": "4.6",
  "ratingcount": "150",
  "ingredients": "3 tablespoons olive oil, divided, or more as needed; 1 ½ tablespoons garlic flavored olive oil; ¼  onion, cut into chunks; 2  portobello mushroom caps, sliced; salt and black pepper to taste; freshly grated Parmesan; freshly grated Asiago cheese",
  "directions": "1. Warm 1 1/2 tablespoons olive oil and garlic-flavored olive oil together in a skillet over medium heat until fragrant, about 1 minute. Stir in onions and mushrooms; reduce heat to low, and cook until the mixture has softened and caramelized, with browning around the edges, 8 to 12 minutes, adding additional olive oil if needed to prevent sticking. 2. Turn off heat, drizzle with remaining 1 1/2 tablespoons olive oil, and season with salt and pepper. Sprinkle generously with Parmesan and Asiago cheeses.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "349"
},
{
  "url": "https://www.allrecipes.com/recipe/18803/pork-chop-and-potato-casserole/",
  "name": "Pork Chop and Potato Casserole",
  "rating": "4.3",
  "ratingcount": "515",
  "ingredients": "1 tablespoon vegetable oil; 6  boneless pork chops; 1 (10.75 ounce) can  condensed cream of mushroom soup; 1 cup milk; 4  potatoes, thinly sliced; ½ cup chopped onion; 1 cup shredded Cheddar cheese",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Heat oil in a large skillet over medium-high heat. Place pork chops in the oil, and sear. 3. Combine condensed soup and milk in a medium bowl. Arrange potatoes and onions in a 9x13-inch baking dish. Place browned pork chops over potatoes and onions, then pour the soup mixture over everything in the dish. 4. Bake 30 minutes in the preheated oven. Top with cheese, and bake for 30 more minutes.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "705"
},
{
  "url": "https://www.allrecipes.com/recipe/8594/easy-chicken-casserole/",
  "name": "Easy Chicken Casserole",
  "rating": "4.2",
  "ratingcount": "334",
  "ingredients": "4  skinless, boneless chicken breast halves; 1 (10.5 ounce) can condensed cream of chicken soup; 1 cup sour cream; ¼ cup chopped onion (Optional); ¼ cup chopped mushrooms (Optional); 32  buttery round crackers, crumbled",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Fill a large pot with water; bring to a boil. Cook chicken in boiling water until no longer pink inside, 20 to 30 minutes. Chop chicken into bite-sized pieces and place in a 9x13-inch baking dish. 3. Combine condensed soup, sour cream, onion, and mushrooms in a bowl. Pour mixture over chicken and top with crumbled crackers. 4. Cover and bake in the preheated oven until top is lightly browned, about 30 minutes.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "466"
},
{
  "url": "https://www.allrecipes.com/recipe/219046/rich-and-creamy-beef-stroganoff/",
  "name": "Rich and Creamy Beef Stroganoff",
  "rating": "4.7",
  "ratingcount": "961",
  "ingredients": "2 (2 pound) beef chuck roast, cut into 1/2-inch thick strips; ½ cup red wine; 1 teaspoon salt, or more to taste; ½ teaspoon ground black pepper, or more to taste; 1 tablespoon extra-virgin olive oil; ½ cup butter, divided; 1 large onion, diced; 3 cloves garlic, minced; 1 cup sliced mushrooms; ¼ cup all-purpose flour; 1 ⅓ cups beef stock; 1 tablespoon Worcestershire sauce; 2 teaspoons crushed red pepper flakes; 1 teaspoon prepared yellow mustard; 1 (3 ounce) package cream cheese, softened; ⅓ cup sour cream",
  "directions": "1. Place beef into a large bowl. Stir in red wine, salt, and black pepper. Marinate for 10 minutes, then remove beef and pat dry with a paper towel. Reserve remaining marinade. 2. Heat olive oil in a large skillet over medium heat. Stir in beef; cook and stir until browned, 5 to 7 minutes. Transfer beef to a plate, then drain any remaining grease from the skillet. 3. Melt 2 tablespoons butter in the skillet over medium heat. Stir in onion, garlic, and a pinch of salt. Cook and stir until onion is soft and translucent, 3 to 4 minutes. Transfer onion mixture to the plate with beef; set aside. 4. Melt 2 tablespoons butter in the skillet over medium heat. Add mushrooms; cook and stir until tender, about 10 minutes. Transfer mushrooms to a bowl; set aside. 5. Melt 1/4 cup butter in the skillet over medium heat. Whisk in flour; cook and stir until flour no longer tastes raw, about 4 minutes. Slowly whisk in beef stock. Bring to a boil, stirring constantly, then reduce heat to medium-low. 6. Pour in reserved marinade, Worcestershire sauce, red pepper flakes, and mustard, then add beef and onion mixture. Cover and simmer until meat is tender, about 1 hour. Season with salt and black pepper. 7. Stir in mushrooms, cream cheese, and sour cream about 5 minutes before serving.",
  "prep": "15 mins",
  "cook": "1 hr 25 mins",
  "total": "1 hr 50 mins",
  "calories": "567"
},
{
  "url": "https://www.allrecipes.com/recipe/272437/keto-smothered-chicken-thighs/",
  "name": "Keto Smothered Chicken Thighs",
  "rating": "4.8",
  "ratingcount": "138",
  "ingredients": "4 (8 ounce) skin-on, bone-in chicken thighs; 1 teaspoon paprika; salt and pepper to taste; 4 slices bacon, cut into 1/2 inch pieces; ⅓ cup low-sodium chicken broth; 4 ounces sliced mushrooms; ¼ cup heavy whipping cream; 2  green onions, white and green parts separated and sliced",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Season chicken thighs on all sides with paprika, salt, and pepper. 3. Cook bacon in a cast iron skillet or oven-safe pan over medium-high heat until browned, 4 to 5 minutes. Remove from skillet and drain on a paper towel-lined plate. Drain and discard excess grease from the skillet. 4. Return the skillet to medium heat and cook chicken thighs, skin-side down, for 3 to 4 minutes. Flip chicken over and place the skillet in the preheated oven. 5. Bake until chicken thighs are no longer pink at the bone and juices run clear, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Remove chicken to a plate and cover with foil to keep warm. Remove all but 2 tablespoons of drippings from the skillet. 6. Return the skillet to the stove over medium-high heat. Pour in chicken broth while whisking up brown bits from the bottom of the skillet. Add mushrooms and cook until soft, about 3 to 4 minutes. Pour in heavy whipping cream and whisk together until lightly simmering, then reduce heat to medium-low. Season with salt and pepper, if necessary. 7. Return chicken and any juices back into the skillet; top with bacon and green onions. Serve immediately, spooning sauce over chicken.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "466"
},
{
  "url": "https://www.allrecipes.com/recipe/219091/chef-johns-mushroom-gravy/",
  "name": "Chef John's Best Mushroom Gravy",
  "rating": "4.8",
  "ratingcount": "396",
  "ingredients": "¼ cup butter; 1 (16 ounce) package sliced mushrooms; salt to taste; ¼ cup all-purpose flour, or as needed; 1 quart beef stock; 1 pinch ground black pepper to taste; 1 pinch fresh thyme leaves, to taste",
  "directions": "1. Heat butter in a saucepan over medium heat until it foams. Stir in mushrooms and season with salt. Simmer until liquid evaporates, about 20 minutes. 2. Stir in flour; cook and stir for 5 minutes. Add 1 cup of beef stock, stirring briskly until incorporated, then pour in the remaining stock and mix thoroughly. Season with black pepper and thyme. Reduce heat to medium-low and simmer until thickened, stirring often, about 30 minutes.",
  "prep": "10 mins",
  "cook": "55 mins",
  "total": "1 hr 5 mins",
  "calories": "133"
},
{
  "url": "https://www.allrecipes.com/recipe/42890/turkey-a-la-king/",
  "name": "Turkey à la King",
  "rating": "4.4",
  "ratingcount": "258",
  "ingredients": "2 tablespoons butter; 3  fresh mushrooms, sliced; 1 tablespoon all-purpose flour; 1 cup chicken broth; 1 cup chopped cooked turkey; ½ cup heavy cream; ⅓ cup frozen peas, thawed; salt and pepper to taste",
  "directions": "1. Cook and stir butter in a large skillet over medium-low heat until golden brown. 2. Add mushrooms to the skillet and cook in browned butter, stirring occasionally, until tender. Stir in flour until smooth. Slowly whisk in chicken broth; cook until slightly thickened. 3. Stir in turkey, cream, and peas. Reduce heat to low; cook until thickened. Season with salt and pepper.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "233"
},
{
  "url": "https://www.allrecipes.com/recipe/17897/hungarian-mushroom-soup/",
  "name": "Hungarian Mushroom Soup",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "4 tablespoons unsalted butter; 2 cups chopped onions; 1 pound fresh mushrooms, sliced; 2 cups chicken broth; 1 tablespoon soy sauce; 1 tablespoon paprika; 2 teaspoons dried dill weed; 1 cup milk; 3 tablespoons all-purpose flour; ½ cup sour cream; ¼ cup chopped fresh parsley; 2 teaspoons lemon juice; 1 teaspoon salt; ground black pepper to taste",
  "directions": "1. Melt butter in a large pot over medium heat. Add onions; cook and stir until softened, about 5 minutes. Add mushrooms and sauté for 5 more minutes. Stir in broth, soy sauce, paprika, and dill; reduce heat to low, cover, and simmer for 15 minutes. 2. Whisk milk and flour together in a separate bowl; stir into soup until blended. Cover and simmer for 15 more minutes, stirring occasionally. 3. Add sour cream, parsley, lemon juice, salt, and ground black pepper; stir over low heat until warmed through, about 3 to 5 minutes. Serve immediately.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "201"
},
{
  "url": "https://www.allrecipes.com/recipe/230213/stuffed-pork-tenderloin/",
  "name": "Stuffed Pork Tenderloin",
  "rating": "4.5",
  "ratingcount": "90",
  "ingredients": "3 tablespoons extra-virgin olive oil, divided, or as needed; 10  white mushrooms, minced; 1  shallot, minced; ½ teaspoon dried thyme; ½ teaspoon garlic powder; ½ teaspoon dried sage; ½ teaspoon ground black pepper; ¼ teaspoon salt; ¼ cup chopped fresh parsley; 2 cups fresh spinach; 1 teaspoon Dijon mustard; 1 (2 pound) pork tenderloin, butterflied and pounded flat; 4 slices prosciutto",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Heat 1 tablespoon olive oil in a skillet over medium heat; cook and stir mushrooms, shallot, thyme, garlic powder, sage, black pepper, and salt in the hot oil until liquid has evaporated and mushrooms and shallots are softened, 5 to 10 minutes. 3. Add parsley; cook and stir for 1 minute. Mix in spinach; cook and stir until spinach is wilted, about 5 minutes. Stir in mustard. Remove from heat. 4. Place pork tenderloin on a work surface; lay prosciutto atop tenderloin. Spread mushroom-spinach mixture over prosciutto, leaving a 1/2-inch border on all sides. 5. Tightly roll tenderloin around filling and tie together with kitchen string to keep closed. 6. Heat remaining 2 tablespoons olive oil in a large skillet over medium heat; place rolled tenderloin in the hot oil. Sear until all sides are golden brown, about 10 minutes. Transfer seared tenderloin to a 9x13-inch casserole dish. 7. Bake in the preheated oven until pork is slightly pink in the center, 25 to 30 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
  "prep": "25 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "296"
},
{
  "url": "https://www.allrecipes.com/recipe/259455/instant-pot-mushroom-risotto/",
  "name": "Instant Pot Mushroom Risotto",
  "rating": "4.7",
  "ratingcount": "326",
  "ingredients": "¼ cup unsalted butter; ¼ cup olive oil; 3 cups diced mushrooms; 1 cup chopped onion; 1 sprig rosemary; 1 ½ cups Arborio rice; ¾ cup white wine; 1 quart chicken stock; salt and ground black pepper to taste; ½ cup grated Parmesan cheese",
  "directions": "1. Turn on a multi-functional pressure cooker (such as Instant Pot) and select Saute function. Add butter and olive oil; stir until butter melts, about 2 minutes. Add mushrooms; cook, stirring occasionally, until slightly softened, about 3 minutes. Stir in onion; cook for 2 minutes. Add rosemary sprig; cook for 1 minute. 2. Stir rice into the pot until each grain is coated with butter and olive oil mixture, about 2 minutes. Pour in wine; simmer for 3 minutes. 3. Pour in chicken stock, stirring to scrape the sides of the pot. Simmer for 1 minute. 4. Close and lock the lid. Turn the venting knob to sealing. Select high pressure according to manufacturer's instructions; set timer for 6 minutes. Allow 10 to 15 minutes for pressure to build. 5. Tap venting knob a few times with a wooden spoon or spatula. Stand back; turn knob to point at vent. Remove lid when pressure is released, about 5 minutes. 6. Stir risotto until creamy, about 1 minute. Discard rosemary sprig. Season with salt and pepper. Stir in Parmesan cheese until melted and combined. 7. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "645"
},
{
  "url": "https://www.allrecipes.com/recipe/269632/slow-cooker-lamb-stew/",
  "name": "Slow Cooker Lamb Stew",
  "rating": "4.7",
  "ratingcount": "21",
  "ingredients": "1 tablespoon olive oil; 1 pound cubed lamb stew meat; 1 large onion, sliced into petals; 1 pound red potatoes, cut into large cubes; 2 large carrots, sliced; 2 stalks celery, sliced; 4  fresh button mushrooms, sliced; 2 cups beef broth; 1 (6 ounce) can tomato paste; ½ cup beer; 3 tablespoons Worcestershire sauce; 1  large sprig fresh rosemary; salt and pepper to taste; 1 ½ cups frozen peas",
  "directions": "1. Heat oil in a large skillet over medium-high heat. Add lamb and onions; cook and stir until lamb is browned and onions are starting to soften, about 5 minutes. Transfer lamb mixture to a slow cooker. 2. Add potatoes, carrots, celery, and mushrooms. Stir in beef broth, tomato paste, beer, Worcestershire sauce, rosemary, salt, and pepper; cover. 3. Cook on High for 7 hours. Add peas and cook for an additional 15 minutes. Season with salt and pepper.",
  "prep": "15 mins",
  "cook": "7 hrs 25 mins",
  "total": "7 hrs 40 mins",
  "calories": "438"
},
{
  "url": "https://www.allrecipes.com/recipe/216740/cream-cheese-alfredo-sauce/",
  "name": "Cream Cheese Alfredo Sauce",
  "rating": "4.7",
  "ratingcount": "126",
  "ingredients": "2 tablespoons butter; 2  portobello mushroom caps, thinly sliced; 1 (8 ounce) package cream cheese; ½ cup butter; 1 ½ cups milk; 6 ounces grated Parmesan cheese, or to taste; 1 tablespoon minced fresh basil leaves; 1 clove garlic, crushed; ground white pepper, to taste",
  "directions": "1. Heat 2 tablespoons butter in a skillet over medium heat. Stir in mushrooms; cook and stir until softened, about 5 minutes. Set aside. 2. Melt cream cheese and 1/2 cup butter in a saucepan, stirring occasionally, over medium heat. Stir in milk and Parmesan cheese until smooth. 3. Add basil, garlic, and white pepper. Simmer until flavors blend, about 5 minutes. Remove garlic, then stir in mushrooms.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "464"
},
{
  "url": "https://www.allrecipes.com/recipe/221198/transformed-spinach-mushroom-quiche/",
  "name": "Transformed Spinach Mushroom Quiche",
  "rating": "4.1",
  "ratingcount": "177",
  "ingredients": "1  prepared 9-inch single pie crust; ½ (10 ounce) bag fresh spinach; 1 (8 ounce) package sliced fresh mushrooms; ½  yellow onion, sliced; ½ (4 ounce) container crumbled feta cheese; ½ (8 ounce) package shredded Swiss cheese, divided; 4 large eggs; ¾ cup milk; 1 tablespoon chopped fresh parsley; 1 teaspoon minced garlic; ½ teaspoon salt; ½ teaspoon ground black pepper; ⅛ teaspoon ground nutmeg",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Fit pie crust into a 9-inch pie dish. 3. Gently combine spinach, mushrooms, onion, and feta cheese in a bowl. Spread mixture in the prepared pie dish; top with 1/2 of the Swiss cheese. 4. Whisk eggs, milk, parsley, garlic, salt, black pepper, and nutmeg in the bowl. Pour egg mixture evenly over filling, swirling egg mixture in bowl to evenly distribute seasonings. Top with remaining Swiss cheese, then place quiche on a baking sheet. 5. Bake in the preheated oven until lightly puffed and browned, 45 to 50 minutes. A toothpick inserted into the center of the filling should come out clean. Cool for 30 minutes before serving.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 30 mins",
  "calories": "334"
},
{
  "url": "https://www.allrecipes.com/recipe/61791/sauteed-mushrooms-in-garlic/",
  "name": "Garlic Mushrooms",
  "rating": "4.5",
  "ratingcount": "82",
  "ingredients": "1 tablespoon butter; 2 pounds sliced fresh mushrooms; 4 cloves garlic, minced; 1 teaspoon dried basil; 1 cup red wine",
  "directions": "1. Heat butter in a skillet over low heat. Add mushrooms and garlic; cook and stir until mushrooms are a light golden brown, about 10 minutes. Stir in basil. 2. Reduce heat to low, and pour wine into the skillet. Simmer until wine has mostly evaporated. Serve immediately.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "130"
},
{
  "url": "https://www.allrecipes.com/recipe/269592/pork-chops-in-garlic-mushroom-sauce/",
  "name": "Pork Chops in Garlic Mushroom Sauce",
  "rating": "4.7",
  "ratingcount": "599",
  "ingredients": "2 pounds boneless pork chops; ½ teaspoon paprika; kosher salt and ground black pepper to taste; ¼ cup butter, divided; 1 (8 ounce) package sliced fresh mushrooms; 4 cloves garlic, minced; 1 teaspoon Dijon mustard; 2 tablespoons all-purpose flour; 2 cups beef broth",
  "directions": "1. Season both sides of pork chops with paprika, salt, and pepper. 2. Heat a large skillet over medium-high heat; add 2 tablespoons butter. Sear pork chops until golden brown and no longer pink in the center, 2 to 4 minutes per side. Remove pork chops from the skillet and set aside. 3. Melt remaining butter in the same skillet over medium-high heat. Add mushrooms and cook until golden and excess moisture evaporates, about 5 minutes. Add garlic and mustard; cook until garlic is fragrant, about 1 minute. 4. Add flour to the skillet, stirring to remove any lumps. Slowly add beef broth, whisking until incorporated. Season with salt and pepper. Reduce heat to medium and simmer, stirring often, until sauce thickens, about 5 minutes. Check for seasoning again. 5. Return pork chops to the skillet and cook until heated through, about 1 minute. Serve hot.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "199"
},
{
  "url": "https://www.allrecipes.com/recipe/45784/mushroom-rice/",
  "name": "Mushroom Rice",
  "rating": "4.5",
  "ratingcount": "629",
  "ingredients": "2 teaspoons butter; 6  mushrooms, coarsely chopped; 1  green onion, finely chopped; 1 clove garlic, minced; 2 cups chicken broth; 1 cup uncooked white rice; ½ teaspoon chopped fresh parsley; salt and pepper to taste",
  "directions": "1. Melt butter in a saucepan over medium heat. Cook mushrooms, green onion, and garlic in butter until mushrooms are cooked and liquid has evaporated, about 5 minutes. 2. Stir in chicken broth and rice. Season with parsley, salt, and pepper. Bring to a boil, then reduce heat. Cover and simmer until liquid is absorbed, about 20 minutes.",
  "prep": "5 mins",
  "cook": "25 mins",
  "total": "30 mins",
  "calories": "216"
},
{
  "url": "https://www.allrecipes.com/recipe/232908/chef-johns-meatless-meatballs/",
  "name": "Chef John's Meatless Meatballs",
  "rating": "4.7",
  "ratingcount": "557",
  "ingredients": "1 tablespoon olive oil; 1 pound fresh white mushrooms, finely chopped; 1 pinch salt; 1 tablespoon butter; ½ cup finely chopped onion; 4 cloves garlic, minced; ½ cup quick-cooking oats; 1 ounce very finely shredded Parmigiano-Reggiano cheese; ½ cup bread crumbs; ¼ cup chopped flat-leaf (Italian) parsley, packed; 2 large eggs, divided; 1 teaspoon salt; freshly ground black pepper to taste; 1 pinch cayenne pepper, or to taste; 1 pinch dried oregano; 3 cups pasta sauce; 1 tablespoon very finely shredded Parmigiano-Reggiano cheese, or to taste; 1 tablespoon chopped flat-leaf (Italian) parsley, or to taste",
  "directions": "1. Gather and prep all ingredients. 2. Heat olive oil in a skillet over medium-high heat. Add mushrooms to the hot oil, sprinkle with salt, and cook and stir until liquid from mushrooms has evaporated. Stir butter into mushrooms, reduce heat to medium, and cook and stir mushrooms until golden brown, about 5 minutes. 3. Stir onion into mushrooms and cook, stirring often, until onion is translucent, 5 minutes. Remove skillet from heat and stir garlic into mushroom mixture until fragrant, about 1 minute. Transfer mixture to a mixing bowl. 4. Mix oats into mushroom mixture until thoroughly combined. Gently stir 1 ounce Parmigiano-Reggiano cheese into the mixture. Add bread crumbs, 1/4 cup parsley, and 1 egg; season with salt, black pepper, cayenne pepper, and oregano. Mix together with a fork until crumbly. Stir in remaining 1 egg. The mixture should hold together when pressed. 5. Cover the bowl with plastic wrap and refrigerate at least 4 hours. For best flavor and texture, refrigerate overnight. 6. Preheat the oven to 450 degrees F (230 degrees C). Line a baking sheet with a silicone baking mat or parchment paper. 7. Form mixture into small meatballs using a 2-tablespoon scoop. Roll meatballs lightly between your hands until smooth, if desired; arrange meatballs on the prepared baking sheet. 8. Bake in the preheated oven until meatballs are lightly golden brown, 12 to 15 minutes. 9. Bring pasta sauce to a boil in a large saucepan; reduce heat to low. Gently stir meatballs into sauce until coated. Simmer meatballs in sauce until cooked through, 45 minutes to 1 hour. Transfer to a serving bowl and garnish with 1 tablespoon Parmigiano-Reggiano cheese and 1 tablespoon parsley.",
  "prep": "30 mins",
  "cook": "1 hr 15 mins",
  "total": "5 hrs 45 mins",
  "calories": "421"
},
{
  "url": "https://www.allrecipes.com/recipe/8472977/got-no-beef-stew/",
  "name": "Got No Beef Stew",
  "rating": "5.0",
  "ratingcount": "8",
  "ingredients": "2 tablespoons vegetable oil; 2 tablespoons unsalted butter; 1 pound brown mushrooms, halved; 1 teaspoon kosher salt, plus more to taste; 1 large yellow onion, diced; 1 tablespoon tomato paste; 2 tablespoons all-purpose flour; 7 cups water; 2 tablespoons yellow miso paste; 2 tablespoons beef base (such as Better than Bouillon®); 1 large bay leaf; 1 teaspoon Worcestershire sauce; 1 teaspoon garlic powder; ½ teaspoon freshly ground black pepper; ¼ teaspoon dried rosemary; ¼ teaspoon dried thyme; 1 pinch cayenne pepper; 4  carrots, peeled and cut into 1-inch pieces; 4 ribs celery, cut into 1-inch pieces; 4  russet potatoes, peeled and quartered; 2 tablespoons finely chopped Italian parsley (Optional)",
  "directions": "1. Combine butter and vegetable oil in a pot over medium-high heat and allow butter to melt. Toss in mushrooms and season salt. Cook, stirring occasionally until mushrooms are nicely browned, 5 to 6 minutes. 2. Add onions and lower heat to medium. Cook, stirring, until onions have softened and are translucent and the bottom of the pot has turned brown, about 5 minutes. The browned bits on the bottom of the pot will add flavor and color. Add tomato paste and flour to thicken the stew. Cook and stir for 2 to 3 minutes. 3. Pour in water, increase temperature to high, and bring to a simmer. While you're waiting for stew to come to a simmer, mix in miso paste, beef paste, bay leaf, Worcestershire sauce, garlic powder, black pepper, thyme, rosemary, and cayenne; stir to combine. 4. Once stew is bubbling, add carrots, and celery and reduce heat to medium-low to keep stew at a steady simmer, stirring occasionally, about 30 minutes. Taste and season with salt if necessary. Add potatoes and simmer until potatoes are very tender and creamy inside and stew has reduced and thickened, about 30 more minutes. Potatoes can be stirred in and broken up a bit to make the stew thicker. 5. Turn off the heat and stir in freshly chopped Italian parsley if desired.",
  "prep": "30 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 50 mins",
  "calories": "408"
},
{
  "url": "https://www.allrecipes.com/recipe/150464/garlic-rosemary-mushrooms/",
  "name": "Garlic-Rosemary Mushrooms",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "1 ounce bacon, chopped; 1 ½ pounds mixed mushrooms, such as cremini, shiitake (stemmed) and portobello, cut into 1/4-inch slices; 2 cloves garlic, finely chopped; 1 ½ teaspoons chopped fresh rosemary; ¼ teaspoon salt; 1 pinch freshly ground pepper to taste; ¼ cup dry white wine",
  "directions": "1. Cook bacon in a large skillet over medium heat until just beginning to brown, about 4 minutes. Add mushrooms, garlic, rosemary, salt and pepper and cook, stirring occasionally, until almost dry, 8 to 10 minutes. Pour in wine and cook until most of the liquid has evaporated, 30 seconds to 1 minute.",
  "prep": "",
  "cook": "20 mins",
  "total": "20 mins",
  "calories": "66"
},
{
  "url": "https://www.allrecipes.com/recipe/59571/mushroom-soup-without-cream/",
  "name": "Mushroom Soup Without Cream",
  "rating": "4.6",
  "ratingcount": "233",
  "ingredients": "2 tablespoons butter; 1 cup peeled and sliced carrots; 1 cup sliced onions; 1 cup sliced leeks (Optional); ½ cup sliced celery; 2 pounds sliced fresh brown or white mushrooms; 1 teaspoon fresh thyme leaves; 6 cups chicken stock; salt and pepper to taste; ½ cup chopped green onion",
  "directions": "1. Melt butter in a stock pot over medium heat. Add carrots, onions, leeks, and celery. Cook and stir until vegetables are tender but not browned, about 10 minutes. 2. Stir in mushrooms and thyme; cook until mushrooms are soft, about 5 minutes. Pour chicken stock into the pot; season with salt and pepper. Cover and simmer over low heat for 30 minutes. 3. Ladle into bowls; serve with green onions sprinkled on top.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "81"
},
{
  "url": "https://www.allrecipes.com/recipe/281241/garlic-butter-roasted-mushrooms/",
  "name": "Garlic Butter Mushrooms",
  "rating": "4.7",
  "ratingcount": "21",
  "ingredients": "1 pound fresh white mushrooms; 1 tablespoon olive oil; 2 cloves garlic, minced; 3 tablespoons salted butter, melted; 1 pinch salt and ground black pepper to taste; 2 tablespoons grated Parmesan cheese; 2 tablespoons minced fresh parsley",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Clean mushrooms with a damp paper towel and gently remove and discard stems. 3. Drizzle oil into a large cast iron skillet to evenly coat. Place mushrooms into the skillet, cap-side down. Carefully sprinkle garlic into the mushroom cavities, taking care not to sprinkle directly into the skillet. Drizzle mushrooms with melted butter, then season with salt and pepper. 4. Roast in the preheated oven for 15 minutes. Sprinkle with Parmesan cheese and return to the oven for 3 to 5 more minutes. Remove from the oven and sprinkle with parsley. Let cool slightly before serving.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "145"
},
{
  "url": "https://www.allrecipes.com/recipe/278271/air-fryer-stuffed-mushrooms/",
  "name": "Air Fryer Stuffed Mushrooms",
  "rating": "4.6",
  "ratingcount": "12",
  "ingredients": "1 (16 ounce) package whole white button mushrooms; 2  scallions; 4 ounces cream cheese, softened; ¼ cup finely shredded sharp Cheddar cheese; ¼ teaspoon ground paprika; 1 pinch salt; cooking spray",
  "directions": "1. Gently clean mushrooms with a damp cloth. Remove and discard stems. 2. Mince scallions, separating white and green parts. 3. Preheat an air fryer to 360 degrees F (182 degrees C). 4. Mix cream cheese, Cheddar cheese, scallion whites, paprika, and salt together in a small bowl. Stuff mixture into mushrooms, pressing gently with the back of a small spoon to fill each cavity. 5. Spray the air fryer basket with cooking spray and set mushrooms inside without overcrowding; you may need to work in batches. 6. Air-fry mushrooms until filling is lightly browned, about 8 minutes. Transfer to a serving plate. 7. Sprinkle mushrooms with scallion greens. Let cool for 5 minutes before serving.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "35 mins",
  "calories": "104"
},
{
  "url": "https://www.allrecipes.com/recipe/85389/gourmet-mushroom-risotto/",
  "name": "Gourmet Mushroom Risotto",
  "rating": "4.8",
  "ratingcount": "3",
  "ingredients": "6 cups chicken broth, or as needed; 3 tablespoons olive oil, divided; 1 pound portobello mushrooms, thinly sliced; 1 pound white mushrooms, thinly sliced; 2 medium shallots, diced; 1 ½ cups Arborio rice; ½ cup dry white wine; 4 tablespoons butter; 3 tablespoons finely chopped chives; ⅓ cup freshly grated Parmesan cheese; sea salt and freshly ground black pepper to taste",
  "directions": "1. Gather all ingredients. 2. Warm broth in a saucepan over low heat. 3. Meanwhile, warm 2 tablespoons olive oil in a large saucepan over medium-high heat. Add portobello and white mushrooms; cook and stir until soft, about 3 minutes. Remove mushrooms and their liquid to a bowl; set aside. 4. Add remaining 1 tablespoon olive oil to the saucepan. Stir in shallots and cook for 1 minute. Add rice; cook and stir until rice is coated with oil and pale, golden in color, about 2 minutes. 5. Pour in wine, stirring constantly until wine is fully absorbed. Add 1/2 cup warm broth to the rice, and stir until the broth is absorbed. 6. Continue adding broth, 1/2 cup at a time, stirring constantly, until the liquid is absorbed and the rice is tender, yet firm to the bite, about 15 to 20 minutes. 7. Remove from heat. Stir in reserved mushrooms and their liquid, butter, chives, and Parmesan cheese. 8. Season with salt and pepper and serve immediately.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "431"
},
{
  "url": "https://www.allrecipes.com/recipe/8490161/mushroom-thyme-white-pizza/",
  "name": "Mushroom-Thyme White Pizza",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "1 pound fresh pizza dough; flour for dusting; 4 tablespoons olive oil, divided; ½ pound cremini mushrooms, thinly sliced; ½ pound maitake mushrooms, broken into small clusters; 2 tablespoons chopped fresh oregano; 2 tablespoons fresh thyme leaves, plus more for garnish; ½ teaspoon kosher salt, divided; ¾ teaspoon freshly ground black pepper, divided, or more to taste; 1 (5 ounce) package fresh baby spinach; 1 cup whole milk ricotta cheese; ½ cup finely grated Pecorino Romano cheese; 2 cloves garlic, grated; 1 cup shredded part-skim mozzarella cheese; shaved Pecorino Romano cheese, for garnish",
  "directions": "1. Put a pizza stone or baking sheet on the middle oven rack. Preheat the oven to 450 degrees F (230 degrees C). 2. Turn dough out onto a lightly floured work surface and roll out into a 14-inch circle. Transfer to a piece of parchment paper or a cookie sheet lightly dusted with flour or cornmeal. Cover with a kitchen towel; let stand at room temperature until ready to use. 3. Meanwhile, heat 2 tablespoons oil in a large skillet over medium heat. Add cremini and maitake mushrooms; cook, stirring occasionally, until well browned and tender, 6 to 8 minutes. Stir in oregano, thyme, 1/4 teaspoon salt, and 1/4 teaspoon pepper. Transfer mushroom mixture to a bowl. (Do not wipe skillet clean.) 4. Add 1 tablespoon oil to skillet. Add spinach and 1/4 teaspoon pepper; cook, stirring frequently, until spinach is wilted, about 2 minutes. Transfer to a paper towel-lined plate to drain. 5. Stir together ricotta, Pecorino-Romano, garlic, and remaining 1/4 teaspoon each salt and pepper in a bowl until well combined. Brush dough with remaining 1 tablespoon oil. Spread ricotta mixture in an even layer over the dough, leaving a 1-inch border. Sprinkle mozzarella evenly over ricotta mixture. Top with cooked mushrooms and spinach. 6. Carefully transfer pizza on parchment to hot pizza stone or baking sheet in the oven. Bake until cheese is bubbly and crust is deeply golden brown, 15 to 18 minutes. 7. Transfer pizza and parchment to a cutting board; let stand 5 minutes. Remove parchment. Garnish with additional thyme, a few grinds of pepper, and shaved Pecorino-Romano cheese.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "714"
},
{
  "url": "https://www.allrecipes.com/recipe/15184/mouth-watering-stuffed-mushrooms/",
  "name": "Mouth-Watering Stuffed Mushrooms",
  "rating": "4.6",
  "ratingcount": "4",
  "ingredients": "12  whole fresh mushrooms; 1 tablespoon vegetable oil; 1 tablespoon minced garlic; 1 (8 ounce) package cream cheese, softened; ¼ cup grated Parmesan cheese; ¼ teaspoon ground black pepper; ¼ teaspoon onion powder; ¼ teaspoon ground cayenne pepper",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Spray a baking sheet with cooking spray. Clean mushrooms with a damp paper towel; carefully break off stems. Chop stems extremely fine, discarding the tough end of stems. 2. Heat oil in a large skillet over medium heat. Add garlic and chopped mushroom stems; fry until any moisture has evaporated, taking care not to burn garlic. Set aside to cool. 3. Stir in cream cheese, Parmesan cheese, black pepper, onion powder, and cayenne. The mixture will be very thick; use a teaspoon to fill each mushroom cap with a generous amount of stuffing. Arrange mushroom caps on the prepared cookie sheet. 4. Bake in the preheated oven until the mushrooms are piping hot, about 20 minutes.",
  "prep": "25 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "88"
},
{
  "url": "https://www.allrecipes.com/recipe/276682/creamy-mushroom-sauce/",
  "name": "Creamy Mushroom Sauce",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "2 tablespoons unsalted butter; ½ tablespoon olive oil; 1 (10 ounce) package sliced fresh mushrooms; 2 cloves garlic, minced; 1 pinch salt and ground black pepper; ¼ cup white wine; 1 cup heavy cream; ½ cup chicken or vegetable broth; ½ cup freshly grated Parmesan cheese; 2 teaspoons chopped fresh thyme",
  "directions": "1. Heat butter and oil in a skillet over medium heat until butter is melted; add mushrooms and cook until golden brown, 4 to 5 minutes. Stir in garlic, salt, and pepper; cook until garlic is fragrant, about 1 minute. Pour white wine into the pan and simmer until wine is mostly evaporated, scraping the browned bits of food off the bottom of the pan with a wooden spoon, about 1 minute. 2. Stir in cream, chicken broth, and cheese; reduce heat to medium-low, and cook, stirring occasionally, until cheese has melted and sauce has thickened but doesn't boil, about 2 to 3 minutes. Stir in thyme and adjust seasoning with salt and pepper, if needed.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "139"
},
{
  "url": "https://www.allrecipes.com/recipe/235589/chef-johns-creamy-mushroom-soup/",
  "name": "Chef John's Creamy Mushroom Soup",
  "rating": "4.7",
  "ratingcount": "586",
  "ingredients": "¼ cup unsalted butter; 2 (16 ounce) packages sliced fresh mushrooms; 1 pinch salt; 1 medium yellow onion, diced; 1 ½ tablespoons all-purpose flour; 6 sprigs fresh thyme, tied in a bundle with kitchen twine; 2 cloves garlic, peeled; 4 cups chicken broth, or more to taste; 1 cup water, or more to taste; 1 cup heavy whipping cream; 1  salt and freshly ground black pepper to taste; 1 teaspoon fresh thyme leaves for garnish, or to taste",
  "directions": "1. Gather all ingredients. 2. Melt butter in a large soup pot over medium-high heat. Sauté mushrooms and 1 pinch salt in the melted butter until mushrooms release their juices, 5 to 10 minutes. Reduce heat to medium-low and continue to cook, stirring often, until juices evaporate and mushrooms are caramelized, 15 to 25 minutes. Set aside a few attractive mushroom slices for garnish later, if desired. 3. Add onion to the mushrooms; cook until onion is soft and translucent, about 5 minutes. 4. Stir flour into the mushroom mixture and cook, stirring often, to remove the raw flour taste, about 2 minutes. 5. Add thyme bundle and garlic cloves, then pour in 4 cups chicken broth and 1 cup water. Reduce heat to low and simmer for 1 hour. Remove and discard thyme bundle. 6. Purée soup with a blender in batches until smooth and thick. 7. Stir in cream. If too thick, add a little chicken broth or water. Season with salt and black pepper. 8. Ladle into bowls, and garnish with reserved mushroom slices and thyme leaves.",
  "prep": "10 mins",
  "cook": "1 hr 25 mins",
  "total": "1 hr 35 mins",
  "calories": "272"
},
{
  "url": "https://www.allrecipes.com/recipe/8887/chicken-marsala/",
  "name": "Chicken Marsala",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "¼ cup all-purpose flour for coating; ½ teaspoon salt; ¼ teaspoon ground black pepper; ½ teaspoon dried oregano; 4 medium skinless, boneless chicken breast halves - pounded 1/4 inch thick; 4 tablespoons butter; 4 tablespoons olive oil; 1 cup sliced mushrooms; ½ cup Marsala wine; ¼ cup cooking sherry",
  "directions": "1. Gather all ingredients. 2. In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. 3. Coat chicken pieces in flour mixture. 4. In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown. 5. Turn over chicken pieces, and add mushrooms. Pour in wine and sherry. 6. Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear. 7. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/37784/easy-turkey-tetrazzini/",
  "name": "Easy Turkey Tetrazzini",
  "rating": "4.4",
  "ratingcount": "518",
  "ingredients": "1 (8 ounce) package egg noodles; 2 tablespoons butter; 1 (6 ounce) can sliced mushrooms; 2 cups chopped cooked turkey; 1 (10.75 ounce) can  condensed cream of celery soup; 1 cup sour cream; 1 teaspoon salt; ⅛ teaspoon pepper; ½ cup grated Parmesan cheese",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add noodles and cook until al dente, 8 to 10 minutes. 2. Preheat the oven to 375 degrees F (190 degrees C). 3. Meanwhile, melt butter in a large heavy skillet. Drain mushrooms, add to skillet, and cook, stirring, for 1 minute. Stir in turkey, condensed soup, sour cream, salt, and pepper. 4. Drain noodles and place in a 9x13-inch baking dish. Pour turkey mixture evenly over the top. Sprinkle with Parmesan. 5. Bake in the preheated oven until sauce is bubbling, 20 to 25 minutes.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "411"
},
{
  "url": "https://www.allrecipes.com/recipe/13096/cream-of-mushroom-soup-i/",
  "name": "Cream of Mushroom Soup",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "5 cups sliced fresh mushrooms; 1 ½ cups chicken broth; ½ cup chopped onion; ⅛ teaspoon dried thyme; 3 tablespoons butter; 3 tablespoons all-purpose flour; ¼ teaspoon salt; ¼ teaspoon ground black pepper; 1 cup half-and-half; 1 tablespoon sherry",
  "directions": "1. Simmer mushrooms, broth, onion, and thyme in a large heavy saucepan until vegetables are tender, 10 to 15 minutes. 2. Carefully transfer the hot mixture to a blender or food processor. Cover and hold lid down with a potholder; pulse until creamy but still with some chunks of vegetable. 3. Melt butter in the same saucepan. Whisk in flour until smooth. Whisk in salt and pepper. Slowly whisk in half-and-half and mushroom mixture. 4. Bring soup to a boil and cook, stirring constantly, until thickened. 5. Stir in sherry. Taste and season with salt and pepper if needed.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "148"
},
{
  "url": "https://www.allrecipes.com/recipe/240406/stuffed-cream-cheese-mushrooms/",
  "name": "Stuffed Cream Cheese Mushrooms",
  "rating": "4.8",
  "ratingcount": "197",
  "ingredients": "cooking spray; 12  whole fresh mushrooms, tough ends trimmed; 1 tablespoon vegetable oil; 1 tablespoon minced garlic; 1 (8 ounce) package cream cheese, softened; ¼ cup grated Parmesan cheese; ¼ teaspoon ground black pepper; ¼ teaspoon onion powder; ¼ teaspoon cayenne pepper",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Prepare a baking sheet with cooking spray. 2. Clean mushrooms with a damp paper towel. Carefully break stems from mushrooms. Finely chop stems and set caps aside. 3. Heat oil in a large skillet over medium heat. Fry chopped mushroom stems and garlic in hot oil until any moisture has disappeared, taking care not to burn the garlic, 3 to 5 minutes. Spread mushroom mixture into a bowl to cool completely, about 10 minutes. 4. Stir cream cheese, Parmesan cheese, black pepper, onion powder, and cayenne pepper into the cooled mushroom mixture until very thick and completely mixed. Use a small spoon to fill each mushroom cap with a generous amount of stuffing. Arrange stuffed mushrooms on the prepared cookie sheet. 5. Bake in the preheated oven until piping hot and liquid starts to form under each cap, about 20 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "176"
},
{
  "url": "https://www.allrecipes.com/recipe/12751/crab-stuffed-mushrooms/",
  "name": "Crab Stuffed Mushrooms",
  "rating": "4.3",
  "ratingcount": "353",
  "ingredients": "7 ounces crabmeat; 5  green onions, thinly sliced; ¼ teaspoon dried thyme; ¼ teaspoon dried oregano; ¼ teaspoon ground savory; ground black pepper to taste; ¼ cup grated Parmesan cheese; ⅓ cup mayonnaise; 1 pound fresh mushrooms; 3 tablespoons grated Parmesan cheese; ¼ teaspoon paprika",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine crabmeat, green onions, thyme, oregano, savory, and pepper in a medium bowl. Mix in mayonnaise and 1/4 cup Parmesan until well combined. Refrigerate filling until ready to use. 3. Wipe mushrooms clean with a damp towel. Remove stems. Spoon out the gills and the base of the stem, making deep cups. Discard gills and stems. 4. Fill mushroom caps with rounded teaspoonfuls of filling and place them in an ungreased shallow baking dish. Sprinkle tops with Parmesan and paprika. 5. Bake mushrooms in preheated oven until heated through, about 15 minutes. Serve hot.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "40 mins",
  "calories": "167"
},
{
  "url": "https://www.allrecipes.com/recipe/266164/air-fryer-meatloaf/",
  "name": "Air Fryer Meatloaf",
  "rating": "4.3",
  "ratingcount": "58",
  "ingredients": "1 pound lean ground beef; 1 small onion, finely chopped; 1 large egg, lightly beaten; 3 tablespoons dry bread crumbs; 1 tablespoon chopped fresh thyme; 1 teaspoon salt; ground black pepper to taste; 2  mushrooms, thickly sliced; 1 tablespoon olive oil, or as needed",
  "directions": "1. Preheat an air fryer to 392 degrees F (200 degrees C). 2. Combine ground beef, onion, bread crumbs, thyme, egg, salt, and pepper in a bowl. Knead and mix thoroughly. Transfer mixture to a small loaf pan. Smooth the top, press in mushrooms, and coat with olive oil. 3. Roast meatloaf in the preheated air fryer until nicely browned, about 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (72 degrees C). 4. Let meatloaf rest at least 10 minutes before slicing into wedges and serving.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/146035/the-best-thai-coconut-soup/",
  "name": "The Best Thai Coconut Soup",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 tablespoon vegetable oil; 2 tablespoons grated fresh ginger; 2 teaspoons red curry paste; 1 stalk lemon grass, minced; 4 cups chicken broth; 3 tablespoons fish sauce; 1 tablespoon light brown sugar; 3 (13.5 ounce) cans coconut milk; ½ pound fresh shiitake mushrooms, sliced; 1 pound medium shrimp - peeled and deveined; 2 tablespoons fresh lime juice; salt to taste; ¼ cup chopped fresh cilantro",
  "directions": "1. Heat oil in a large pot over medium heat. Add ginger, curry paste, and lemongrass; cook and stir in the hot oil for 1 minute. 2. Gradually stir in chicken broth, then stir in fish sauce and brown sugar; reduce heat to low and simmer for 15 minutes. 3. Add coconut milk and mushrooms; cook and stir until mushrooms are soft, about 5 minutes. 4. Add shrimp; cook until no longer translucent, about 5 minutes. Stir in lime juice; season with salt and garnish with cilantro.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "368"
},
{
  "url": "https://www.allrecipes.com/recipe/14497/portobello-mushroom-burgers/",
  "name": "Portobello Mushroom Burgers",
  "rating": "4.6",
  "ratingcount": "966",
  "ingredients": "4  portobello mushroom caps; ¼ cup balsamic vinegar; 2 tablespoons olive oil; 1 tablespoon minced garlic; 1 teaspoon dried basil; 1 teaspoon dried oregano; salt and pepper to taste; 4 (1 ounce) slices provolone cheese",
  "directions": "1. Place mushroom caps, smooth side up, in a shallow dish. 2. Whisk together balsamic, oil, garlic, basil, and oregano in a small bowl. Season with salt and pepper. 3. Pour vinaigrette over mushrooms. Let stand at room temperature for 15 minutes or so, turning twice. 4. Preheat grill for medium-high heat. 5. Brush grill grates with oil. Place mushrooms on grill, reserving marinade for basting. Grill until just tender, 5 to 8 minutes per side, brushing with marinade frequently. 6. Top mushrooms with cheese and continue grilling until cheese is melted, about 2 minutes.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "203"
},
{
  "url": "https://www.allrecipes.com/recipe/14746/mushroom-pork-chops/",
  "name": "Mushroom Pork Chops",
  "rating": "4.4",
  "ratingcount": "2",
  "ingredients": "4  pork chops; salt and ground black pepper to taste; 1 pinch garlic salt, or to taste; ½ pound fresh mushrooms, sliced; 1  onion, chopped; 1 (10.75 ounce) can  condensed cream of mushroom soup",
  "directions": "1. Season pork chops with salt, pepper, and garlic salt. 2. Brown chops over medium-high heat in a large nonstick skillet. Add mushrooms and onion and sauté for one minute. 3. Pour soup over chops. Cover, reduce the heat to medium-low, and simmer until chops are cooked through, 20 to 30 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "210"
},
{
  "url": "https://www.allrecipes.com/recipe/269890/air-fryer-roasted-veggies/",
  "name": "Air-Fryer Roasted Veggies",
  "rating": "4.7",
  "ratingcount": "12",
  "ingredients": "½ cup diced zucchini; ½ cup diced summer squash; ½ cup diced mushrooms; ½ cup diced cauliflower; ½ cup diced asparagus; ½ cup diced sweet red pepper; 2 teaspoons vegetable oil; ¼ teaspoon salt; ¼ teaspoon ground black pepper; 1/4 teaspoon seasoning, or more to taste",
  "directions": "1. Gather all ingredients. 2. Preheat the air fryer to 360 degrees F (180 degrees C). 3. Add zucchini, squash, mushrooms, cauliflower, asparagus, red pepper, oil, salt, pepper, and desired seasoning to a large bowl. Toss to coat; arrange in a single layer in the fryer basket. 4. Cook, stirring halfway, in the preheated air fryer until tender crisp, about 10 minutes. 5. Serve hot and enjoy!",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "37"
},
{
  "url": "https://www.allrecipes.com/recipe/11786/hearty-vegetable-lasagna/",
  "name": "Hearty Vegetable Lasagna",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 (16 ounce) package lasagna noodles; 2 tablespoons vegetable oil; 1 pound fresh mushrooms, sliced; ¾ cup chopped green bell pepper; ¾ cup chopped onion; 3 cloves garlic, minced; 2 (26 ounce) jars pasta sauce; 1 teaspoon dried basil; 1 (15 ounce) container part-skim ricotta cheese; 4 cups shredded mozzarella cheese, divided; 2  eggs; ½ cup grated Parmesan cheese",
  "directions": "1. Cook lasagna noodles in a large pot of boiling water for 10 minutes, or until al dente. Rinse with cold water, and drain. 2. Heat oil in a large saucepan. Add mushrooms, green peppers, onion, and garlic; cook and stir until tender, about 5 minutes. Stir in pasta sauce and basil; bring to a boil. Reduce heat, and simmer for 15 minutes. 3. While the sauce is simmering, mix together ricotta, 2 cups mozzarella cheese, and eggs in a medium bowl. 4. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 5. Spread 1 cup cooked tomato and vegetable sauce into the bottom of the prepared baking dish. Lay down 1/2 of the lasagna noodles and layer 1/2 each of the ricotta mix, sauce, and Parmesan cheese on top. Repeat layering again with noodles, ricotta mix, sauce, and Parmesan cheese. Top with remaining 2 cups mozzarella. 6. Bake in the preheated oven, uncovered, for 40 minutes. Let stand for 15 minutes before serving.",
  "prep": "25 mins",
  "cook": "1 hr",
  "total": "1 hr 40 mins",
  "calories": "463"
},
{
  "url": "https://www.allrecipes.com/recipe/8778/cajun-chicken-pasta/",
  "name": "Cajun Chicken Pasta",
  "rating": "4.7",
  "ratingcount": "2",
  "ingredients": "4 ounces linguine pasta; 2  skinless, boneless chicken breast halves; 2 teaspoons Cajun seasoning; 2 tablespoons butter; 1  red bell pepper, sliced; 1  green bell pepper, sliced; 4  fresh mushrooms, sliced; 1  green onion, chopped; 1 cup heavy cream; ¼ teaspoon dried basil; ¼ teaspoon lemon pepper; ¼ teaspoon salt; ⅛ teaspoon garlic powder; ⅛ teaspoon ground black pepper; ¼ cup grated Parmesan cheese",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Add pasta and cook until al dente, 8 to 10 minutes. Drain. 2. Cut chicken breast into strips. Place chicken and Cajun seasoning in a plastic bag. Shake to coat. 3. Melt butter in a large skillet over medium heat. Add chicken and cook, stirring, until browned and almost cooked through, 5 to 7 minutes. 4. Add bell peppers, mushrooms, and green onion. Cook, stirring, 2 to 3 minutes. 5. Reduce the heat and stir in cream, basil, lemon pepper, salt, garlic powder, and black pepper. Heat through. Add cooked linguine, toss, and heat through. 6. Sprinkle with Parmesan and serve.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "935"
},
{
  "url": "https://www.allrecipes.com/recipe/172958/no-noodle-zucchini-lasagna/",
  "name": "No-Noodle Zucchini Lasagna",
  "rating": "4.6",
  "ratingcount": "669",
  "ingredients": "2 large zucchini; 1 tablespoon salt; 1 pound ground beef; 1 ½ teaspoons ground black pepper; 1 small green bell pepper, diced; 1  onion, diced; 1 (16 ounce) can tomato sauce; 1 cup tomato paste; ¼ cup red wine; 2 tablespoons chopped fresh basil; 1 tablespoon chopped fresh oregano; 3 tablespoons hot water, or as needed; 1 (15 ounce) container low-fat ricotta cheese; 1  egg; 2 tablespoons chopped fresh parsley; 1 (16 ounce) package frozen chopped spinach, thawed and drained; 1 pound fresh mushrooms, sliced; 8 ounces shredded mozzarella cheese; 8 ounces grated Parmesan cheese",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease a deep 9x13-inch baking pan. 2. Slice zucchini lengthwise into very thin slices. Sprinkle slices lightly with salt; set aside to drain in a colander. 3. To prepare the meat sauce, cook ground beef and black pepper in a large skillet over medium-high heat, stirring, for 5 minutes. Add green pepper and onion; cook and stir until meat is no longer pink. 4. Stir in tomato sauce, tomato paste, wine, basil, and oregano; add a small amount of hot water if sauce is too thick. Bring to a boil; reduce heat and simmer sauce for about 20 minutes, stirring frequently. 5. Meanwhile, stir ricotta, egg, and parsley together in a bowl until well combined. 6. To assemble lasagna, spread 1/2 of the meat sauce over the bottom of the prepared pan. Layer with 1/2 of the zucchini slices, 1/2 of the ricotta mixture, all of the spinach, followed by all of the mushrooms, then 1/2 of the mozzarella cheese. Repeat by layering in the remaining meat sauce, zucchini slices, ricotta mixture, and mozzarella. Spread Parmesan evenly over the top; cover with foil. 7. Bake in the preheated oven for 45 minutes. Remove foil; raise oven temperature to 350 degrees F (175 degrees C), and bake an additional 15 minutes. 8. Let lasagna stand 5 minutes before serving.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 35 mins",
  "calories": "494"
}]