[{
  "url": "https://www.allrecipes.com/recipe/19869/drupey-pie/",
  "name": "Drupey Pie",
  "rating": "4.9",
  "ratingcount": "10",
  "ingredients": "2 cups all-purpose flour; 1 teaspoon salt; .79100000858307 cup butter; 7 tablespoons ice water; 2 cups pitted sour cherries; 3  nectarines, pitted and chopped; 3  fresh apricots, pitted and sliced; ⅝ cup turbinado sugar; 1 pinch ground cinnamon; 1 tablespoon cornstarch; 2 tablespoons all-purpose flour; 2 tablespoons butter, cut into pieces; 1 teaspoon water; 1  egg yolk",
  "directions": "1. Preheat oven to 425 degrees F (220 degrees C). Place cherries, nectarines and apricots into a colander to drain off any excess liquid. 2. To Make Dough: In a medium bowl, combine flour and salt. Cut 3/4 cup of butter into flour mixture until it resembles coarse crumbs. Pour in one tablespoon of water at a time until the dough sticks together. Add additional water if necessary. Divide dough into two parts. Roll out one half toa circle 1/8 of an inch thick, then place in a 9 inch pie pan. Roll out the other half of the dough and cut into long strips about 1/2 inch wide. Set aside. 3. To Make Filling: Place the drained fruit mixture into a medium bowl, Stir in the sugar, cinnamon, cornstarch and flour; pour into the prepared pie pan. Dot with the remaining two tablespoons of butter. Arrange the pastry strips into a lattice top and crimp edges. In a small bowl, whisk together the egg yolk and teaspoon of water, and use a pastry brush to coat just the lattice strips--not the edges. 4. Bake in the preheated oven and bake for 25 minutes, until the crust begins to brown. Reduce the heat to 350 degrees F (175 degrees C) and bake for an additional 20 to 25 minutes. Remove from oven and let cool a bit before serving.",
  "prep": "1 hr",
  "cook": "50 mins",
  "total": "1 hr 50 mins",
  "calories": "423"
},
{
  "url": "https://www.allrecipes.com/recipe/263802/nectarine-mixed-fruit-cobbler-with-crunchy-topping/",
  "name": "Nectarine Mixed Fruit Cobbler with Crunchy Topping",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "½ cup water; ½ cup packed light brown sugar; 4 teaspoons cornstarch; 2 teaspoons ground cinnamon; ¼ teaspoon ground nutmeg; 2  ripe peaches, pitted and diced; 2  ripe nectarines, pitted and diced; 4  ripe plums, pitted and diced; 1 tablespoon lemon juice; 1 tablespoon butter; 1 cup all-purpose flour; 1 cup rolled oats; ¾ cup packed light brown sugar; ½ teaspoon ground cinnamon; ¼ teaspoon salt; 1 stick butter, softened",
  "directions": "1. Combine water, brown sugar, cornstarch, cinnamon, and nutmeg in a medium saucepan over medium heat. Stir until cornstarch is dissolved, about 3 minutes. Add peaches, nectarines, and plums; toss to coat. Cook, stirring often, until thick and bubbly and fruit is semi-soft, about 10 minutes. Remove from heat, stir in lemon juice and butter. Pour into a pie plate. 2. Preheat the oven to 325 degrees F (165 degrees C). 3. Mix flour, oats, brown sugar, cinnamon, and salt together in a bowl. Add butter and stir until combined. Mound topping over fruit. Place filled pie plate onto a baking sheet. 4. Bake in the preheated oven until topping is nicely browned, about 20 minutes. Serve warm.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "385"
},
{
  "url": "https://www.allrecipes.com/recipe/215586/summer-fruit-salad-ii/",
  "name": "Summer Fruit Salad II",
  "rating": "4.7",
  "ratingcount": "7",
  "ingredients": "3 cups cubed (1-inch) seedless watermelon; 1 large white peach, pitted and cut into small cubes; 1 large nectarine, pitted and cut into small cubes; 1  black plum, pitted and cut into small cubes; 1 cup fresh blueberries; ½ cup seedless red grapes, halved; ½ cup shredded coconut; 1 teaspoon ground cinnamon; ½ cup nondairy whipped topping (Optional)",
  "directions": "1. Gently toss the watermelon, peach, nectarine, plum, blueberries, and grapes together in a large bowl. Sprinkle the coconut and cinnamon over the fruit mixture and lightly stir to mix. Cover the bowl with plastic wrap and chill in refrigerator at least 1 hour before serving. Top with whipped topping as desired.",
  "prep": "25 mins",
  "cook": "",
  "total": "1 hr 25 mins",
  "calories": "60"
},
{
  "url": "https://www.allrecipes.com/recipe/215149/fresh-fruit-basket-cobbler/",
  "name": "Fresh Fruit Basket Cobbler",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "2 cups sliced fresh peaches; 2 cups sliced fresh nectarines; 2 cups pitted and quartered plums; 1 teaspoon cornstarch; 1 cup currant jelly; ½ teaspoon apple pie spice; ⅛ teaspoon white pepper; 1 (16.3 ounce) can refrigerated flaky biscuits (such as Pillsbury Grands!®); ¼ cup white sugar; ¼ teaspoon ground cinnamon",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Spray an 8x13-inch baking dish with cooking spray. 2. In a large bowl, lightly mix together the peach, nectarine, and plum slices until well mixed, and toss with the cornstarch to dust the fruit. Pour in the currant jelly, apple pie spice, and white pepper, and lightly mix again with your hands to coat the fruit with the jelly and seasonings. Spread the fruit into the prepared baking dish. 3. Pop open the can of biscuits, and cut them in half. Arrange the biscuit dough halves on top of the fruit. Mix the sugar and cinnamon in a small bowl, and sprinkle the mixture evenly on the biscuit dough. 4. Bake in the preheated oven until the biscuits are golden brown, 20 to 25 minutes. Allow to cool on a rack for at least 20 minutes to let the dish set up.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "358"
},
{
  "url": "https://www.allrecipes.com/recipe/258417/nectarine-bars/",
  "name": "Nectarine Bars",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 cups all-purpose flour; 1 ½ cups white sugar, divided; ½ cup butter; 3  nectarines, sliced, divided; 1 tablespoon cornstarch; 2  eggs",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Combine flour and 1/2 cup sugar in a 9x13-inch baking pan; cut in butter until mixture is crumbly. Press firmly into an even layer. 3. Bake in preheated oven until crust is slightly browned, about 25 minutes. 4. Place 1/3 of the nectarine slices in a blender and puree until smooth. Stir cornstarch into the mixture until evenly distributed. 5. Beat eggs in a large bowl until light, using an electric mixer; gradually beat in 1 cup sugar until well combined. Stir in the blended nectarine mixture; pour over hot baked crust. 6. Bake until almost set, about 30 minutes. Let cool completely on a rack, 30 minutes to 1 hour; cut into bars. Top bars with remaining nectarine slices.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "1 hr 45 mins",
  "calories": "268"
},
{
  "url": "https://www.allrecipes.com/recipe/215148/kks-three-fruit-cobbler/",
  "name": "KK's Three Fruit Cobbler",
  "rating": "4.4",
  "ratingcount": "11",
  "ingredients": "3  nectarines, pitted and cut into bite-size pieces; 3  tart plums, pitted and cut into bite-size pieces; ½ pint fresh raspberries; 1 cup all-purpose flour; ¾ cup white sugar; ¼ cup packed brown sugar; 1 teaspoon ground ginger; ½ teaspoon ground cinnamon; ⅔ cup cold unsalted butter",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Spread the nectarine and plum pieces into the bottom of a 13x9-inch baking dish. Sprinkle the raspberries over the fruit. Whisk together the flour, white sugar, brown sugar, ginger, and cinnamon in a bowl; cut the butter into the flour mixture with a pastry cutter until it resembles coarse crumbs. Spread the crumb mixture evenly over the fruit and raspberries. 3. Bake in the preheated oven for 15 minutes, and turn the dish around in the oven for even cooking. Bake another 10 to 15 minutes; if crumb topping is pale, place dish under broiler for 1 to 3 minutes to brown.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "334"
},
{
  "url": "https://www.allrecipes.com/recipe/214990/nectarine-sunshine-smoothie/",
  "name": "Nectarine Sunshine Smoothie",
  "rating": "4.6",
  "ratingcount": "33",
  "ingredients": "2 large  nectarines, pitted and quartered; 1  banana, cut into pieces and frozen; 1 large orange, peeled and quartered; 1 cup vanilla yogurt; 1 cup orange juice; 1 tablespoon honey",
  "directions": "1. Place the nectarines, frozen banana chunks, orange, vanilla yogurt, orange juice, and honey into a blender, and blend until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "30 mins",
  "calories": "184"
},
{
  "url": "https://www.allrecipes.com/recipe/263853/fresh-nectarine-cake-with-blackberries/",
  "name": "Fresh Nectarine Cake with Blackberries",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "½ cup unsalted butter, at room temperature; 2  eggs; ½ cup white sugar; 1 pinch salt; 1 ½ cups all-purpose flour; 1 ¼ teaspoons baking powder; 1 tablespoon milk, or more as needed (Optional); 3  fresh nectarines - peeled, halved, and pitted, or more to taste; 1 (6 ounce) container fresh blackberries, or more to taste; 1 tablespoon confectioners' sugar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch springform pan. 2. Beat butter in a large bowl with an electric mixer until creamy. Add sugar and salt gradually and mix in well. Add eggs one at a time, beating well after each addition. 3. Combine flour and baking powder, sift, and quickly beat into the batter on low speed. Thin batter with a little milk if needed. Pour batter into the prepared springform pan. Arrange nectarines and blackberries on top in a decorative pattern. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes. Dust with confectioners' sugar and cool on a wire rack for 5 minutes. Run a table knife around the edges to loosen. Invert carefully onto a serving plate or cooling rack. Let cool completely.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "288"
},
{
  "url": "https://www.allrecipes.com/recipe/265910/nectarine-jam/",
  "name": "Nectarine Jam",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "4 pounds nectarines - peeled, pitted, and chopped; 2 tablespoons lemon juice; 3 cups sugar; 1 (1.75 ounce) package fruit pectin (such as Sure-Jell® Pectin Light for less or no sugar); 3 drops almond extract, or to taste",
  "directions": "1. Inspect five (1/2-pint) jars for cracks and rings for rust; discard any defective ones. Immerse the jars and rings in simmering water until jam is ready. Wash new, unused lids and rings in warm soapy water. 2. Measure finely chopped, peeled nectarines; you should have 4 1/2 cups. Add to a heavy pot and immediately mix with lemon juice so they don't turn brown. 3. Combine 1/4 cup sugar and fruit pectin in a small bowl. Add to nectarines in the pot; stir well. Slowly bring mixture to a full rolling boil that does not stop bubbling when stirred. Add remaining 2 3/4 cups sugar and stir to dissolve, making sure to scrape over the bottom of the pot. Boil for exactly 1 minute, stirring constantly. 4. Remove from heat and stir in almond extract. 5. Pack jam into the prepared jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe the rims with a moist paper towel to remove any spills. Top with the lids and tightly screw on the rings. 6. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 10 minutes. 7. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart. Let rest for 24 hours without moving the jars. 8. Gently press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "1 day 40 mins",
  "calories": "78"
},
{
  "url": "https://www.allrecipes.com/recipe/88354/easy-batter-fruit-cobbler/",
  "name": "Easy Batter Fruit Cobbler",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "4 tablespoons butter; ¾ cup all-purpose flour; ¾ cup sugar; 1 teaspoon baking powder; ¼ teaspoon salt; ¾ cup milk; 2 cups of sliced fresh peaches or nectarines, or whole blueberries, strawberries, raspberries, blackberries or a combination of fruits (or a 12-ounce package of frozen berries); 1 tablespoon sugar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Adjust the oven rack to the upper-middle position. 2. Put butter in an 8-inch square or 9-inch round pan; place in the oven until butter is melted. Remove the pan from the oven and set aside. 3. Whisk flour, 3/4 cup sugar, baking powder, and salt in a medium bowl. Whisk in milk until a smooth batter forms. 4. Pour batter into the prepared pan with melted butter. 5. Scatter fruit over batter. Sprinkle with 1 tablespoon sugar. 6. Bake in the preheated oven until the top is lightly browned and fruit bubbles, 50 to 60 minutes. 7. Serve warm or at room temperature.",
  "prep": "15 mins",
  "cook": "55 mins",
  "total": "1 hr 10 mins",
  "calories": "384"
},
{
  "url": "https://www.allrecipes.com/recipe/266997/summer-salad-with-burrata-tomatoes-and-nectarines/",
  "name": "Summer Salad with Burrata, Tomatoes, and Nectarines",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "3  nectarines, pitted and chopped; 2 large heirloom tomatoes, chopped; 2 (4 ounce) balls Burrata cheese, cut into 3/4-inch pieces; 2 tablespoons fresh basil, chopped, or to taste; 5 tablespoons extra-virgin olive oil; 3 tablespoons white wine vinegar; 1 teaspoon Dijon mustard; ½ teaspoon honey; salt and freshly ground black pepper to taste",
  "directions": "1. Combine nectarines, tomatoes, burrata cheese, and basil in a bowl. 2. Stir together olive oil, vinegar, mustard, and honey. Season with salt and pepper. Drizzle dressing over salad.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "378"
},
{
  "url": "https://www.allrecipes.com/recipe/12392/nectarine-pie/",
  "name": "Nectarine Pie",
  "rating": "4.4",
  "ratingcount": "96",
  "ingredients": "⅔ cup white sugar; 4 tablespoons all-purpose flour; ½ teaspoon ground cinnamon; 1 cup heavy whipping cream; ¼ teaspoon almond extract; 5  nectarines; 1 (9 inch) unbaked pie shell",
  "directions": "1. Preheat oven to 400 degrees F (205 degrees C). Place a large pot of water over high heat, and bring to a boil. 2. Combine sugar, flour, cinnamon, heavy cream and almond extract. Set aside. 3. Place the nectarines in boiling water for 30 to 45 seconds. Immediately place nectarines under cold running water and remove skins. Cut nectarines in half and remove pits. Place halves in the pie shell with the cut side down. Pour the cream mixture around the nectarines. 4. Bake at 400 degrees F (205 degrees C) for 35 to 40 minutes. Good served warm or cold.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "333"
},
{
  "url": "https://www.allrecipes.com/recipe/263769/easy-grilled-nectarines/",
  "name": "Easy Grilled Nectarines",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "4  fresh nectarines, pitted and halved; 2 tablespoons unsalted butter, melted, divided; 4 tablespoons brown sugar, divided",
  "directions": "1. Brush each nectarine half with 1/4 tablespoon melted butter and sprinkle with 1/2 tablespoon brown sugar. 2. Preheat the grill to medium heat. 3. Place nectarines into an aluminum grill dish or directly onto the grill. Grill until lightly browned, turning occasionally, 3 to 5 minutes.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "162"
},
{
  "url": "https://www.allrecipes.com/recipe/244391/chef-johns-nectarine-salsa/",
  "name": "Chef John's Nectarine Salsa",
  "rating": "4.8",
  "ratingcount": "32",
  "ingredients": "1 cup finely diced nectarine; ½ cup finely diced red bell pepper; ⅓ cup finely diced onions; 2 tablespoons finely diced jalapeno pepper; 1 tablespoon chopped fresh cilantro; 1 tablespoon fresh lime juice; 2 teaspoons olive oil; ½ teaspoon salt, plus more to taste; 1 pinch cayenne pepper; 1 pinch freshly ground black pepper",
  "directions": "1. Combine nectarine, bell pepper, onions, jalapeño pepper, and cilantro in a medium bowl. Stir in lime juice, olive oil, salt, and cayenne pepper. Cover the bowl with plastic wrap. Refrigerate to let flavors develop, 30 minutes to 1 hour. 2. Stir in black pepper before serving. Add a pinch more salt if needed.",
  "prep": "20 mins",
  "cook": "",
  "total": "50 mins",
  "calories": "33"
},
{
  "url": "https://www.allrecipes.com/recipe/266537/spinach-nectarine-and-halloumi-salad/",
  "name": "Spinach, Nectarine, and Halloumi Salad",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "3 tablespoons white wine vinegar; 3 tablespoons extra-virgin olive oil; 3 teaspoons honey; 1 teaspoon Dijon mustard; ¼ teaspoon salt; ¼ teaspoon ground black pepper; ¼ teaspoon dried basil; 4 cups baby spinach; 1  nectarine, pitted and sliced; ¼ cup sliced almonds, toasted; 2 tablespoons thinly sliced red onion; 2 tablespoons thinly sliced red bell pepper; 1 (8.8 ounce) package halloumi cheese, sliced into 1/2-inch strips",
  "directions": "1. Whisk vinegar, olive oil, honey, mustard, salt, pepper, and basil together in a medium bowl. Set vinaigrette aside. 2. Toss 1/2 of the vinaigrette together with spinach, nectarine, almonds, red onion, and bell pepper in a large bowl. 3. Heat a nonstick skillet over medium-high heat. Add strips of halloumi and let cook until the undersides are golden brown and all liquid has been released and evaporates, about 4 minutes. Flip and cook until other side is golden brown, about 1 minute more. 4. Plate servings of salad, top with warm halloumi slices, and serve with remaining vinaigrette.",
  "prep": "20 mins",
  "cook": "5 mins",
  "total": "25 mins",
  "calories": "366"
},
{
  "url": "https://www.allrecipes.com/recipe/233648/summer-fruit-salad-with-whipped-cream/",
  "name": "Summer Fruit Salad with Whipped Cream",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "⅓ cup water; 5 tablespoons white sugar; ¼ cup raspberry-flavored liqueur (such as Chambord®); 2 tablespoons fresh lemon juice; 2 cups diced nectarines; 1 cup pitted and halved sweet cherries; 1 cup sliced strawberries; 1 cup fresh raspberries; 1 cup fresh blueberries; ⅓ cup heavy whipping cream; 2 teaspoons white sugar; 1 teaspoon raspberry-flavored liqueur (such as Chambord®); 3 tablespoons toasted slivered almonds",
  "directions": "1. Stir water, 5 tablespoons sugar, 1/4 cup raspberry-flavored liqueur, and lemon juice together in a saucepan over medium-low heat. Bring mixture to a boil, reduce heat to low, and simmer, frequently stirring, until sugar dissolves completely, about 8 minutes. Set aside to cool. 2. Mix nectarines, cherries, strawberries, raspberries, and blueberries in a large bowl. Pour cooled sugar mixture over fruit and toss gently to coat. 3. Beat heavy whipping cream and 2 teaspoons sugar in a bowl with an electric hand mixer on high until stiff peaks form. Fold 1 teaspoon raspberry-flavored liqueur into whipped cream; spoon over fruit salad and sprinkle evenly with almonds.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "168"
},
{
  "url": "https://www.allrecipes.com/recipe/247294/caramelized-nectarine/",
  "name": "Caramelized Nectarine",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "1  nectarine; 2 tablespoons white sugar; 2 tablespoons plain yogurt",
  "directions": "1. Cut nectarine all the way around and twist open. Remove pit. Sprinkle sugar on the cut side of each nectarine half. 2. Place nectarine, cut-side down, onto a griddle or in a skillet over medium heat; cook for 1 1/2 minutes. Transfer nectarines to a plate, cut-side up, and top each with plain yogurt.",
  "prep": "5 mins",
  "cook": "2 mins",
  "total": "7 mins",
  "calories": "88"
},
{
  "url": "https://www.allrecipes.com/recipe/143355/grilled-pork-chops-with-fresh-nectarine-salsa/",
  "name": "Grilled Pork Chops with Fresh Nectarine Salsa",
  "rating": "4.6",
  "ratingcount": "113",
  "ingredients": "2  nectarines, pitted and diced; 1  ripe tomato, seeded and diced; ¼ cup diced onion; 2 tablespoons chopped fresh cilantro; 2 tablespoons fresh lime juice; ¼ teaspoon crushed red pepper flakes, or to taste; salt to taste; 1 teaspoon ground cumin; 1 teaspoon chili powder; salt and ground black pepper to taste; 2 tablespoons olive oil; 8 (4 ounce) boneless pork loin chops",
  "directions": "1. Preheat an outdoor grill for medium-high heat. Lightly oil grate, and set 4 inches from the heat. 2. To make the salsa, place the nectarines, tomato, onion, cilantro, lime juice, and red pepper flakes in a bowl; toss to blend. Season to taste with salt. Cover, and refrigerate 30 minutes to blend flavors. 3. Stir the cumin, chili powder, salt, and pepper together in a small bowl. Place the olive oil in a small bowl. Brush the pork chops with oil, and season both sides evenly with the cumin mixture. 4. Place pork loin chops on the preheated grill. Cook until lightly browned and juices run clear, about 4 minutes on each side. Place pork chops on serving plates, and top with a generous spoonful of salsa.",
  "prep": "25 mins",
  "cook": "8 mins",
  "total": "33 mins",
  "calories": "419"
},
{
  "url": "https://www.allrecipes.com/recipe/14187/fabulous-fruit-salad/",
  "name": "Fabulous Fruit Salad",
  "rating": "4.6",
  "ratingcount": "212",
  "ingredients": "1  red apple, cored and chopped; 1  Granny Smith apple, cored and chopped; 1  nectarine, pitted and sliced; 2 stalks celery, chopped; ½ cup dried cranberries; ½ cup chopped walnuts; 1 (8 ounce) container nonfat lemon yogurt",
  "directions": "1. In a large bowl, combine red apple, Granny Smith apple, nectarine, celery, dried cranberries, and walnuts. Mix in yogurt. Chill until ready to serve.",
  "prep": "20 mins",
  "cook": "",
  "total": "20 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/228231/summer-fruit-salad-with-a-lemon-honey-and-mint-dressing/",
  "name": "Summer Fruit Salad with a Lemon, Honey, and Mint Dressing",
  "rating": "4.9",
  "ratingcount": "25",
  "ingredients": "4 cups cubed seeded watermelon; 2 cups sliced fresh strawberries; 2 large  fresh peaches, cut into cubes; 2 large  nectarines, cut into cubes; 1  red Anjou pear, cut into cubes; 1 cup seedless grapes, halved; 2  lemons, juiced; ¼ cup minced fresh mint (chocolate mint preferred); ½  lemon, zested; 1 tablespoon honey (fireweed honey preferred)",
  "directions": "1. Combine watermelon, strawberries, peaches, nectarines, pear, and grapes in a large mixing bowl. 2. Whisk lemon juice, mint, lemon zest, and honey together in a small bowl; drizzle over the fruit mixture and toss to coat. 3. Refrigerate 1 hour before serving.",
  "prep": "20 mins",
  "cook": "",
  "total": "1 hr 20 mins",
  "calories": "99"
},
{
  "url": "https://www.allrecipes.com/recipe/258812/peach-and-nectarine-crumble/",
  "name": "Peach and Nectarine Crumble",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "3 cups soft peaches, or as needed; 3 cups soft nectarines, or as needed; ½ cup white sugar (Optional); 3 tablespoons cornstarch; 1 teaspoon vanilla extract (Optional); 1 cup whole wheat flour; ½ cup brown sugar; ¼ cup extra-virgin coconut oil; 1 teaspoon baking powder; ½ teaspoon ground cinnamon (Optional); ¼ teaspoon salt",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Grease a 9-inch baking pan. 2. Boil peaches and nectarines 1 fruit at a time in a pot until very soft, about 30 seconds each. Let cool until ready to handle. Peel, core, and chop into bite-sized pieces. 3. Mix the fruit, sugar, cornstarch, and vanilla extract together in a large bowl. Pour into the prepared pan. 4. Combine flour, brown sugar, coconut oil, baking powder, cinnamon, and salt in a bowl. Mix with hands or a fork until crumbly. Sprinkle evenly over the fruit mixture. 5. Bake in the preheated oven until top is browned and juice appears bubbly, about 30 minutes. Let cool for at least 15 minutes before serving.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "1 hr 5 mins",
  "calories": "249"
},
{
  "url": "https://www.allrecipes.com/recipe/246155/flavored-water/",
  "name": "Flavored Water",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "½ small cucumber, sliced thin; ½  nectarine, pitted and chopped; ½  lemon, sliced; ½  lemon, juiced; ½  lime, sliced; ½  lime, juiced; 4 slices ginger root, peeled, or more to taste; 10  melissa leaves (lemon balm), or more to taste; 2 quarts water; 1 drop liquid stevia, or to taste",
  "directions": "1. Place cucumber, nectarine, lemon slices, lemon juice, lime slices, lime juice, ginger, and melissa leaves in a large pitcher; mash gently with a wooden spoon. Pour in water, stir, and refrigerate until flavors blend, 2 hours to overnight. Strain; serve over ice.",
  "prep": "15 mins",
  "cook": "",
  "total": "2 hrs 15 mins",
  "calories": "8"
},
{
  "url": "https://www.allrecipes.com/recipe/264546/vegan-overnight-oats-with-chia-seeds-and-fruit/",
  "name": "Vegan Overnight Oats with Chia Seeds and Fruit",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "1 ⅓ cups almond milk; 2  ripe bananas, mashed; 1 ¼ cups rolled oats; ¾ cup water; 4 tablespoons chia seeds; ½ teaspoon ground cinnamon; ¼ cup fresh blueberries; ¼ cup fresh blackberries; 1  nectarine, peeled and diced",
  "directions": "1. Combine almond milk, bananas, oats, water, chia seeds, and cinnamon in a jar or airtight container; stir together. Cover and refrigerate, 8 hours to overnight. 2. Place oat mixture in a saucepan over low heat and gently cook for about 5 minutes. Divide between 2 bowls and top with blueberries, blackberries, and nectarine.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "8 hrs 10 mins",
  "calories": "492"
},
{
  "url": "https://www.allrecipes.com/recipe/247291/nectarine-upside-down-cake/",
  "name": "Nectarine Upside-Down Cake",
  "rating": "4.2",
  "ratingcount": "10",
  "ingredients": "3 tablespoons butter, at room temperature; ¼ cup brown sugar (such as muscovado); 4  fresh nectarines, sliced into bite-size pieces; 2 cups all-purpose flour; 1 teaspoon baking powder; ¾ teaspoon salt; 11 tablespoons unsalted butter, at room temperature; ½ cup white sugar; 2  large eggs; 2 teaspoons vanilla extract",
  "directions": "1. Preheat oven to 340 degrees F (170 degrees C). Place butter in a 9-inch round cake pan and melt in the oven as it preheats. 2. Remove pan from oven and sprinkle brown sugar evenly over melted butter. Arrange nectarine pieces on the brown sugar layer. 3. Gently whisk flour, baking powder, and salt together in a bowl. Beat unsalted butter and white sugar together in a separate bowl until creamy and smooth; add eggs, 1 at a time, beating well after each addition. Beat vanilla extract into the creamed butter mixture. Add flour mixture to creamed butter mixture; beat on low speed just until batter is combined, about 1 minute. Spread batter over nectarine layer. 4. Increase oven temperature to 350 degrees F (180 degrees C). 5. Bake in the preheated oven until cake is golden brown and a toothpick inserted in the center comes out clean, 35 to 40 minutes. Cool cake in pan on a wire rack for 15 minutes. Run a knife around edge of pan and invert cake onto a serving plate. Serve warm or at room temperature.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "1 hr 15 mins",
  "calories": "327"
},
{
  "url": "https://www.allrecipes.com/recipe/36908/caribbean-chicken/",
  "name": "Caribbean Chicken",
  "rating": "4.0",
  "ratingcount": "38",
  "ingredients": "1 teaspoon paprika; 1 teaspoon onion powder; 1 teaspoon garlic powder; 1 teaspoon dried parsley; ½ teaspoon dried oregano; 1 teaspoon salt; 1 teaspoon pepper; 4  boneless, skinless chicken breast halves; ¼ cup duck sauce; ¼ cup marinara sauce; 1 teaspoon mango hot sauce; ¾ cup fresh pink grapefruit juice, divided; 1 cup Italian seasoned bread crumbs; 1  ripe nectarine, pitted and sliced",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Line a baking dish with parchment paper. 2. In a large bowl, mix together paprika, onion powder, garlic powder, parsley, oregano, salt and pepper. Toss with chicken breasts until evenly coated. In a bowl, combine duck sauce, marinara sauce, mango hot sauce and 1/4 cup grapefruit juice. Coat chicken evenly with sauce mixture. Place bread crumbs in a shallow dish, and dredge chicken until evenly breaded. Place chicken in baking dish. Place nectarine slices around the edge of baking dish. 3. Bake in preheated oven for 15 minutes. Turn the chicken, pour 1/2 cup grapefruit juice over chicken, and continue cooking for another 15 minutes or until done.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "319"
},
{
  "url": "https://www.allrecipes.com/recipe/73729/nectarine-salsa/",
  "name": "Nectarine Salsa",
  "rating": "4.1",
  "ratingcount": "8",
  "ingredients": "2  nectarines, pitted and chopped; ¼ medium red onion, finely chopped; ¼ cup balsamic vinegar; 1 teaspoon white sugar; ½ teaspoon dried cilantro; ½ teaspoon kosher salt; freshly ground black pepper to taste",
  "directions": "1. In a bowl, mix the nectarines, onion, vinegar, sugar, cilantro, salt, and pepper. Allow to sit 5 minutes. 2. In a skillet over medium heat, cook and stir the nectarine mixture 10 minutes, until onion and nectarines are tender and lightly browned.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "95"
},
{
  "url": "https://www.allrecipes.com/recipe/258418/summer-nectarine-tomato-and-cucumber-salad/",
  "name": "Summer Nectarine, Tomato, and Cucumber Salad",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "2  tomatoes, cut into chunks; ½  cucumber - peeled, seeded, and diced; 1 large ripe nectarine, diced; 3 tablespoons chopped fresh cilantro; 1 tablespoon olive oil; 3 tablespoons crumbled goat cheese",
  "directions": "1. Mix tomatoes, cucumber, nectarine, and cilantro together in a bowl. Stir in olive oil gently. Sprinkle goat cheese over salad.",
  "prep": "20 mins",
  "cook": "",
  "total": "20 mins",
  "calories": "83"
},
{
  "url": "https://www.allrecipes.com/recipe/263800/sticky-orange-chicken-with-nectarines/",
  "name": "Sticky Orange Chicken with Nectarines",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "½ cup orange juice; ¼ cup light soy sauce; 2 tablespoons buckwheat honey; 2 tablespoons hot sauce; 2 tablespoons brown sugar; 2 teaspoons chopped fresh ginger; 2 teaspoons chopped fresh garlic; 3 tablespoons all-purpose flour; salt and ground black pepper to taste; 1 pinch Italian seasoning; 4  skinless, boneless chicken breast halves; 1 tablespoon extra-virgin olive oil, or as needed; 2  nectarines, sliced",
  "directions": "1. Mix orange juice, soy sauce, honey, hot sauce, brown sugar, ginger, and garlic together in a small bowl to make the sauce. 2. Season flour lightly with salt, pepper, and Italian seasoning. Cut chicken breasts into 1/2-inch strips. Dredge chicken pieces in the seasoned flour; sprinkle more salt and pepper on top. 3. Heat oil in a large skillet over medium heat. Add chicken strips and brown on both sides, 1 to 2 minutes per side. Pour in the orange sauce. Reduce heat and simmer, uncovered, until sauce thickens and chicken is no longer pink in the centers, 8 to 10 minutes. 4. Plate the chicken and top with nectarine slices.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "285"
},
{
  "url": "https://www.allrecipes.com/recipe/275175/grilled-honey-nectarine-ricotta-toast/",
  "name": "Grilled Honey-Nectarine Ricotta Toast",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 teaspoon olive oil; 1 large nectarine, pitted and cut into 8 wedges; 2 thick slices crusty bread; 2 tablespoons olive oil; ¼ cup whole-milk ricotta cheese; 1 tablespoon crushed sliced almonds; 2 leaves fresh mint, minced; 2 teaspoons honey, or to taste",
  "directions": "1. Preheat an outdoor grill for medium-high heat and lightly oil grate. 2. Drizzle 1 teaspoon olive oil onto a small plate. Place nectarine wedges on the plate and cover all sides with oil. Brush both sides of bread with 2 tablespoons olive oil. 3. Place nectarines onto the hot grate and grill 1 to 2 minutes per side; remove to a plate. When nectarine wedges have cooled slightly, cut each wedge in 1/2 lengthwise so you now have 16 pieces. 4. Place bread slices onto the hot grate and cook until grill marks appear and bread is toasted, about 1 minute per side; remove to a plate. 5. Spread ricotta cheese onto each slice of toast. Arrange 8 nectarine slices onto each toast and top with almonds. Sprinkle with mint and drizzle with honey. Cut each toast in half and serve.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "336"
},
{
  "url": "https://www.allrecipes.com/recipe/259034/apple-and-nectarine-pie/",
  "name": "Apple and Nectarine Pie",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "cooking spray; 4  apples - peeled, cored and sliced, peel reserved; ½ cup white sugar; ½ cup light brown sugar; ½ cup water; ¼ cup brandy; 1 teaspoon ground cinnamon; 1 teaspoon vanilla extract; 1  pastry for 9-inch double-crust pie; ½ (8.5 ounce) package corn muffin mix (such as Jiffy®); ¼ cup milk; 4  nectarines, peeled and sliced",
  "directions": "1. Preheat oven to 425 degrees F (220 degrees C). Grease a 9-inch deep-dish pie plate. 2. Combine apple peels, white sugar, brown sugar, water, brandy, cinnamon, and vanilla extract in a saucepan; bring to a boil. Reduce temperature and simmer until fragrant, about 5 minutes. Remove apple peels with a fork. 3. Roll 1 crust into a 12-inch circle; place in the prepared pie plate. Roll out second crust into a 10-inch circle. Cut a few slits in the center to vent steam. 4. Mix corn muffin mix and milk in a bowl. Pour into pie plate. 5. Bake in the preheated oven for 5 to 8 minutes. Remove from oven. Layer apple slices and nectarine slices on top. Pour sugar mixture slowly over fruit; cover with second crust. Press crusts together to seal; flute edges. 6. Bake in the preheated oven for 10 minutes. Reduce heat to 350 degrees F (175 degrees C). Continue baking until top crust is golden brown, 35 to 45 minutes. Let cool to room temperature before slicing, about 1 hour.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "2 hrs 30 mins",
  "calories": "366"
},
{
  "url": "https://www.allrecipes.com/recipe/265422/nectarine-raspberry-crumble/",
  "name": "Nectarine-Raspberry Crumble",
  "rating": "4.0",
  "ratingcount": "2",
  "ingredients": "3 ½ pounds nectarines; 1 (6 ounce) container fresh raspberries; 2 tablespoons white sugar; ¾ cup brown sugar; 7 tablespoons unsalted butter, room temperature and cut into chunks; ¾ cup all-purpose flour; ½ cup rolled oats; 1 teaspoon ground cinnamon; ½ teaspoon ground nutmeg; ¼ teaspoon salt",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Bring a large pot of water to a boil. Submerge nectarines for about 30 seconds. Remove with a slotted spoon and let cool until safe to handle. Peel, halve, remove pit, and slice. Combine sliced nectarines, raspberries, and white sugar in a bowl. Transfer to a baking dish. 3. Combine brown sugar, butter, flour, oats, cinnamon, nutmeg, and salt in a bowl. Rub between your fingers to create streusel. Sprinkle streusel evenly over fruit. 4. Bake in the preheated oven until crumble is lightly browned, 45 to 60 minutes.",
  "prep": "20 mins",
  "cook": "50 mins",
  "total": "1 hr 10 mins",
  "calories": "455"
},
{
  "url": "https://www.allrecipes.com/recipe/142435/nectarine-blush/",
  "name": "Nectarine Blush",
  "rating": "4.3",
  "ratingcount": "19",
  "ingredients": "2  nectarines, pitted and chopped; 2 tablespoons brown sugar; 1 cup buttermilk",
  "directions": "1. Place the nectarines, brown sugar and buttermilk in the bowl of a blender and blend until smooth. Serve immediately.",
  "prep": "2 mins",
  "cook": "2 mins",
  "total": "4 mins",
  "calories": "160"
}]