[{
  "url": "https://www.allrecipes.com/recipe/278661/chocolate-espresso-banana-muffins/",
  "name": "Chocolate Espresso Banana Muffins",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "½ cup unsalted butter, melted; 1 cup brown sugar; 2  eggs; 3  ripe bananas; 1 ½ cups all-purpose flour; 1 cup oat flour; 2 tablespoons unsweetened cocoa powder; 2 tablespoons instant espresso powder; 1 tablespoon ground cinnamon; 1 teaspoon salt; ½ teaspoon baking soda",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line 18 muffin cups with paper liners. 2. Pour melted butter into the bowl of an electric mixer and add brown sugar, eggs, and bananas. Mix until combined. Mix in all-purpose flour, oat flour, cocoa, espresso, cinnamon, salt, and baking soda until combined. 3. Spoon batter evenly into the prepared muffin cups. 4. Bake in the preheated oven until tops spring back when lightly pressed, about 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "162"
},
{
  "url": "https://www.allrecipes.com/recipe/255110/gluten-free-chocolate-chip-cookie-waffles/",
  "name": "Gluten-Free Chocolate Chip Cookie Waffles",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "2 cups almond milk; ½ cup vanilla Greek-style yogurt; ¼ cup melted butter; 2 teaspoons vanilla extract; 1 ¾ cups gluten-free flour blend; 1 cup gluten-free chocolate chips; ¼ cup gluten-free oat flour; 3 tablespoons white sugar; 1 ½ teaspoons baking powder; ¼ teaspoon salt",
  "directions": "1. Preheat a waffle iron according to manufacturer's instructions. 2. Whisk milk, yogurt, butter, and vanilla extract together in a bowl. 3. Mix gluten-free flour, chocolate chips, oat flour, sugar, baking powder, and salt together in a bowl. Stir milk mixture into the flour mixture until well incorporated. Let batter stand, about 10 minutes. 4. Pour 1/2 cup of batter onto the preheated iron and bake until crisp and golden, according to manufacturer's instructions, about 3 minutes. Transfer to a wire rack to cool. Repeat with remaining batter.",
  "prep": "10 mins",
  "cook": "3 mins",
  "total": "23 mins",
  "calories": "493"
},
{
  "url": "https://www.allrecipes.com/recipe/259230/no-bake-peanut-butter-banana-protein-bars/",
  "name": "No-Bake Peanut Butter Banana Protein Bars",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "2  bananas; ¾ cup freshly ground peanut butter; 2 teaspoons honey; ¾ cup oat flour; ½ cup coconut flour; ¼ cup pea protein powder",
  "directions": "1. Puree bananas, peanut butter, and honey in a food processor until smooth. Place mixture in a bowl and add oat flour, coconut flour, and pea powder. Stir until combined. 2. Press into a 10-inch square pan and refrigerate until hardened, about 30 minutes.",
  "prep": "10 mins",
  "cook": "",
  "total": "40 mins",
  "calories": "245"
},
{
  "url": "https://www.allrecipes.com/recipe/234749/gluten-free-heart-friendly-carrot-pancakes/",
  "name": "Gluten-Free Heart-Friendly Carrot Pancakes",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "½ cup chopped walnuts; 2 ½ cups gluten-free oat flour; 1 ½ teaspoons baking soda; 1 teaspoon ground cinnamon; 1 teaspoon cream of tartar; ½ teaspoon salt; 1 (14.5 ounce) can sliced carrots; 1 ½ cups orange juice; 1 cup water; 1 jumbo egg, beaten; 2 tablespoons walnut oil; 1 tablespoon canola oil, or as needed",
  "directions": "1. Pulse walnuts in a food processor or blender until finely crushed; transfer to a large bowl. Whisk oat flour, baking soda, cinnamon, cream of tartar, and salt with the walnuts. 2. Puree carrots in a food processor; transfer to a separate bowl. Whisk orange juice, water, egg, and walnut oil with the pureed carrots until smooth; stir into the dry ingredients to make a rich and hearty batter. Set batter aside to rest for 5 minutes. 3. Heat a small amount of canola oil in a nonstick skillet over medium heat. Tilt skillet to coat cooking surface with oil. 4. Stir the batter again with the whisk. Use a 1/4-cup measuring cup to spoon out the batter, but do not fill the measuring cup. Drop small amounts of the batter into the skillet. 5. Cook pancakes until the edges start to look dry, 3 to 5 minutes; turn and continue cooking until the other side is browned, 3 to 5 minutes more.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "81"
},
{
  "url": "https://www.allrecipes.com/recipe/278907/moist-orange-cake-with-olive-oil/",
  "name": "Moist Orange Cake with Olive Oil",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "3  eggs; 1 cup monk fruit sugar substitute; ⅔ cup olive oil; 2 medium oranges, zested and juiced; 1 teaspoon vanilla extract; 2 ¼ cups oat flour; 2 teaspoons baking powder",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease and flour a 9x13-inch baking pan. 2. Beat eggs in a large bowl and mix in monk fruit sweetener and olive oil. Stir in orange zest, orange juice, and vanilla extract. 3. Combine flour and baking powder in another bowl; stir into the egg mixture until just blended. Pour into the prepared pan. 4. Bake in the preheated oven until a knife inserted into the center of the cake comes out clean, 40 to 45 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "207"
},
{
  "url": "https://www.allrecipes.com/recipe/245866/chocolate-chip-cookie-dough-protein-bites/",
  "name": "Chocolate Chip Cookie Dough Protein Bites",
  "rating": "3.5",
  "ratingcount": "2",
  "ingredients": "2 cups all-purpose flour; ⅔ cup soy protein powder (such as MLO®); ⅓ cup oat flour; 1 cup white sugar; 1 cup brown sugar; ½ cup plain Greek yogurt; ½ cup butter, softened; 2 teaspoons vanilla extract; 2 tablespoons milk, or more as needed; 2 cups chocolate chips",
  "directions": "1. Combine all-purpose flour, soy protein powder, and oat flour together in a bowl. 2. Beat white sugar, brown sugar, yogurt, and butter together in a large bowl with an electric mixer until smooth and creamy. Add vanilla extract. Stir in flour mixture. Mix in milk, 1 tablespoon at a time, until batter is thick and smooth. Fold in chocolate chips. 3. Roll batter into 1-inch balls with your hands. Arrange on a baking sheet. Transfer to the freezer and chill until firm, about 1 hour, or in the refrigerator, 2 to 3 hours.",
  "prep": "20 mins",
  "cook": "",
  "total": "1 hr 20 mins",
  "calories": "118"
},
{
  "url": "https://www.allrecipes.com/recipe/234876/bacon-bourbon-apple-pancakes/",
  "name": "Bacon Bourbon Apple Pancakes",
  "rating": "4.8",
  "ratingcount": "27",
  "ingredients": "2 teaspoons canola oil, divided; 2 cups diced apples; 2 tablespoons white sugar, divided; 2 teaspoons ground cinnamon; ¾ cup milk; 2 tablespoons melted butter; 1  egg; 1 ½ teaspoons bourbon whiskey; ½ teaspoon vanilla extract; ½ cup all-purpose flour; ½ cup oat flour; 1 tablespoon baking powder; ½ teaspoon salt; 2 tablespoons chopped cooked bacon",
  "directions": "1. Heat 1 teaspoon canola oil in a skillet over medium heat; cook and stir apples, 1 tablespoon sugar, and cinnamon in the hot oil until apples are slightly softened, 5 to 10 minutes. Remove skillet from heat. 2. Whisk milk, butter, egg, bourbon, and vanilla extract together in a bowl. Sift all-purpose flour, oat flour, 1 tablespoon sugar, baking powder, and salt together in a separate bowl. Stir flour mixture into milk mixture until batter is well mixed; fold in apples and bacon. 3. Heat remaining 1 teaspoon canola oil in a skillet over medium heat; drop batter, about 1/2 cup per pancake, onto the griddle, and cook until bubbles form and the edges are dry, 3 to 5 minutes. Flip pancake and cook until browned on the other side, 3 to 5 more minutes. Repeat with remaining batter.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "309"
},
{
  "url": "https://www.allrecipes.com/recipe/245913/blueberry-oatmeal-breakfast-bars/",
  "name": "Blueberry Oatmeal Breakfast Bars",
  "rating": "4.4",
  "ratingcount": "46",
  "ingredients": "1 cup whole oats; 1 cup oat flour; ½ cup brown sugar; ½ teaspoon salt; ½ teaspoon baking soda; ½ cup almond milk; 2  eggs; ¼ cup melted butter; 1 teaspoon vanilla extract; 1 cup fresh blueberries; ½ cup chopped walnuts; ⅓ cup shredded coconut (Optional)",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square pan. 2. Combine whole oats, oat flour, brown sugar, salt, and baking soda together in a bowl. Stir in almond milk, eggs, butter, and vanilla extract until well combined. Fold in blueberries and walnuts. Spread mixture into prepared square pan; top with shredded coconut. 3. Bake in the preheated oven until edges are golden and coconut is brown; about 35 minutes. Cool in the pan for 10 minutes before cutting into squares.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "324"
},
{
  "url": "https://www.allrecipes.com/recipe/241345/chocolate-almond-coconut-breakfast-bars/",
  "name": "Chocolate Almond Coconut Breakfast Bars",
  "rating": "4.3",
  "ratingcount": "4",
  "ingredients": "1 cup whole oats; 1 cup oat flour; ½ teaspoon salt; ½ teaspoon baking soda; 2  eggs; ½ cup dark chocolate-flavored almond milk; ½ cup brown sugar; 1 teaspoon vanilla extract, or to taste; ½ cup dry-roasted cocoa almonds; ½ cup semi-sweet chocolate chips; ½ cup shredded coconut",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish. 2. Combine oats, oat flour, salt, and baking soda in a bowl. Add eggs, almond milk, brown sugar, and vanilla extract and mix well. Fold almonds, chocolate chips, and coconut into oats mixture; pour into the prepared baking dish. 3. Bake in the preheated oven until set in the middle, about 40 minutes. Cool before cutting into squares.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "280"
},
{
  "url": "https://www.allrecipes.com/recipe/67396/staffordshire-oatcakes/",
  "name": "Staffordshire Oatcakes",
  "rating": "3.3",
  "ratingcount": "11",
  "ingredients": "1 ½ cups warm water; 1 ½ cups warm milk; 1 tablespoon white sugar; 1 (.25 ounce) envelope active dry yeast; 2 ½ cups oat flour; 2 cups whole wheat flour; 1 teaspoon salt",
  "directions": "1. Place warm water and warm milk into a large bowl. Stir in sugar and yeast, and let stand for 5 minutes, or until frothy. Mix in oat flour, whole wheat flour and salt, blending thoroughly. Cover bowl, and let stand in a warm place for 1 hour. 2. Heat a large griddle or two skillets over medium heat, and grease well. Spoon enough batter onto the pan to make a thin pancake about 8 inches across for each one. Cook for 2 to 3 minutes, or until the top surface is covered with holes. Turn over and brown on the other side. Place oatcakes on a warm plate until ready to serve. Best served immediately, but can be frozen and heated later.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "1 hr 45 mins",
  "calories": "165"
},
{
  "url": "https://www.allrecipes.com/recipe/255594/pear-and-almond-tart-dairy-and-gluten-free/",
  "name": "Pear and Almond Tart (Dairy and Gluten Free)",
  "rating": "4.9",
  "ratingcount": "9",
  "ingredients": "1 ¼ cups almond meal; ¼ cup gluten-free oat flour; ½ teaspoon gluten-free baking powder; 1 large egg, beaten; ¼ cup maple syrup; 2 tablespoons coconut oil, melted; 1 teaspoon vanilla extract; ¼ teaspoon sea salt; ¼ teaspoon almond extract; 1 ½ (16 ounce) cans pear halves, drained and patted dry",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease the bottom of a tart pan with a removable bottom and line with parchment paper. 2. Mix together almond meal, oat flour, and baking powder in a medium bowl. 3. Whisk egg, maple syrup, coconut oil, vanilla, salt, and almond extract in a large bowl. Fold in almond meal mixture to form a sticky dough. 4. Press dough into the prepared tart pan. Arrange pears on top. 5. Bake in the preheated oven until golden brown, 22 to 25 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "234"
},
{
  "url": "https://www.allrecipes.com/recipe/71604/lemon-poppyseed-scones/",
  "name": "Lemon Poppyseed Scones",
  "rating": "4.3",
  "ratingcount": "7",
  "ingredients": "2 cups oat flour; 1 ¼ cups whole wheat pastry flour; 1 ¼ cups all-purpose flour; 4 teaspoons baking powder; ¾ teaspoon salt; ½ cup white sugar; ½ cup shortening; ½ cup butter; 1 tablespoon grated lemon zest; 2 tablespoons poppy seeds; ⅔ cup buttermilk; 1 tablespoon melted butter",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. In a large bowl, stir together the oat flour, whole wheat flour, all-purpose flour, baking powder, salt and sugar. Cut in shortening and 1/2 cup of butter until the lumps are smaller than peas. Stir in the lemon zest and poppy seeds. Make a well in the center and pour in the buttermilk. Stir just until the dry ingredients are moistened. 3. Divide the dough into 2 pieces. Pat each one into a 1 inch thick circle. Cut circles into 6 wedges like a pie. Place pieces onto a baking sheet, and brush the tops with melted butter. 4. Bake for 12 to 15 minutes in the preheated oven, until lightly browned. Cool on a wire rack so they do not get too crumbly.",
  "prep": "30 mins",
  "cook": "12 mins",
  "total": "42 mins",
  "calories": "341"
},
{
  "url": "https://www.allrecipes.com/recipe/260828/dark-chocolate-butternut-squash-bread/",
  "name": "Dark Chocolate Butternut Squash Bread",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "cooking spray; ½ cup unsweetened applesauce; ⅓ cup nonfat Greek yogurt; ¼ cup coconut oil; ½ cup sucralose-sugar blend for baking (such as Truvia® Baking Blend); 2  large egg whites; ¼ cup unsweetened almond milk; ½ cup pureed butternut squash; 1 ½ teaspoons almond extract; ⅔ cup unsweetened cocoa powder; 1 teaspoon sea salt; 1 teaspoon baking soda; 1 teaspoon baking powder; 1 ⅓ cups oat flour; ¼ cup miniature chocolate chips, divided",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Spray a loaf pan with cooking spray. 2. Blend applesauce, Greek yogurt, and coconut oil together in a bowl using an electric mixer. Mix in sucralose-sugar blend until combined. Add egg whites and almond milk; blend until fluffy. Mix in butternut squash and almond extract. Add cocoa powder, salt, baking soda, and baking powder; mix to combine. Add oat flour slowly, mixing batter until no dry spots remain. Fold in about chocolate chips by hand, reserving a few to sprinkle on top. 3. Pour batter into the prepared pan; sprinkle the remaining chocolate chips over the batter. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 45 to 50 minutes. Let cool in pan for 1 hour.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "1 hr 55 mins",
  "calories": "198"
},
{
  "url": "https://www.allrecipes.com/recipe/242290/snickerdoodles-with-a-hint-of-ginger/",
  "name": "Snickerdoodles With a Hint of Ginger",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "1 ½ cups white sugar; 1 cup salted butter, softened; 2  eggs; 2 teaspoons vanilla extract; 3 cups all-purpose flour; 1 cup oat flour; 2 teaspoons cream of tartar; 1 teaspoon baking soda; 2 tablespoons white sugar; 2 teaspoons ground cinnamon; ¼ teaspoon ground ginger",
  "directions": "1. Beat 1 1/2 cups sugar, butter, eggs, and vanilla extract together in a large bowl until smooth and creamy. 2. Sift all-purpose flour, oat flour, cream of tartar, and baking soda together into a bowl. Beat 1/2 of the flour mixture into butter mixture; and remaining flour mixture and beat until dough is just combined. Cover the bowl with plastic wrap and refrigerate until chilled, about 30 minutes. 3. Preheat oven to 400 degrees F (200 degrees C). Line baking sheets with parchment paper. 4. Whisk 2 tablespoons sugar, cinnamon, and ginger together in a shallow bowl. 5. Roll chilled dough into 1 1/2-inch balls and roll each ball in cinnamon-sugar mixture to coat. Place coated dough 2-inches apart on prepared baking sheets. 6. Bake in the preheated oven until golden and set, 9 to 11 minutes. Cool on the baking sheet for 5 minutes before removing to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "1 hr",
  "calories": "100"
},
{
  "url": "https://www.allrecipes.com/recipe/274529/high-protein-banana-bread/",
  "name": "High-Protein Banana Bread",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "1  serving nonstick cooking spray; 1 ¼ cups oat flour; ½ cup white sugar; ½ cup chopped walnuts; 2 scoops chocolate protein powder (such as Premier Protein®); 3 teaspoons ground cinnamon; 1 ½ teaspoons baking powder; ½ teaspoon baking soda; 3  overripe bananas, mashed; ½ cup unsweetened applesauce; ¼ cup milk; 2  large egg whites; 3 teaspoons pure vanilla extract",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Spray a 9x5-inch loaf pan with cooking spray. 2. Mix together oat flour, sugar, walnuts, protein powder, cinnamon, baking powder, and baking soda in a medium bowl. 3. Mix together mashed bananas, applesauce, milk, egg whites, and vanilla extract in a large bowl. Slowly add flour mixture to banana mixture; stirring until just combined. Transfer batter into the prepared loaf pan. 4. Bake in the preheated oven until top of bread springs back when lightly pressed and a toothpick inserted into the center comes out clean, 35 to 40 minutes. Cool in the pan for 10 minutes. Transfer to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "193"
},
{
  "url": "https://www.allrecipes.com/recipe/268954/pumpkin-banana-oat-muffins/",
  "name": "Pumpkin-Banana-Oat Muffins",
  "rating": "4.8",
  "ratingcount": "11",
  "ingredients": "1 cup all-purpose flour; 1 cup oat flour; 1 teaspoon baking soda; 1 teaspoon baking powder; 1 teaspoon salt; 1 teaspoon cinnamon; 1 teaspoon ground ginger; 1 teaspoon ground nutmeg; ½ teaspoon ground cloves; 1 stick butter, softened; ½ cup brown sugar; ¼ cup white sugar; 2  eggs; ½ cup vanilla Greek yogurt; 1 teaspoon vanilla extract; 1 cup pumpkin puree; ¾ cup mashed ripe bananas; ½ cup semisweet chocolate chips; ½ cup chopped toasted pecans; 1 cup vanilla-coconut granola; ¾ cup semisweet chocolate chips; ½ cup chopped toasted pecans",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine flour, oat flour, baking soda, baking powder, salt, cinnamon, ginger, nutmeg, and cloves in a bowl. 3. Combine butter, brown sugar, and white sugar in a separate bowl and mix well using an electric mixer. Add eggs, yogurt, and vanilla extract and mix again on medium speed. Add pumpkin puree and mashed bananas and blend. Fold in chocolate chips and pecans. Stir flour mixture into batter. 4. Combine granola, chocolate chips, and pecans in a bowl and set topping aside. 5. Spoon batter into the prepared muffin cups, filling each 2/3 full. Sprinkle with topping. 6. Bake in the preheated oven until a toothpick inserted in the center comes out clean, 25 to 30 minutes.",
  "prep": "25 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "427"
},
{
  "url": "https://www.allrecipes.com/recipe/276476/gluten-free-gingersnap-cookies/",
  "name": "Gluten-Free Gingersnap Cookies",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "¾ cup unsalted butter, softened; ½ cup brown sugar; ½ cup unbleached cane sugar; 1  egg; ¼ cup blackstrap molasses; 1 teaspoon vanilla extract; 1 cup oat flour; ½ cup almond flour; ⅓ cup coconut flour; 1 (1/4 inch thick) slice fresh ginger, grated; 1 tablespoon ground ginger; 1 teaspoon baking soda; 1 teaspoon ground cinnamon; 1 teaspoon ground nutmeg; ½ teaspoon ground cloves; ¼ cup unbleached cane sugar, or as needed; ½ teaspoon ground cinnamon, or as needed; ¼ teaspoon ground nutmeg, or as needed",
  "directions": "1. Beat butter, brown sugar, and 1/2 cup cane sugar together in a bowl using an electric mixer until creamy. Add egg and mix to combine. Mix in molasses and vanilla extract. 2. Mix oat flour, almond flour, coconut flour, fresh ginger, ground ginger, baking soda, 1 teaspoon cinnamon, 1 teaspoon nutmeg, and cloves together in a separate bowl. Add to butter mixture slowly and combine. Refrigerate dough for at least 1 hour, to overnight; dough will be very wet before it's chilled. 3. Preheat the oven to 350 degrees F (175 degrees C). Line 2 large baking sheets with parchment paper. 4. Combine 1/4 cup cane sugar, 1/2 teaspoon cinnamon, and 1/4 teaspoon nutmeg in a shallow dish. 5. Scoop dough by tablespoonfuls and roll into balls. Roll balls in cinnamon-sugar mixture to coat and place onto the prepared baking sheets, making sure not to overcrowd the sheets as they will flatten and spread. 6. Bake in the preheated oven until set and golden, 10 to 12 minutes. Let cookies sit for 5 minutes before transferring to a wire rack to cool. Serve warm or let cool completely before storing in an airtight container.",
  "prep": "30 mins",
  "cook": "10 mins",
  "total": "1 hr 45 mins",
  "calories": "123"
},
{
  "url": "https://www.allrecipes.com/recipe/258751/vegan-zucchini-bread-muffins/",
  "name": "Vegan Zucchini Bread Muffins",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "½ cup warm water; 6 tablespoons flax seed meal; 1 cup turbinado sugar; ¾ cup unsweetened applesauce; ¼ cup safflower oil; 1 teaspoon vanilla extract; 2 ½ cups zucchini, grated; 2 cups oat flour; 1 cup all-purpose flour; 1 tablespoon baking powder; 1 tablespoon ground cinnamon; 2 teaspoons ground nutmeg; 1 teaspoon salt; ½ teaspoon baking soda; 1 cup raisins",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease 2 muffin pans. 2. Whisk warm water and flaxseed together in a large bowl. Mix in sugar, applesauce, oil, and vanilla extract. Stir in zucchini until well combined. 3. Sift oat flour, all-purpose flour, baking powder, cinnamon, nutmeg, salt, and baking soda into a bowl. Stir in raisins and combine with the zucchini mixture until batter is just mixed. 4. Transfer batter into muffin cups using 1/4 cup measure. 5. Bake in the preheated oven until a knife inserted into a muffin comes out clean, 50 to 55 minutes.",
  "prep": "25 mins",
  "cook": "50 mins",
  "total": "1 hr 15 mins",
  "calories": "133"
},
{
  "url": "https://www.allrecipes.com/recipe/275879/gluten-free-hamburger-buns/",
  "name": "Gluten-Free Hamburger Buns",
  "rating": "4.3",
  "ratingcount": "4",
  "ingredients": "2 tablespoons white sugar; 1 tablespoon active dry yeast; 2 cups warm water; 1 ½ cups rice flour; 1 ½ cups gluten-free oat flour; ¾ cup tapioca starch; ¾ cup cornstarch; 1 tablespoon xanthan gum; 1 teaspoon salt; 5  eggs; ½ cup canola oil; 1 tablespoon sesame seeds (Optional)",
  "directions": "1. Preheat the oven to 200 degrees F (95 degrees C). 2. Dissolve sugar and yeast in warm water in a bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes. 3. Combine rice flour, oat flour, tapioca starch, cornstarch, xanthan gum, and salt in a mixing bowl; mix to combine. Add yeast mixture, eggs, and oil; mix using an electric mixer on high speed for 3 minutes. 4. Distribute batter evenly between between eighteen 5-inch pie tins. Place onto 2 large cookie sheets. Sprinkle buns with sesame seeds. 5. Allow to rise in the preheated warm oven, 30 to 40 minutes. 6. Set the oven temperature to 400 degrees F (200 degrees C) without removing the buns. 7. Bake in the hot oven for 15 minutes. Switch baking sheets on oven racks and continue to bake until golden, 12 to 15 minutes more.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "1 hr 25 mins",
  "calories": "207"
},
{
  "url": "https://www.allrecipes.com/recipe/262611/dee-licious-greek-yogurt-banana-bread/",
  "name": "Dee-licious Greek Yogurt Banana Bread",
  "rating": "4.7",
  "ratingcount": "11",
  "ingredients": "2 cups mashed bananas; ½ cup plain Greek yogurt; ¾ cup butter; ⅔ cup white sugar; ⅔ cup brown sugar; 2  eggs, beaten; 1 teaspoon vanilla extract; 2 cups all-purpose flour; 1 cup oat flour; 1 cup rolled oats; 2 teaspoons baking soda; 1 ½ teaspoons baking powder; 1 teaspoon salt; 1 cup chocolate chips; 1 cup chopped walnuts",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease two 9x5-inch loaf pans. 2. Mix mashed bananas and yogurt together in a bowl. 3. Combine butter, white sugar, and brown sugar in a large bowl; beat using an electric mixer until creamy. Add eggs and vanilla extract and stir to combine. Add banana mixture and mix well. 4. Stir flour, oat flour, rolled oats, baking soda, baking powder, and salt together in a bowl. Add to the banana-butter mixture and stir just until combined. Don't overmix. Fold chocolate chips and walnuts into the batter. Divide batter between the prepared pans. 5. Bake in the preheated oven until a knife inserted into the center comes out clean, 50 to 60 minutes. Remove from the oven and cover loosely with aluminum foil for 5 minutes. Remove from the pans and allow to cool completely.",
  "prep": "20 mins",
  "cook": "50 mins",
  "total": "1 hr 15 mins",
  "calories": "372"
},
{
  "url": "https://www.allrecipes.com/recipe/242242/barley-oat-pancakes/",
  "name": "Barley Oat Pancakes",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "1 cup oat flour; 1 cup barley flour; ¼ cup wheat germ; 2 tablespoons brown sugar; 1 tablespoon baking powder; 1 teaspoon salt; 1 ½ cups skim milk, or as needed; 2  eggs, slightly beaten; ½  banana, mashed; 2 tablespoons honey; 1 tablespoon oil; 1 teaspoon vanilla extract",
  "directions": "1. Mix oat flour, barley flour, wheat germ, brown sugar, baking powder, and salt together in a bowl; make a well in the center. Stir milk, eggs, banana, honey, oil, and vanilla extract together in a separate bowl. Pour milk mixture into the well in the flour mixture and gently stir just until batter is moistened and slightly lumpy. Add more milk to thin the batter, if desired. 2. Heat a griddle or skillet over medium-low heat. Drop a small amount of water on surface. If water bounces, the griddle is ready. Lightly grease the griddle by running a paper towel dabbed with oil around the bottom of the griddle. 3. Drop batter by large spoonfuls onto the griddle forming 4- to 6-inch circles and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "417"
},
{
  "url": "https://www.allrecipes.com/recipe/74935/zucchini-yogurt-multigrain-muffins/",
  "name": "Zucchini Yogurt Multigrain Muffins",
  "rating": "4.6",
  "ratingcount": "322",
  "ingredients": "1 ½ cups all-purpose flour; ¾ cup whole wheat flour; ¾ cup oat flour; 1 teaspoon salt; 1 teaspoon baking soda; 1 teaspoon baking powder; 2 ½ teaspoons ground cinnamon; ¼ teaspoon ground nutmeg; 3  eggs; ½ cup vegetable oil; ½ cup unsweetened applesauce; 1 cup plain yogurt; 1 cup white sugar; ¾ cup honey; 2 teaspoons vanilla extract; 1 cup shredded zucchini; 1 cup shredded carrots; ½ cup chopped pecans (Optional); ½ cup raisins (Optional)",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Lightly grease 24 muffin cups. 2. In a bowl, sift together the all-purpose flour, whole wheat flour, oat flour, salt, baking powder, baking soda, cinnamon, and nutmeg. In a separate bowl, beat together eggs, vegetable oil, applesauce, yogurt, sugar, honey, and vanilla. Mix the flour mixture into the egg mixture. Fold in the zucchini, carrots, pecans, and raisins. Scoop into the prepared muffin cups. 3. Bake 18 to 20 minutes in the preheated oven, until a toothpick inserted in the center of a muffin comes out clean. Cool 10 minutes before transferring to wire racks to cool completely.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "55 mins",
  "calories": "207"
},
{
  "url": "https://www.allrecipes.com/recipe/242025/thanksgiving-muffins/",
  "name": "Thanksgiving Muffins",
  "rating": "5.0",
  "ratingcount": "7",
  "ingredients": "½ cup sweetened dried cranberries (such as Craisins®); 1 cup hot water, or as needed; 1 cup whole wheat flour; 1 cup white sugar; ½ cup oat flour; 1 teaspoon baking powder; 1 teaspoon baking soda; 1 teaspoon salt; 1 teaspoon ground cinnamon; ½ teaspoon ground nutmeg; 1 (15 ounce) can sweet potatoes, undrained; 3  eggs; ¼ cup coconut oil; ½ cup chopped pecans",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease 6 jumbo muffin cups or line with paper liners. 2. Soak dried cranberries in a bowl of hot water until plump, about 10 minutes; drain. 3. Combine whole wheat flour, white sugar, oat flour, baking powder, baking soda, salt, cinnamon, and nutmeg together in a bowl. Beat sweet potatoes, eggs, and coconut oil together in a separate bowl until smooth; stir into flour mixture until batter is smooth. Fold plump sweetened cranberries and pecans into batter; spoon into prepared muffin cups. 4. Bake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, 25 to 30 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "505"
},
{
  "url": "https://www.allrecipes.com/recipe/218056/easy-roasted-almond-cookies/",
  "name": "Easy Roasted Almond Cookies",
  "rating": "4.6",
  "ratingcount": "26",
  "ingredients": "1 cup raw whole almonds; 1 cup oat flour; ½ cup real maple syrup; 1 teaspoon almond extract",
  "directions": "1. Preheat oven to 275 degrees F (135 degrees C). Spread the almonds onto a baking sheet, and toast until the nuts start to turn golden brown and become fragrant, about 45 minutes. Watch the nuts carefully as they bake, they burn quickly. Once toasted, set the nuts aside to cool to room temperature. Finely grind the almonds in a food processor. 2. Raise oven temperature to 350 degrees F (175 degrees C). Oil a baking sheet with vegetable oil. 3. In a bowl, mix together the ground almonds, oat flour, maple syrup, and almond extract. Form the mixture into 6 balls, then flatten the balls into cookies about 1/4 inch thick. Place cookies onto the prepared baking sheet. 4. Bake until crisp and brown around the edges, 12 to 15 minutes; watch them carefully because they burn easily. Remove the cookies carefully, and allow to cool.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 45 mins",
  "calories": "268"
},
{
  "url": "https://www.allrecipes.com/recipe/229356/whole-wheat-oat-waffles/",
  "name": "Whole Wheat Oat Waffles",
  "rating": "4.7",
  "ratingcount": "45",
  "ingredients": "½ cup whole wheat pastry flour; ½ cup all-purpose flour; 1 cup oat flour; ¼ cup white sugar; 1 tablespoon baking powder; ½ teaspoon salt; 2  eggs, separated; 1 ½ cups milk; 2 tablespoons canola oil; 1 teaspoon vanilla extract",
  "directions": "1. Preheat a waffle maker according to manufacturer's directions. 2. Whisk whole wheat flour, all-purpose flour, oat flour, sugar, baking powder, and salt together in a bowl. Whisk egg yolks, milk, canola oil, and vanilla extract in a separate bowl. Beat egg whites in a third bowl (not plastic) with an electric mixer until soft peaks form when you lift the beaters straight out of the beaten eggs, 1 to 2 minutes. 3. Make a well in the dry ingredients and pour the milk mixture into the well; mix batter until smooth. Gently fold the egg whites into the batter, retaining as much volume as possible. Let batter stand until slightly thickened, about 5 minutes. 4. Pour 1/2 cup of batter, or amount recommended by the manufacturer, onto the waffle maker; close lid and bake waffle until browned and crisp, 2 to 4 minutes.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "55 mins",
  "calories": "257"
},
{
  "url": "https://www.allrecipes.com/recipe/25562/banana-crunch-cake/",
  "name": "Banana Crunch Cake",
  "rating": "4.3",
  "ratingcount": "39",
  "ingredients": "¾ cup rolled oats; ⅓ cup packed brown sugar; 2 tablespoons butter, melted; 2 tablespoons chopped walnuts; ½ cup shortening; ⅔ cup white sugar; 1 cup mashed banana; 2  eggs; 1 teaspoon vanilla extract; 1 cup oat flour; ¾ cup all-purpose flour; 1 teaspoon baking soda; 1 teaspoon salt; ½ cup chopped walnuts",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8x8 inch pan. Make the oat crunch topping: In a small bowl, combine the rolled oats, brown sugar, melted butter and 2 tablespoons chopped walnuts. Mix well and set aside. 2. In a large bowl, cream shortening and white sugar until light and fluffy. Blend in bananas, eggs, and vanilla. Combine the oat flour, all-purpose flour, baking soda and salt. Beat into creamed mixture. Stir in 1/2 cup chopped walnuts. Pour batter into the prepared pan. Sprinkle with the oat crunch topping. 3. Bake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "459"
},
{
  "url": "https://www.allrecipes.com/recipe/244773/honey-wheat-oat-flour-bread-machine-bread/",
  "name": "Honey Wheat Oat Flour Bread Machine Bread",
  "rating": "4.5",
  "ratingcount": "22",
  "ingredients": "¾ cup water (80 degrees F/27 degrees C); ¾ cup milk (80 degrees F/27 degrees C); 1 ½ tablespoons vegetable oil; 6 tablespoons honey; 1 ½ teaspoons salt; ¾ cup oats; 1 cup oat flour; 1 ¼ cups wheat flour; 1 ¼ cups bread flour; 1 ½ teaspoons active dry yeast",
  "directions": "1. Place warm water, milk, oil, honey, salt, oats, oat flour, wheat flour, bread flour, and yeast in the pan of a bread machine in the order listed. 2. Set cycle for light crust according to manufacturer's instructions.",
  "prep": "10 mins",
  "cook": "3 hrs 20 mins",
  "total": "3 hrs 30 mins",
  "calories": "184"
},
{
  "url": "https://www.allrecipes.com/recipe/263129/best-gluten-free-pita-bread/",
  "name": "Best Gluten-Free Pita Bread",
  "rating": "5.0",
  "ratingcount": "8",
  "ingredients": "1 ¼ cups gluten-free oat flour (such as Bob's Red Mill®); ½ cup potato starch; ⅓ cup cornstarch; ⅓ cup tapioca flour; 2 tablespoons xanthan gum; 1 tablespoon active dry yeast; 1 teaspoon white sugar; 1 teaspoon salt; 1 cup warm milk; 1  egg; ¼ cup olive oil; 1 teaspoon apple cider vinegar",
  "directions": "1. Combine oat flour, potato starch, cornstarch, tapioca flour, xanthan gum, yeast, sugar, and salt in the bowl of a stand mixer; whisk until well mixed, about 1 minute. 2. Whisk milk, egg, olive oil, and vinegar together in a separate bowl until well combined, about 1 minute. Stir milk mixture in gradually to the flour mixture on low speed; mix until a soft dough comes together, about 5 minutes. 3. Line 2 baking sheets with parchment paper. Divide dough into 6 equal pieces; roll each piece on a floured surface to a 6-inch circle. Place on the prepared baking sheets; cover with plastic wrap and set aside for 1 to 1 1/2 hours. 4. Preheat the oven to 450 degrees F (230 degrees C). Heat a pizza stone in the oven. 5. Spray pita breads with water and place them straight on the hot pizza stone. 6. Bake in the preheated oven until puffed and lightly golden, 5 to 7 minutes.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "1 hr 20 mins",
  "calories": "308"
},
{
  "url": "https://www.allrecipes.com/recipe/274251/pumpkin-pie-oat-flour-muffins/",
  "name": "Pumpkin Pie-Oat Flour Muffins",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 ½ cups oat flour; ½ cup packed brown sugar; 1 teaspoon baking powder; 1 teaspoon ground cinnamon; ½ teaspoon baking soda; ½ teaspoon ground nutmeg; ¼ teaspoon ground ginger; ¼ teaspoon ground cloves; ¼ teaspoon salt; 1 cup pumpkin puree; 2  eggs; ½ cup honey; ¼ cup unsweetened applesauce; ¼ cup vegetable oil",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 12-cup muffin tin or line with paper liners. 2. Mix oat flour, brown sugar, baking powder, cinnamon, baking soda, nutmeg, ginger, cloves, and salt together in a large bowl using a fork. Combine pumpkin puree, eggs, honey, applesauce, and oil in a separate bowl. Add pumpkin mixture to flour mixture and stir using a spatula until well combined. 3. Spoon batter into the prepared muffin tin, filling cups 3/4 full. 4. Bake until a fork or toothpick inserted in a cupcake center comes out clean, 22 to 25 minutes.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "186"
},
{
  "url": "https://www.allrecipes.com/recipe/269702/homemade-einkorn-spelt-bread/",
  "name": "Homemade Einkorn Spelt Bread",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 ⅓ cups water; 2 cups spelt flour; 2 cups einkorn flour; ½ cup oat flour; ¼ cup flax seeds; 2 tablespoons white sugar; 2 tablespoons butter; 1 ½ teaspoons salt; 2 teaspoons fast-rising yeast; ⅓ cup milk, or as needed (Optional)",
  "directions": "1. Place water, spelt flour, einkorn flour, oat flour, flax seeds, sugar, butter, salt, and yeast in a bread machine in the order listed by the manufacturer. Run Wheat cycle. 2. Check dough's moisture level while the machine is mixing; add enough milk to reach a smooth, damp consistency. Remove dough from the machine after the cycle is done, about 1 hour 45 minutes.",
  "prep": "10 mins",
  "cook": "",
  "total": "1 hr 55 mins",
  "calories": "118"
},
{
  "url": "https://www.allrecipes.com/recipe/259136/whole-grain-carrot-peach-muffins/",
  "name": "Whole Grain Carrot Peach Muffins",
  "rating": "4.1",
  "ratingcount": "9",
  "ingredients": "2 tablespoons butter, slightly softened; ¼ cup rolled oats; 1 tablespoon dark brown sugar; 1 tablespoon all-purpose flour; ¼ teaspoon ground cinnamon; ½ cup all-purpose flour; ½ cup white whole-wheat flour; ½ cup oat flour; 1 ½ teaspoons baking powder; 1 teaspoon ground cinnamon; ½ teaspoon baking soda; ½ cup canola oil; ½ cup white sugar; 2  large eggs; 1 teaspoon vanilla extract; 1 ½ cups diced peaches; 1 cup grated carrots",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a muffin pan with paper liners. 2. Combine butter, rolled oats, dark brown sugar, 1 tablespoon all-purpose flour, and 1/4 teaspoon cinnamon in a bowl. Mix with a fork or fingers until crumbly. 3. Whisk 1/2 cup all-purpose flour, white whole-wheat flour, oat flour, baking powder, 1 teaspoon cinnamon, and baking soda together in a large bowl. 4. Whisk oil, sugar, eggs, and vanilla extract together in a separate bowl. Pour into flour mixture; fold until batter is just combined. Fold peaches and carrots in gently. 5. Spoon batter into prepared muffin pan, about 2/3 full. Sprinkle with oat topping. 6. Bake in the preheated oven until an inserted toothpick comes out clean, about 15 minutes. Cool in the pan for 5 to 10 minutes; transfer muffins to a wire rack to cool completely.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "214"
},
{
  "url": "https://www.allrecipes.com/recipe/236410/coconut-chocolate-chip-waffles/",
  "name": "Coconut Chocolate Chip Waffles",
  "rating": "4.7",
  "ratingcount": "12",
  "ingredients": "1 cup bread flour; 1 cup oat flour; 2 tablespoons white sugar; 1 tablespoon baking powder; ½ teaspoon ground cinnamon; ½ teaspoon salt; 1 ⅔ cups unsweetened almond milk; ½ cup unsweetened applesauce; ⅓ cup coconut oil, melted; ½ cup chocolate chips",
  "directions": "1. Preheat a waffle iron according to manufacturer's instructions. 2. Whisk bread flour, oat flour, sugar, baking powder, cinnamon, and salt together in a bowl. Mix almond milk, applesauce, and coconut oil together in a separate bowl; stir into flour mixture until batter is just combined. Fold chocolate chips into batter; let stand for 5 minutes. 3. Scoop 1/4 to 1/2 cup batter into preheated waffle iron; cook according to manufacturer's instructions, about 4 minutes per waffle.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "418"
},
{
  "url": "https://www.allrecipes.com/recipe/268952/gluten-free-gingersnaps/",
  "name": "Gluten-Free Gingersnaps",
  "rating": "3.5",
  "ratingcount": "4",
  "ingredients": "1 ½ cups white sugar, divided; ¾ cup margarine; 1  egg; ¼ cup molasses; 2 cups oat flour; 1 tablespoon ground ginger; 3 teaspoons baking powder; 1 teaspoon ground cinnamon; ½ teaspoon salt; ½ teaspoon ground cardamom",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line cookie sheets with parchment paper. 2. Beat 1 cup sugar and margarine together in a medium bowl until creamy. Beat in egg and molasses until well blended. 3. Combine oat flour, ginger, baking powder, cinnamon, salt, and cardamom in another bowl; stir into the molasses mixture to form a dough. 4. Roll dough into 1-inch balls and rolls in the remaining 1/2 cup sugar. Place cookies 2 inches apart on the prepared cookie sheets. 5. Bake in the preheated oven until tops are slightly cracked, 15 to 18 minutes. Let cookies cool for 5 minutes before removing to a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "40 mins",
  "calories": "95"
},
{
  "url": "https://www.allrecipes.com/recipe/241411/apple-oatmeal-breakfast-cups/",
  "name": "Apple Oatmeal Breakfast Cups",
  "rating": "4.6",
  "ratingcount": "35",
  "ingredients": "1 cup whole oats; 1 cup oat flour; 1 teaspoon ground cinnamon; ½ teaspoon allspice; ½ teaspoon baking soda; ½ teaspoon salt; 2 large apples - peeled, cored, and chopped; ¾ cup plain yogurt; 2  eggs; ½ cup brown sugar; ¼ cup butter, melted; 1 teaspoon vanilla extract; ½ cup chopped walnuts",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Generously grease muffin cups or line with paper liners. 2. Combine oats, oat flour, cinnamon, allspice, baking soda, and salt in a large bowl. Add apples, yogurt, eggs, brown sugar, butter, and vanilla extract to oat mixture until batter is well mixed; fold in walnuts. Pour batter into the prepared muffin cups. 3. Bake in the preheated oven until a toothpick inserted in the center comes out clean, about 25 minutes.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "227"
},
{
  "url": "https://www.allrecipes.com/recipe/235955/betsys-best-gluten-free-muffins/",
  "name": "Betsy's Best Gluten-Free Muffins",
  "rating": "3.3",
  "ratingcount": "3",
  "ingredients": "1 cup white rice flour; ¾ cup white sugar; ½ cup oat flour; ½ cup all-purpose gluten-free flour; 1 tablespoon baking powder; ½ teaspoon ground cinnamon; 1  egg; ⅔ cup milk; ⅓ cup vegetable oil; ⅓ cup yogurt; ½ teaspoon vanilla extract; ½ cup chopped walnuts; ½ cup raisins; ½ cup pumpkin puree",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Line muffin cups with paper liners. 2. Mix rice flour, sugar, oat flour, all-purpose flour, baking powder, and cinnamon together in a large bowl. 3. Beat egg, milk, vegetable oil, yogurt, and vanilla together in a separate bowl until smooth; add to the dry ingredients and mix by hand until mostly smooth with only small lumps and you cannot see any patches of dry material in the batter. Gently stir walnuts, raisins, and pumpkin puree into the batter; spoon into prepared muffin cups to about 2/3 full. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "259"
},
{
  "url": "https://www.allrecipes.com/recipe/223436/vegan-lemon-scones-with-chia/",
  "name": "Vegan Lemon Scones with Chia",
  "rating": "4.9",
  "ratingcount": "28",
  "ingredients": "1 cup whole wheat flour; 1 cup oat flour; 1 teaspoon baking powder; 1 teaspoon baking soda; ¼ teaspoon salt; 1 tablespoon chia seeds; ¼ cup white sugar; 3 tablespoons coconut oil; ⅓ cup soy milk; 2 tablespoons lemon juice; 2 tablespoons lemon zest; ¾ cup confectioners' sugar; 1 ½ tablespoons lemon juice; 1 tablespoon lemon zest",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Combine whole wheat flour, oat flour, baking powder, baking soda, salt, chia seeds, and white sugar in a bowl. Mix in coconut oil in until the mixture is crumbly. Stir in soy milk, 2 tablespoons lemon juice, and 2 tablespoons lemon zest until a dough forms. 3. Transfer dough to a bowl and knead in bowl until workable, about 8 times. Gently roll into a ball and turn out onto a lightly floured surface. Press into a circle about 1 inch thick; cut into 10 wedges. Place scones onto prepared baking sheet. 4. Bake in preheated oven until edges are lightly golden brown, 18 to 20 minutes. 5. Mix confectioners' sugar, 1 1/2 tablespoon lemon juice, and 1 tablespoon lemon zest in a small bowl. Drizzle or spread frosting on top of scones while still warm.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "176"
}]