[{
  "url": "https://www.allrecipes.com/recipe/11291/chocolate-revel-bars/",
  "name": "Chocolate Revel Bars",
  "rating": "4.5",
  "ratingcount": "215",
  "ingredients": "3 cups quick cooking oats; 2 ½ cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon salt; 2 cups packed brown sugar; 1 cup butter, softened; 2 large eggs; 2 teaspoons vanilla extract; 1 (14 ounce) can sweetened condensed milk; 1 ½ cups semisweet chocolate chips; 2 tablespoons butter; ½ teaspoon salt; ½ cup chopped walnuts; 2 teaspoons vanilla extract",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking pan. 2. Make the oatmeal batter: Combine oats, flour, baking soda, and salt in a bowl. 3. Beat brown sugar and butter with an electric mixer in a large bowl until fluffy. Mix in eggs and vanilla. Stir in flour mixture until combined. 4. Make the filling: Heat condensed milk, chocolate chips, butter, and salt in a medium saucepan over low heat, stirring frequently, until smooth, 5 to 8 minutes. Remove from the heat and stir in walnuts and vanilla. 5. Pat 2/3 of the oatmeal batter into the bottom of the prepared pan. Spread filling evenly over top, then dot with remaining batter. 6. Bake in the preheated oven for 30 to 35 minutes. Remove to a wire rack and let cool completely before cutting into 24 bars.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "358"
},
{
  "url": "https://www.allrecipes.com/recipe/98390/megans-granola/",
  "name": "Megan's Granola",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "8 cups rolled oats; 1 ½ cups wheat germ; 1 ½ cups oat bran; 1 cup sunflower seeds; 1 cup finely chopped almonds; 1 cup finely chopped pecans; 1 cup finely chopped walnuts; 1 cup vegetable oil; ¾ cup honey; ½ cup brown sugar; ¼ cup maple syrup; 1 tablespoon ground cinnamon; 1 tablespoon vanilla extract; 1 ½ teaspoons salt; 2 cups raisins",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Line two large baking sheets with parchment paper or aluminum foil. 2. Combine oats, wheat germ, oat bran, sunflower seeds, almonds, pecans, and walnuts in a large bowl. 3. Stir oil, honey, brown sugar, maple syrup, cinnamon, vanilla, and salt together in a saucepan over medium heat. Bring to a boil, then pour over dry ingredients and stir to coat. Transfer to the prepared baking sheets and spread out evenly. 4. Bake in the preheated oven until crispy and toasted, about 20 minutes, stirring once halfway through. Let cool for 15 to 20 minutes, then stir in raisins.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "1 hr",
  "calories": "306"
},
{
  "url": "https://www.allrecipes.com/recipe/244756/blackberry-crisp/",
  "name": "Blackberry Crisp",
  "rating": "4.8",
  "ratingcount": "52",
  "ingredients": "1 cup rolled oats; 1 cup brown sugar; ¾ cup all-purpose flour, divided; ½ cup butter, softened; 4 cups fresh blackberries",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine oats, brown sugar, and 1/2 cup flour in a bowl. Cut in butter with a pastry blender until mixture is moistened and crumbly. 3. Spread blackberries into an 8-inch square baking dish. Sprinkle with remaining 1/4 cup flour and toss to coat. Sprinkle oat mixture over top. 4. Bake in the preheated oven until golden brown, 35 to 40 minutes.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "318"
},
{
  "url": "https://www.allrecipes.com/recipe/279653/homemade-dog-treats/",
  "name": "Homemade Dog Treats (Tango's Treats)",
  "rating": "4.7",
  "ratingcount": "24",
  "ingredients": "1 ¼ cups grated carrots; 1 ¼ cups quick-cooking oats; 1 cup grated apple; ½ cup natural peanut butter; 2  eggs",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line two baking sheets with parchment paper. 2. Mix carrots, oats, and apple together in a large bowl. Whisk peanut butter and eggs together in a second bowl; pour into the oat mixture and stir until thoroughly combined. 3. Drop 1 1/2 tablespoonfuls of batter onto the prepared baking sheets. Use your hands to flatten each scoop to a thickness of 1/2 inch. 4. Bake in the preheated oven until treats are firm to the touch and begin to brown on the bottom, 15 to 20 minutes. Let cool briefly on the baking sheets before removing to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "72"
},
{
  "url": "https://www.allrecipes.com/recipe/10403/preacher-cookies/",
  "name": "Preacher Cookies",
  "rating": "4.5",
  "ratingcount": "159",
  "ingredients": "2 cups white sugar; ½ cup butter; ½ cup milk; 4 tablespoons unsweetened cocoa powder; ⅛ teaspoon salt; 3 cups quick cooking oats; ½ cup crunchy peanut butter; 1 teaspoon vanilla extract",
  "directions": "1. Mix sugar, butter, milk, cocoa, and salt together in a saucepan over medium-high heat. Boil for 1 minute. 2. Stir in oats, peanut butter, and vanilla. Drop by tablespoonfuls onto waxed paper. Allow to cool and harden, 30 to 45 minutes.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "45 mins",
  "calories": "117"
},
{
  "url": "https://www.allrecipes.com/recipe/218929/slow-cooker-oats/",
  "name": "Slow Cooker Oats",
  "rating": "4.0",
  "ratingcount": "416",
  "ingredients": "3 ½ cups water; 1 cup steel-cut oats; 1 cup peeled and chopped apple; ½ cup raisins; 2 tablespoons butter; 2 tablespoons brown sugar; 1 tablespoon ground cinnamon; 1 teaspoon vanilla extract",
  "directions": "1. Combine water, steel-cut oats, apple, raisins, butter, brown sugar, cinnamon, and vanilla in a slow cooker; stir until well combined and sugar is dissolved. Cover and cook on Low until oats are tender and creamy, 6 to 7 hours. For a softer texture, cook for 8 hours.",
  "prep": "10 mins",
  "cook": "6 hrs",
  "total": "6 hrs 10 mins",
  "calories": "208"
},
{
  "url": "https://www.allrecipes.com/recipe/25030/caramel-bars/",
  "name": "Caramel Bars",
  "rating": "4.7",
  "ratingcount": "627",
  "ingredients": "32  individually wrapped caramels, unwrapped; 5 tablespoons heavy cream; 1 cup all-purpose flour; 1 cup rolled oats; ¾ cup brown sugar; ½ teaspoon baking soda; ¼ teaspoon salt; ¾ cup butter, melted; ½ cup semisweet chocolate chips; ½ cup chopped walnuts",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Make sauce: Melt together caramels and heavy cream in a medium saucepan over low heat; stir occasionally until smooth. Set sauce aside. 3. Make bars: Mix together flour, oats, brown sugar, baking soda, and salt in a medium bowl. Stir in melted butter until well blended. Press 1/2 of the oat mixture into the bottom of a 9x13-inch baking dish. 4. Bake crust in the preheated oven for 8 minutes. Remove from the oven. Sprinkle crust with chocolate chips and walnuts. Drizzle with sauce and crumble remaining oat mixture on top. 5. Continue baking until the top is lightly toasted, about 12 more minutes. Cut into squares while still warm.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "195"
},
{
  "url": "https://www.allrecipes.com/recipe/233999/mushroom-veggie-burger/",
  "name": "Mushroom Veggie Burger",
  "rating": "4.8",
  "ratingcount": "196",
  "ingredients": "4 tablespoons olive oil, divided; 3 (8 ounce) packages sliced fresh mushrooms; ½ medium onion, finely chopped; 4 cloves garlic, minced; 1 teaspoon salt; ½ teaspoon black pepper; ½ teaspoon dried oregano; ¾ cup dry bread crumbs; ⅔ cup rolled oats; ½ cup freshly shredded Parmigiano-Reggiano cheese; 2 large eggs, beaten",
  "directions": "1. Heat 2 tablespoons oil in a large skillet over medium heat. Add mushrooms, onion, garlic, salt, pepper, and oregano; cook and stir until mushrooms have released their juices and the liquid has evaporated, about 10 minutes. Remove from the heat. 2. Transfer mushrooms to a cutting board and clean the skillet. 3. Chop mushrooms into small chunks, then transfer to a large bowl. Mix in bread crumbs and oats, and season with salt and pepper as needed. Stir in Parmigiano-Reggiano cheese, then eggs; let stand until bread crumbs have absorbed any excess liquid, about 15 minutes. Use moist hands to form mixture, 1/4 cup at a time, into patties. 4. Heat remaining 2 tablespoons oil in the skillet over medium heat. Pan-fry patties in the hot skillet until golden brown and cooked through, 2 1/2 to 3 minutes per side.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "255"
},
{
  "url": "https://www.allrecipes.com/recipe/223467/granola-bars/",
  "name": "Granola Bars",
  "rating": "4.3",
  "ratingcount": "117",
  "ingredients": "cooking spray; 2 cups rolled oats; ½ cup shredded coconut; ½ cup honey; 2 tablespoons creamy peanut butter; 1 teaspoon vanilla extract; ⅛ teaspoon salt",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Grease a 9-inch square baking dish. 2. Spread oats and coconut evenly across a baking sheet. 3. Toast oats and coconut in the preheated oven until browned, about 10 minutes; transfer to a large mixing bowl. 4. Mix honey, peanut butter, vanilla, and salt in a saucepan over medium-low heat. Cook and stir until smooth. Pour honey mixture over oats and coconut. Stir to coat. Spread mixture evenly into the prepared baking dish. 5. Bake in the preheated oven until beginning to dry, about 15 minutes for crunchy granola bars, less if you like them chewy. Cool completely before cutting.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "1 hr 40 mins",
  "calories": "188"
},
{
  "url": "https://www.allrecipes.com/recipe/10338/no-bakes/",
  "name": "No Bakes",
  "rating": "4.7",
  "ratingcount": "510",
  "ingredients": "3 cups quick cooking oats; 1 cup shredded coconut (Optional); ½ cup crunchy peanut butter; 1 tablespoon vanilla extract; 2 cups white sugar; ½ cup milk; ½ cup butter; 3 tablespoons unsweetened cocoa powder; cooking spray",
  "directions": "1. Line two rimmed baking sheets with parchment paper. Stir oats, coconut, peanut butter, and vanilla together in a large bowl with a spatula until well combined. 2. Combine sugar, milk, butter, and cocoa powder in a saucepan over medium heat. Stir occasionally and gradually bring mixture to a boil. Once boiling, stir constantly and boil for no longer than 90 to 120 seconds; if it boils for too long the cookies will turn out crumbly. Remove from the heat and pour over the oat mixture; stir until well combined. 3. Drop large scoops of batter onto the prepared baking sheets. Spray the back of a spoon with cooking spray, and use it to flatten the scoops, respraying as needed. Let cool to room temperature.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "348"
},
{
  "url": "https://www.allrecipes.com/recipe/8489191/granola-oatmeal-cookies/",
  "name": "Granola Oatmeal Cookies",
  "rating": "5.0",
  "ratingcount": "13",
  "ingredients": "1 cup finely crumbled prepared granola; ¾ cup all-purpose flour; ½ teaspoon kosher salt; ¼ teaspoon baking powder; ¼ teaspoon baking soda; ½ cup unsalted butter, softened to room temperature; ½ cup firmly packed light brown sugar; ¼ cup white granulated sugar; 1 large egg; ¾ teaspoon vanilla extract; ¼ teaspoon ground cinnamon; ½ cup old-fashioned rolled oats",
  "directions": "1. Gather all ingredients. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with a silicone baking mat (such as Silpat™) or parchment paper. 2. Combine flour, salt, baking powder, and baking soda in a bowl and whisk for 30 seconds until dry ingredients are well combined. 3. Combine butter, light brown sugar, and granulated sugar in a second bowl. Cream with an electric beater until mixture is light and fluffy. Add egg and mix on high speed until well combined. Add vanilla extract and cinnamon and beat in. 4. Add egg and mix on high speed until well combined. Add vanilla extract and cinnamon and beat in. 5. Fold in dry ingredients with a spatula just until flour disappears. 6. Fold in granola and oats until well combined. 7. Scoop out tablespoonfuls of dough onto the prepared baking sheet, leaving ample space between the dough balls as they will spread out, about 8 per baking sheet. 8. Bake on the center rack in the preheated oven until cookies are golden brown, 13 to 15 minutes. Remove from oven and allow to cool on the baking sheet for 10 minutes. Transfer to a wire rack and cool completely. Repeat with remaining dough. 9. Transfer to a wire rack and cool completely. Repeat with remaining dough. 10. Serve and enjoy!",
  "prep": "20 mins",
  "cook": "",
  "total": "35 mins",
  "calories": "122"
},
{
  "url": "https://www.allrecipes.com/recipe/24445/chewy-chocolate-chip-oatmeal-cookies/",
  "name": "Chewy Chocolate Chip Oatmeal Cookies",
  "rating": "4.5",
  "ratingcount": "5",
  "ingredients": "1 cup butter, softened; 1 cup packed light brown sugar; ½ cup white sugar; 2  eggs; 2 teaspoons vanilla extract; 1 ¼ cups all-purpose flour; ½ teaspoon baking soda; 1 teaspoon salt; 3 cups quick-cooking oats; 1 cup chopped walnuts; 1 cup semisweet chocolate chips",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Combine flour, baking soda, and salt in a medium bowl. Set aside. 3. Cream together butter, brown sugar, and white sugar in a large bowl until smooth. Beat in eggs one at a time, until well combined; stir in vanilla extract. 4. Stir flour mixture into egg mixture until just blended. Mix in quick oats, walnuts, and chocolate chips. Drop batter by heaping spoonfuls onto ungreased baking sheets. 5. Bake in the preheated oven for 12 minutes. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "12 mins",
  "total": "47 mins",
  "calories": "145"
},
{
  "url": "https://www.allrecipes.com/recipe/229088/apple-crisp-with-oat-topping/",
  "name": "Easy Apple Crisp with Oat Topping",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "6  apples - peeled, cored, and sliced; 2 tablespoons white sugar; 1 ½ teaspoons ground cinnamon, divided; 1 cup brown sugar; ¾ cup old-fashioned oats; ¾ cup all-purpose flour; ½ cup cold butter",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Toss apples with white sugar and 1/2 teaspoon cinnamon in a medium bowl to coat; pour into a 9-inch square baking dish. 3. Mix brown sugar, oats, flour, and 1 teaspoon cinnamon in a separate bowl. Cut in cold butter with 2 knives or a pastry blender until the mixture resembles coarse crumbs; spread over apples and pat down gently until even. 4. Bake in the preheated oven until golden brown and sides are bubbling, about 40 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "618"
},
{
  "url": "https://www.allrecipes.com/recipe/231532/moms-peach-crisp/",
  "name": "Mom's Peach Crisp",
  "rating": "4.7",
  "ratingcount": "691",
  "ingredients": "4 cups sliced fresh peaches; ½ cup all-purpose flour; ½ cup brown sugar; ½ cup cold butter; 1 teaspoon ground cinnamon; ¼ teaspoon salt; 1 cup rolled oats",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Arrange sliced peaches evenly in an 8x8-inch baking dish. 3. Mix flour, brown sugar, butter, cinnamon, and salt in a bowl using a pastry cutter until crumbly. 4. Fold oats into flour mixture. 5. Sprinkle mixture evenly over peaches, pressing down lightly. 6. Bake in the preheated oven until crispy and golden brown on top, about 30 minutes. 7. Enjoy!",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "238"
},
{
  "url": "https://www.allrecipes.com/recipe/9832/no-bake-cookies-i/",
  "name": "No-Bake Cookies",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 ¾ cups white sugar; ½ cup butter; ½ cup milk; 4 tablespoons unsweetened cocoa powder; ½ cup crunchy peanut butter; 3 cups quick-cooking oats; 1 teaspoon vanilla extract; waxed paper",
  "directions": "1. Combine sugar, butter, milk, and cocoa in a medium saucepan; bring to a boil, stirring often. Boil for exactly 1 1/2 minutes. Remove from heat, and stir in peanut butter. Add oats and vanilla; stir until well combined. 2. Drop by teaspoonfuls onto waxed paper. Let cool until hardened.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "45 mins",
  "calories": "110"
},
{
  "url": "https://www.allrecipes.com/recipe/19247/soft-oatmeal-cookies/",
  "name": "Soft Oatmeal Cookies",
  "rating": "4.7",
  "ratingcount": "5",
  "ingredients": "2 cups all-purpose flour; 1 ½ teaspoons ground cinnamon; 1 teaspoon baking soda; 1 teaspoon salt; 1 cup unsalted butter, softened; 1 cup white sugar; 1 cup packed brown sugar; 2 large eggs; 1 teaspoon vanilla extract; 3 cups quick cooking oats; nonstick cooking spray with flour; 2 tablespoons water; 2 tablespoons white sugar, or as needed",
  "directions": "1. Whisk flour, cinnamon, baking soda, and salt together in a medium bowl until well combined. 2. Beat butter, 1 cup white sugar, and brown sugar in a large bowl with an electric mixer until creamy, at least 2 to 3 minutes. Beat in eggs, one at a time, then mix in vanilla. Gradually mix in dry ingredients until well combined. Add oats and mix until thoroughly incorporated. Cover the bowl and chill dough in the refrigerator for at least 1 hour. 3. When ready to bake, preheat the oven to 375 degrees F (190 degrees C). Spray two cookie sheets with floured cooking spray. Place water in a small bowl and 2 tablespoons sugar in another small bowl. 4. Roll chilled dough into walnut-sized balls, and place 2 inches apart on the prepared cookie sheets. Dip a large fork in water, then in sugar, and use to flatten each cookie, rewetting and resugaring as necessary. 5. Bake in the preheated oven until light golden brown around the edges and centers are nearly set, 8 to 10 minutes, switching racks halfway through. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "1 hr 30 mins",
  "calories": "218"
},
{
  "url": "https://www.allrecipes.com/recipe/228562/pumpkin-muffins-with-streusel-topping/",
  "name": "Pumpkin Muffins with Streusel Topping",
  "rating": "4.8",
  "ratingcount": "423",
  "ingredients": "2 ½ cups all-purpose flour; ½ cup rolled oats; 4 teaspoons pumpkin pie spice; 2 teaspoons baking soda; 1 teaspoon baking powder; 1 teaspoon salt; 1 ½ cups pumpkin puree; 1 cup brown sugar; 1 cup white sugar; ⅔ cup vegetable oil; ½ cup applesauce; 3  eggs; 1 teaspoon vanilla extract; ¼ cup raisins (Optional); ¼ cup packed brown sugar; 2 tablespoons butter, softened; 2 tablespoons rolled oats; 2 tablespoons all-purpose flour",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease or line 18 muffin cups with paper liners. 2. Combine 2 1/2 cups flour, 1/2 cup oats, pumpkin pie spice, baking soda, baking powder, and salt together in a bowl. Whisk pumpkin puree, 1 cup brown sugar, white sugar, vegetable oil, applesauce, eggs, and vanilla extract together in a separate large bowl. Stir flour mixture into pumpkin mixture; mix well. Fold in raisins. 3. Beat 1/4 cup brown sugar with butter in a bowl until creamy and smooth. Whisk 2 tablespoons oats and 2 tablespoons flour, using a fork, into sugar-butter mixture until streusel topping is crumbly. 4. Pour the batter into the prepared muffin tin. Sprinkle each muffin with streusel topping. 5. Bake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, 25 to 35 minutes.",
  "prep": "30 mins",
  "cook": "25 mins",
  "total": "55 mins",
  "calories": "292"
},
{
  "url": "https://www.allrecipes.com/recipe/6714/banana-oat-muffins/",
  "name": "Banana Oat Muffins",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "1 ½ cups unbleached all-purpose flour; 1 cup rolled oats; ½ cup white sugar; 2 teaspoons baking powder; 1 teaspoon baking soda; ½ teaspoon salt; 1  egg; ¾ cup milk; ⅓ cup vegetable oil; ½ teaspoon vanilla extract; 1 cup mashed bananas",
  "directions": "1. Preheat the oven to 400 degrees F (205 degrees C). Line a 12-cup muffin tin with paper liners. 2. Combine flour, oats, sugar, baking powder, soda, and salt in a medium bowl; set aside. 3. Beat egg lightly in a large bowl. Whisk in milk, oil, and vanilla. Stir in mashed bananas. Add the flour mixture and stir until just combined. Spoon batter into the prepared muffin cups, filling each 3/4 full. 4. Bake in the preheated oven until tops spring back when lightly pressed, 18 to 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "200"
},
{
  "url": "https://www.allrecipes.com/recipe/228740/pumpkin-oatmeal-chocolate-chip-cookies/",
  "name": "Pumpkin Oatmeal Chocolate Chip Cookies",
  "rating": "4.7",
  "ratingcount": "199",
  "ingredients": "1 ½ cups butter, softened; 2 cups packed brown sugar; 1 cup white sugar; 1 (15 ounce) can pumpkin puree; 1  egg; 1 teaspoon vanilla extract; 4 cups all-purpose flour; 2 cups quick-cooking oats; 2 teaspoons ground cinnamon; 2 teaspoons baking soda; 1 teaspoon baking powder; 1 teaspoon salt; 2 cups miniature chocolate chips",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Beat butter, brown sugar, and white sugar together in a bowl until creamy. Add pumpkin, egg, and vanilla extract; beat until smooth. 3. Mix flour, oats, cinnamon, baking soda, baking powder, and salt in a separate bowl; stir into creamed butter until combined. Fold chocolate chips into batter. Drop 1 to 2 tablespoons batter for each cookie onto a baking sheet. 4. Bake in the preheated oven until the edges of each cookie are lightly browned, 10 to 12 minutes.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "128"
},
{
  "url": "https://www.allrecipes.com/recipe/10264/oatmeal-raisin-cookies-i/",
  "name": "Oatmeal Raisin Cookies",
  "rating": "4.4",
  "ratingcount": "2",
  "ingredients": "¾ cup butter, softened; ¾ cup white sugar; ¾ cup packed light brown sugar; 2 large eggs; 1 teaspoon vanilla extract; 1 ¼ cups all-purpose flour; 1 teaspoon baking soda; ¾ teaspoon ground cinnamon; ½ teaspoon salt; 2 ¾ cups rolled oats; 1 cup raisins",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 375 degrees F (190 degrees C). Line two cookie sheets with parchment paper or silicone liners. 3. Beat butter, white sugar, and brown sugar in a large bowl until smooth and creamy. Beat in eggs and vanilla until fluffy. 4. Stir together flour, baking soda, cinnamon, and salt. Gradually beat into the butter mixture. Stir in oats and raisins. Drop teaspoonfuls of batter onto the prepared cookie sheets. 5. Bake in the preheated oven until golden brown, 8 to 10 minutes, switching racks halfway through. Remove from the oven and let sit on the cookie sheets for 1 to 2 minutes before transferring cookies to a wire rack to cool completely.",
  "prep": "25 mins",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "92"
},
{
  "url": "https://www.allrecipes.com/recipe/239969/no-bake-energy-bites/",
  "name": "No-Bake Energy Bites",
  "rating": "4.8",
  "ratingcount": "682",
  "ingredients": "1 cup rolled oats; ½ cup miniature semisweet chocolate chips; ½ cup ground flax seed; ½ cup crunchy peanut butter; ⅓ cup honey; 1 teaspoon vanilla extract",
  "directions": "1. Stir oats, chocolate chips, flax seed, peanut butter, honey, and vanilla extract together in a bowl. 2. Roll dough into 24 balls with your hands. Arrange balls on a baking sheet and freeze until set, about 1 hour.",
  "prep": "15 mins",
  "cook": "",
  "total": "1 hr 15 mins",
  "calories": "94"
},
{
  "url": "https://www.allrecipes.com/recipe/51013/baked-oatmeal-ii/",
  "name": "Baked Oatmeal",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "3 cups rolled oats; 1 cup brown sugar; 2 teaspoons ground cinnamon; 2 teaspoons baking powder; 1 teaspoon salt; 2  eggs; 1 cup milk; ½ cup melted butter; 2 teaspoons vanilla extract; ¾ cup dried cranberries",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix together oats, brown sugar, cinnamon, baking powder, and salt in a large bowl. Beat in eggs, milk, melted butter, and vanilla extract. Stir in dried cranberries. Spread into a 9x13-inch baking dish. 3. Bake in the preheated oven until top is golden, about 40 minutes.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "393"
},
{
  "url": "https://www.allrecipes.com/recipe/244251/no-cook-overnight-oatmeal/",
  "name": "Easy Overnight Oats ",
  "rating": "4.8",
  "ratingcount": "244",
  "ingredients": "⅓ cup milk; ¼ cup Greek yogurt; ¼ cup rolled oats; 2 teaspoons honey; 2 teaspoons chia seeds; 1/4 teaspoon ground cinnamon or more to taste; ¼ cup fresh blueberries",
  "directions": "1. Combine milk, yogurt, oats, honey, chia seeds, and cinnamon in a 1/2-pint jar with a lid; cover and shake until combined. Fold in blueberries. 2. Cover and refrigerate, 8 hours to overnight.",
  "prep": "5 mins",
  "cook": "",
  "total": "8 hrs 5 mins",
  "calories": "279"
},
{
  "url": "https://www.allrecipes.com/recipe/26183/no-bake-peanut-butter-cookies-iii/",
  "name": "No-Bake Peanut Butter Cookies",
  "rating": "4.6",
  "ratingcount": "451",
  "ingredients": "3 cups white sugar; ¾ cup butter; ¾ cup milk; 1 ½ cups peanut butter; ½ teaspoon vanilla extract; 4 ½ cups quick-cooking oats",
  "directions": "1. Combine sugar, butter, and milk in a saucepan over medium heat. Bring to a rapid boil and boil for 1 minute. Remove from heat and stir in peanut butter and vanilla. Mix in oats, stirring until mixture begins to cool. (Transfer mixture to a large bowl if ingredients overflow.) 2. Drop batter by teaspoonfuls onto waxed paper. Let cool until set.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "152"
},
{
  "url": "https://www.allrecipes.com/recipe/22458/easy-oatmeal-muffins/",
  "name": "Easy Oatmeal Muffins",
  "rating": "4.2",
  "ratingcount": "503",
  "ingredients": "1 cup milk; 1 cup quick cooking oats; 1  egg; ¼ cup vegetable oil; 1 cup all-purpose flour; ¼ cup white sugar; 2 teaspoons baking powder; ½ teaspoon salt",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Grease 12 standard muffin cups or line with paper muffin liners. 2. Combine milk and oats in a small bowl; let soak for 15 minutes. 3. Beat together egg and oil in a large bowl; stir in oat mixture. Sift together flour, sugar, baking powder, and salt in a separate bowl. Stir flour mixture into wet ingredients until just combined. Spoon batter into the prepared muffin cups until 2/3 full. 4. Bake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, 20 to 25 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "136"
},
{
  "url": "https://www.allrecipes.com/recipe/11298/grammas-date-squares/",
  "name": "Gramma's Date Squares",
  "rating": "4.6",
  "ratingcount": "463",
  "ingredients": "1 ½ cups rolled oats; 1 ½ cups sifted pastry flour; 1 ⅓ cups packed brown sugar, divided; ¾ teaspoon baking soda; ¼ teaspoon salt; ¾ cup butter, softened; ¾ pound pitted dates, diced; 1 cup water; 1 teaspoon lemon juice",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine oats, pastry flour, 1 cup brown sugar, baking soda, and salt in a large bowl. Mix in butter until crumbly. Press half of the mixture into the bottom of a 9-inch square baking pan. 3. Combine dates, water, and remaining 1/3 cup brown sugar in a small saucepan over medium heat. Bring to a boil, and cook until thickened. Stir in lemon juice, and remove from heat. Spread the filling over the base, and spread the remaining crumb mixture on top. 4. Bake in the preheated oven until the top is lightly toasted, 20 to 25 minutes. Cool before cutting into 12 squares.",
  "prep": "25 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "363"
},
{
  "url": "https://www.allrecipes.com/recipe/23539/strawberry-oatmeal-breakfast-smoothie/",
  "name": "Strawberry Oatmeal Breakfast Smoothie",
  "rating": "4.4",
  "ratingcount": "1",
  "ingredients": "1 cup soy milk; ½ cup rolled oats; 14  frozen strawberries; 1  banana, broken into chunks; 1 ½ teaspoons white sugar (Optional); ½ teaspoon vanilla extract (Optional)",
  "directions": "1. Gather ingredients. 2. Blend soy milk, oats, strawberries, and banana in a blender until smooth. Add sugar and vanilla and blend again until smooth. 3. Pour into glasses and serve.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "142"
},
{
  "url": "https://www.allrecipes.com/recipe/245914/baked-oatmeal-breakfast-bars/",
  "name": "Baked Oatmeal Breakfast Bars",
  "rating": "4.2",
  "ratingcount": "248",
  "ingredients": "2 cups old-fashioned rolled oats; ⅓ cup packed brown sugar; 1 tablespoon white sugar; 1 ½ teaspoons baking powder; ½ teaspoon salt; ½ teaspoon ground cinnamon; 1 cup milk; 2 large eggs; 2 tablespoons canola oil; 1 teaspoon vanilla extract",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8-inch square pan. 3. Mix oats, brown sugar, white sugar, baking powder, salt, and cinnamon together in a bowl. 4. Whisk milk, eggs, canola oil, and vanilla together in a separate bowl. 5. Stir egg mixture into the oat mixture until well combined. Let sit until flavors blend, about 20 minutes. 6. Spread oat mixture into the prepared pan. 7. Bake in the preheated oven until the edges are golden brown, about 30 minutes. 8. Remove from the oven and let cool completely before cutting into 16 bars.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "184"
},
{
  "url": "https://www.allrecipes.com/recipe/245429/no-bake-energy-balls/",
  "name": "No Bake Energy Balls",
  "rating": "4.8",
  "ratingcount": "218",
  "ingredients": "1 cup old-fashioned oats; ½ cup peanut butter; ½ cup ground flax seed; ½ cup chocolate chips; ⅓ cup honey; 1 tablespoon chia seeds (Optional); 1 teaspoon vanilla extract",
  "directions": "1. Combine oats, peanut butter, ground flaxseed, chocolate chips, honey, chia seeds, and vanilla extract together in a bowl. Cover and chill the dough in the refrigerator for 30 minutes. 2. Remove chilled dough from the refrigerator; roll into twenty 1-inch diameter balls.",
  "prep": "10 mins",
  "cook": "",
  "total": "40 mins",
  "calories": "114"
},
{
  "url": "https://www.allrecipes.com/recipe/265505/maple-and-brown-sugar-oatmeal/",
  "name": "Maple and Brown Sugar Oatmeal",
  "rating": "4.7",
  "ratingcount": "31",
  "ingredients": "1 ½ cups water; ¾ cup quick-cooking oats; 1 tablespoon packed dark brown sugar; 1 tablespoon maple syrup",
  "directions": "1. Gather all ingredients. 2. Bring water to a boil in a small pot. Add oats and cook, stirring, for 1 minute. 3. Remove from heat and stir in brown sugar and maple syrup. Let sit until desired thickness is reached, 2 to 3 minutes.",
  "prep": "2 mins",
  "cook": "6 mins",
  "total": "10 mins",
  "calories": "334"
},
{
  "url": "https://www.allrecipes.com/recipe/233985/chocolate-protein-balls/",
  "name": "Chocolate Protein Balls",
  "rating": "4.9",
  "ratingcount": "170",
  "ingredients": "1 cup rolled oats; ½ cup natural peanut butter; ⅓ cup honey; ¼ cup chopped dark chocolate; 2 tablespoons flax seeds; 2 tablespoons chia seeds; 1 tablespoon chocolate-flavored protein powder, or to taste",
  "directions": "1. Stir oats, peanut butter, honey, chocolate, flax seeds, chia seeds, and protein powder together in a bowl until evenly mixed. Cover bowl with plastic wrap and refrigerate for 30 minutes. 2. Scoop chilled mixture into balls. Keep cold until serving. 3. Enjoy!",
  "prep": "10 mins",
  "cook": "",
  "total": "40 mins",
  "calories": "188"
},
{
  "url": "https://www.allrecipes.com/recipe/11314/delicious-raspberry-oatmeal-cookie-bars/",
  "name": "Delicious Raspberry Oatmeal Cookie Bars",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "1 cup all-purpose flour; 1 cup rolled oats; ½ cup packed light brown sugar; ¼ teaspoon baking soda; ⅛ teaspoon salt; ½ cup butter, softened; ¾ cup seedless raspberry jam",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8x8-inch square pan; line with greased foil. 2. Combine flour, oats, brown sugar, baking soda, and salt in a large bowl. Rub in butter using your hands or a pastry blender to form a crumbly mixture. 3. Press 2 cups oat mixture into the bottom of the prepared pan. Spread jam to within 1/4 inch of the edge. Sprinkle remaining crumb mixture on top; press down lightly into jam. 4. Bake in the preheated oven until lightly browned, 35 to 40 minutes. Allow to cool before cutting into bars.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "292"
},
{
  "url": "https://www.allrecipes.com/recipe/14009/muesli/",
  "name": "Muesli",
  "rating": "4.8",
  "ratingcount": "190",
  "ingredients": "4 ½ cups rolled oats; 1 cup raisins; ½ cup toasted wheat germ; ½ cup wheat bran; ½ cup oat bran; ½ cup chopped walnuts; ¼ cup packed brown sugar; ¼ cup raw sunflower seeds",
  "directions": "1. Combine oats, raisins, wheat germ, wheat bran, oat bran, walnuts, brown sugar, and sunflower seeds in a large bowl; mix well. Store muesli in an airtight container at room temperature for up to 2 months.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "188"
},
{
  "url": "https://www.allrecipes.com/recipe/232191/lactation-cookies/",
  "name": "Lactation Cookies",
  "rating": "4.8",
  "ratingcount": "357",
  "ingredients": "2 tablespoons flaxseed meal; ¼ cup water; 1 cup butter, softened; 1 cup white sugar; ½ cup brown sugar; 3  egg yolks; 1 ½ teaspoons pure vanilla extract; 2 cups all-purpose flour; ¼ cup brewer’s yeast; 1 tablespoon wheat germ; 1 teaspoon baking soda; ½ teaspoon salt; ½ teaspoon cream of tartar; 2 ½ cups old-fashioned oats; 1 cup chocolate chips",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix flaxseed meal with water in a small bowl and let soak for 5 minutes. 3. Beat butter, white sugar, and brown sugar together in a large mixing bowl until creamy. Add egg yolks and vanilla extract; beat to incorporate. Stir in flaxseed mixture. 4. Mix flour, brewer's yeast, wheat germ, baking soda, salt, and cream of tartar, in a separate bowl. 5. Add dry ingredients to the wet ingredients and stir until just combined. Fold in oats and chocolate chips. 6. Roll dough into walnut-sized balls and place 2 inches apart onto a baking sheet. 7. Bake in the preheated oven until the edges are golden, 10 to 12 minutes. Allow cookies to cool on the baking sheet for 1 minute before removing to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "158"
},
{
  "url": "https://www.allrecipes.com/recipe/25023/chocolate-oatmeal-cookies/",
  "name": "Chocolate Oatmeal Cookies",
  "rating": "4.6",
  "ratingcount": "513",
  "ingredients": "1 cup all-purpose flour; 3 tablespoons unsweetened cocoa powder; 1 teaspoon baking powder; ½ teaspoon baking soda; ½ teaspoon salt; ½ teaspoon ground cinnamon; ½ cup margarine; ½ cup brown sugar; ½ cup white sugar; 1 large egg; 1 teaspoon vanilla extract; 1 ¼ cups rolled oats; ½ cup semisweet chocolate chips",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease cookie sheets. 2. Stir flour, cocoa, baking powder, baking soda, salt, and cinnamon together in a large bowl; set aside. 3. Beat margarine, brown sugar, and white sugar together in a large bowl with an electric mixer until light and fluffy. Beat in egg and vanilla. Stir in flour mixture using a wooden spoon. Mix in oats and chocolate chips. Drop spoonfuls of dough 2 inches apart onto the prepared cookie sheets. 4. Bake in the preheated oven until edges are golden, about 8 to 10 minutes. Cool on the baking sheet briefly before removing to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "79"
},
{
  "url": "https://www.allrecipes.com/recipe/231731/no-bake-chocolate-coconut-cookies/",
  "name": "No-Bake Chocolate Coconut Cookies",
  "rating": "4.5",
  "ratingcount": "130",
  "ingredients": "3 cups quick cooking oats; 1 cup sweetened flaked coconut; 2 cups white sugar; ½ cup unsweetened cocoa powder; ½ cup milk; ½ cup margarine",
  "directions": "1. Line a baking sheet with waxed paper. 2. Mix oats and coconut in a large bowl until thoroughly combined. 3. Stir together sugar, cocoa powder, milk, and margarine in a saucepan over medium heat until smooth. Bring to a boil and cook, stirring constantly, for 2 minutes. Pour over oats and coconut; mix quickly to coat. 4. Drop tablespoonfuls onto the prepared baking sheet. Let cookies cool and harden, then store in an airtight container.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "157"
},
{
  "url": "https://www.allrecipes.com/recipe/230280/oatmeal-chocolate-coconut-macaroons/",
  "name": "Oatmeal Chocolate Coconut Macaroons",
  "rating": "4.2",
  "ratingcount": "84",
  "ingredients": "2 cups quick-cooking oats; 1 cup shredded coconut; ¼ cup unsweetened cocoa powder; 2 cups white sugar; ½ cup butter; ½ cup milk",
  "directions": "1. Mix together oats, coconut, and cocoa powder in a large bowl. 2. Bring sugar, butter, and milk to a boil in a saucepan, stirring occasionally; remove immediately from heat and stir into oat mixture until well combined. 3. Drop 15 spoonfuls of dough onto a sheet of waxed paper. Let cool completely at room temperature before serving.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "20 mins",
  "calories": "228"
},
{
  "url": "https://www.allrecipes.com/recipe/24127/apple-oatmeal-crisp/",
  "name": "Apple Oatmeal Crisp",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "1 cup brown sugar; 1 cup rolled oats; 1 cup all-purpose flour; ½ cup butter, melted; 3 cups apples - peeled, cored and chopped; ½ cup white sugar; 2 teaspoons ground cinnamon",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). Lightly grease an 8-inch square pan. 3. Place brown sugar, oats, flour, and butter in a large bowl; mix until crumbly. 4. Place 1/2 of the crumb mixture in the bottom of the prepared pan. Spread apples evenly over crumb mixture. 5. Sprinkle with sugar and cinnamon; top with remaining crumb mixture. 6. Bake in the preheated oven until golden brown, 40 to 45 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "376"
},
{
  "url": "https://www.allrecipes.com/recipe/244987/apple-cinnamon-oatmeal-muffins/",
  "name": "Apple Cinnamon Oatmeal Muffins",
  "rating": "4.6",
  "ratingcount": "125",
  "ingredients": "¼ cup quick-cooking oats; 1 tablespoon brown sugar; 1 tablespoon melted butter; ¼ teaspoon ground cinnamon; 1 ½ cups quick-cooking oats; 1 ½ cups all-purpose flour; ½ cup brown sugar; 1 ½ teaspoons ground cinnamon; 1 teaspoon baking powder; ½ teaspoon baking soda; ½ teaspoon salt; ½ cup unsweetened applesauce; ½ cup milk; ¼ cup vegetable oil; 1 large egg, lightly beaten; 1 teaspoon vanilla extract; 1  apple - peeled, cored, and chopped",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Grease a 12-cup muffin pan or line with paper liners. 2. Make topping: Mix oats, brown sugar, melted butter, and cinnamon in a small bowl; set aside. 3. Make muffins: Whisk together oats, flour, brown sugar, cinnamon, baking powder, baking soda, and salt in a large bowl. Whisk together applesauce, milk, oil, egg, and vanilla extract in a medium bowl. Stir applesauce mixture into flour mixture until all ingredients are moistened. Fold in chopped apple. 4. Spoon batter into the prepared muffin cups about 2/3 full; sprinkle oat topping mixture evenly over each muffin. 5. Bake in the preheated oven until a toothpick inserted near the center comes out clean, about 15 minutes.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "196"
},
{
  "url": "https://www.allrecipes.com/recipe/11303/oatmeal-butterscotch-cookies/",
  "name": "Oatmeal Butterscotch Cookies",
  "rating": "4.6",
  "ratingcount": "664",
  "ingredients": "¾ cup butter, softened; ¾ cup white sugar; ¾ cup packed brown sugar; 2 large eggs; 1 teaspoon vanilla extract; 1 ¼ cups all-purpose flour; 1 teaspoon baking soda; ½ teaspoon ground cinnamon; ½ teaspoon salt; 3 cups rolled oats; 1 ⅔ cups butterscotch chips",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Beat butter, white sugar, and brown sugar together in a large bowl with an electric mixer until light and fluffy. Add eggs one at a time, beating well after each addition. Beat in vanilla. 3. Stir together flour, baking soda, cinnamon, and salt in a separate bowl. Gradually add flour mixture to butter mixture and mix until blended. Mix in oats and butterscotch chips until combined. 4. Drop dough by teaspoonfuls onto an ungreased cookie sheet. 5. Bake in the preheated oven until the edges begin to brown, 8 to 10 minutes.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "119"
},
{
  "url": "https://www.allrecipes.com/recipe/263512/instant-pot-steel-cut-oats/",
  "name": "Instant Pot Steel-Cut Oats",
  "rating": "4.9",
  "ratingcount": "17",
  "ingredients": "3 cups water; 1 cup steel-cut oats",
  "directions": "1. Gather all ingredients. 2. Combine water and oats in a multi-functional pressure cooker (such as Instant Pot). Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 3 minutes. Allow 10 to 15 minutes for pressure to build. 3. Release pressure using the natural-release method according to manufacturer's instructions, 10 to 40 minutes. Oats will thicken as they cool.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "300"
},
{
  "url": "https://www.allrecipes.com/recipe/15683/dutch-apple-pie-with-oatmeal-streusel/",
  "name": "Dutch Apple Pie with Oatmeal Streusel",
  "rating": "4.6",
  "ratingcount": "661",
  "ingredients": "5 cups apples - peeled, cored and sliced; ⅔ cup white sugar; 2 tablespoons all-purpose flour; ½ teaspoon ground cinnamon; ¼ teaspoon ground nutmeg; ¼ teaspoon ground allspice; 1 (9 inch) frozen pie crust; 2 tablespoons butter; aluminum foil; ¾ cup all-purpose flour; ¾ cup rolled oats; ½ cup packed brown sugar; 1 teaspoon lemon zest; ½ teaspoon ground cinnamon; ½ cup butter",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Make the apple pie: Place apple slices in a large bowl. Mix white sugar, flour, cinnamon, nutmeg, and allspice together in a separate bowl until combined; sprinkle over apples and toss until evenly coated. 3. Remove pie shell from freezer; pour apple mixture into pie shell and dot with butter. Lay a sheet of aluminum foil lightly on top of filling, but do not seal. 4. Bake pie in the preheated oven for 10 minutes. 5. Meanwhile, make the streusel topping: Mix flour, oats, brown sugar, lemon zest, and cinnamon in a medium bowl until combined. Cut in butter until mixture is crumbly. Remove pie from oven and sprinkle streusel on top. 6. Reduce heat to 375 degrees F (190 degrees C). Return pie to oven and bake until streusel is browned and apples are tender, 30 to 35 minutes more. Cover loosely with aluminum foil to prevent excess browning.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "441"
},
{
  "url": "https://www.allrecipes.com/recipe/242191/easy-rhubarb-crisp/",
  "name": "Easy Rhubarb Crisp",
  "rating": "4.6",
  "ratingcount": "63",
  "ingredients": "1 cup all-purpose flour; 1 cup brown sugar; ¾ cup oats; ½ cup melted butter; 1 teaspoon ground cinnamon; 4 cups diced rhubarb; 1 cup white sugar; 1 cup water; 2 tablespoons cornstarch; 1 teaspoon vanilla extract",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 2. Mix flour, brown sugar, oats, butter, and cinnamon together in a bowl until crumbly. Press 1/2 of the oat mixture into the bottom of prepared baking dish. Sprinkle rhubarb over oat mixture. 3. Combine white sugar, water, cornstarch, and vanilla in a saucepan over medium heat; cook and stir until thick and clear, about 5 minutes. Pour sugar mixture over rhubarb. Sprinkle remaining oat mixture over rhubarb. 4. Bake in the preheated oven until the crisp is lightly brown and bubbling, about 1 hour.",
  "prep": "20 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 25 mins",
  "calories": "329"
},
{
  "url": "https://www.allrecipes.com/recipe/10308/oatmeal-peanut-butter-cookies/",
  "name": "Oatmeal Peanut Butter Cookies",
  "rating": "4.6",
  "ratingcount": "3",
  "ingredients": "1 cup peanut butter; 1 cup packed brown sugar; ¾ cup white sugar; ½ cup shortening; ½ cup margarine, softened; 2 large eggs; 1 ½ cups all-purpose flour; 2 teaspoons baking soda; 1 teaspoon salt; 1 cup quick-cooking oats",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Beat peanut butter, brown sugar, white sugar, shortening, and margarine in a large bowl with an electric mixer on medium speed until smooth and creamy. Beat in eggs, one at a time, until well blended. 3. Combine flour, baking soda, and salt in a separate bowl; stir into creamed mixture until incorporated. Mix in oats until just combined. 4. Drop teaspoonfuls of dough onto ungreased cookie sheets. 5. Bake cookies in the preheated oven until just lightly browned, 10 to 15 minutes. Do not overbake. Cool and store in an airtight container.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "120"
},
{
  "url": "https://www.allrecipes.com/recipe/10298/no-bake-cookies-ii/",
  "name": "No Bake Cookies without Peanut Butter",
  "rating": "4.1",
  "ratingcount": "312",
  "ingredients": "2 cups white sugar; ½ cup butter; ½ cup milk; 3 cups quick cooking oats; 3 tablespoons cocoa powder; 1 teaspoon vanilla extract",
  "directions": "1. Place sugar, butter, and milk in a medium saucepan. Bring to a rolling boil over medium-low heat; boil for one minute, stirring constantly. 2. Remove from heat and mix in oats, cocoa powder, and vanilla. Drop by teaspoonfuls onto waxed paper. Let cool until hardened.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "189"
},
{
  "url": "https://www.allrecipes.com/recipe/254832/clean-banana-oat-cookies/",
  "name": "Clean Banana Oat Cookies",
  "rating": "3.9",
  "ratingcount": "114",
  "ingredients": "2  bananas, mashed; ¼ cup milk; 1 large egg, beaten; 1 teaspoon honey; ½ teaspoon vanilla extract; 1 cup rolled oats, or as needed; 1 teaspoon ground cinnamon; ½ teaspoon baking powder; ⅛ teaspoon salt",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 2. Mix together mashed bananas, milk, egg, honey, and vanilla in a bowl. Stir in oats, cinnamon, baking powder, and salt until well combined. Add more oats if the batter is too runny. 3. Spoon mounds of batter a few inches apart onto the prepared baking sheet. 4. Bake in the preheated oven until the tops look dry and edges are golden, about 15 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "55"
},
{
  "url": "https://www.allrecipes.com/recipe/10602/no-bake-chocolate-oat-bars/",
  "name": "No-Bake Chocolate Oat Bars",
  "rating": "4.3",
  "ratingcount": "1",
  "ingredients": "1 cup butter; ½ cup packed brown sugar; 1 teaspoon vanilla extract; 3 cups quick cooking oats; 1 cup semisweet chocolate chips; ½ cup peanut butter",
  "directions": "1. Grease a 9-inch square pan. 2. Melt butter in a large saucepan over medium heat. Stir in brown sugar and vanilla; mix in oats. Cook over low heat until ingredients are well blended, about 2 to 3 minutes. Press 1/2 of the mixture into the bottom of the prepared pan. Reserve remaining oat mixture for topping. 3. Meanwhile, melt chocolate chips and peanut butter in a small heavy saucepan over low heat, stirring frequently until smooth. Pour chocolate mixture over crust in the pan and spread evenly with a knife or the back of a spoon. 4. Crumble remaining oat mixture over chocolate layer, pressing down gently. Cover and refrigerate for 2 to 3 hours or overnight. Bring to room temperature before cutting into bars.",
  "prep": "30 mins",
  "cook": "",
  "total": "2 hrs 30 mins",
  "calories": "142"
},
{
  "url": "https://www.allrecipes.com/recipe/8116/oat-bran-muffins/",
  "name": "Oat Bran Muffins",
  "rating": "4.4",
  "ratingcount": "283",
  "ingredients": "1 ½ cups oat bran; 1 ½ cups all-purpose flour; ½ cup dark brown sugar; 2 teaspoons baking powder; 2 teaspoons baking soda; ½ teaspoon salt; 1 cup chilled applesauce; 2 large eggs; ¼ cup vegetable oil",
  "directions": "1. Preheat the oven to 400 degrees F (205 degrees C). Line or grease 12 muffin cups. 2. Blend together oat bran, flour, brown sugar, baking powder, baking soda, and salt in a large bowl. Add chilled applesauce, eggs, and oil; mix until well blended. Spoon batter into the prepared muffin cups. Let stand for 10 minutes. 3. Bake in the preheated oven until golden brown and a toothpick inserted into the center of muffins comes out clean, about 15 minutes.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "40 mins",
  "calories": "182"
},
{
  "url": "https://www.allrecipes.com/recipe/269573/overnight-chia-oats/",
  "name": "Overnight Chia Oats",
  "rating": "4.7",
  "ratingcount": "24",
  "ingredients": "1 cup Almond Breeze Vanilla almondmilk; ½ cup rolled oats; ½ medium banana, mashed; 1 tablespoon chia seeds",
  "directions": "1. Combine almond milk, oats, mashed banana, and chia seeds in a 1-pint jar. Seal with a lid and shake until well combined. Refrigerate until chia seeds have swelled and mixture is thick and gel-like, 8 hours to overnight.",
  "prep": "5 mins",
  "cook": "",
  "total": "8 hrs 5 mins",
  "calories": "338"
},
{
  "url": "https://www.allrecipes.com/recipe/11032/oatmeal-craisin-cookies/",
  "name": "Oatmeal Craisin Cookies",
  "rating": "4.7",
  "ratingcount": "737",
  "ingredients": "1 cup butter, softened; 1 cup packed brown sugar; 1 cup white sugar; 2 large eggs; 1 teaspoon vanilla extract; 2 cups quick cooking oats; 2 cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon baking powder; 1 teaspoon salt; 1 cup raisins; 1 cup sweetened dried cranberries (such as Craisins®)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease cookie sheets. 2. Beat together butter, sugars, eggs, and vanilla in a large bowl with an electric mixer until light and fluffy, about 5 minutes. Combine oats, flour, baking soda, baking powder, and salt in a separate bowl. Add flour mixture, 1 cup at a time, beating batter briefly after each addition. Mix in raisins and cranberries. Drop by spoonfuls onto the prepared cookie sheets. 3. Bake in the preheated oven until edges are golden, 12 to 14 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "238"
},
{
  "url": "https://www.allrecipes.com/recipe/10745/no-bake-cookies-iii/",
  "name": "No-Bake Chocolate Oatmeal Cookies",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "2 cups white sugar; ½ cup margarine; ½ cup milk; 3 tablespoons unsweetened cocoa powder; 1 pinch salt; 3 cups quick cooking oats; ½ cup peanut butter; 1 teaspoon vanilla extract",
  "directions": "1. Bring sugar, margarine, milk, cocoa, and salt to a rapid boil in a saucepan for 1 minute. 2. Add quick-cooking oats, peanut butter, and vanilla; mix well. 3. Working quickly, drop by teaspoonfuls onto waxed paper and let cool.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "20 mins",
  "calories": "173"
},
{
  "url": "https://www.allrecipes.com/recipe/6753/oatmeal-chocolate-chip-muffins/",
  "name": "Oatmeal Chocolate Chip Muffins",
  "rating": "4.2",
  "ratingcount": "660",
  "ingredients": "1 ¼ cups quick cooking oats; 1 ¼ cups milk; 1 cup chopped pecans, divided; ¾ cup packed brown sugar, divided; ¾ cup semisweet chocolate chips; ½ cup vegetable oil; 1  egg; 1 ¼ cups all-purpose flour; 4 teaspoons baking powder; 1 teaspoon salt",
  "directions": "1. Combine oats and milk in a medium bowl; allow to stand for 15 minutes. Preheat the oven to 400 degrees F (205 degrees C). Grease a 12-cup muffin tin or line cups with paper liners. 2. Stir 1/2 of the chopped pecans, 1/2 cup of the brown sugar, chocolate chips, vegetable oil, and egg into oat and milk mixture. 3. Combine flour, baking powder, and salt in a separate bowl. Stir in oat mixture until just moist. Spoon batter into the prepared muffin cups, filling each 2/3 full. Sprinkle tops with remaining brown sugar and pecans. 4. Bake in the preheated oven until tops spring back when lightly pressed, about 20 to 25 minutes.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "345"
},
{
  "url": "https://www.allrecipes.com/recipe/6766/oatmeal-blueberry-muffins/",
  "name": "Oatmeal Blueberry Muffins",
  "rating": "4.1",
  "ratingcount": "450",
  "ingredients": "1 cup milk; ¼ cup vegetable oil; 1  egg; 1 ¼ cups quick cooking oats; 1 cup all-purpose flour; ⅓ cup white sugar; 1 tablespoon baking powder; ½ teaspoon salt; 1 cup blueberries, rinsed and drained",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Grease a 12-cup muffin tin or line cups with paper liners. 2. Whisk milk, oil, and egg together in a bowl until evenly blended. Stir oats, flour, sugar, baking powder, and salt together in a separate bowl, making a well in the center. Pour milk mixture into well and stir just until batter is combined; fold in blueberries. 3. Spoon batter into the prepared muffin cups, filling each 2/3 full. 4. Bake in the preheated oven until tops spring back when lightly pressed, about 20 to 25 minutes. Cool in the tin for 5 minutes. Transfer to a wire rack to cool completely.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "156"
},
{
  "url": "https://www.allrecipes.com/recipe/255719/perfect-apple-crisp-pie/",
  "name": "Perfect Apple Crisp Pie",
  "rating": "4.8",
  "ratingcount": "24",
  "ingredients": "5 cups peeled and sliced apples; ¼ cup brown sugar; ¼ cup white sugar; ¼ cup all-purpose flour; ¾ teaspoon ground cinnamon; 1 (9 inch) deep-dish pie shell; ¾ cup all-purpose flour; ¾ cup quick-cooking oats; ⅔ cup brown sugar; 2 tablespoons brown sugar; ⅓ cup butter, melted",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Make the pie: Mix apples, brown sugar, white sugar, flour, and cinnamon together in a bowl. Pour into pie shell. 3. Make the topping: Mix flour, oats, and 2/3 cup plus 2 tablespoons brown sugar together in a bowl. Drizzle in melted butter and stir until crumbly. Scatter over pie. 4. Bake in the preheated oven until apples start to soften, about 15 minutes. Reduce the oven temperature to 350 degrees F (175 degrees C). Continue baking until apples are soft and topping is browned, about 40 minutes more.",
  "prep": "25 mins",
  "cook": "55 mins",
  "total": "1 hr 20 mins",
  "calories": "440"
},
{
  "url": "https://www.allrecipes.com/recipe/10245/oatmeal-chocolate-coconut-chewy/",
  "name": "Oatmeal Chocolate Coconut Chewy",
  "rating": "4.8",
  "ratingcount": "572",
  "ingredients": "1 ¼ cups packed brown sugar; 1 cup butter, softened; ½ cup white sugar; 2 large eggs; 2 tablespoons milk; 2 teaspoons vanilla extract; 1 ¾ cups all-purpose flour; 1 teaspoon baking soda; ½ teaspoon salt (Optional); 3 cups rolled oats; 2 cups semisweet chocolate chips; 1 cup chopped walnuts (Optional); 1 cup shredded coconut",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Cream together brown sugar, butter, and white sugar in a large bowl until smooth. Beat in eggs one at a time, then stir in milk and vanilla. 3. Combine flour, baking soda, and salt; stir into sugar mixture until well blended. Stir in oats, chocolate chips, walnuts, and coconut until evenly distributed. 4. Drop by rounded spoonfuls onto ungreased cookie sheets. 5. Bake in the preheated oven for 10 to 12 minutes for a chewy cookie or 14 minutes for a firmer cookie. 6. Cool for 1 minute on the cookie sheets and then remove to wire rack. Cool completely and then store in a tightly sealed container.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "30 mins",
  "calories": "256"
},
{
  "url": "https://www.allrecipes.com/recipe/9891/haystacks-i/",
  "name": "Haystack Cookies",
  "rating": "4.4",
  "ratingcount": "79",
  "ingredients": "2 cups white sugar; ⅓ cup unsweetened cocoa powder; ½ cup milk; ½ cup butter; 3 ½ cups quick cooking oats; 1 cup flaked coconut; ½ cup chopped peanuts; 1 pinch salt",
  "directions": "1. Gather all ingredients. 2. Bring sugar, cocoa, milk, and butter to a boil in a saucepan. Remove from heat. 3. Stir in oats, coconut, nuts and salt. Drop quickly from teaspoon on wax paper. Let cool.",
  "prep": "25 mins",
  "cook": "",
  "total": "25 mins",
  "calories": "180"
},
{
  "url": "https://www.allrecipes.com/recipe/229252/apple-and-pear-crumble/",
  "name": "Apple and Pear Crumble",
  "rating": "4.5",
  "ratingcount": "66",
  "ingredients": "1 ½ cups rolled oats; 1 ½ cups brown sugar, divided; ½ cup all-purpose flour; ½ cup butter, softened; 2 cups peeled and diced apples; 2 cups peeled and diced pears; 1 teaspoon ground cinnamon; ½ cup sliced almonds, or to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix oats, 3/4 cup brown sugar, flour, and butter together in a bowl until crumbly. 3. Mix apples, pears, remaining 3/4 cup brown sugar, and cinnamon together in a separate bowl; spread into the bottom of a 9x9-inch glass pan. Sprinkle oat mixture atop apple-pear mixture; top with almonds. 4. Bake in the preheated oven until the top is golden brown, about 40 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "366"
},
{
  "url": "https://www.allrecipes.com/recipe/245153/baked-apples-with-oatmeal-filling/",
  "name": "Baked Apples with Oatmeal Filling",
  "rating": "4.4",
  "ratingcount": "114",
  "ingredients": "4 medium apples; 1 cup rolled oats; ¼ cup brown sugar; 1 teaspoon ground cinnamon; ¼ cup unsalted butter, cut into pieces",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Core each apple, making a large well in the center; place onto a rimmed baking sheet. 3. Mix oats, brown sugar, and cinnamon together in a bowl; cut in butter until well combined. Spoon 1/4 of the oat mixture into each apple. 4. Bake in the preheated oven until apples are tender and filling is bubbling, about 30 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "304"
},
{
  "url": "https://www.allrecipes.com/recipe/21384/oatmeal-pancakes-ii/",
  "name": "Oatmeal Pancakes",
  "rating": "4.7",
  "ratingcount": "993",
  "ingredients": "¾ cup buttermilk; ½ cup all-purpose flour; ½ cup quick cooking oats; 1 large egg; 2 tablespoons vegetable oil; 1 tablespoon white sugar; 1 teaspoon vanilla extract; 1 teaspoon baking powder; ½ teaspoon baking soda; ½ teaspoon salt",
  "directions": "1. Gather all ingredients. 2. Combine buttermilk, flour, oats, egg, oil, sugar, vanilla, baking powder, baking soda, and salt in a blender; purée until smooth. 3. Heat a lightly oiled griddle or large skillet over medium-high heat. Pour 1/4 cupfuls batter onto the hot griddle. Cook until bubbles form on the surface, 1 to 2 minutes. Flip and cook until browned on the other side, 1 to 2 minutes more. 4. Serve immediately.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "207"
}]