[{
  "url": "https://www.allrecipes.com/recipe/241987/baked-peaches/",
  "name": "Baked Peaches",
  "rating": "4.6",
  "ratingcount": "23",
  "ingredients": "1 (16 ounce) package frozen peach slices; ⅓ cup brown sugar substitute; ¼ cup pecans; 1 tablespoon all-purpose flour; 1 teaspoon vanilla extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Spread peach slices into a baking dish in a single layer. Stir brown sugar substitute, pecans, flour, and vanilla extract together; spread over the peach slices. 3. Bake in preheated oven until the peaches are heated through, 20 to 30 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "113"
},
{
  "url": "https://www.allrecipes.com/recipe/12307/single-crust-peach-pie/",
  "name": "Single Crust Peach Pie",
  "rating": "4.4",
  "ratingcount": "138",
  "ingredients": "¾ cup white sugar; 2 tablespoons butter, softened; ⅓ cup all-purpose flour; ¼ teaspoon ground nutmeg; 6  fresh peaches - pitted, skinned, and sliced; 1 recipe pastry for a 9 inch single crust pie",
  "directions": "1. Cream sugar and butter or margarine together. Add flour and nutmeg; mix until mealy. Spread 1/2 of mixture in pie crust. Arrange peaches on top of crumb mixture. Sprinkle remaining crumb mixture on top of peaches. 2. Bake at 450 degrees F (230 degrees C) for ten minutes. Reduce heat to 350 degrees F (175 degrees C). Continue baking for 40 minutes, or until brown.",
  "prep": "30 mins",
  "cook": "",
  "total": "1 hr 20 mins",
  "calories": "250"
},
{
  "url": "https://www.allrecipes.com/recipe/174599/peachy-bread-pudding-with-caramel-sauce/",
  "name": "Peachy Bread Pudding with Caramel Sauce",
  "rating": "4.7",
  "ratingcount": "228",
  "ingredients": "2 cups fresh peaches - peeled, pitted and halved; 1 (14 ounce) can sweetened condensed milk; 3  eggs, lightly beaten; 1 ¼ cups hot water; ¼ cup butter, melted; 1 teaspoon ground cinnamon; 1 teaspoon vanilla extract; 4 cups French bread, torn into small pieces; ½ cup brown sugar; ½ cup butter; 2 tablespoons light corn syrup; 1 tablespoon rum",
  "directions": "1. Preheat an oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish. 2. Chop the peaches and lightly mash them in a mixing bowl. Combine the sweetened condensed milk and the eggs; add them to the peaches and mix well. Stir in the hot water, melted butter, cinnamon, and vanilla. Stir the French bread into to the custard mixture until the bread is completely moistened. Turn the pudding into the prepared baking dish. 3. Bake until a knife inserted in the center of the pudding comes out clean, about 1 hour and 10 minutes. 4. While the pudding is baking, combine the brown sugar, 1/2 cup butter, corn syrup, and rum in a saucepan. Bring to a boil over medium heat and simmer for 3 to 4 minutes or until just slightly thickened. Let cool slightly. 5. Remove the pudding from the oven and let it cool for about ten minutes before serving. Serve warm with the caramel sauce. Cool and cover any leftover pudding and store it in the refrigerator.",
  "prep": "15 mins",
  "cook": "1 hr 10 mins",
  "total": "1 hr 35 mins",
  "calories": "456"
},
{
  "url": "https://www.allrecipes.com/recipe/23734/white-peach-sangria/",
  "name": "White Peach Sangria",
  "rating": "4.7",
  "ratingcount": "504",
  "ingredients": "1 (750 milliliter) bottle dry white wine; ¾ cup peach flavored vodka; 6 tablespoons frozen lemonade concentrate, thawed; ¼ cup white sugar; 1 pound white peaches, pitted and sliced; ¾ cup seedless red grapes, halved; ¾ cup seedless green grapes, halved",
  "directions": "1. Combine white wine, peach vodka, lemonade concentrate, and sugar in a large pitcher; stir until sugar is dissolved. Add sliced peaches, red grapes, and green grapes. 2. Refrigerate sangria until well chilled and flavors have blended, at least 2 hours to overnight. 3. Serve over ice, and use a slotted spoon to include sliced peaches and grapes with each serving.",
  "prep": "10 mins",
  "cook": "",
  "total": "2 hrs 10 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/15148/fresh-peach-cobbler-i/",
  "name": "Fresh Peach Cobbler I",
  "rating": "4.2",
  "ratingcount": "141",
  "ingredients": "½ cup white sugar; 1 tablespoon cornstarch; ¼ teaspoon ground cinnamon; 4 cups sliced fresh peaches; 1 teaspoon lemon juice; 1 cup all-purpose flour; 1 tablespoon white sugar; 1 ½ teaspoons baking powder; ½ teaspoon salt; 3 tablespoons shortening; ½ cup milk",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). 2. Combine 1/2 cup sugar, cornstarch, and cinnamon in a saucepan and whisk to mix. Stir in sliced peaches (see Editor's Note) and lemon juice, tossing until peaches are evenly coated. 3. Cook filling over medium heat, stirring constantly, until mixture thickens and boils. Boil 1 minute. Pour mixture into an ungreased 2-quart casserole dish. Keep mixture hot in oven while you make the topping. 4. In a medium bowl combine flour, 1 tablespoon sugar, baking powder, and salt. Mix thoroughly, then cut in shortening until mixture looks like fine crumbs. Add milk and stir until mixture is evenly moistened. 5. Remove peach filling from oven and drop dough onto peaches in 6 equal-size spoonfuls. 6. Return cobbler to oven and bake until topping is golden brown, 25 to 30 minutes.",
  "prep": "30 mins",
  "cook": "25 mins",
  "total": "55 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/229004/peach-dump-cake/",
  "name": "Marie's Peach Dump Cake",
  "rating": "4.3",
  "ratingcount": "86",
  "ingredients": "1 (29 ounce) can sliced peaches in heavy syrup, undrained; 1 (18.25 ounce) box yellow cake mix; ¾ cup butter, sliced into pats, or more if needed",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with margarine. 2. Pour peaches and heavy syrup into the prepared baking dish. Spread cake mix evenly over peaches. Arrange butter pats in even rows on the cake mix. 3. Bake in the preheated oven until top of cake is golden brown, 35 to 40 minutes.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "318"
},
{
  "url": "https://www.allrecipes.com/recipe/139349/easy-stovetop-peach-cobbler/",
  "name": "Easy Stovetop Peach Cobbler",
  "rating": "4.3",
  "ratingcount": "62",
  "ingredients": "1 (29 ounce) can sliced peaches; 2 teaspoons ground cinnamon (Optional); ¼ cup white sugar; 1 (9 ounce) package yellow cake mix; 4 teaspoons margarine",
  "directions": "1. Discard 1/2 of the juice from the peaches and pour the rest into a saucepan. Sprinkle the top with cinnamon and sugar. Empty the cake mix on top of the peaches in an even layer. Place the margarine on top of the cake mix in the center. 2. Cover sauce pan with a lid and bring to a simmer over medium-high heat. Once you see steam escaping the saucepan, reduce heat to medium-low, and continue cooking for 10 minutes. Do not lift the lid during this time! Remove from heat and allow to stand with the lid on for 15 minutes before serving. The cake mix should look like dumplings.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "298"
},
{
  "url": "https://www.allrecipes.com/recipe/274821/peaches-and-cream-literally/",
  "name": "Peaches and Cream, Literally",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "4 medium fresh peaches, or as needed; ⅓ cup white sugar, or to taste; ¼ cup water; 1 ½ cups heavy cream",
  "directions": "1. Cut each peach in half along the crease, twist open, and remove the pit. Peel and slice. Cut slices in half to get roughly 2 cups of sliced peaches. 2. Bring sugar and water to a boil in a saucepan over medium-high heat. Boil until a syrup forms, about 3 minutes. Stir in peaches until coated. Bring syrup back to a light simmer, about 1 minute. Immediately remove from the heat and pour mixture into a bowl to cool, 15 to 20 minutes. 3. Use a slotted spoon to transfer peaches to a large bowl. Discard simple syrup or reserve for another use. Pour in heavy cream and stir to combine. Divide mixture between six serving glasses or bowls, cover with plastic wrap, and refrigerate until completely chilled and cream has absorbed all the peach flavor, at least 3 hours.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "3 hrs 40 mins",
  "calories": "397"
},
{
  "url": "https://www.allrecipes.com/recipe/15142/award-winning-peaches-and-cream-pie/",
  "name": "Award-Winning Peaches and Cream Pie",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "¾ cup all-purpose flour; 1 (3 ounce) package cook-and-serve vanilla pudding (not instant); 1 teaspoon baking powder; ½ teaspoon salt; ½ cup milk; 3 tablespoons butter, softened; 1 large egg; 1 (29 ounce) can sliced peaches in heavy syrup; 1 tablespoon white sugar; 1 teaspoon ground cinnamon; 1 (8 ounce) package cream cheese, softened; ½ cup white sugar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease the sides and bottom of a 10-inch deep-dish pie pan. 2. Make the crust: Whisk flour, pudding mix, baking powder, and salt together in a bowl. Add milk, butter, and egg; beat with an electric mixer for 2 minutes. Pour into the prepared pie pan. 3. Make the filling: Drain peaches, reserving 3 tablespoons syrup. Mix 1 tablespoon sugar and cinnamon together in a small bowl. 4. Beat cream cheese in another small bowl until fluffy. Add 1/2 cup sugar and reserved syrup; beat for 2 minutes. 5. Arrange sliced peaches over crust mixture. Spoon cream cheese mixture over peaches to within 1 inch of the pan edge, then sprinkle cinnamon sugar over top. 6. Bake in the preheated oven until golden brown, 30 to 35 minutes. Let cool for 20 minutes, then chill for at least 2 hours before serving.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "3 hrs 10 mins",
  "calories": "370"
},
{
  "url": "https://www.allrecipes.com/recipe/284448/peach-pie-with-frozen-peaches/",
  "name": "Peach Pie with Frozen Peaches",
  "rating": "4.7",
  "ratingcount": "10",
  "ingredients": "2 sheets refrigerated pie crust; 2 teaspoons all-purpose flour, or as needed; 2 pounds sliced frozen peaches; ½ cup white sugar; 1 teaspoon lemon juice; ½ teaspoon ground cinnamon; ⅛ teaspoon salt; 3 tablespoons cornstarch; 1 large egg, beaten; 1 tablespoon white sugar; 1 tablespoon coarse sparkling sugar",
  "directions": "1. Allow pie crusts to sit at room temperature about 15 minutes if recommended by manufacturer. 2. Preheat the oven to 400 degrees F (200 degrees C). 3. Remove plastic packaging from pie crusts and gently unroll one piece on a floured work surface. Dust the dough with flour on both sides. Fit the dough inside a 9-inch pie pan, shaping and gently stretching it to the top edge of the pie pan. 4. Stir together frozen peach slices, sugar, cornstarch, lemon juice, cinnamon, and salt in a large bowl (see note.) 5. Pour peach mixture into the unbaked pie crust and gently level out the top of the peaches with the back of a spoon. Peach slices will still be frozen. 6. Gently unroll the second piece of dough on the floured work surface. Fit the second dough circle on top of the peaches, and allow an even amount to hang over the edge of the pan, all the way around. 7. Brush the top of the pie with beaten egg, discarding any excess egg. Fold the edges of the top crust under, using the edge of the pan for a guide. Press the top crust and the bottom crust together to form a crimped edge. Lightly cover the crimped edge of the pie with strips of aluminum foil or with pie crust shields, to prevent over-browning. 8. Cut several slits in the top crust with a sharp knife. Sprinkle sparkling sugar over the crust. 9. Place the pie on a baking sheet and bake in the preheated oven until the pie is browned and bubbly, about 1 hour. 10. Cool on a rack about 30 minutes and serve warm.",
  "prep": "25 mins",
  "cook": "1 hr",
  "total": "2 hrs 10 mins",
  "calories": "354"
},
{
  "url": "https://www.allrecipes.com/recipe/285159/easy-peach-cobbler-with-canned-peaches/",
  "name": "Easy Peach Cobbler with Canned Peaches",
  "rating": "3.6",
  "ratingcount": "5",
  "ingredients": "2 (29 ounce) cans sliced peaches in juice; 2 cups all-purpose flour; 1 cup sugar; ¾ cup unsalted butter, softened; 1 cup chopped pecans",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Pour peaches and juice into a 9x13-inch baking dish. 2. Combine flour, sugar, and butter in a bowl; mix and knead with hands until crumbly. Sprinkle over the peaches, then scatter pecans over top. 3. Bake in the preheated oven until topping is golden brown and peaches are bubbly, 45 minutes to 1 hour.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "55 mins",
  "calories": "273"
},
{
  "url": "https://www.allrecipes.com/recipe/12148/easy-fruit-cobbler/",
  "name": "Easy Fruit Cobbler",
  "rating": "4.3",
  "ratingcount": "491",
  "ingredients": "1 cup all-purpose flour; 2 teaspoons baking powder; ¾ cup white sugar; ¾ cup milk; ¼ cup butter; 2 cups sliced fresh peaches",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). Melt butter in a 9 x 9 inch baking dish. 2. Blend together flour, baking powder, sugar, and milk. 3. Pour batter in baking dish over the butter. Sprinkle fruit on top of the batter, do not stir. Bake for 1 hour or until golden brown.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "200"
},
{
  "url": "https://www.allrecipes.com/recipe/72126/nanas-southern-pickled-peaches/",
  "name": "Nana's Southern Pickled Peaches",
  "rating": "4.9",
  "ratingcount": "54",
  "ingredients": "4 cups white sugar; 1 cup white vinegar; 1 cup water; 2 tablespoons whole cloves; 4 pounds fresh clingstone peaches, blanched and peeled; 5 (3-inch long) cinnamon sticks",
  "directions": "1. Inspect five quart-sized jars for cracks and rings for rust, discarding any defective ones. Immerse in simmering water until peaches are ready. Wash new, unused lids and rings in warm soapy water. 2. At the same time, bring sugar, vinegar, and water to a boil in a large pot. Boil until syrupy, about 5 minutes. 3. Press one to two cloves into each peach. Place peaches into boiling syrup and boil until tender, about 20 minutes. 4. Spoon peaches into hot, sterilized jars, and top with liquid, filling to within 1/2 inch of the rim. Insert one cinnamon stick into each jar. Wipe the rims with a clean dry cloth, then seal with lids and rings. 5. Place a rack into the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 10 minutes to seal, or consult times recommended by your local extension. 6. Remove the jars from the stockpot and let rest, several inches apart, for 12 to 24 hours. Press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "13 hrs 15 mins",
  "calories": "88"
},
{
  "url": "https://www.allrecipes.com/recipe/15046/easy-peach-cobbler-with-cake-mix/",
  "name": "Easy Peach Cobbler with Cake Mix",
  "rating": "4.3",
  "ratingcount": "330",
  "ingredients": "12  fresh peaches, pitted and sliced; 1 cup water; 1 cup white sugar; ½ teaspoon ground cinnamon; 1 (15.25 ounce) package white cake mix; 1 (8 ounce) package cream cheese, cut into pats; ½ cup unsalted butter, cut into pieces",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Spread peach slices evenly in the bottom of a 9x13-inch baking dish. Stir water and sugar together in a small bowl until dissolved; pour mixture over peaches. Sprinkle cinnamon over peaches, then cake mix. Top cake mix with pats of cream cheese, then butter. 3. Bake in the preheated oven until golden, about 45 minutes.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "356"
},
{
  "url": "https://www.allrecipes.com/recipe/17635/ga-peach-pound-cake/",
  "name": "Peach Pound Cake",
  "rating": "4.6",
  "ratingcount": "614",
  "ingredients": "2 cups white sugar; 1 cup butter or margarine, softened; 4  eggs; 1 teaspoon vanilla extract; 3 cups all-purpose flour, divided; 1 teaspoon baking powder; ½ teaspoon salt; 2 cups fresh peaches, pitted and chopped",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Butter a 10-inch tube pan and dust with white sugar. 2. Cream sugar and butter in a mixing bowl with an electric mixer until light and fluffy. Add eggs, one at a time, beating well after each addition, then stir in vanilla. 3. Sift 2 3/4 cups flour, baking powder, and salt together into a bowl; gradually stir dry ingredients into wet ingredients. 4. Place remaining 1/4 cup flour into a small bowl. Add peaches and toss to coat, then fold floured peaches into batter. Spread batter evenly into the prepared pan. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 70 minutes. Cool in the pan for 10 minutes, then invert onto a wire rack to cool completely.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "307"
},
{
  "url": "https://www.allrecipes.com/recipe/259043/crisp-peach-cobbler/",
  "name": "Crisp Peach Cobbler",
  "rating": "4.6",
  "ratingcount": "289",
  "ingredients": "6 large  fresh peaches, pitted and cut into eighths; 1  lemon, zested and juiced; ½ cup unsalted butter, at room temperature; 1 ¼ cups white sugar; 1 ⅓ cups self-rising flour; ⅓ cup rolled oats; ⅔ cup whole milk; ¼ cup white sugar; 2 tablespoons cold water, or as needed to wet topping sugar",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Place a baking sheet on the rack under the middle rack to catch drips. Generously butter a 2-inch deep (2-quart) baking dish. 2. Place peach sections into prepared baking dish. Sprinkle with lemon juice and zest. 3. Stir butter and sugar together in a mixing bowl. Mix until creamed and resembles a sugary, buttery paste, 4 to 5 minutes. Add oats and flour; stir until flour and oats are incorporated into the butter-sugar mixture and mixture resembles coarse crumbs, 4 to 5 minutes. Pour in milk; stir until mixture is wet and creamy, like a thick spreadable batter, 3 to 4 minutes. 4. Drop batter by spoonful on top of the peaches. Spread batter evenly over the surface of the peaches. Sprinkle 1/4 cup sugar on the batter. Spritz with water until sugar is wet and surface glistens. 5. Bake in preheated oven on middle rack until browned and crispy, about 45 minutes. Let cool at least 30 minutes before serving.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 35 mins",
  "calories": "371"
},
{
  "url": "https://www.allrecipes.com/recipe/18917/absolute-stress/",
  "name": "Absolute Stress",
  "rating": "4.3",
  "ratingcount": "86",
  "ingredients": "1 cup ice cubes, or as needed; 1 fluid ounce vodka; 1 fluid ounce dark rum; 1 fluid ounce peach schnapps; 1 fluid ounce orange juice; 1 fluid ounce cranberry juice",
  "directions": "1. Fill a tall glass with ice. 2. Add vodka, rum, peach schnapps, orange juice, and cranberry juice to a cocktail shaker. Cover and shake well. Pour over ice.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/234306/butter-biscuit-peach-cobbler/",
  "name": "Butter Biscuit Peach Cobbler",
  "rating": "4.6",
  "ratingcount": "61",
  "ingredients": "2 (29 ounce) cans peaches; ¾ cup white sugar; ½ cup brown sugar; ½ cup unsalted butter; 1 tablespoon cornstarch; 1 teaspoon vanilla extract; 1 teaspoon ground cinnamon; ½ teaspoon nutmeg; 1 pinch salt; 1 (16 ounce) can refrigerated buttermilk biscuit dough (such as Pillsbury Grands!®); 1 pinch ground cinnamon; 1 pinch white sugar; 1 pinch ground nutmeg; 1  pastry for a 9-inch pie crust",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Mix peaches, 3/4 cup white sugar, brown sugar, butter, cornstarch, vanilla extract, 1 teaspoon cinnamon, 1/2 teaspoon nutmeg, and salt in a large pot over medium heat; cook and stir until sugars are dissolved and butter is melted, about 5 minutes. 3. Sprinkle each biscuit with 1 pinch cinnamon, 1 pinch white sugar, and 1 pinch nutmeg. Flatten biscuits on a lightly floured surface using a rolling pin. Cut each flattened biscuit into 12 to 15 small squares; stir into peach mixture. Reduce heat to medium-low and simmer, stirring occasionally, until thickened, about 10 minutes. 4. Pour peach-biscuit mixture into a 9x13-inch baking dish and allow to thicken for 2 to 3 minutes; cover or decorate with pie crust. Cover dish with a sheet of aluminum foil and place dish on a baking sheet. 5. Bake in the preheated oven until crust is golden brown, 45 minutes to 1 hour. Cool before serving.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 35 mins",
  "calories": "495"
},
{
  "url": "https://www.allrecipes.com/recipe/223329/white-peachy-sangria/",
  "name": "White Peachy Sangria",
  "rating": "4.9",
  "ratingcount": "69",
  "ingredients": "4 (750 milliliter) bottles moscato wine; 4 (12 fluid ounce) cans or bottles lemon-lime soda (such as Sprite®); 1 cup brandy; 1 cup peach schnapps; 2  fresh peaches, pitted and sliced; 1 (16 ounce) package fresh strawberries, sliced; 2  mangos - peeled, seeded, and sliced; ½  fresh pineapple - peeled, cored, and cut into chunks; 1 (6 ounce) container fresh raspberries",
  "directions": "1. Stir moscato wine, lemon-lime soda, brandy, peach schnapps, peaches, strawberries, mangos, pineapple chunks, and raspberries together in a large container and chill 8 hours or overnight.",
  "prep": "30 mins",
  "cook": "",
  "total": "8 hrs 30 mins",
  "calories": "376"
},
{
  "url": "https://www.allrecipes.com/recipe/22778/southern-peach-cobbler/",
  "name": "Southern Peach Cobbler",
  "rating": "4.4",
  "ratingcount": "332",
  "ingredients": "½ cup butter; 1 cup white sugar; ¾ cup self-rising flour; ¾ cup milk; 1 (29 ounce) can sliced peaches in light syrup",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Place butter in a deep 2 quart baking dish and place in oven to melt. 2. In a medium bowl, mix sugar and flour. Stir in milk, a little at a time, until wholly incorporated. Pour carefully over melted butter in dish. Spoon peaches and syrup over batter. 3. Bake in preheated oven 35 to 45 minutes, until crust is puffed and golden.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "306"
},
{
  "url": "https://www.allrecipes.com/recipe/223305/peach-and-blackberry-cobbler/",
  "name": "Peach and Blackberry Cobbler",
  "rating": "4.6",
  "ratingcount": "57",
  "ingredients": "4 cups peeled and sliced fresh peaches; 1 cup fresh blackberries; ¼ cup white sugar; 1 teaspoon ground cinnamon; 1 tablespoon lemon juice; ½ cup butter, melted; 1 ¼ cups all-purpose flour; 1 cup white sugar; 2 teaspoons baking powder; ½ teaspoon salt; 1 cup milk",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Mix peaches, blackberries, 1/4 cup sugar, cinnamon, and lemon juice in a bowl. 3. Pour butter into a 9x13-inch glass baking dish and evenly coat the bottom and sides. Whisk flour, 1 cup sugar, baking powder, and salt in a bowl; mix in milk, stirring just to moisten dry ingredients. Pour batter into prepared baking dish and distribute fruit mixture evenly over the batter. 4. Bake in the preheated oven until cobbler is golden brown, about 45 minutes.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "223"
},
{
  "url": "https://www.allrecipes.com/recipe/232903/peach-banana-smoothie/",
  "name": "Peach Banana Smoothie",
  "rating": "4.7",
  "ratingcount": "27",
  "ingredients": "1 cup plain yogurt; 1 (15.25 ounce) can peaches; 2  bananas, sliced; ¼ cup orange juice; ¼ cup white sugar, or to taste; 2 cubes  ice",
  "directions": "1. Blend yogurt, peaches, bananas, orange juice, sugar, and ice in a blender on high until the ice is crushed and the smoothie is to your desired consistency.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "194"
},
{
  "url": "https://www.allrecipes.com/recipe/75611/freezer-peach-pie-filling/",
  "name": "Freezer Peach Pie Filling",
  "rating": "4.7",
  "ratingcount": "61",
  "ingredients": "2 ½ cups sliced peaches; ¾ cup white sugar; 1 tablespoon cornstarch; 1 tablespoon MINUTE Tapioca; 1 dash Dash of nutmeg",
  "directions": "1. Place sliced peaches in a bowl with sugar, cornstarch, tapioca, and nutmeg. Toss until evenly coated and sugar is mostly dissolved. 2. Transfer peaches to a 9 inch foil-lined pie plate. Cover with another piece of foil and freeze immediately to prevent peaches from discoloring. Once frozen solid, remove peaches from pie plate, with foil, and transfer to a zipper locked plastic bag for later use. When ready to use, line a pie plate with prepared crust and place frozen peaches on top. 3. Preheat oven to 450 degrees F (230 degrees C). 4. Bake in the preheated oven on the bottom rack for 20 minutes. Lower heat to 350 degrees F (175 degrees C) and continue baking for another 30 to 35 minutes, or until completely warmed through.",
  "prep": "15 mins",
  "cook": "55 mins",
  "total": "3 hrs 10 mins",
  "calories": "121"
},
{
  "url": "https://www.allrecipes.com/recipe/20120/peach-ice-cream/",
  "name": "Peach Ice Cream",
  "rating": "4.7",
  "ratingcount": "301",
  "ingredients": "6 large eggs, beaten; 3 ½ cups white sugar; 10  fresh peaches, pitted and chopped; 4 cups heavy cream; 2 cups half-and-half cream; 2 teaspoons vanilla extract; ¾ teaspoon salt",
  "directions": "1. Mix together eggs and sugar in a large bowl until smooth; purée peaches in a blender or food processor and stir 5 cups purée into egg mixture. Stir in cream, half-and-half, vanilla, and salt, and mix well. 2. Pour mixture into an ice cream maker and freeze according to manufacturer's instructions, about 20 minutes. Transfer to an airtight container and freeze until firm, about 4 hours.",
  "prep": "20 mins",
  "cook": "",
  "total": "4 hrs 40 mins",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/23537/white-sangria/",
  "name": "White Sangria",
  "rating": "4.7",
  "ratingcount": "162",
  "ingredients": "½ cup peach schnapps; ½ cup cognac; ¼ cup white sugar; 4  oranges, sliced into rounds; 2  mangos, peeled and sliced; 4 (750 milliliter) bottles dry white wine, chilled; 1 liter ginger ale, chilled",
  "directions": "1. Combine peach schnapps, cognac, sugar, sliced oranges, and sliced mangos in a pitcher; stir and chill for at least an hour. 2. Pour fruit mixture into a large punch bowl. Stir in chilled white wine and ginger ale. Ladle into glasses with some of the sliced fruit.",
  "prep": "30 mins",
  "cook": "",
  "total": "1 hr 30 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/7446/peach-upside-down-cake-i/",
  "name": "Peach Upside Down Cake I",
  "rating": "4.2",
  "ratingcount": "122",
  "ingredients": "¼ cup butter; ½ cup packed light brown sugar; ¼ teaspoon ground nutmeg; 5  fresh peaches - peeled, pitted and halved; ½ cup butter, softened; ½ cup white sugar; 1  egg; 1 ¼ cups all-purpose flour; 2 teaspoons baking powder; ½ teaspoon salt; ½ cup milk",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Melt 1/4 cup butter or margarine in an 8-inch square pan. Sprinkle with brown sugar and nutmeg. Arrange peach halves, cut side down, in pan. 3. In a large bowl, cream the butter and sugar until light and fluffy. Beat in egg. Stir together flour, baking powder and salt. Add flour mixture to creamed mixture alternately with milk, beating well after each addition. Spread batter over peaches. 4. Bake in preheated oven until lightly browned on top, 35 to 40 minutes. Remove cake from oven, and let stand in pan for 5 minutes; invert onto serving platter.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "318"
},
{
  "url": "https://www.allrecipes.com/recipe/241994/baked-peaches-n-cream/",
  "name": "Baked Peaches 'n Cream",
  "rating": "4.7",
  "ratingcount": "23",
  "ingredients": "8 teaspoons brown sugar; 2 tablespoons butter, cut into 8 pieces; 1 pinch ground cinnamon, or more to taste; 4  ripe peaches, halved and pitted; 4 scoops vanilla ice cream",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). 2. Arrange brown sugar, 1 teaspoon per peach, in a 9x13-inch baking dish. Top each brown sugar mound with a piece of butter and a sprinkle of cinnamon. Place a peach half, cut-side down, on top of brown sugar-butter. 3. Bake in the preheated oven until peaches are soft, 15 to 20 minutes. 4. Plate 2 warm peaches per serving and top with 1 scoop vanilla ice cream.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "141"
},
{
  "url": "https://www.allrecipes.com/recipe/8249/peach-cake-ii/",
  "name": "Peach Cake II",
  "rating": "4.4",
  "ratingcount": "227",
  "ingredients": "3  egg, beaten; 1 ¾ cups white sugar; 1 cup vegetable oil; 2 cups all-purpose flour; 1 teaspoon salt; 1 teaspoon ground cinnamon; 1 teaspoon baking soda; 2 cups fresh peaches - peeled, pitted, and sliced; ½ cup chopped pecans",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Grease and flour a 9x13 inch pan. 2. In a large bowl, combine the eggs, sugar, oil, flour, salt, cinnamon, baking soda, peaches and pecans. Mix thoroughly by hand. 3. Pour into prepared 9x13 inch pan and bake at 375 degrees F (190 degrees C) for 50 minutes or until done.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "203"
},
{
  "url": "https://www.allrecipes.com/recipe/244408/peaches-with-burrata-basil-and-raspberry-balsamic-syrup/",
  "name": "Peach Burrata Salad",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "1 (4 ounce) ball burrata cheese, at room temperature; 1  peach, sliced; 1 tablespoon thinly sliced fresh basil leaves; 2 tablespoons extra-virgin olive oil; 3 tablespoons raspberry balsamic vinegar; flaked sea salt to taste; 1 pinch freshly ground black pepper or to taste",
  "directions": "1. Gently tear open the burrata cheese to expose the soft, creamy core and place in the center of a plate. Arrange peach slices in and around the cheese. Sprinkle basil leaves over cheese and drizzle with olive oil. 2. Bring raspberry balsamic vinegar to a boil in a small saucepan; reduce heat to medium-low and simmer until vinegar reduces to a thick syrup, about 5 minutes. Spoon balsamic syrup over peaches and cheese; season with sea salt and black pepper.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "159"
},
{
  "url": "https://www.allrecipes.com/recipe/12347/peach-pie/",
  "name": "Peach Pie",
  "rating": "4.4",
  "ratingcount": "704",
  "ingredients": "10  fresh peaches, pitted and sliced; ⅓ cup all-purpose flour; 1 cup white sugar; ¼ cup butter; 1 recipe pastry for a 9 inch double crust pie",
  "directions": "1. Mix flour, sugar and butter into crumb stage. 2. Place one crust in the bottom of a 9 inch pie plate. Line the shell with some sliced peaches. Sprinkle some of the butter mixture on top of the peaches, then put more peaches on top of the the crumb mixture. Continue layering until both the peaches and crumbs are gone. 3. Top with lattice strips of pie crust. 4. Bake at 350 degrees F (175 degrees C) for 45 minutes, or until crust is golden. Allow pie to cool before slicing. Best when eaten fresh.",
  "prep": "1 hr",
  "cook": "45 mins",
  "total": "1 hr 45 mins",
  "calories": "425"
},
{
  "url": "https://www.allrecipes.com/recipe/12320/best-peach-cobbler-ever/",
  "name": "Best Peach Cobbler Ever",
  "rating": "4.2",
  "ratingcount": "374",
  "ingredients": "1 (29 ounce) can sliced peaches; 2 tablespoons butter, melted; 1 pinch ground cinnamon; 1 pinch ground nutmeg; 1 tablespoon cornstarch; ½ cup water; 1 cup milk; 1 cup white sugar; 1 cup all-purpose flour; 2 teaspoons baking powder; 1 pinch salt; ½ cup butter; 1 teaspoon ground cinnamon; ¼ teaspoon ground nutmeg",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C.) In a large bowl, combine sliced peaches with juice, 2 tablespoons melted butter, a pinch of cinnamon and a pinch of nutmeg. Dissolve cornstarch in water, then stir into peach mixture; set aside. 2. In another bowl, combine milk, sugar, flour, baking powder and salt. Beat until smooth - mixture will be thin. 3. Melt 1/2 cup butter in a 9x13 inch pan. Pour batter over melted butter. Spoon peaches over batter. Sprinkle top with additional cinnamon and nutmeg. 4. Bake in preheated oven for 1 hour, or until knife inserted comes out clean.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "263"
},
{
  "url": "https://www.allrecipes.com/recipe/18469/peach-cobbler-vi/",
  "name": "Peach Cobbler VI",
  "rating": "4.5",
  "ratingcount": "543",
  "ingredients": "1 cup all-purpose flour; ½ cup brown sugar; ½ cup white sugar; 2 teaspoons baking powder; ½ teaspoon salt; 1 teaspoon vanilla extract; ¾ cup milk; ½ cup margarine, melted; 1 (29 ounce) can sliced canned peaches, drained; 1 teaspoon ground cinnamon",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Grease a 9x9-inch baking dish. 2. In a large bowl, combine flour, brown sugar, white sugar, baking powder, salt, and vanilla. Pour milk into dry ingredients, and then stir in melted margarine. Mix thoroughly. 3. Pour mixture into prepared baking pan. Arrange peaches on top and sprinkle with cinnamon. Bake in preheated oven until golden brown, about 30 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "299"
},
{
  "url": "https://www.allrecipes.com/recipe/15814/apricot-and-peach-fried-pies/",
  "name": "Apricot and Peach Fried Pies",
  "rating": "4.7",
  "ratingcount": "70",
  "ingredients": "4 cups all-purpose flour; 2 teaspoons salt; 1 cup shortening; 1 cup milk; 8 ounces dried apricots; 1 (6 ounce) package dried peaches; ¾ cup white sugar; water to cover; 2 cups vegetable oil for frying",
  "directions": "1. To Make Crust: In a large bowl, mix together flour and salt. Cut in shortening until mixture is crumbly. Mix in milk and stir until dough forms a ball. Roll out dough and cut into 18 6-inch circles. Set aside. 2. To Make Filling: In a large saucepan, combine apricots, peaches, and sugar. Add enough water to cover fruit. Cover pan and cook over low heat until fruit is falling apart. Remove lid and continue to cook until water is evaporated. 3. Place oil or shortening in small high-sided skillet. Place over medium heat. Spoon equal amounts of filling into each pastry circle and fold in half. Seal pastry with a fork dipped in cold water. 4. Fry a few pies at a time in hot oil, browning on both sides. Drain pies on paper towels.",
  "prep": "",
  "cook": "30 mins",
  "total": "30 mins",
  "calories": "280"
},
{
  "url": "https://www.allrecipes.com/recipe/8420615/pork-tenderloin-with-peaches/",
  "name": "Pork Tenderloin with Peaches",
  "rating": "4.0",
  "ratingcount": "4",
  "ingredients": "3 slices bacon; 1 (2 pound) package pork tenderloin; ½ teaspoon salt; ¼ teaspoon freshly ground black pepper; ¾ teaspoon ground ginger, divided; 1 ½ cups vertically sliced onion; 1 ½ teaspoons minced garlic; 2 cups peeled and sliced fresh peaches; 1 cup low-sodium chicken broth; 2 tablespoons frozen orange juice concentrate; 1 teaspoon fish sauce; 2 tablespoons water; 2 tablespoons cornstarch; fresh parsley for garnish (optional)",
  "directions": "1. Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned and crisp, about 10 minutes. Drain bacon slices on paper towels. Reserve drippings in the skillet. 2. Dry pork tenderloin with paper towels and season both sides with salt, pepper, and 1/4 teaspoon ground ginger. 3. Increase heat to medium-high and brown tenderloin in the bacon drippings on all sides, 5 to 7 minutes. Removed browned tenderloin from skillet, transfer to a plate, and keep warm. 4. Reduce heat to medium. Add onion slices to the same skillet and stir until onions are soft and beginning to take on some color, 3 to 5 minutes. Stir in garlic and cook until fragrant, about 1 minute. 5. Add sliced peaches, chicken broth, orange juice concentrate, and remaining ground ginger. Bring to a boil and return tenderloin to the skillet. Pile peaches on top of the meat, cover, reduce heat to simmer, and cook until pork is slightly pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). 6. Arrange pork and peaches on a serving platter. 7. Meanwhile, combine fish sauce, water, and cornstarch in a small bowl and stir until there are no lumps. Increase heat to medium and bring skillet contents back to a boil. Add cornstarch mixture to the liquid in the skillet and stir quickly until sauce is bubbly and thickened, about 5 minutes. 8. Pour sauce over pork and peaches. Crumble up cooked bacon and sprinkle over the peaches. Garnish with parsley, if desired, and serve warm.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "200"
},
{
  "url": "https://www.allrecipes.com/recipe/231532/moms-peach-crisp/",
  "name": "Mom's Peach Crisp",
  "rating": "4.7",
  "ratingcount": "691",
  "ingredients": "4 cups sliced fresh peaches; ½ cup all-purpose flour; ½ cup brown sugar; ½ cup cold butter; 1 teaspoon ground cinnamon; ¼ teaspoon salt; 1 cup rolled oats",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Arrange sliced peaches evenly in an 8x8-inch baking dish. 3. Mix flour, brown sugar, butter, cinnamon, and salt in a bowl using a pastry cutter until crumbly. 4. Fold oats into flour mixture. 5. Sprinkle mixture evenly over peaches, pressing down lightly. 6. Bake in the preheated oven until crispy and golden brown on top, about 30 minutes. 7. Enjoy!",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "238"
},
{
  "url": "https://www.allrecipes.com/recipe/283081/instant-pot-peach-cobbler/",
  "name": "Instant Pot Peach Cobbler",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "3 (15 ounce) cans peaches, drained; 1 teaspoon cinnamon sugar; 1 ½ cups white cake mix; ¼ teaspoon ground cinnamon; 4 tablespoons unsalted butter; ½ cup water",
  "directions": "1. Drain peaches and pat dry with a paper towel. Sprinkle peaches with cinnamon sugar. 2. Mix dry cake mix with cinnamon. Cut in butter until mixture resembles coarse crumbs. Set 1/2 of the mixture aside. 3. Mix peaches with 1/2 of the cake mix mixture; place in a 6-inch round dish. Top peaches with remaining cake mix mixture. Cover dish with foil. 4. Pour water into a multi-functional pressure cooker (such as Instant Pot). Set trivet inside. Place round dish on top of the trivet. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 12 minutes. Allow 10 to 15 minutes for pressure to build. 5. Release pressure using the natural-release method according to manufacturer's instructions, about 20 minutes. Unlock and remove the lid. Quick release remaining pressure using the quick-release method, about 5 minutes. 6. Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. 7. Carefully remove dish from the pot and uncover. Broil until topping is set, about 2 minutes.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "1 hr",
  "calories": "432"
},
{
  "url": "https://www.allrecipes.com/recipe/8500498/peach-bourbon-bbq-sauce/",
  "name": "Peach Bourbon BBQ Sauce",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "2 large  ripe peaches - peeled, pitted, and chopped; ½ cup ketchup; ⅓ cup bourbon whiskey; ¼ cup apple cider vinegar; ¼ cup hot honey (such as Mike's Hot Honey®); ¼ cup dark brown sugar; 2 tablespoons Worcestershire sauce; 1 tablespoon liquid smoke; 2 teaspoons Dijon mustard; 1 teaspoon smoked paprika; 1 teaspoon garlic powder; 1 teaspoon onion powder; 1 teaspoon salt; ¼ teaspoon freshly ground black pepper; ⅛ teaspoon allspice",
  "directions": "1. Combine peaches, ketchup, bourbon, apple cider vinegar, hot honey, brown sugar, Worcestershire sauce, liquid smoke, Dijon mustard, smoked paprika, garlic powder, onion powder, salt, pepper, and allspice in a high-powered blender. Blend until mixture is smooth, 15 to 20 seconds. 2. Pour mixture into a medium saucepan. Bring to a light boil over medium heat, whisking constantly. Reduce heat to medium-low and simmer until thickened, 15 to 20 minutes. Sauce will thicken further upon cooling. 3. Store in the refrigerator for up to 1 week, or freeze for future use.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "43"
},
{
  "url": "https://www.allrecipes.com/recipe/87979/peach-pie-the-old-fashioned-two-crust-way/",
  "name": "Peach Pie the Old Fashioned Two Crust Way",
  "rating": "4.6",
  "ratingcount": "767",
  "ingredients": "1 (14.1 ounce) package pastry for a double-crust 9-inch pie; 1  egg, beaten; 5 cups sliced peeled peaches; 2 tablespoons lemon juice; 1 cup white sugar; ½ cup all-purpose flour; ½ teaspoon ground cinnamon; ¼ teaspoon ground nutmeg; ¼ teaspoon salt; 2 tablespoons butter",
  "directions": "1. Preheat the oven to 450 degrees F (220 degrees C). 2. Line the bottom and sides of a 9-inch pie plate with one pie crust. Lightly brush crust with egg to prevent dough from becoming soggy later. Set second crust aside. 3. Place peaches in a large bowl, sprinkle with lemon juice, and mix gently. Mix together sugar, flour, cinnamon, nutmeg, and salt in a separate bowl. Pour over peaches and mix until combined. Pour into pie crust and dot with butter. 4. Cover filling with remaining pie crust. Flute the edges to seal or use a fork dipped in egg to press them down. Brush remaining egg on top, then cut several slits in the top crust to allow steam to escape. 5. Bake pie in the preheated oven for 10 minutes. Reduce the heat to 350 degrees F (175 degrees C) and bake until crust is brown and juice begins to bubble through the vents, 30 to 35 more minutes. If the edges brown too fast, cover them with strips of aluminum foil about halfway through baking. 6. Cool pie for 15 minutes before slicing.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 25 mins",
  "calories": "428"
},
{
  "url": "https://www.allrecipes.com/recipe/51535/fresh-southern-peach-cobbler/",
  "name": "Fresh Southern Peach Cobbler",
  "rating": "4.7",
  "ratingcount": "4",
  "ingredients": "8 fresh peaches - peeled, pitted and sliced into thin wedges; ¼ cup white sugar; ¼ cup brown sugar; ¼ teaspoon ground cinnamon; ⅛ teaspoon ground nutmeg; 1 teaspoon fresh lemon juice; 2 teaspoons cornstarch; 1 cup all-purpose flour; ¼ cup white sugar; ¼ cup brown sugar; 1 teaspoon baking powder; ½ teaspoon salt; 6 tablespoons unsalted butter, chilled and cut into small pieces; ¼ cup boiling water; 3 tablespoons white sugar; 1 teaspoon ground cinnamon",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 425 degrees F (220 degrees C). 3. Combine peaches, 1/4 cup white sugar, 1/4 cup brown sugar, 1/4 teaspoon cinnamon, nutmeg, lemon juice, and cornstarch in a large bowl; toss to coat evenly, and pour into a 2-quart baking dish. Bake in preheated oven for 10 minutes. 4. Meanwhile, combine flour, 1/4 cup white sugar, 1/4 cup brown sugar, baking powder, and salt in a large bowl. Blend in butter with your fingertips or a pastry blender until mixture resembles coarse meal. Stir in water until just combined. 5. Remove peaches from oven, and drop spoonfuls of topping over them. 6. Mix 3 tablespoons white sugar and 1 teaspoon cinnamon together in a small bowl; sprinkle over entire cobbler. 7. Bake in the preheated oven until topping is golden, about 30 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "562"
},
{
  "url": "https://www.allrecipes.com/recipe/12386/quick-and-easy-peach-cobbler/",
  "name": "Quick and Easy Peach Cobbler",
  "rating": "4.3",
  "ratingcount": "509",
  "ingredients": "½ cup unsalted butter, melted; 1 cup self-rising flour; 1 cup white sugar; 1 cup milk; 2 (16 ounce) cans sliced peaches in heavy syrup",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). 3. Mix self-rising flour, sugar, and milk together in a bowl until well combined and no lumps remain. 4. Pour melted butter into a 9- or 10-inch cast iron skillet. Pour flour-milk mixture over top. 5. Carefully pour peaches and syrup into the skillet. Use a spatula to spread peaches evenly around the pan. 6. Bake in the preheated oven until the crust turns golden brown, 30 to 45 minutes. 7. Remove from the oven and let cool for about 10 minutes before serving.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "238"
},
{
  "url": "https://www.allrecipes.com/recipe/258123/peach-and-tomato-caprese-salad/",
  "name": "Peach and Tomato Caprese Salad",
  "rating": "4.7",
  "ratingcount": "19",
  "ingredients": "2 tablespoons extra-virgin olive oil; 1 tablespoon balsamic vinegar; 1 teaspoon flaked salt, divided; 2 large heirloom tomatoes, thinly sliced; 2  ripe peaches - halved, pitted, and sliced into half moons; 1 (8 ounce) ball fresh mozzarella, thinly sliced; 6 leaves fresh basil",
  "directions": "1. Whisk olive oil, balsamic vinegar, and 1 pinch flaked salt together in a bowl until dressing is smooth. 2. Alternate tomato slices, peach slices, mozzarella slices, and basil leaves in layers on a platter. Drizzle dressing over salad and sprinkle remaining flaked salt on top.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "254"
},
{
  "url": "https://www.allrecipes.com/recipe/267581/peach-sorbet/",
  "name": "Peach Sorbet",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "1 pound ripe peaches - peeled, pitted, and chopped; 2 tablespoons lemon juice; ½ cup water; ½ cup white sugar",
  "directions": "1. Add peaches to a blender; blend until smooth. Measure out 1 1/2 cups peach puree into a bowl. Immediately stir in lemon juice and refrigerate. 2. Combine water and sugar in a small saucepan and bring to a boil. Stir until sugar is dissolved, about 1 minute. Remove from stove and cool to room temperature. Refrigerate simple syrup until chilled, about 1 hour. 3. Pour chilled peach puree and simple syrup into an ice cream maker and freeze according to manufacturer's instructions, about 20 minutes. Transfer to an airtight container and freeze until firm, about 4 hours.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "5 hrs 35 mins",
  "calories": "60"
},
{
  "url": "https://www.allrecipes.com/recipe/234261/classic-bisquick-peach-cobbler/",
  "name": "Classic Bisquick Peach Cobbler",
  "rating": "4.5",
  "ratingcount": "169",
  "ingredients": "1 cup Original Bisquick® mix; 1 cup milk; ½ teaspoon ground nutmeg; ½ cup butter or margarine, melted; 1 (29 ounce) can sliced peaches, drained; 1 cup sugar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Stir together Bisquick mix, milk, and nutmeg in an ungreased 8x8-inch baking dish. Stir in melted butter or margarine until blended. 3. Stir together peaches and sugar in a bowl until combined; spoon over batter. 4. Bake in the preheated oven until golden, 50 to 60 minutes.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "427"
},
{
  "url": "https://www.allrecipes.com/recipe/7987/peach-cobbler-dump-cake-i/",
  "name": "Peach Dump Cake",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "2 (16 ounce) cans peaches in heavy syrup; 1 (15.25 ounce) package yellow cake mix; ½ cup butter; ½ teaspoon ground cinnamon, or to taste",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Empty peaches into a 9x13-inch baking dish. Cover peaches with dry cake mix and press down firmly. Cut butter into small pieces and scatter on top of cake mix. Sprinkle top with cinnamon. 3. Bake in the preheated oven until top of cake is golden brown, about 45 minutes.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "55 mins",
  "calories": "155"
},
{
  "url": "https://www.allrecipes.com/recipe/264042/3-ingredient-cake-mix-cobbler/",
  "name": "3-Ingredient Cake Mix Cobbler",
  "rating": "4.3",
  "ratingcount": "47",
  "ingredients": "2 (15.25 ounce) cans peaches in light syrup; 1 (15.25 ounce) package yellow cake mix; ½ cup butter, melted",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Pour peaches into a baking dish. Sprinkle cake mix on top and pour melted butter all over. 3. Bake in the preheated oven until golden brown, about 50 minutes.",
  "prep": "5 mins",
  "cook": "50 mins",
  "total": "55 mins",
  "calories": "439"
},
{
  "url": "https://www.allrecipes.com/recipe/239090/blueberry-and-peach-crisp/",
  "name": "Blueberry Peach Crisp",
  "rating": "4.5",
  "ratingcount": "67",
  "ingredients": "2 (10 ounce) packages frozen sliced peaches, thawed and drained; 1 (10 ounce) package frozen blueberries, thawed and drained; 2 teaspoons lemon juice; 2 tablespoons all-purpose flour; 2 tablespoons white sugar; ½ cup old-fashioned oats; ⅓ cup firmly packed brown sugar; ¼ cup all-purpose flour; ¼ cup chopped almonds; ½ teaspoon ground cinnamon; ⅛ teaspoon nutmeg; ¼ cup butter",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Gently stir peaches, blueberries, and lemon juice together in an 8-inch square baking dish. Stir 2 tablespoons flour and white sugar into fruit mixture. 3. Stir oats, brown sugar, 1/4 cup flour, almonds, cinnamon, and nutmeg together in a small bowl. Mash butter into the oats mixture with a pastry cutter or a fork until the mixture is crumbly; sprinkle over the fruit to cover. 4. Bake in preheated oven until the fruit is bubbling and the topping is golden brown, about 30 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "222"
},
{
  "url": "https://www.allrecipes.com/recipe/23553/basic-fruit-smoothie/",
  "name": "Basic Fruit Smoothie",
  "rating": "4.4",
  "ratingcount": "81",
  "ingredients": "1 quart strawberries, hulled; 2  fresh peaches - peeled, pitted, and sliced; 1  banana, broken into chunks; 2 cups ice; 1 cup orange-peach-mango juice",
  "directions": "1. Gather all ingredients. 2. Combine strawberries, peaches, and banana in a blender; blend until smooth. 3. Add ice and pour in juice; blend again to desired consistency. 4. Enjoy!",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "118"
},
{
  "url": "https://www.allrecipes.com/recipe/88354/easy-batter-fruit-cobbler/",
  "name": "Easy Batter Fruit Cobbler",
  "rating": "4.6",
  "ratingcount": "2",
  "ingredients": "4 tablespoons butter; ¾ cup all-purpose flour; ¾ cup sugar; 1 teaspoon baking powder; ¼ teaspoon salt; ¾ cup milk; 2 cups of sliced fresh peaches or nectarines, or whole blueberries, strawberries, raspberries, blackberries or a combination of fruits (or a 12-ounce package of frozen berries); 1 tablespoon sugar",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Adjust the oven rack to the upper-middle position. 2. Put butter in an 8-inch square or 9-inch round pan; place in the oven until butter is melted. Remove the pan from the oven and set aside. 3. Whisk flour, 3/4 cup sugar, baking powder, and salt in a medium bowl. Whisk in milk until a smooth batter forms. 4. Pour batter into the prepared pan with melted butter. 5. Scatter fruit over batter. Sprinkle with 1 tablespoon sugar. 6. Bake in the preheated oven until the top is lightly browned and fruit bubbles, 50 to 60 minutes. 7. Serve warm or at room temperature.",
  "prep": "15 mins",
  "cook": "55 mins",
  "total": "1 hr 10 mins",
  "calories": "384"
},
{
  "url": "https://www.allrecipes.com/recipe/38236/georgia-peach-homemade-ice-cream/",
  "name": "Georgia Peach Homemade Ice Cream",
  "rating": "4.6",
  "ratingcount": "138",
  "ingredients": "2 ½ pounds fresh peaches - peeled, pitted and chopped; 1 pint half-and-half cream; ½ cup white sugar; 1 (14 ounce) can sweetened condensed milk; 1 (12 fluid ounce) can evaporated milk; 1 teaspoon vanilla extract; 2 cups whole milk, or as needed",
  "directions": "1. Working in batches, purée peaches with half-and-half and sugar in a blender or food processor. 2. Mix peach mixture, sweetened condensed milk, evaporated milk, and vanilla in a gallon ice cream freezer container. Pour enough whole milk into the container to reach the fill line, about 2 cups. 3. Pour mixture into an ice cream maker and freeze according to manufacturer's instructions, about 20 minutes. Transfer to an airtight container and freeze until firm, about 4 hours.",
  "prep": "15 mins",
  "cook": "",
  "total": "4 hrs 35 mins",
  "calories": "106"
},
{
  "url": "https://www.allrecipes.com/recipe/19897/old-fashioned-peach-cobbler/",
  "name": "Old Fashioned Peach Cobbler",
  "rating": "4.6",
  "ratingcount": "704",
  "ingredients": "2 ½ cups all-purpose flour; 4 tablespoons white sugar, divided; 1 teaspoon salt; 1 cup shortening; 1 large egg; ¼ cup cold water; 1 tablespoon butter, melted; 3 pounds fresh peaches - peeled, pitted, and sliced; ¾ cup orange juice; ¼ cup lemon juice; ½ cup butter; 2 cups white sugar; 1 tablespoon cornstarch; 1 teaspoon ground cinnamon; ½ teaspoon ground nutmeg",
  "directions": "1. Make crust: Sift together flour, 3 tablespoons sugar, and salt in a medium bowl. Work in shortening with a pastry blender until mixture resembles coarse crumbs. Whisk together egg and cold water in a small bowl. Sprinkle over flour mixture; work with hands to form dough into a ball. Wrap with plastic wrap and chill in the refrigerator for 30 minutes. 2. Preheat the oven to 350 degrees F (175 degrees C). 3. Roll out 1/2 of the chilled dough to 1/8-inch thickness. Place in a 9x13-inch baking dish, covering the bottom and halfway up the sides. 4. Bake in the preheated oven until golden brown, about 20 minutes. 5. Make filling: Mix peaches, orange juice, and lemon juice in a large saucepan. Add butter and cook over medium-low heat until butter is melted. Stir together sugar, cornstarch, cinnamon, and nutmeg in a bowl; mix into peach mixture until combined. Pour into baked crust. 6. Roll remaining dough to 1/4-inch thickness. Cut into 1/2-inch-wide strips. Weave strips into a lattice over peaches. Sprinkle with 1 tablespoon sugar, then drizzle with melted butter. 7. Bake in the preheated oven until top crust is golden brown, 35 to 40 minutes.",
  "prep": "30 mins",
  "cook": "1 hr 10 mins",
  "total": "2 hrs 10 mins",
  "calories": "338"
},
{
  "url": "https://www.allrecipes.com/recipe/19044/easy-peach-cobbler/",
  "name": "Easy Peach Cobbler",
  "rating": "4.2",
  "ratingcount": "376",
  "ingredients": "1 cup white sugar; ½ cup butter, room temperature; 1 cup self-rising flour; 1 cup milk; 1 (15 ounce) can sliced peaches, with juice",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Beat sugar and butter together in a 1-quart baking dish. Mix in flour and milk until smooth. Pour peaches and juice over top. 3. Bake in the preheated oven until golden brown, 25 to 30 minutes.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "292"
},
{
  "url": "https://www.allrecipes.com/recipe/21351/peach-preserves/",
  "name": "Peach Preserves",
  "rating": "4.6",
  "ratingcount": "223",
  "ingredients": "12  fresh peaches, pitted and chopped; 4 ½ cups white sugar; 1 (2 ounce) package dry pectin",
  "directions": "1. Crush 1 cup of chopped peaches in the bottom of a large saucepan. Add remaining peaches and set the pan over medium-low heat. Bring to a low boil and cook until peaches become liquid with a few bits of peach left, about 20 minutes. 2. Pour cooked peaches into a bowl, then measure 6 cups peaches back into the pan. Add sugar and bring to a boil over medium heat. Gradually stir in dry pectin; boil for 1 minute. 3. Remove from heat and pack jam into hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe rims with a moist paper towel to remove any residue. 4. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 10 minutes. Carefully remove jars from stockpot and let jam cool, then store on a shelf in a cool, dark place.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "59"
},
{
  "url": "https://www.allrecipes.com/recipe/273453/peach-and-raspberry-crumble/",
  "name": "Peach and Raspberry Crumble",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "3  fresh peaches, pitted and sliced into equal crescents; 1 pint fresh raspberries; ¾ cup white sugar, divided; 1 tablespoon ground cinnamon, divided; 1  lemon, juiced; 2 cups rolled oats; 1 ¼ cups all-purpose flour; ½ cup unsalted butter, cubed; ¼ cup brown sugar; 1 teaspoon salt",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Combine peaches, raspberries, 1/2 cup white sugar, 1/2 tablespoon cinnamon, and lemon juice in a bowl. 3. Combine oats, flour, butter, remaining 1/4 cup white sugar, brown sugar, and salt in a separate bowl; mix crumble topping thoroughly until smooth and not lumpy. 4. Pour fruit mixture into a large ceramic baking dish, spreading evenly. Top evenly with oat crumble mixture. 5. Bake in the preheated oven until golden brown, about 35 minutes.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "305"
},
{
  "url": "https://www.allrecipes.com/recipe/74658/peach-muffins/",
  "name": "Peach Muffins",
  "rating": "4.4",
  "ratingcount": "685",
  "ingredients": "3 cups all-purpose flour; 1 tablespoon ground cinnamon; 1 teaspoon baking soda; 1 teaspoon salt; 2 cups white sugar; 1 ¼ cups vegetable oil; 3 large eggs, lightly beaten; 2 cups peeled, pitted, and chopped peaches",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Grease 16 muffin cups or line with paper liners. 2. Combine flour, cinnamon, baking soda, and salt in a large bowl. Beat together sugar, oil, and eggs in a separate bowl. Stir into flour mixture until moist. Fold in peaches. Spoon into the prepared muffin cups. 3. Bake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, about 25 minutes. Cool for 10 minutes before turning out onto wire racks to cool completely.",
  "prep": "20 mins",
  "cook": "25 mins",
  "total": "55 mins",
  "calories": "351"
}]