[{
  "url": "https://www.allrecipes.com/recipe/280440/instant-pot-salt-and-vinegar-boiled-peanuts/",
  "name": "Instant Pot® Salt and Vinegar Boiled Peanuts",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 cups distilled white vinegar; 2 cups water; ⅓ cup sea salt; 1 pound raw Virginia peanuts in shells",
  "directions": "1. Whisk vinegar, water, and salt in a large bowl. Add peanuts and stir to coat. Transfer mixture to a gallon-sized plastic zip-top bag and let sit for 8 hours or overnight. 2. Pour bag of peanuts and liquid into a multi-functional pressure cooker (such as Instant Pot®). Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 120 minutes. Allow 10 to 15 minutes for pressure to build. 3. Release pressure using the natural-release method according to manufacturer's instructions, about 20 minutes. Unlock and remove the lid.",
  "prep": "5 mins",
  "cook": "2 hrs 10 mins",
  "total": "10 hrs 35 mins",
  "calories": "162"
},
{
  "url": "https://www.allrecipes.com/recipe/230518/cereal-squares/",
  "name": "Cereal Squares",
  "rating": "4.8",
  "ratingcount": "18",
  "ingredients": "3 cups toasted oat cereal (such as Cheerios®); 3 cups corn flake cereal; 1 cup peanuts; 1 cup brown sugar; ½ cup corn syrup; ½ cup butter; ½ cup peanut butter; 1 teaspoon vanilla extract",
  "directions": "1. Combine oat cereal, corn flake cereal, and peanuts together in a large bowl. 2. Mix brown sugar, corn syrup, and butter together in a saucepan; bring to a boil. Remove from heat and stir in peanut butter and vanilla extract until smooth. Pour peanut butter mixture over cereal mixture; stir to coat. Press coated cereal mixture into a 9x13-inch casserole dish. Refrigerate until set, at least 1 hour. Cut into squares.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "1 hr 25 mins",
  "calories": "219"
},
{
  "url": "https://www.allrecipes.com/recipe/244813/spicy-caramel-chicken/",
  "name": "Spicy Caramel Chicken",
  "rating": "4.7",
  "ratingcount": "57",
  "ingredients": "2 tablespoons finely grated fresh ginger; 4 cloves finely minced garlic; ¾ cup light brown sugar; ⅓ cup rice vinegar; ⅓ cup fish sauce; 2 teaspoons hot pepper sauce, or to taste; 1 teaspoon soy sauce; 2 pounds boneless, skinless chicken thighs, cut into 1-inch pieces; 1 tablespoon vegetable oil; ½ cup sliced, seeded jalapeno peppers; ½ cup sliced, seeded mild red chilies or bell peppers; ½ cup roasted peanuts; ½ cup chopped green onions, plus more for garnish; ¼ cup chopped fresh cilantro leaves; 4 cups cooked white rice",
  "directions": "1. Whisk grated ginger, garlic, brown sugar, rice vinegar, fish sauce, hot sauce, and soy sauce together in a large bowl. 2. Place chicken chunks in a bowl. Pour 1/4 cup of the prepared sauce onto chicken chunks; mix until all chicken pieces are coated. Set aside 15 minutes. 3. Heat vegetable oil in a heavy skillet over high heat. As soon as oil starts to smoke, place chicken chunks in a single layer in the pan. Cook and stir until chicken pieces start to caramelize and turn deep brown, 8 to 10 minutes. Reduce heat to medium. Stir in sliced jalapeno and red peppers, peanuts, and green onions. Cook and stir one minute. Pour in remainder of sauce. Simmer until heated through, 1 or 2 minutes. Remove from heat. 4. Stir in cilantro. Serve over hot cooked rice and top with chopped green onions.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "49 mins",
  "calories": "1004"
},
{
  "url": "https://www.allrecipes.com/recipe/228619/thai-orange-chicken/",
  "name": "Thai Orange Chicken",
  "rating": "4.6",
  "ratingcount": "166",
  "ingredients": "2 tablespoons olive oil; 3  carrots, cut into matchsticks; ½ teaspoon minced fresh ginger root; 1 clove garlic, minced; 2 tablespoons olive oil; 2  skinless, boneless chicken breast halves, cut into small pieces; ½ cup water; ½ cup peanuts; ⅓ cup orange juice; ⅓ cup soy sauce; ⅓ cup brown sugar; 2 tablespoons ketchup; 1 teaspoon crushed red pepper flakes; 2 tablespoons cornstarch",
  "directions": "1. Heat 2 tablespoons olive oil in a large skillet over medium heat; cook and stir carrots, ginger, and garlic until carrots are slightly softened, about 5 minutes. Transfer carrot mixture to a bowl. Add remaining 2 tablespoons olive oil to the same skillet. 2. Cook and stir chicken in the hot olive oil until no longer pink in the center, about 10 minutes. Add carrot mixture, water, peanuts, orange juice, soy sauce, brown sugar, ketchup, and red pepper flakes to chicken; stir to combine. Cover and simmer until sugar has dissolved, about 5 minutes. 3. Remove about 1/4 cup sauce from the skillet; whisk in cornstarch until dissolved and sauce is smooth. Pour cornstarch mixture back into chicken and sauce; cook until sauce is slightly thickened, about 5 more minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "427"
},
{
  "url": "https://www.allrecipes.com/recipe/233044/sugar-spanish-peanuts/",
  "name": "Sugar Spanish Peanuts",
  "rating": "5.0",
  "ratingcount": "7",
  "ingredients": "2 cups raw Spanish peanuts with skins; 2 cups white sugar; 1 ½ cups water",
  "directions": "1. Line a baking sheet with a plain paper bag or parchment paper. 2. Mix peanuts, sugar, and water together using a wooden spoon in a large pot over medium-low heat; cook, stirring constantly, until liquid is evaporated and peanuts are coated, 20 to 30 minutes. Carefully pour coated peanuts onto the prepared baking sheet to cool completely.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "321"
},
{
  "url": "https://www.allrecipes.com/recipe/214225/vietnamese-chicken-salad/",
  "name": "Vietnamese Chicken Salad",
  "rating": "4.5",
  "ratingcount": "47",
  "ingredients": "1 tablespoon finely chopped green chile peppers; 1 tablespoon rice vinegar; 2 tablespoons fresh lime juice; 3 tablespoons Asian fish sauce; 3 cloves garlic, minced; 1 tablespoon white sugar; 1 tablespoon Asian (toasted) sesame oil; 2 tablespoons vegetable oil; 1 teaspoon black pepper; 2  cooked skinless boneless chicken breast halves, shredded; ½ head cabbage, cored and thinly sliced; 1  carrot, cut into matchsticks; ⅓  onion, finely chopped; ⅓ cup finely chopped dry roasted peanuts; ⅓ cup chopped fresh cilantro",
  "directions": "1. Stir together the chopped green chiles, rice vinegar, lime juice, fish sauce, garlic, sugar, sesame oil, vegetable oil, and black pepper until the mixture is thoroughly combined and the sugar is dissolved. 2. Place the chicken, cabbage, carrot, onion, peanuts, and cilantro in a salad bowl, and toss thoroughly together with tongs. Pour the dressing over the salad and toss again. Serve immediately.",
  "prep": "30 mins",
  "cook": "",
  "total": "30 mins",
  "calories": "303"
},
{
  "url": "https://www.allrecipes.com/recipe/214217/slow-cooker-thai-pork-with-peppers/",
  "name": "Slow Cooker Thai Pork with Peppers",
  "rating": "4.4",
  "ratingcount": "169",
  "ingredients": "1 cup chicken broth; ⅓ cup soy sauce; ⅓ cup creamy peanut butter; 3 tablespoons honey; 6 cloves garlic, minced; 2 tablespoons minced fresh ginger root; 1 teaspoon crushed red pepper flakes; 2  red bell peppers, thinly sliced and cut into bite-size lengths; 1 pound boneless pork chops",
  "directions": "1. Place the chicken broth, soy sauce, peanut butter, honey, garlic, ginger, crushed red pepper flakes, red bell peppers, and pork chops into a slow cooker, stir together, and set the cooker on Low. Cook for 5 to 6 hours until the pork is tender, and remove the pork from the sauce. Shred the pork, return to the sauce, let cook until hot, and serve.",
  "prep": "20 mins",
  "cook": "5 hrs 10 mins",
  "total": "5 hrs 30 mins",
  "calories": "314"
},
{
  "url": "https://www.allrecipes.com/recipe/11100/seven-layer-magic-bars/",
  "name": "Seven Layer Magic Bars",
  "rating": "4.3",
  "ratingcount": "45",
  "ingredients": "½ cup butter; 1 cup graham cracker crumbs; 2 cups semisweet chocolate chips; 2 cups butterscotch chips; 1 cup flaked coconut; 1 cup salted peanuts; 1 (14 ounce) can sweetened condensed milk",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Melt butter in a saucepan or microwave; pour into a 9x13-inch baking dish, tilting to coat. Sprinkle on the graham cracker crumbs; press mixture with your hands to form a crust. 3. Layer the chocolate chips, butterscotch chips, coconut, and peanuts over the graham cracker crust. Pour the condensed milk over the layers. 4. Bake in preheated oven until edges begin to brown, about 20 minutes. Allow to cool before cutting into bars.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "597"
},
{
  "url": "https://www.allrecipes.com/recipe/245062/banana-oat-energy-bars/",
  "name": "Banana Oat Energy Bars",
  "rating": "3.5",
  "ratingcount": "86",
  "ingredients": "2 cups rolled oats; 2  bananas, mashed; 2  carrots, grated; 1  apple, grated; 1 cup unsweetened applesauce; ½ cup chopped peanuts",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 2. Mix oats, bananas, carrots, apple, applesauce, and peanuts together in a bowl; spread into the prepared baking dish. 3. Bake in the preheated oven until golden brown, about 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "124"
},
{
  "url": "https://www.allrecipes.com/recipe/77685/denises-peanut-chicken/",
  "name": "Denise's Peanut Chicken",
  "rating": "4.4",
  "ratingcount": "372",
  "ingredients": "1 tablespoon wok oil or peanut oil; 1 pound skinless, boneless chicken breast halves - cut into bite-size pieces; 1 medium red bell pepper, chopped; 1 ½ cups chicken broth; 1 tablespoon sugar; 1 tablespoon cornstarch; 2 teaspoons soy sauce; 1 (1 inch) piece fresh ginger root, peeled and chopped; 1 clove garlic, minced; ¼ teaspoon ground cayenne pepper; 1 bunch green onions, chopped; 1 bunch cilantro, chopped; 2 cups chopped dry roasted peanuts",
  "directions": "1. Heat oil in a wok over medium heat. Cook and stir chicken in hot oil until juices run clear. Mix in bell pepper and continue cooking until pepper is tender. 2. Mix together broth, sugar, cornstarch, soy sauce, ginger, garlic, and cayenne pepper in a small bowl until well combined; pour into the wok. Toss in green onions and cilantro, reserving some of each for garnish. Continue to cook and stir until mixture is slightly thickened, about 5 minutes. Mix in peanuts and garnish with reserved green onions and cilantro to serve.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "437"
},
{
  "url": "https://www.allrecipes.com/recipe/270596/kung-pao-shrimp/",
  "name": "Kung Pao Shrimp",
  "rating": "4.0",
  "ratingcount": "2",
  "ingredients": "2 tablespoons soy sauce; 2 tablespoons chicken broth; 2 teaspoons sesame oil; 1 teaspoon cornstarch; 2 teaspoons water; ½ pound medium shrimp, peeled and deveined; ⅓ cup chicken broth; 2 tablespoons white sugar; 2 tablespoons vinegar; 1 ½ tablespoons soy sauce; 1 ½ teaspoons sesame oil; 1 teaspoon cornstarch; 2 tablespoons vegetable oil; 1 small onion, thinly sliced; 1 (8 ounce) can sliced bamboo shoots, drained; 1  green bell pepper, seeded and cut into 1-inch slices; 1  dried red chile pepper; 2 tablespoons salted peanuts, or to taste",
  "directions": "1. Combine soy sauce, chicken broth, and sesame oil in a bowl. Dissolve cornstarch in water and mix into the bowl. Add shrimp and stir to coat. Cover and refrigerate for 1 1/2 hours; stir occasionally. 2. Mix chicken broth, sugar, vinegar, soy sauce, sesame oil, and cornstarch together to make the sauce. Set aside. 3. Heat oil in a large frying pan. Add onion and cook, stirring occasionally, until limp and translucent, about 5 minutes. Add shrimp and stir until pink, about 1 minute. Stir in bamboo shoots, bell peppers, and dried chile; cook for 1 minute. Pour in sauce and peanuts. Cook until sauce boils and thickens slightly, about 5 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "1 hr 55 mins",
  "calories": "496"
},
{
  "url": "https://www.allrecipes.com/recipe/220181/kung-wow-chicken/",
  "name": "Kung Wow Chicken",
  "rating": "4.5",
  "ratingcount": "131",
  "ingredients": "1 tablespoon white wine; 1 tablespoon soy sauce; 1 teaspoon brown sugar; 3 medium green onions, finely chopped (white parts only); 1 pound skinless, boneless chicken breast, cut into 1-inch pieces; 1 tablespoon white vinegar; 2 tablespoons rice vinegar; 1 tablespoon soy sauce, or to taste; 1 tablespoon Asian chili paste (sambal), or more to taste; 1 tablespoon sesame oil; 2 tablespoons brown sugar; 2 teaspoons ketchup; 2 tablespoons white wine; 4 cloves garlic, minced; 1 tablespoon cornstarch; 2 tablespoons water; 2 tablespoons peanut oil; 2 cups cubed zucchini; 1 cup cubed red bell pepper; ½ cup chicken broth; ¼ cup roasted, salted peanuts; salt and ground black pepper to taste; ¼ cup chopped green onion tops; 4 cups cooked white rice",
  "directions": "1. Whisk together 1 tablespoon white wine, 1 tablespoon soy sauce, 1 teaspoon brown sugar, and finely chopped green onion. 2. Stir in chicken pieces to coat. Cover and refrigerate for 1 hour. 3. Combine white vinegar, rice vinegar, 1 tablespoon soy sauce, sambal chile paste, sesame oil, 2 tablespoons brown sugar, ketchup, 2 tablespoon white wine, and garlic in a bowl. Whisk thoroughly; set aside. 4. Mix cornstarch with cold water in a small bowl. 5. Heat peanut oil in a heavy duty, nonstick skillet over high heat. Stir in chicken; cook and stir until chicken begins to brown, about 2 minutes 6. Stir in zucchini and red bell pepper; cook for 2 more minutes. Add chicken broth and stir. 7. Stir in vinegar mixture; cook and stir until vegetables are tender and chicken is no longer pink in the center, about 2 minutes. Stir in cornstarch mixture until sauce is thickened, about 30 seconds; remove from heat. 8. Toss in peanuts; season with salt and pepper to taste. Stir in green onion tops. Serve over white rice.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "1 hr 35 mins",
  "calories": "568"
},
{
  "url": "https://www.allrecipes.com/recipe/88384/honey-peanut-granola/",
  "name": "Honey Peanut Granola",
  "rating": "4.6",
  "ratingcount": "139",
  "ingredients": "3 cups quick cooking oats; ½ cup chopped peanuts; ¼ cup wheat germ; ⅓ cup honey; ⅓ cup brown sugar; ¼ cup vegetable oil; 2 tablespoons warm water; ½ teaspoon salt; 1 teaspoon vanilla extract",
  "directions": "1. Preheat oven to 250 degrees F (120 degrees C). Lightly grease a baking sheet. 2. In a large bowl, combine oats, peanuts, and wheat germ. 3. In a separate bowl, combine honey, brown sugar, vegetable oil, water, salt, and vanilla. Stir well; then pour into the oat mixture, and stir. Spread out on a cookie sheet. 4. Bake for 1 hour, stirring every 15 minutes. Remove from oven, and cool before serving.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "428"
},
{
  "url": "https://www.allrecipes.com/recipe/259226/puffed-caramel-corn/",
  "name": "Puffed Caramel Corn",
  "rating": "4.9",
  "ratingcount": "33",
  "ingredients": "1 (8 ounce) bag corn puffs (such as O-Ke-Doke®); 1 cup salted peanuts (Optional); 1 cup butter; 1 cup packed brown sugar; ½ cup light corn syrup; 1 teaspoon baking soda",
  "directions": "1. Preheat the oven to 250 degrees F (120 degrees C). Combine corn puffs and peanuts in a large roasting pan. 2. Bring butter, brown sugar, and corn syrup to a boil in a heavy 2-quart saucepan. Cook and stir for 2 minutes. 3. Remove from heat; stir in baking soda until mixture foams up. 4. Pour over corn puff mixture and toss well using rubber spatulas. Bake in the preheated oven, stirring every 10 to 15 minutes, until a cooled piece of corn is crunchy, about 45 minutes. 5. Spread on waxed paper to cool. Break apart and store in an airtight container.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "631"
},
{
  "url": "https://www.allrecipes.com/recipe/19888/microwave-peanut-brittle/",
  "name": "Microwave Peanut Brittle",
  "rating": "4.4",
  "ratingcount": "594",
  "ingredients": "1 cup white sugar; ½ cup light corn syrup; 1 cup salted peanuts; 1 teaspoon butter; 1 teaspoon vanilla extract; 1 teaspoon baking soda",
  "directions": "1. Grease a cookie sheet; set aside. Combine sugar and corn syrup in a 2-quart microwave-safe bowl. 2. Microwave on high for 4 minutes, stirring halfway through cooking time. Stir in peanuts and microwave on high for 3 1/2 minutes more. Stir in butter and vanilla: microwave for 1 1/2 minutes. 3. Stir in baking soda until light and foamy; immediately pour onto the prepared cookie sheet and spread thin. Cool completely. Break into pieces, and store in an airtight container.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "89"
},
{
  "url": "https://www.allrecipes.com/recipe/273409/air-fryer-spicy-roasted-peanuts/",
  "name": "Air Fryer Spicy Roasted Peanuts",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "2 tablespoons olive oil; 1 tablespoon seafood seasoning (such as Old Bay®); ½ teaspoon cayenne pepper; 8 ounces raw Spanish peanuts; salt to taste",
  "directions": "1. Preheat an air fryer to 320 degrees F (160 degrees C). 2. Whisk together olive oil, seafood seasoning, and cayenne pepper in a large bowl. Add peanuts and stir to coat. Transfer to the air fryer basket. 3. Cook in the preheated air fryer for 10 minutes. Toss and continue cooking for 10 minutes more. 4. Remove the basket from the air fryer. Season peanuts with salt, toss, and cook for 5 minutes more. Transfer peanuts to a paper towel-lined plate and let cool.",
  "prep": "5 mins",
  "cook": "25 mins",
  "total": "30 mins",
  "calories": "193"
},
{
  "url": "https://www.allrecipes.com/recipe/244537/payday-bars/",
  "name": "PayDay® Bars",
  "rating": "4.2",
  "ratingcount": "30",
  "ingredients": "cooking spray; 1 (16 ounce) jar dry-roasted peanuts, divided; 1 (14 ounce) can sweetened condensed milk; 1 (12 ounce) package peanut butter chips; 3 tablespoons butter; 3 cups miniature marshmallows",
  "directions": "1. Spray the bottom of a 9x13-inch baking dish with cooking spray. 2. Spread 1/2 of the peanuts into the prepared baking dish. 3. Cook and stir sweetened condensed milk, peanut butter chips, and butter in a saucepan over medium heat until melted, about 5 minutes. Add marshmallows and stir until smooth. Pour mixture over peanuts and top with remaining peanuts. 4. Refrigerate until chilled, 1 to 2 hours. Cut into bars.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "1 hr 15 mins",
  "calories": "186"
},
{
  "url": "https://www.allrecipes.com/recipe/222658/frozen-vegetable-stir-fry/",
  "name": "Frozen Vegetable Stir-Fry",
  "rating": "4.7",
  "ratingcount": "259",
  "ingredients": "2 tablespoons soy sauce; 1 tablespoon brown sugar; 2 teaspoons peanut butter; 2 teaspoons garlic powder; 2 teaspoons olive oil; 1 (16 ounce) package frozen mixed vegetables",
  "directions": "1. Combine soy sauce, brown sugar, peanut butter, and garlic powder in a small bowl. 2. Heat oil in a large skillet over medium heat. Add frozen mixed vegetables; cook and stir until just tender, 5 to 7 minutes. 3. Remove from heat and fold in soy sauce mixture.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "88"
},
{
  "url": "https://www.allrecipes.com/recipe/50658/thai-peanut-chicken/",
  "name": "Thai Peanut Chicken",
  "rating": "4.3",
  "ratingcount": "669",
  "ingredients": "4 cups water; 2 cups uncooked white rice; 3 tablespoons soy sauce; 2 tablespoons creamy peanut butter; 2 teaspoons white wine vinegar; ¼ teaspoon cayenne pepper; 3 tablespoons olive oil; 4  skinless, boneless chicken breast halves - cut into thin strips; 3 tablespoons chopped garlic; 1 ½ tablespoons chopped fresh ginger root; 2 ½ cups broccoli florets; ¾ cup chopped green onions; ⅓ cup unsalted dry-roasted peanuts",
  "directions": "1. Combine water and rice in a saucepan over medium-high heat; bring to a boil. Reduce heat to low, cover, and simmer until rice is tender and liquid is absorbed, about 20 minutes. 2. Meanwhile, stir together soy sauce, peanut butter, vinegar, and cayenne pepper in a small bowl; set aside. 3. Heat olive oil in a skillet or wok over high heat. Cook and stir chicken, garlic, and ginger in hot oil until chicken is lightly browned, about 5 minutes. Reduce heat to medium and add broccoli, green onions, peanuts, and soy sauce mixture. Cook, stirring frequently, until broccoli is tender and chicken is cooked through, about 5 minutes. 4. Serve chicken-broccoli mixture over cooked rice.",
  "prep": "25 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "360"
},
{
  "url": "https://www.allrecipes.com/recipe/239295/deep-fried-peanuts/",
  "name": "Deep-Fried Peanuts",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "oil, or as needed; 1 cup shelled raw peanuts; salt to taste",
  "directions": "1. Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). 2. Cook peanuts in preheated oil until fragrant and hot, about 2 minutes. Transfer to paper-towel lined plates to drain. Season peanuts with salt.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "100"
},
{
  "url": "https://www.allrecipes.com/recipe/17551/boiled-peanuts/",
  "name": "Boiled Peanuts",
  "rating": "4.6",
  "ratingcount": "93",
  "ingredients": "5 pounds raw peanuts, in shells; 1 cup salt, or to taste; water to cover",
  "directions": "1. Wash peanuts and place them in a pot. Add salt, then water to cover. Bring water to a boil. 2. Let peanuts boil in water for 3 hours. 3. Test peanuts; add more salt to taste if needed and continue cooking until they reach the softness/consistency you desire.",
  "prep": "5 mins",
  "cook": "3 hrs",
  "total": "3 hrs 5 mins",
  "calories": "322"
},
{
  "url": "https://www.allrecipes.com/recipe/222350/authentic-pad-thai/",
  "name": "Authentic Pad Thai",
  "rating": "4.3",
  "ratingcount": "290",
  "ingredients": "12 ounces dried rice noodles; ½ cup white sugar; ½ cup distilled white vinegar; ¼ cup fish sauce; 2 tablespoons tamarind paste; 2 tablespoons vegetable oil, divided; 2  boneless, skinless chicken breast halves, sliced into thin strips; 1 ½ teaspoons garlic, minced; 4 large eggs, beaten; 1 ½ tablespoons white sugar; 1 ½ teaspoons salt; 1 cup coarsely ground peanuts; 2 cups bean sprouts; ½ cup chopped fresh chives; 1 tablespoon paprika, or to taste; 1 medium lime, cut into wedges",
  "directions": "1. Place rice noodles into a large bowl and cover with several inches of room temperature water; let soak for 30 to 60 minutes. Drain. 2. Whisk 1/2 cup sugar, vinegar, fish sauce, and tamarind paste together in a saucepan over medium heat. Bring to a simmer, then remove from the heat. 3. Heat 1 tablespoon oil in a skillet over medium-high heat. Add chicken; cook and stir until chicken is no longer pink in the center and the juices run clear, 5 to 7 minutes. Remove from the heat. 4. Heat remaining 1 tablespoon oil in a large skillet or wok over medium-high heat. Add garlic and cook until fragrant, about 1 minute. Stir in eggs; scramble until eggs are nearly cooked through, about 2 minutes. Add chicken and rice noodles and stir until well combined. 5. Stir in tamarind mixture, 1 1/2 tablespoons sugar, and salt; cook until noodles are tender, 3 to 5 minutes. Stir in peanuts and cook until heated through, 1 to 2 minutes. Garnish with bean sprouts, chives, and paprika; serve with lime wedges.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "1 hr 10 mins",
  "calories": "583"
},
{
  "url": "https://www.allrecipes.com/recipe/170008/rachaels-superheated-cajun-boiled-peanuts/",
  "name": "Rachael's Superheated Cajun Boiled Peanuts",
  "rating": "4.6",
  "ratingcount": "185",
  "ingredients": "1 pound raw peanuts, in shells; ½ cup salt; ½ cup chopped jalapeño peppers; ½ cup red pepper flakes; 1 (3 ounce) package dry crab boil (such as Zatarain's Crab and Shrimp Boil); 2 tablespoons Cajun seasoning; 1 tablespoon garlic powder",
  "directions": "1. Place peanuts, salt, jalapeños, red pepper flakes, crab boil, Cajun seasoning, and garlic powder into a slow cooker. Pour in water to cover the peanuts and stir to combine. Cover and cook on Low until peanuts are soft, at least 24 hours. Stir occasionally and add water as needed to keep the peanuts covered. Drain, then serve hot or cold.",
  "prep": "20 mins",
  "cook": "1 day",
  "total": "1 day 20 mins",
  "calories": "360"
},
{
  "url": "https://www.allrecipes.com/recipe/11570/amazing-gluten-free-layer-bars/",
  "name": "Amazing Gluten-Free Layer Bars",
  "rating": "4.1",
  "ratingcount": "99",
  "ingredients": "7 ounces sweetened flaked coconut, divided; 1 cup butterscotch chips; 6 ounces semisweet chocolate chips; 8 ounces unsalted peanuts; ½ cup sliced almonds; 1 (14 ounce) can sweetened condensed milk",
  "directions": "1. Preheat oven to 350 degrees F ( 175 degrees C ). Generously grease one 13x9-inch baking pan. 2. Spread 2/3 of the flaked coconut evenly on the bottom of the baking pan. Sprinkle the butterscotch morsels, chocolate chips, and peanuts evenly over the coconut layer. Pour condensed milk evenly over the whole pan. Top with sliced almonds and remaining coconut. 3. Bake in preheated oven for 20 minutes. Cool completely before cutting into squares.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "185"
},
{
  "url": "https://www.allrecipes.com/recipe/236937/mexican-capirotada/",
  "name": "Capirotada",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "3 cups water; 3 cups brown sugar, divided; 2  cinnamon sticks; 2 cups butter, softened; 2 loaves sliced white bread, toasted; ¼ teaspoon ground cinnamon, or to taste; ¼ teaspoon ground nutmeg, or to taste; ⅛ teaspoon ground cloves, or to taste; 2 cups raisins; 2 cups peanuts; 1 pound shredded sharp Cheddar cheese",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine water, 2 cups brown sugar, and cinnamon sticks together in a saucepan; bring to a boil. Reduce heat and simmer, stirring occasionally, until sugar is dissolved and liquid has reduced into a syrup, about 15 minutes. Remove cinnamon sticks from syrup using a slotted spoon. 3. Spread butter onto each toasted bread slice. Make 1 layer of buttered bread in a deep casserole dish or oven-proof stockpot. Sprinkle cinnamon, nutmeg, and cloves over bread layer. Sprinkle 1/4 of the raisins, 1/4 of the peanuts, 1/4 of the remaining brown sugar, and 1/4 of the Cheddar cheese over bread layer. Repeat layering with remaining ingredients. Pour cinnamon syrup over entire dish; cover with aluminum foil. 4. Bake in the preheated oven until cooked through, about 30 minutes. Cool for 15 to 20 minutes before serving.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "490"
},
{
  "url": "https://www.allrecipes.com/recipe/221950/chef-johns-caramel-chicken/",
  "name": "Chef John's Caramel Chicken",
  "rating": "4.7",
  "ratingcount": "513",
  "ingredients": "¾ cup dark brown sugar; ⅓ cup cold water; ⅓ cup fish sauce; ⅓ cup rice vinegar; 1 tablespoon soy sauce; 4 cloves garlic, crushed; 1 tablespoon fresh grated ginger; 1 teaspoon vegetable oil; 8  boneless, skinless chicken thighs, quartered; ½ cup roasted peanuts; 2  fresh jalapeno peppers, seeded and sliced; 1 bunch green onions, chopped; fresh cilantro sprigs, for garnish",
  "directions": "1. Whisk brown sugar, water, fish sauce, rice vinegar, soy sauce, garlic, and ginger in a bowl until brown sugar is completely dissolved, about 1 minute. Set aside. 2. Heat oil over high heat in a skillet. Stir in chicken. 3. Pour 1/3 cup of the brown sugar mixture over chicken; cook and stir until the brown sugar mixture has a syrup-like consistency, 6 to 7 minutes. 4. Pour in the remaining brown sugar mixture; cook until chicken is tender and no longer pink inside, about 5 minutes. 5. Stir in in peanuts, jalapenos and green onion; cook until warmed through, 2 to 3 minutes. 6. Garnish with cilantro and serve.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "615"
},
{
  "url": "https://www.allrecipes.com/recipe/217092/caramelized-chicken-wings/",
  "name": "Caramelized Chicken Wings",
  "rating": "4.7",
  "ratingcount": "313",
  "ingredients": "1 cup water; ½ cup white sugar; ⅓ cup soy sauce; 2 tablespoons peanut butter; 1 tablespoon honey; 2 teaspoons wine vinegar; 1 tablespoon minced garlic; 12  large chicken wings, tips removed and wings cut in half at joint; 1 teaspoon sesame seeds, or to taste (Optional)",
  "directions": "1. In an electric skillet or a large skillet over medium heat, mix together the water, sugar, soy sauce, peanut butter, honey, wine vinegar, and garlic until smooth and the sugar has dissolved. Place the wings into the sauce, cover, and simmer for 30 minutes. Uncover and simmer until the wings are tender and the sauce has thickened, about 30 more minutes, spooning sauce over wings occasionally. Sprinkle with sesame seeds.",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 5 mins",
  "calories": "529"
},
{
  "url": "https://www.allrecipes.com/recipe/238469/easy-caramel-apple-salad/",
  "name": "Easy Caramel Apple Salad",
  "rating": "4.9",
  "ratingcount": "15",
  "ingredients": "1 (8 ounce) container frozen whipped topping, thawed; 1 (8 ounce) can crushed pineapple; 1 (3.4 ounce) package instant butterscotch pudding mix; 2 cups chopped apples; 1 cup skinless peanuts",
  "directions": "1. Stir whipped topping, pineapple, and butterscotch pudding mix together in a bowl until smooth. Fold apples and peanuts into pudding mixture until salad is well mixed. 2. Refrigerate salad until completely chilled, at least 30 minutes.",
  "prep": "10 mins",
  "cook": "",
  "total": "40 mins",
  "calories": "181"
},
{
  "url": "https://www.allrecipes.com/recipe/212888/reindeer-poop/",
  "name": "Reindeer Poop",
  "rating": "4.7",
  "ratingcount": "37",
  "ingredients": "1 (16 ounce) package white candy coating, coarsely chopped; 1 (4 ounce) bar German sweet chocolate, chopped; 1 (16 ounce) package semi-sweet chocolate chips; 2 (16 ounce) jars dry roasted peanuts",
  "directions": "1. Place the white candy coating, German sweet chocolate, chocolate chips, and peanuts into a slow cooker. Set the cooker to Low, cover, and gently heat the candy for 1 1/2 hours without stirring. After 1 1/2 hours, stir the mixture, and spoon out by teaspoons onto waxed paper. Allow to cool and set, about 45 minutes.",
  "prep": "10 mins",
  "cook": "1 hr 30 mins",
  "total": "2 hrs 25 mins",
  "calories": "174"
},
{
  "url": "https://www.allrecipes.com/recipe/80988/peanut-patties/",
  "name": "Peanut Patties",
  "rating": "3.4",
  "ratingcount": "28",
  "ingredients": "2 ½ cups white sugar; ⅔ cup light corn syrup; 1 cup evaporated milk; 1 tablespoon butter; 3 cups raw peanuts; 1 tablespoon vanilla extract; 1 dash red food coloring (Optional)",
  "directions": "1. In a saucepan over medium-low heat, combine the sugar, corn syrup, evaporated milk, and peanuts. Bring to a slow boil, and stir to blend once heated. Let boil until the mixture reaches a temperature of between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. This may take up to 1 hour. 2. Stir in the butter, vanilla and food coloring once the mixture has reached the proper temperature. Spoon out onto waxed paper or parchment paper to form patties. Cool until set.",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 5 mins",
  "calories": "460"
},
{
  "url": "https://www.allrecipes.com/recipe/222533/no-bake-sweet-marie-bars/",
  "name": "No Bake Sweet Marie Bars",
  "rating": "4.7",
  "ratingcount": "21",
  "ingredients": "cooking spray; ½ cup peanut butter; ½ cup corn syrup; ½ cup brown sugar; 1 tablespoon butter; 2 cups crispy rice cereal; 1 cup peanuts; 1 cup chocolate chips",
  "directions": "1. Prepare an 8-inch square baking dish with cooking spray. 2. Cook and stir peanut butter, corn syrup, brown sugar, and butter together in a large saucepan over medium-low heat until boiling. Fold crispy rice cereal and peanuts into the peanut butter mixture; press into the prepared baking dish. Sprinkle chocolate chips evenly over the top of the hot mixture. Let chocolate chips melt; spread chocolate over the top in an even layer. 3. Refrigerate until the mixture hardens, about 1 hour.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "1 hr 20 mins",
  "calories": "150"
},
{
  "url": "https://www.allrecipes.com/recipe/53169/sugar-peanuts/",
  "name": "Sugar Peanuts",
  "rating": "4.6",
  "ratingcount": "46",
  "ingredients": "1 cup sugar; ½ cup water; 2 cups raw peanuts",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. In a saucepan over medium heat, combine sugar and water. Bring to a boil, and stir until sugar is dissolved. Add peanuts, and cook stirring, over medium heat until peanuts are evenly coated, and no syrup is left in pan. Spread nuts out on a baking sheet. 3. Bake in preheated oven for 20 minutes, stirring every 5 minutes to evenly roast peanuts.",
  "prep": "5 mins",
  "cook": "35 mins",
  "total": "40 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/217186/slow-cooker-chicken-mole/",
  "name": "Slow Cooker Chicken Mole",
  "rating": "4.1",
  "ratingcount": "248",
  "ingredients": "1 large onion, chopped; ½ cup raisins; 3 cloves garlic, chopped; 2 tablespoons toasted sesame seeds (Optional); 1  finely chopped canned chipotle chile in adobo sauce; 3 tablespoons peanut butter; 1 (28 ounce) can crushed tomatoes; 1 teaspoon sugar; 1 teaspoon ground cinnamon; 4 teaspoons chili powder; 1 teaspoon ground cumin; ½ teaspoon ground coriander; ⅛ teaspoon ground nutmeg; 3 tablespoons unsweetened cocoa powder; 1 ½ pounds skinless, boneless chicken breasts",
  "directions": "1. Place onion, raisins, garlic, sesame seeds, chopped chipotle pepper, peanut butter and crushed tomatoes in slow cooker. Stir in sugar, cinnamon, chili powder, cumin, coriander, nutmeg, and cocoa powder. Place chicken in the sauce. 2. Cover; cook on Low until chicken is very tender, about 5 hours.",
  "prep": "15 mins",
  "cook": "5 hrs",
  "total": "5 hrs 15 mins",
  "calories": "289"
},
{
  "url": "https://www.allrecipes.com/recipe/215329/frozen-bananas/",
  "name": "Frozen Bananas",
  "rating": "4.7",
  "ratingcount": "35",
  "ingredients": "4  bananas, peeled and halved horizontally; ⅓ cup peanut butter; 1 (8 ounce) package semisweet baking chocolate, chopped; ½ cup roasted peanuts, chopped; 8  ice pop sticks",
  "directions": "1. Insert 1 ice pop stick into the cut end of each banana half. Place the bananas on a wax paper-covered baking sheet, and freeze until the bananas are frozen through, about 2 hours. 2. Remove the frozen bananas from the freezer and spread a layer of peanut butter on each banana. Place the peanut butter-covered bananas back in the freezer for 30 to 45 minutes. 3. Melt the chocolate in the top of a double boiler over just-barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. 4. Dip each frozen banana in the melted chocolate, spooning the chocolate over the banana to cover it completely. Roll the dipped bananas in the chopped peanuts and place on the wax paper covered baking sheet; freeze until the chocolate is firm, about 1 to 2 hours.",
  "prep": "20 mins",
  "cook": "",
  "total": "4 hrs 20 mins",
  "calories": "308"
},
{
  "url": "https://www.allrecipes.com/recipe/274367/chicken-noodle-salad/",
  "name": "Chicken Noodle Salad",
  "rating": "4.7",
  "ratingcount": "17",
  "ingredients": "3 cloves garlic, crushed; ½ cup seasoned rice vinegar; 1 tablespoon soy sauce; 1 tablespoon fish sauce; 1 tablespoon brown sugar; 1 tablespoon Sriracha chile sauce; 1 tablespoon hoisin sauce; 1 teaspoon sesame oil; 1  cooked chicken breast; 1 (8 ounce) package spaghetti; 1 cup grated carrots; 1  red bell pepper, thinly sliced; 4  green onions, thinly sliced; ½ cup chopped roasted, salted peanuts; ⅓ cup chopped fresh basil; ⅓ cup chopped fresh mint; ⅓ cup chopped cilantro",
  "directions": "1. Whisk garlic, rice vinegar, soy sauce, fish sauce, brown sugar, Sriracha, hoisin, and sesame oil together in a mixing bowl for the dressing. 2. Tear chicken apart into strands similar in width to the spaghetti. Refrigerate until ready to use. 3. Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain and rinse with cold water. 4. Transfer spaghetti to a mixing bowl; add the chicken, carrots, bell pepper, and green onions. Pour in the dressing and toss by hand until well combined. Seal the surface of the salad with plastic wrap and refrigerate, tossing occasionally, for 2 to 12 hours, the longer the better. 5. Add peanuts, basil, mint, and cilantro to the salad. Toss well; taste and adjust for seasoning.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "2 hrs 35 mins",
  "calories": "441"
},
{
  "url": "https://www.allrecipes.com/recipe/236383/grandma-mottles-blarney-stones/",
  "name": "Grandma Mottle's Blarney Stones",
  "rating": "4.4",
  "ratingcount": "15",
  "ingredients": "2 cups confectioners' sugar; ½ cup milk, or as needed; 1 ½ teaspoons vanilla extract; 2 cups dry roasted salted peanuts, finely chopped; 1  pound cake, cut into bize-size cubes",
  "directions": "1. Pour confectioners' sugar in a bowl. Gradually add milk, whisking constantly, until mixture has a thin frosting consistency; whisk in vanilla extract. 2. Place chopped peanuts in a bowl. Line a flat surface or a plate with waxed paper. 3. Dip 1 pound cake cube in frosting and roll cube in peanuts; place on wax paper to dry. Repeat with remaining pound cake pieces.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "117"
},
{
  "url": "https://www.allrecipes.com/recipe/235783/reindeer-munch/",
  "name": "Reindeer Munch",
  "rating": "4.6",
  "ratingcount": "18",
  "ingredients": "2 cups crispy rice cereal squares (such as Rice Chex®); 2 cups thin pretzel sticks; 1 cup cocktail peanuts; 1 cup candy-coated milk chocolate pieces (such as M&M's®); 1 (12 ounce) package white vanilla baking chips",
  "directions": "1. Stir cereal squares, pretzel sticks, peanuts, and milk chocolate pieces together in a large bowl. 2. Melt the vanilla baking chips in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave). Drizzle melted chips over cereal mixture. Pour mixture out onto a large piece of aluminum foil and cool for 30 minutes. Break into bite-size pieces.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "40 mins",
  "calories": "174"
},
{
  "url": "https://www.allrecipes.com/recipe/280886/classic-chicken-pad-thai/",
  "name": "Classic Chicken Pad Thai",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "10 ounces dried rice noodles; 4 tablespoons brown sugar; 4 tablespoons soy sauce, or to taste; 6 tablespoons fish sauce, or to taste; 5 tablespoons tamarind paste; 2 tablespoons vegetable oil; 12 ounces chicken breast, thinly sliced; 1 (7 ounce) package firm tofu, sliced; 3 cloves garlic, chopped; 1 tablespoon shrimp paste; 3  eggs; 2 tablespoons chopped spring onions; ¾ cup dry roasted peanuts; 2 cups bean sprouts; 1  lime, cut into wedges",
  "directions": "1. Soak rice noodles in a bowl of water for 15 minutes. 2. Meanwhile, combine brown sugar, soy sauce, fish sauce, and tamarind paste in a bowl. Whisk well and set aside. 3. Heat oil in a wok over medium-high heat. Add chicken. Stir-fry for 1 minute. Add tofu. Cook until chicken is no longer pink in the center, about 4 minutes. 4. Add garlic and shrimp paste to the wok and stir well. Cook for 2 minutes, then add fish sauce mixture and drained noodles. Cook until the noodles are tender, 3 to 5 minutes. 5. Push noodles to one side of the wok. Crack the eggs into the other side. Scramble until firm, about 3 minutes. Stir into the noodles. Serve with peanuts, bean sprouts, and lime wedges.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "797"
},
{
  "url": "https://www.allrecipes.com/recipe/142314/roasted-peanuts/",
  "name": "Roasted Peanuts",
  "rating": "3.8",
  "ratingcount": "23",
  "ingredients": "1 pound raw peanuts, in shells",
  "directions": "1. Preheat the oven to 500 degrees F (260 degrees C). 2. Arrange peanuts in a single layer on a cookie sheet, and place in the preheated oven. 3. Turn the oven off. Leave peanuts in the oven for 1 hour without opening the door. Serve warm or at room temperature.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "322"
},
{
  "url": "https://www.allrecipes.com/recipe/128804/the-best-thai-curry-peanut-sauce/",
  "name": "The Best Thai Curry-Peanut Sauce",
  "rating": "4.4",
  "ratingcount": "66",
  "ingredients": "1 tablespoon vegetable oil; 1 ½ tablespoons minced garlic; 2 tablespoons red curry paste; 1 ¼ cups creamy peanut butter; ¾ cup brown sugar; ½ teaspoon chili powder; ½ teaspoon cayenne pepper; ½ tablespoon fish sauce; 1 teaspoon sesame oil; 3 (13.5 ounce) cans coconut milk",
  "directions": "1. Heat the oil in a large skillet over medium heat. Stir in the garlic, and cook until the aroma of the garlic has mellowed, about 1 minute. Add the red curry paste, and stir for 1 minute more. Whisk in the peanut butter, brown sugar, chili powder, cayenne pepper, fish sauce, sesame oil, and coconut milk. Bring to a simmer, whisking occasionally, until the sauce has thickened and is smooth.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "179"
},
{
  "url": "https://www.allrecipes.com/recipe/255142/nigerian-suya/",
  "name": "Nigerian Suya",
  "rating": "4.0",
  "ratingcount": "3",
  "ingredients": "1 tablespoon finely ground roasted peanuts; 1 teaspoon ground cayenne pepper; 1 teaspoon ground paprika; 1 teaspoon salt; ½ teaspoon ground ginger; ½ teaspoon garlic powder; ½ teaspoon onion powder; 1 ½ pounds beef tri-tip steak, cut into bite-size pieces; 1  red bell pepper, cut into bite-size pieces; ¼  onion, cut into bite-size pieces; 4  mushrooms, halved",
  "directions": "1. Mix ground peanuts, cayenne pepper, paprika, salt, ginger, garlic powder, and onion powder together in a bowl. 2. Combine spice mixture and beef in a resealable plastic bag; shake until well coated. Marinate in the refrigerator, about 30 minutes. 3. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 4. Place beef, bell pepper, onion, and mushrooms in alternating order onto skewers. 5. Cook on the preheated grill, flipping once, until meat is browned and vegetables are soft, 10 to 15 minutes.",
  "prep": "25 mins",
  "cook": "10 mins",
  "total": "1 hr 5 mins",
  "calories": "358"
},
{
  "url": "https://www.allrecipes.com/recipe/263384/spicy-shrimp-pad-thai/",
  "name": "Spicy Shrimp Pad Thai",
  "rating": "4.8",
  "ratingcount": "28",
  "ingredients": "1 (8 ounce) package dried rice noodles; 2 teaspoons peanut oil; 1 small onion, diced; 2 cloves garlic, minced; 3 tablespoons rice wine vinegar; 3 tablespoons ketchup; 3 tablespoons fish sauce; 3 tablespoons sweet chile sauce; 2 tablespoons creamy peanut butter; 1 tablespoon light soy sauce; 1 tablespoon fresh lime juice; 1 tablespoon white sugar; 1 teaspoon red pepper flakes; ½ teaspoon cayenne pepper; 12  uncooked medium shrimp, peeled and deveined; 2  eggs, lightly beaten; 1 cup unsalted dry-roasted peanuts, chopped; ½ pound bean sprouts; ¼ cup shredded carrots (Optional); ½  lime, cut into wedges; ¼ cup chopped green onions; ¼ cup coarsely chopped cilantro",
  "directions": "1. Place noodles in a large bowl and cover with hot water. Set aside until noodles are softened, about 15 minutes. Drain and rinse thoroughly. 2. Heat oil in a wok over medium heat. Cook and stir onion and garlic until onion is translucent, about 5 minutes. 3. Combine rice wine vinegar, ketchup, fish sauce, chile sauce, peanut butter, soy sauce, lime juice, sugar, red pepper flakes, and cayenne pepper together in a bowl. Set aside. 4. Add shrimp to the wok. Cook and stir until pink, about 4 minutes. Add the ketchup mixture and stir. Move all ingredients to one side to clear a small space in the pan. Pour in eggs and cook without stirring until partially set, about 3 minutes. 5. Stir the drained noodles into the shrimp and egg mixture. Add 1/2 cup peanuts, 1/4 cup bean sprouts, and carrots. Cook and stir until noodles are heated through, about 2 minutes. Garnish with the remaining peanuts, bean sprouts, lime wedges, green onions, and cilantro.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "50 mins",
  "calories": "619"
},
{
  "url": "https://www.allrecipes.com/recipe/9362/microwave-oven-peanut-brittle/",
  "name": "Microwave Oven Peanut Brittle",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 ½ cups dry roasted peanuts; 1 cup white sugar; ½ cup light corn syrup; 1 pinch salt (Optional); 1 tablespoon butter; 1 teaspoon vanilla extract; 1 teaspoon baking soda",
  "directions": "1. Grease a baking sheet, and set aside. In a glass bowl, combine peanuts, sugar, corn syrup, and salt. Cook in microwave for 6 to 7 minutes on High (700 W); mixture should be bubbly and peanuts browned. Stir in butter and vanilla; cook 2 to 3 minutes longer. 2. Quickly stir in baking soda, just until mixture is foamy. Pour immediately onto greased baking sheet. Let cool 15 minutes, or until set. Break into pieces, and store in an airtight container.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "165"
},
{
  "url": "https://www.allrecipes.com/recipe/148073/chipotle-honey-roasted-peanuts/",
  "name": "Chipotle Honey Roasted Peanuts",
  "rating": "4.6",
  "ratingcount": "112",
  "ingredients": "⅓ cup white sugar; 1 ½ teaspoons chipotle chile powder; ¼ teaspoon chili powder; ¼ teaspoon garlic powder; 2 tablespoons butter; 2 tablespoons honey; 1 teaspoon kosher salt; 1 pound skinless peanuts",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). Stir together the sugar, chipotle powder, chili powder, and garlic powder in a small bowl; set aside. 2. Stir together the butter, honey, and kosher salt in a large saucepan over medium heat until the butter has melted, and the mixture is bubbly. Stir in the peanuts until well coated, then pour out into a 9x13 inch baking dish. 3. Bake in preheated oven until the nuts are golden brown, about 30 minutes. Stir the mixture 2 or 3 times to ensure even cooking. Once done, scrape the peanuts into a large metal bowl, and sprinkle with the spice mixture. Toss the peanuts to evenly coat with the spice mixture. Allow the peanuts to cool to room temperature, tossing every few minutes so the nuts do not stick together.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "2 hrs 50 mins",
  "calories": "204"
},
{
  "url": "https://www.allrecipes.com/recipe/228299/krispy-brownie-delights/",
  "name": "Krispy Brownie Delights",
  "rating": "4.4",
  "ratingcount": "16",
  "ingredients": "1 (19.5 ounce) package brownie mix; ½ cup vegetable oil; ¼ cup water; 2  eggs; 1 (7 ounce) jar marshmallow creme; 1 (12 ounce) bag milk chocolate chips; 1 cup peanut butter; 3 cups crispy rice cereal",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 2. Place brownie mix into a mixing bowl and stir in vegetable oil, water, and eggs; beat 50 strokes with a spoon. Spread the batter into the prepared baking dish. 3. Bake brownies in the preheated oven until a toothpick inserted into the center comes out with moist crumbs, 25 to 30 minutes. Check after 25 minutes. Let the brownies cool while you complete remaining steps. 4. Spread marshmallow creme over the warm brownies. Place milk chocolate chips and peanut butter in a large saucepan over low heat and stir until the mixture is warm, completely melted, and smoothly combined. Stir in the crispy rice cereal until thoroughly coated and spread over the marshmallow creme layer, pressing and filling any voids. Refrigerate until set, 20 to 30 minutes. Cut into bars to serve.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "1 hr 5 mins",
  "calories": "315"
},
{
  "url": "https://www.allrecipes.com/recipe/258884/alexanders-chocolate-covered-peanuts/",
  "name": "Alexander's Chocolate-Covered Peanuts",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "18 ounces white almond bark, broken into pieces; 2 cups semisweet chocolate chips, or more to taste; 24 ounces lightly salted peanuts, or more to taste",
  "directions": "1. Cook almond bark in a slow cooker on High, uncovered and stirring occasionally, until mostly melted, 5 to 10 minutes. Reduce the heat to Low and stir in chocolate chips. Cook and stir until chips are melted and mixture is dark in color, 5 to 10 minutes. 2. Turn off the heat and stir in peanuts. Drop a spoonful onto a piece of parchment paper to test consistency; it should be thick and chunky. If it's too loose and runny, stir in more chocolate chips and peanuts. 3. Line several baking sheets with parchment paper. Use a melon baller to drop spoonfuls peanut mixture onto the prepared baking sheets. Let harden before serving, about 1 hour.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "1 hr 25 mins",
  "calories": "143"
},
{
  "url": "https://www.allrecipes.com/recipe/14122/green-chutney/",
  "name": "Green Chutney",
  "rating": "4.6",
  "ratingcount": "52",
  "ingredients": "1 bunch fresh cilantro; 1 clove garlic; 1 tablespoon minced fresh ginger root; 1  minced hot green chile peppers; 1 tablespoon peanuts; salt to taste; 2 tablespoons lemon juice",
  "directions": "1. Blend the following in a food processor until smooth: cilantro, garlic, ginger, green chili, peanuts, salt to taste, and lemon juice. Add a few drops of water if the mixture is too dry.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "25"
},
{
  "url": "https://www.allrecipes.com/recipe/274073/thai-beef-curry/",
  "name": "Thai Beef Curry",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "1 tablespoon peanut oil; ½  yellow onion, sliced thin; ½  green bell pepper, sliced into 1/4-inch strips; ½  red bell pepper, sliced into 1/4-inch strips; 1 (14 ounce) can coconut milk; 3 tablespoons lime juice; 2 tablespoons fish sauce; 2 tablespoons red curry paste, or more to taste; 1 tablespoon white sugar; 1 tablespoon soy sauce; 1 tablespoon peanut sauce, or more to taste (Optional); 1 teaspoon Worcestershire sauce; ¼ teaspoon ground turmeric; ⅛ teaspoon garlic salt, or more to taste; ⅛ teaspoon curry powder, or more to taste; ⅛ teaspoon garam masala, or more to taste; 2 dashes chile-garlic sauce (such as Sriracha®); 1 ½ pounds sirloin steak, cut into strips; ⅓ cup peanuts, chopped",
  "directions": "1. Heat peanut oil over medium heat in a large wok until it sizzles. Add onion and green and red bell peppers. Stir-fry until tender, 5 to 7 minute. Transfer to a bowl. 2. Pour coconut milk into the wok. Reduce heat to low and simmer 3 to 5 minutes. Add lime juice, fish sauce, curry paste, sugar, soy sauce, peanut sauce, Worcestershire, turmeric, garlic salt, curry powder, garam masala, and chile-garlic sauce. Stir to combine and adjust to taste. 3. Increase heat to medium; stir steak and vegetable mixture into the wok. Cook until mixture has thickened and reduced and steak is firm and hot in the center, about 10 minutes. Remove from heat and top with peanuts.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "377"
},
{
  "url": "https://www.allrecipes.com/recipe/15316/cracker-jack-cookies-i/",
  "name": "Cracker Jack Cookies",
  "rating": "4.7",
  "ratingcount": "26",
  "ingredients": "1 cup butter; 1 cup white sugar; 1 cup packed brown sugar; 2 large eggs; 1 teaspoon vanilla extract; 1 ½ cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon baking powder; 1 pinch salt; 2 cups quick cooking oats; 1 ½ cups flaked coconut; 2 cups crisp rice cereal; 1 ½ cups chopped salted peanuts",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease cookie sheets. 2. In a medium bowl, cream together butter, white sugar, and brown sugar. Beat in eggs, one at a time, then stir in vanilla. Sift together flour, baking soda, baking powder, and salt; stir into creamed mixture. Gently stir in oatmeal, coconut, rice cereal, and chopped peanuts. 3. Drop dough by teaspoonfuls onto the prepared cookie sheets. Bake for 10 to 12 minutes in the preheated oven. Remove from cookie sheets to cool on wire racks.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "186"
},
{
  "url": "https://www.allrecipes.com/recipe/277483/slow-cooker-chocolate-peanut-clusters/",
  "name": "Slow Cooker Chocolate Peanut Clusters",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "2 pounds white chocolate, coarsely chopped; 28 ounces dry roasted peanuts; 1 (12 ounce) bag semisweet chocolate chips; 1 (4 ounce) bar German sweet chocolate, broken into pieces",
  "directions": "1. Combine white chocolate, peanuts, chocolate chips, and German chocolate in a slow cooker. 2. Cook on High for 1 hour, without stirring. Reduce heat to Low, stir, and cook for 1 hour, stirring every 15 minutes. 3. Drop spoonfuls of chocolate-peanut mixture onto waxed paper and let cool and harden, 30 to 45 minutes.",
  "prep": "10 mins",
  "cook": "2 hrs",
  "total": "2 hrs 40 mins",
  "calories": "117"
},
{
  "url": "https://www.allrecipes.com/recipe/240451/salted-nut-roll-squares/",
  "name": "Salted Nut Roll Squares",
  "rating": "4.1",
  "ratingcount": "22",
  "ingredients": "1 (16 ounce) jar salted peanuts, divided; 1 (10 ounce) package peanut butter chips; 3 tablespoons butter; 1 (14 ounce) can sweetened condensed milk; 2 ½ cups marshmallows",
  "directions": "1. Pour 1/2 of peanuts into the bottom of a 9x13-inch baking dish. 2. Melt peanut butter chips and butter in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes. Stir in sweetened condensed milk and microwave until heated through, about 30 seconds more. 3. Stir marshmallows into butter mixture until completely incorporated and melted. Pour marshmallow mixture over peanuts into the baking dish. Sprinkle remaining peanuts over the top, cover peanuts with a sheet of waxed paper and press down to fill the pan and create an even layer. Remove wax paper and cool completely before cutting into squares.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "45 mins",
  "calories": "510"
},
{
  "url": "https://www.allrecipes.com/recipe/245754/spicy-buffalo-chex-mix/",
  "name": "Spicy Buffalo Chex Mix",
  "rating": "4.3",
  "ratingcount": "15",
  "ingredients": "½ cup butter; ½ cup hot sauce; 1 (1 ounce) package dry ranch-flavored seasoning mix; 6 cups crispy rice cereal squares (such as Rice Chex®); 4 cups crispy wheat cereal squares (such as Wheat Chex®); 1 ¾ cups dry-roasted peanuts; 1 ½ cups fish-shaped pretzel crackers (such as Pepperidge Farm® Goldish®); 1 ½ cups Parmesan-flavored fish-shaped crackers (such as Pepperidge Farm® Goldish®)",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Heat butter in a microwave-safe bowl in the microwave until melted, 25 to 30 seconds. Add hot sauce and microwave until heated through, 20 to 30 seconds more. Stir in ranch seasoning. 3. Combine rice cereal squares, wheat cereal squares, peanuts, pretzel crackers, and Parmesan-flavored crackers in a large bowl. Pour in butter mixture; mix thoroughly to coat. Spread in 2 ungreased 9x13-inch baking pans. 4. Bake in the preheated oven until golden, about 15 minutes. Remove from oven and stir well. Return to the oven; bake until dried, about 15 minutes more. Spread on paper towels to cool.",
  "prep": "10 mins",
  "cook": "31 mins",
  "total": "41 mins",
  "calories": "153"
},
{
  "url": "https://www.allrecipes.com/recipe/228066/asian-cucumber-and-peanut-salad/",
  "name": "Spicy Cucumber and Peanut Salad",
  "rating": "4.5",
  "ratingcount": "21",
  "ingredients": "1 teaspoon vegetable oil; 4 cloves garlic, minced; 3 tablespoons white vinegar; 1 teaspoon white sugar, or to taste; 1 tablespoon chile-garlic sauce (such as Huy Fong Foods®); 1 tablespoon fish sauce; 1 teaspoon ground coriander; ½ teaspoon red pepper flakes (Optional); 2 medium cucumbers - halved lengthwise, seeds scraped out with a spoon, and thinly sliced; ½ cup chopped peanuts; 2  green onions, chopped",
  "directions": "1. Heat vegetable oil in a small skillet over medium heat. Add garlic; cook and stir until softened and lightly browned, 3 to 5 minutes. Remove from the heat and let cool. 2. Whisk vinegar and sugar together in a salad bowl until sugar has dissolved. Whisk in chili-garlic sauce, fish sauce, coriander, red pepper flakes, and cooled garlic until thoroughly combined. Stir in cucumbers, peanuts, and green onions until coated with dressing. Refrigerate for at least 1 hour or overnight before serving.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "1 hr 20 mins",
  "calories": "155"
},
{
  "url": "https://www.allrecipes.com/recipe/230555/easy-microwave-peanut-brittle/",
  "name": "Easy Microwave Peanut Brittle",
  "rating": "4.5",
  "ratingcount": "116",
  "ingredients": "cooking spray; 1 cup white sugar; ½ cup light corn syrup; 1 ½ cups peanuts, or more to taste; 1 tablespoon butter; 1 teaspoon baking soda; 1 teaspoon vanilla extract",
  "directions": "1. Grease a baking sheet and a wooden spoon with cooking spray. 2. Mix sugar and corn syrup together in a microwaveable bowl safe for high temperatures. 3. Heat sugar mixture in the microwave on high for 5 minutes. 4. Stir peanuts and butter into sugar mixture. Heat in the microwave until mixture turns a caramel color, 3 to 4 minutes. Mix baking soda and vanilla into syrup until smooth and foam has dissipated. 5. Spread candy onto the prepared baking sheet using the sprayed wooden spoon. Work quickly; candy hardens fast. Let stand until cool. Break into pieces to serve.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "439"
},
{
  "url": "https://www.allrecipes.com/recipe/128601/my-favorite-sesame-noodles/",
  "name": "My Favorite Sesame Noodles",
  "rating": "4.4",
  "ratingcount": "248",
  "ingredients": "½ (8 ounce) package spaghetti; 2 tablespoons peanut butter; 1 tablespoon honey; 2 tablespoons tamari; 1 teaspoon Thai chili sauce; 1 teaspoon sesame oil; 1 teaspoon ground ginger; 1 clove garlic, minced; 1  green onion, chopped; 2 teaspoons sesame seeds",
  "directions": "1. Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the spaghetti, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain well in a colander set in the sink. 2. Melt the peanut butter in a large microwave-safe glass or ceramic bowl, 15 to 20 seconds (depending on your microwave). Whisk the honey, tamari, and chili sauce into the peanut butter, then stir in the sesame oil and ginger. Mix in the garlic and green onions and toss with the spaghetti. Top with the sesame seeds.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "788"
},
{
  "url": "https://www.allrecipes.com/recipe/265584/vegan-african-peanut-stew-in-the-instant-pot/",
  "name": "Vegan African Peanut Stew in the Instant Pot®",
  "rating": "4.4",
  "ratingcount": "23",
  "ingredients": "1 ½ teaspoons ground cumin; ½ teaspoon ground cinnamon; ¼ teaspoon cayenne pepper; ¼ teaspoon dried red chile flakes; ⅛ teaspoon ground cloves; 1 teaspoon salt; 2 medium sweet potato, cut into 1/2-inch pieces; 1 cup diced yellow onion; ½ cup diced red bell pepper; 4  garlic cloves, minced; 1 (3 inch) piece ginger root, peeled and minced; 1 (28 ounce) can crushed tomatoes; ½ cup peanut butter; 2 cups water; 3 cups chopped collard greens; chopped cilantro, or to taste; chopped peanuts, or to taste",
  "directions": "1. Mix cumin, cinnamon, cayenne, chile flakes, cloves, and salt together in a bowl. Set spice mixture aside. 2. Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Allow the pot to preheat for 2 minutes. Add sweet potato, onion, and bell pepper. Cook, stirring occasionally, for 3 minutes. Add a splash of water and stir if vegetables stick to the pot. Add garlic, ginger, and spice mixture; cook and stir continually for 1 minute. Turn pressure cooker off. 3. Add tomatoes and peanut butter. Stir until dissolved. Add water and stir. Close and lock the lid with vent set to sealing. Select manual mode and set timer for 10 minutes. Allow 10 to 15 minutes for pressure to build. 4. Release pressure using the natural-release method according to manufacturer's instructions, 10 to 40 minutes. Unlock and remove the lid. Stir in collard greens. 5. Place cilantro and chopped peanuts in separate bowls and serve alongside stew.",
  "prep": "30 mins",
  "cook": "26 mins",
  "total": "1 hr 6 mins",
  "calories": "447"
},
{
  "url": "https://www.allrecipes.com/recipe/22841/forgotten-cookies-ii/",
  "name": "Forgotten Cookies II",
  "rating": "4.6",
  "ratingcount": "71",
  "ingredients": "2  egg whites; 1 pinch salt; ⅔ cup white sugar; 1 teaspoon vanilla extract; 1 cup semisweet chocolate chips; 1 cup salted peanuts (Optional)",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line cookie sheets with parchment paper or aluminum foil. 2. In a large glass or metal mixing bowl, beat egg whites and salt until foamy. Gradually add sugar, continuing to beat until whites form stiff peaks. Fold in the vanilla and chocolate chips. Add peanuts if desired. Spoon onto the prepared cookie sheets. 3. Place the cookies into the preheated oven, shut the door and turn off the oven immediately. Let cookies sit in the turned off oven for 5 to 6 hours or overnight.",
  "prep": "10 mins",
  "cook": "5 hrs",
  "total": "5 hrs 50 mins",
  "calories": "62"
},
{
  "url": "https://www.allrecipes.com/recipe/186965/slow-cooker-thai-peanut-pork/",
  "name": "Slow Cooker Thai Peanut Pork",
  "rating": "4.1",
  "ratingcount": "350",
  "ingredients": "cooking spray; 2  red bell pepper, seeded and sliced into strips; 4 (8 ounce) boneless pork loin chops; ½ cup teriyaki sauce; 2 tablespoons rice vinegar; 2 cloves garlic, minced; 1 teaspoon crushed red pepper flakes; ¼ cup creamy peanut butter; ½ cup chopped green onions; ¼ cup chopped roasted peanuts; 2  limes, cut into wedges",
  "directions": "1. Coat a slow cooker with cooking spray. Place bell pepper strips and pork chops into the slow cooker. Pour teriyaki sauce, vinegar, garlic, and red pepper flakes over the pork chops. 2. Cover and cook on Low until pork is very tender, 8 to 9 hours. Once tender, remove pork from the slow cooker, and whisk in peanut butter until smooth. Return pork to the slow cooker, and cook 10 minutes more. 3. Pour into a serving dish and sprinkle with green onions and peanuts to garnish. Decorate with lime wedges to serve.",
  "prep": "10 mins",
  "cook": "8 hrs 10 mins",
  "total": "8 hrs 20 mins",
  "calories": "209"
},
{
  "url": "https://www.allrecipes.com/recipe/10485/salted-peanut-cookies/",
  "name": "Salted Peanut Cookies",
  "rating": "4.7",
  "ratingcount": "15",
  "ingredients": "1 cup shortening; 1 ½ cups packed brown sugar; 2  eggs; 2 teaspoons vanilla extract; 3 cups all-purpose flour; ½ teaspoon baking soda; 1 teaspoon salt; 2 cups salted peanuts",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Cream shortening, brown sugar, eggs, and vanilla in a large bowl until light and fluffy, 3 to 4 minutes. Measure flour and sift into a separate bowl; blend baking soda and salt into flour. Stir flour mixture into egg mixture. Mix in peanuts. 3. Drop rounded teaspoons of dough about 2 inches apart on a lightly greased baking sheet. Flatten dough with the bottom of a greased glass dipped in sugar. 4. Bake in the preheated oven until golden brown, 8 to 10 minutes.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "175"
},
{
  "url": "https://www.allrecipes.com/recipe/68530/west-african-peanut-soup/",
  "name": "West African Peanut Soup",
  "rating": "4.3",
  "ratingcount": "108",
  "ingredients": "2 tablespoons olive oil; 2 medium onions, very finely diced; 2 large bell peppers, (any color) finely chopped; 6 large cloves garlic, minced; 1 (28 ounce) can chopped tomatoes with juice; 8 cups vegetable broth; ¼ teaspoon pepper; ¼ teaspoon red pepper flakes; ½ cup uncooked rice; 1 (18 ounce) jar creamy peanut butter; ½ cup chopped roasted peanuts",
  "directions": "1. Heat olive oil in a large stock pot over medium-high heat. Cook onion, bell pepper, and garlic until lightly browned, about 5 minutes. Stir in tomatoes with their juice, vegetable broth, pepper, and red pepper flakes. Simmer, uncovered, for 15 minutes. 2. Add rice to soup and stir. Reduce heat, cover, and simmer 25 minutes, or until rice is tender. 3. When rice is cooked, whisk in peanut butter and return to a simmer, and serve. Garnish with chopped roasted peanuts, if desired.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "459"
},
{
  "url": "https://www.allrecipes.com/recipe/244325/candied-nuts/",
  "name": "Candied Nuts",
  "rating": "4.5",
  "ratingcount": "10",
  "ingredients": "2 cups raw peanuts; 1 cup white sugar; ⅓ cup water; 1 pinch coarse sea salt, or to taste; 1 pinch ground cinnamon (Optional); 1 pinch chili powder (Optional)",
  "directions": "1. Grease a baking sheet or line with a silicone mat. 2. Cook and stir peanuts, sugar, and water together in a wide, heavy skillet over medium heat until liquid evaporates and nuts begin to crust with the hardening sugar; about 5 minutes. 3. Reduce heat to low and continue to cook and stir, scraping the bottom of the pan to coat peanuts with syrup as the sugar begins to melt and darken to a deep caramel color, about 10 minutes. Tilt pan away from the heat as needed to allow peanut mixture to darken without burning. Remove from heat immediately when peanuts are deeply bronzed; stir. 4. Sprinkle peanuts with sea salt and cinnamon or chili powder; tilt peanuts onto prepared baking sheet to cool completely. Break up clumps. Store in an airtight container at room temperature for up to 1 week.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "55 mins",
  "calories": "304"
},
{
  "url": "https://www.allrecipes.com/recipe/284874/one-bite-thai-flavor-bomb-salad-wraps-miang-kham/",
  "name": "One-Bite Thai \"Flavor Bomb\" Salad Wraps (Miang Kham)",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "⅓ cup unsweetened shredded dried coconut; 2 tablespoons finely chopped roasted peanuts; 2 tablespoons minced shallot; 1 tablespoon finely minced fresh ginger; 1 small lime, zested and juiced; ½ cup packed dark brown sugar; 2 tablespoons fish sauce; ⅔ cup water; 1 cup cubed cooked chicken; 32 leaves fresh spinach; ½ cup toasted unsweetened coconut flakes; ⅓ cup roasted peanuts; 32 leaves Thai basil; 8 slices  lime, quartered; ¼ cup finely chopped Thai chile peppers; ⅓ cup diced shallot; ⅓ cup diced fresh ginger",
  "directions": "1. Combine coconut, peanuts, shallot, ginger, lime zest and juice, brown sugar, fish sauce, and water in a small saucepan, swirl to mix, and bring to a simmer over medium-high heat. Reduce heat to medium and simmer, stirring occasionally, until the mixture reduces by about half and starts to thicken up. 2. Remove from heat and let cool to room temperature before using. Sauce will get thicker once cooled. If sauce is too thick, thin out with a little bit of water. If it's too runny, simply put it back on the heat and reduce it a little more. 3. To make the wraps, place a heaping teaspoon of chicken in a spinach leaf, top with a big pinch of toasted coconut, a few peanuts, a Thai basil leaf, one piece of lime, one piece of Thai chili, one or two pieces of shallots, and one or two cubes of ginger. 4. Top with 1 teaspoon of the sauce and wrap everything into one neat bite. These must be eaten in a single bite to get all the flavors working properly together.",
  "prep": "45 mins",
  "cook": "5 mins",
  "total": "1 hr",
  "calories": "225"
},
{
  "url": "https://www.allrecipes.com/recipe/214695/banana-wake-up-bars/",
  "name": "Banana Wake-Up Bars",
  "rating": "4.2",
  "ratingcount": "101",
  "ingredients": "⅓ cup peanut butter; ⅓ cup brown sugar; 2 ½ tablespoons butter; 1  egg; ½ teaspoon vanilla extract; 1  ripe banana, mashed; ⅔ cup rolled oats; ⅓ cup all-purpose flour; 2 tablespoons wheat germ; ¼ teaspoon baking soda",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9-inch baking pan. 2. In a mixing bowl, beat together the peanut butter, brown sugar, and butter with an electric mixer until smooth and fluffy. Beat in the egg and vanilla extract, then the banana. Stir in the oats, flour, wheat germ, and baking soda until completely combined. Spread in prepared baking pan. 3. Bake in the preheated oven until set and lightly browned, 20 to 25 minutes. Remove from oven and cool in pan on wire rack before cutting into bars.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "102"
}]