[{
  "url": "https://www.allrecipes.com/recipe/245028/poached-pears-belle-helene/",
  "name": "Poached Pears Belle Helene",
  "rating": "4.9",
  "ratingcount": "14",
  "ingredients": "6 cups water; 1  lemon, zested and juiced; 4  Bosc pears - cored, peeled, stems left on; 1  vanilla bean; 3 cups sugar; 1 cup prepared hot fudge topping, or as needed; 1 cup vanilla ice cream, or as needed",
  "directions": "1. Place water in a heavy pot. Stir in zest and juice of 1 lemon. Place pears in pot. Split the vanilla bean lengthwise and scrape out the seeds. Add the seeds and split pods to the poaching liquid. Pour in sugar. 2. Bring pot to a simmer over medium-high heat; stir gently to dissolve sugar with minimal jostling of the pears. Reduce heat so pears continue cooking over a steady, gentle simmer. Pears need to stay submerged, so place a small plate over them in the pot to keep them under the liquid. Simmer until pears are just tender, 20 to 25 minutes. (Remove plate to test the pears for doneness.) Remove pot from heat and let pears cool to room temperature in the poaching liquid. 3. Transfer pears and vanilla beans to a storage container and cover with some of the poaching liquid. Cover and refrigerate until pears are thoroughly chilled, several hours or overnight. Reserve all of the poaching liquid (see footnote). 4. Heat hot fudge sauce in a saucepan over medium heat until warm. Dip base of pear into the chocolate and spoon chocolate along the sides except for the top inch or so of the pear. 5. Place dipped pears in individual serving bowls with another generous spoonful of syrup and a small scoop of vanilla ice cream.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "3 hrs",
  "calories": "1060"
},
{
  "url": "https://www.allrecipes.com/recipe/206356/gorgonzola-pear-pasta/",
  "name": "Gorgonzola Pear Pasta",
  "rating": "4.6",
  "ratingcount": "69",
  "ingredients": "9 ounces penne pasta; 2 tablespoons butter; ½ cup grated Parmesan cheese; 3 tablespoons crumbled Gorgonzola cheese; ½ cup heavy whipping cream; 1 large pear, peeled and cubed; ½ cup chopped toasted walnuts; ground black pepper to taste",
  "directions": "1. Bring a large pot of lightly salted water to a rolling boil. Cook penne in the boiling water, stirring occasionally, until tender yet firm to the bite, about 11 minutes; drain. 2. Return drained pasta to the pot; stir butter, Parmesan cheese, and Gorgonzola cheese into pasta and place over medium heat; cook until the cheese is completely melted. Pour cream into pasta mixture; stir. Remove from heat and fold in pear. Top with walnuts. Season with pepper and serve.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "1828"
},
{
  "url": "https://www.allrecipes.com/recipe/7491/fabulously-sweet-pear-cake/",
  "name": "Fabulously Sweet Pear Cake",
  "rating": "4.3",
  "ratingcount": "185",
  "ingredients": "4  fresh pears; 1 cup white sugar; 1 cup packed brown sugar; 1 cup chopped pecans; 1 cup vegetable oil; 2  eggs; 3 cups all-purpose flour; ½ teaspoon salt; 2 teaspoons baking soda; 1 teaspoon vanilla extract",
  "directions": "1. Peel and slice pears thin. Mix sliced pears with white sugar, brown sugar, and nuts and let sit for one hour. After sitting puree pear mixture in a blender. 2. Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 13x9 inch pan. 3. By hand stir in until just blended; the flour, salt, and baking soda. Add dry ingredients to pear mixture and add oil, vanilla and eggs. Pour batter into prepared pan. 4. Bake at 350 degrees F (175 degrees C) for 1 hour and 15 minutes.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "451"
},
{
  "url": "https://www.allrecipes.com/recipe/255519/homemade-pear-and-gorgonzola-ravioli/",
  "name": "Homemade Pear and Gorgonzola Ravioli",
  "rating": "5.0",
  "ratingcount": "6",
  "ingredients": "3 tablespoons butter; 2  ripe pears - peeled, cored, and cubed; 3 sprigs fresh thyme; 7 ounces Gorgonzola cheese, crumbled; 1 pound fresh pasta dough",
  "directions": "1. Melt butter in a large skillet over medium heat. Add pears and thyme; cook, stirring often, until pears have softened, about 10 minutes. Crumble Gorgonzola cheese over pears; cook and stir until melted, 2 to 3 minutes. Remove skillet from heat and cool filling completely. 2. Cut pasta dough into 3 equal pieces. Flatten the first piece of dough on a floured work surface; roll with a rolling pin 5 or 6 times. Turn the dough 45 degrees and roll again, 5 to 6 times. Keep rolling and turning in the same direction until dough has a consistent thickness of about 1/16-inch. Repeat with remaining 2 pieces of pasta dough. 3. Gently transfer 1 pasta sheet to a floured surface and cut in half to form 2 evenly sized rectangles. Drop about 1 teaspoon filling onto 1 rectangle, spacing the filling about 1-inch apart. Brush the spaces around the filling with water. 4. Lay the second rectangle on top of the first. Gently squeeze out the air around the filling and press firmly with your hands to seal the edges and all dough around the filling. 5. Cut square ravioli shapes using a ravioli cutter. Transfer the ravioli to a floured plate or board. Repeat with the remaining dough and filling. Let the ravioli stand for about 30 minutes. 6. Bring a saucepan of lightly salted water to the boil; gently add ravioli, working in batches. Cook until ravioli float to the top, about 3 minutes. Remove using a slotted spoon and transfer to a warm bowl.",
  "prep": "30 mins",
  "cook": "20 mins",
  "total": "1 hr 20 mins",
  "calories": "555"
},
{
  "url": "https://www.allrecipes.com/recipe/229399/cranberry-pear-salad/",
  "name": "Cranberry Pear Salad",
  "rating": "4.8",
  "ratingcount": "19",
  "ingredients": "¾ cup olive oil; ¼ cup balsamic vinegar; 1 tablespoon dark brown sugar; 2 ½ teaspoons minced garlic; ½ teaspoon salt; ½ teaspoon freshly ground black pepper; 6 cups mixed baby greens; 3  pears, thinly sliced; 1 cup dried cranberries; 1 cup toasted pecans; ¾ cup cubed Havarti cheese; ½ cup toasted sliced almonds",
  "directions": "1. Whisk olive oil, balsamic vinegar, brown sugar, garlic, salt, and black pepper in a medium bowl. 2. Combine greens, pears, cranberries, pecans, and Havarti cheese in a large bowl. Pour balsamic vinegar dressing over salad and toss. Garnish with almonds to serve.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "604"
},
{
  "url": "https://www.allrecipes.com/recipe/39988/peach-salsa-ii/",
  "name": "Peach Salsa",
  "rating": "4.6",
  "ratingcount": "63",
  "ingredients": "canning jars; 4 cups fresh peaches - peeled, pitted and chopped; 4  jalapeno peppers, minced; ½ cup chopped onion; ½ cup chopped red bell pepper; ¼ cup chopped fresh cilantro; ¼ cup distilled white vinegar; 3 cloves garlic, minced; 1 ½ teaspoons ground cumin; 1 teaspoon grated lime zest; 1 (49 gram) package light fruit pectin crystals; 3 ¾ cups white sugar",
  "directions": "1. Inspect canning jars for cracks and rings for rust, discarding any defective ones. Immerse in simmering water until salsa is ready. Wash new, unused lids and rings in warm soapy water. 2. Combine peaches, jalapeño, onion, bell pepper, cilantro, vinegar, garlic, cumin, and lime zest in a large saucepan. Mix together pectin and 1/4 cup sugar in a small bowl, then stir into peach mixture in the saucepan. Bring to a boil. Stir in remaining 3 1/2 cups sugar. Boil for 1 minute, stirring constantly. Remove from heat and stir for 5 minutes. 3. Pack salsa into hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe the rims with a moist paper towel to remove any residue. Top with the lids and screw the rings on tightly 4. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 15 minutes. 5. Remove the jars from the stockpot and let rest, several inches apart, for 12 to 24 hours. Press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area.",
  "prep": "1 hr",
  "cook": "30 mins",
  "total": "1 hr 30 mins",
  "calories": "118"
},
{
  "url": "https://www.allrecipes.com/recipe/66969/blue-cheese-and-pear-tartlets/",
  "name": "Blue Cheese and Pear Tartlets",
  "rating": "4.1",
  "ratingcount": "193",
  "ingredients": "1  ripe pear - peeled, cored, and chopped; 4 ounces blue cheese, crumbled; 2 tablespoons light cream; ground black pepper to taste; 1 (1.9 ounce) package mini phyllo tart shells",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix together pear, blue cheese, and cream in a baking dish. Season with pepper. Spoon mixture into phyllo shells. 3. Bake in the preheated oven for 15 minutes. Serve warm.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "60"
},
{
  "url": "https://www.allrecipes.com/recipe/270527/instant-pot-galbi-korean-style-short-ribs/",
  "name": "Instant Pot Galbi (Korean-Style Short Ribs)",
  "rating": "4.4",
  "ratingcount": "9",
  "ingredients": "3 pounds beef short ribs; 1  Asian pear - peeled, cored, and coarsely chopped; 1 small onion, chopped; 4 cloves garlic, chopped; ½ tablespoon peeled and coarsely chopped fresh ginger; 1 cup low-sodium soy sauce, divided; ¼ cup rice wine; ¼ cup water; ¼ cup brown sugar; 2 tablespoons sesame oil, divided; ½ teaspoon ground black pepper; 2  carrots, peeled and cut in chunks; 5  radishes, peeled and cut into chunks; ¼ cup white sugar; ½ bunch green onions, chopped, or to taste; 1 tablespoon sesame seeds, or to taste",
  "directions": "1. Soak ribs in a large bowl of water for 1 hour. 2. Meanwhile, combine Asian pear, onion, garlic, and ginger in a blender or food processor; purée until smooth. Transfer mixture to a mixing bowl. Mix in 3/4 cup soy sauce, rice wine, water, brown sugar, 1 tablespoon sesame oil, and pepper to create a sauce. Set aside. 3. Drain ribs and dry them well. Trim off excess fat. Place ribs in a multi-functional pressure cooker (such as Instant Pot), then add carrots and radishes. Pour Asian pear sauce on top. Close and lock the lid. Select Meat function according to manufacturer's instructions; set the timer for 35 minutes. Allow 10 to 15 minutes for pressure to build. 4. Release pressure using the natural-release method according to manufacturer's instructions, 10 to 40 minutes. Unlock and remove the lid. Transfer meat and vegetables to a plate and set aside. 5. Select the Sauté function on your Instant Pot. Stir in white sugar, remaining 1/4 cup soy sauce, and remaining 1 tablespoon sesame oil. Cook, stirring occasionally, until sugar has melted and sauce has thickened, about 10 minutes. Return ribs and vegetables to the pot; stir to coat with sauce. 6. Garnish ribs and vegetables with green onions and sesame seeds.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "2 hrs 25 mins",
  "calories": "657"
},
{
  "url": "https://www.allrecipes.com/recipe/103364/winter-white-soup/",
  "name": "Winter White Soup",
  "rating": "4.2",
  "ratingcount": "14",
  "ingredients": "1 tablespoon butter; 1 tablespoon olive oil; 3 cloves garlic, chopped; 2  shallots, chopped; 1 (1 inch) piece fresh ginger, minced; ⅓ small head cauliflower, chopped; 10 small button mushrooms, chopped; 3  green onions, chopped; 1 small parsnip, chopped; 1  pear - peeled, cored and diced; ½ cup cannellini beans; 1 teaspoon chopped fresh dill; ½ teaspoon Dijon mustard; ¾ cup Chardonnay wine; 6 sprigs fresh thyme; 1 (14.5 ounce) can fat-free chicken broth; ⅓ cup heavy cream; ¼ cup fat-free chicken broth (Optional); salt and pepper to taste",
  "directions": "1. Heat butter and olive oil in a large saucepan over low heat. Stir in garlic, shallots, and ginger; cook and stir until fragrant but not brown, about 5 minutes. Stir in cauliflower, mushrooms, green onions, and parsnip; cook and stir for an additional 5 minutes. Add pear, beans, dill, and mustard; stir just until heated through, about 1 minute. 2. Stir in wine and thyme; increase heat to high. Bring to a boil, stirring constantly, and simmer until wine is reduced by half and is syrupy, about 5 minutes. Pour in chicken broth; return to a boil, then reduce heat to low and simmer, partly covered, until vegetables are tender, about 20 minutes. Allow soup to cool slightly. 3. Fill a blender halfway with soup. Cover and hold the lid down with a potholder; pulse a few times before leaving on to blend. Pour into a pot. Repeat with remaining soup. 4. Stir in cream and, if needed, thin with additional chicken broth. Season with salt and pepper; serve hot.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "158"
},
{
  "url": "https://www.allrecipes.com/recipe/235666/vanilla-pear-muffins/",
  "name": "Vanilla Pear Muffins",
  "rating": "4.8",
  "ratingcount": "40",
  "ingredients": "1 cup whole wheat flour; ½ cup all-purpose flour; ¾ cup white sugar; 1 ½ teaspoons baking powder; ½ teaspoon salt; ½ cup low-fat vanilla yogurt; ½ cup canola oil; 1  egg; 2 teaspoons vanilla extract; 1  ripe pear - peeled, cored, and diced; ½ cup chopped pecans",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). Grease or line 12 muffin cups with paper liners. 2. Whisk whole wheat flour, all-purpose flour, sugar, baking powder, and salt together in a bowl. Whisk yogurt, oil, egg, and vanilla extract together in a separate bowl until smooth. Stir yogurt mixture into flour mixture until batter is just mixed; fold in pear and pecans. Spoon batter into the prepared muffin cups. 3. Place muffin tin in the preheated oven; reduce heat to 350 degrees F (175 degrees C). Bake until tops of muffins are browned and a toothpick inserted in the middle comes out clean, 20 to 25 minutes. Cool in the tin for 5 minutes before transferring to a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "1 hr",
  "calories": "240"
},
{
  "url": "https://www.allrecipes.com/recipe/239366/spiced-pear-apple-pie/",
  "name": "Spiced Pear & Apple Pie",
  "rating": "4.8",
  "ratingcount": "21",
  "ingredients": "1  Classic Crisco® Double Pie Crust; 4 cups peeled, thinly sliced pears; 2 cups peeled, thinly sliced apples; ¾ cup sugar; 2 tablespoons Pillsbury BEST® All Purpose Flour; ¾ teaspoon ground cinnamon; ¾ teaspoon ground ginger; ¼ teaspoon salt; 1 tablespoon lemon juice; Milk; Cinnamon sugar",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Roll out dough for bottom crust; place in a 9-inch pie plate. Press to fit without stretching dough; trim edges until even with pie plate. 2. Combine pears, apples, sugar, flour, cinnamon, ginger, salt, and lemon juice in a large bowl. Spoon into prepared pie crust. 3. Roll out dough for top crust. Place onto filled pie or cut into strips creating a lattice top. Trim 1/2 inch beyond the edge and fold under bottom crust edge to seal. Crimp and flute edges. Cut slits in top crust or prick with a fork to allow steam to escape. Brush crust with milk and sprinkle with cinnamon sugar. 4. Bake in preheated oven for 30 to 40 minutes or until apples are tender and crust is golden brown.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "418"
},
{
  "url": "https://www.allrecipes.com/recipe/228231/summer-fruit-salad-with-a-lemon-honey-and-mint-dressing/",
  "name": "Summer Fruit Salad with a Lemon, Honey, and Mint Dressing",
  "rating": "4.9",
  "ratingcount": "25",
  "ingredients": "4 cups cubed seeded watermelon; 2 cups sliced fresh strawberries; 2 large  fresh peaches, cut into cubes; 2 large  nectarines, cut into cubes; 1  red Anjou pear, cut into cubes; 1 cup seedless grapes, halved; 2  lemons, juiced; ¼ cup minced fresh mint (chocolate mint preferred); ½  lemon, zested; 1 tablespoon honey (fireweed honey preferred)",
  "directions": "1. Combine watermelon, strawberries, peaches, nectarines, pear, and grapes in a large mixing bowl. 2. Whisk lemon juice, mint, lemon zest, and honey together in a small bowl; drizzle over the fruit mixture and toss to coat. 3. Refrigerate 1 hour before serving.",
  "prep": "20 mins",
  "cook": "",
  "total": "1 hr 20 mins",
  "calories": "99"
},
{
  "url": "https://www.allrecipes.com/recipe/89854/roasted-pears-with-caramel-sauce/",
  "name": "Roasted Pears with Caramel Sauce",
  "rating": "4.4",
  "ratingcount": "102",
  "ingredients": "4 tablespoons butter; 1 cup packed dark brown sugar; 4  pears, halved and cored; ½ cup sour cream; ¼ cup coarsely chopped toasted pistachios (or your favorite nuts)",
  "directions": "1. Adjust the oven rack to the center position and heat the oven to 400 degrees F (200 degrees C). Place butter in a baking pan large enough to hold pears in a single layer; set in the heating oven until it melts. 2. Sprinkle sugar over melted butter, then place pears, cut-side down, on top. Bake until tender, about 30 minutes. 3. Remove pan from oven, turn pears over and baste with pan sauce. Return to oven; bake until golden and glossy, about 10 minutes longer. 4. Let cool briefly. Transfer pears to dessert plates or bowls. Top each with a dollop of sour cream, drizzle with caramel pan sauce, sprinkle with nuts, and serve.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "50 mins",
  "calories": "512"
},
{
  "url": "https://www.allrecipes.com/recipe/74140/grilled-pork-chops-with-balsamic-caramelized-pears/",
  "name": "Grilled Pork Chops with Balsamic Caramelized Pears",
  "rating": "4.5",
  "ratingcount": "122",
  "ingredients": "1 ½ quarts water; 5 tablespoons kosher salt; 2 tablespoons white sugar; 6  pork loin chops, 1/2 inch thick; ½ cup olive oil; 4 cloves garlic, minced; 1 tablespoon fresh rosemary, minced; ½ cup balsamic vinegar; 1 tablespoon butter; 1 tablespoon olive oil; 2  Vidalia onions, each cut into 8 wedges; 2  pears, cored and each cut into 8 wedges; 1 teaspoon salt",
  "directions": "1. In a large bowl, stir together the water, kosher salt, and sugar. Add pork chops to this brine, and let them soak for no more than one hour. Drain and discard the brine. Pat pork chops dry with paper towels. 2. In a shallow dish, stir together the olive oil, garlic, and rosemary. Place pork chops in the dish, and turn to coat. Cover, and marinate in the refrigerator for at least 1 or 2 hours. 3. Pour the balsamic vinegar into a small saucepan. Bring to a boil, and cook until reduced by 1/2, about 10 minutes. When the vinegar cools, it should be the consistency of syrup. 4. Melt butter with olive oil in a large skillet over medium-high or high heat. Add the onions and pears, and quickly brown being careful to keep the wedges intact. Once the onions and pears are browned, reduce heat to low, and cook for about 7 minutes, or until tender. Stir in the reduced vinegar and salt. The recipe can be prepared up to this point several hours before grilling. 5. Preheat the grill for medium-high heat. 6. Warm pears on a cool section of the grill (in the skillet), while placing the pork chops over the hot part. Cook pork for about 3 minutes per side, or to desired doneness. Remove to a serving plate, cover with aluminum foil and let rest for a few minutes. Uncover, top with the pear onion sauce, and serve.",
  "prep": "2 hrs",
  "cook": "6 mins",
  "total": "2 hrs 6 mins",
  "calories": "420"
},
{
  "url": "https://www.allrecipes.com/recipe/50953/brandied-pears/",
  "name": "Brandied Pears",
  "rating": "4.5",
  "ratingcount": "14",
  "ingredients": "⅓ cup brown sugar; ⅓ cup water; 1 tablespoon fresh lemon juice; 3 large pears, peeled, halved, and cored; ⅓ cup walnuts, finely chopped; 2 tablespoons brown sugar; 1 ½ tablespoons brandy; 1 tablespoon plain yogurt; 1 cup whipping cream; 1 tablespoon white sugar; 2 teaspoons brandy, sherry, or other liqueur",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Mix 1/3 cup brown sugar, water, and lemon juice together in an ungreased baking dish until sugar is dissolved. Place pear halves into the dish with the flat sides facing down; baste with sauce. Cover the dish with aluminum foil. 3. Bake in the preheated oven until pears are fork-tender but not mushy, 20 to 25 minutes. 4. Meanwhile, mix walnuts, 2 tablespoons brown sugar, 1 1/2 tablespoons brandy, and yogurt together in a small bowl. 5. Beat cream in a separate bowl until stiff peaks form. Add white sugar and 2 teaspoons of brandy; gently whip a few strokes more to incorporate. 6. Flip warm pear halves and transfer to serving plates. Fill cavities with nut stuffing and top with whipped cream. Spoon remaining cooking sauce over top.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "308"
},
{
  "url": "https://www.allrecipes.com/recipe/280230/air-fryer-pear-crisp-for-two/",
  "name": "Air Fryer Pear Crisp for Two",
  "rating": "4.0",
  "ratingcount": "2",
  "ingredients": "2  pears - peeled, cored, and diced; 1 teaspoon lemon juice; ¾ teaspoon ground cinnamon, divided; 2 tablespoons quick-cooking oats; 1 tablespoon all-purpose flour; 1 tablespoon brown sugar; 1 tablespoon salted butter, softened",
  "directions": "1. Preheat the air fryer to 360 degrees F (180 degrees C). 2. Combine pears, lemon juice, and 1/4 teaspoon cinnamon in a medium bowl. Toss to coat, then divide the mixture between 2 ramekins. 3. Combine oats, flour, brown sugar, and remaining 1/2 teaspoon cinnamon in a small bowl. Mix in softened butter using a fork until mixture is crumbly. Sprinkle over the pears. 4. Place the ramekins in the air fryer basket and cook until the pears are soft and bubbling, 18 to 20 minutes.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "234"
},
{
  "url": "https://www.allrecipes.com/recipe/230201/baked-pears/",
  "name": "Baked Pears",
  "rating": "3.4",
  "ratingcount": "9",
  "ingredients": "2 large pears; 1 teaspoon maple syrup, or to taste; 2 tablespoons brown sugar; 2 tablespoons butter; 1 teaspoon ground cinnamon; ½ cup vanilla ice cream",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Cut top quarter of pears off; create a well by scooping out the core, being careful not to puncture the bottom of the pear. Arrange pears in a shallow baking dish. 3. Drizzle maple syrup over pears. Place 1 tablespoon brown sugar and 1 tablespoon butter in each pear; sprinkle with cinnamon. 4. Bake in preheated oven until pears are easily pierced with a fork, 35 to 50 minutes. Serve with ice cream.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "352"
},
{
  "url": "https://www.allrecipes.com/recipe/62151/fruit-leather/",
  "name": "Fruit Leather",
  "rating": "4.4",
  "ratingcount": "38",
  "ingredients": "1 cup sugar; ¼ cup lemon juice; 4 cups peeled, cored and chopped apple; 4 cups peeled, cored and chopped pears",
  "directions": "1. Preheat the oven to 150 degrees F (65 degrees C). Cover a baking sheet with a layer of plastic wrap or parchment paper. 2. In the container of a blender, combine the sugar, lemon juice, apple and pear. Cover and puree until smooth. Spread evenly on the prepared pan. Place the pan on the top rack of the oven. 3. Bake for 5 to 6 hours, leaving the door to the oven partway open. Fruit is dry when the surface is no longer tacky and you can tear it like leather. Roll up on the plastic wrap and store in an airtight jar.",
  "prep": "20 mins",
  "cook": "5 hrs",
  "total": "5 hrs 20 mins",
  "calories": "90"
},
{
  "url": "https://www.allrecipes.com/recipe/275903/pear-clafoutis/",
  "name": "Pear Clafoutis",
  "rating": "4.6",
  "ratingcount": "19",
  "ingredients": "2 tablespoons unsalted butter, softened, divided; 3 large eggs; ⅓ cup white sugar, or to taste; 1 ¼ cups whole milk; ¼ teaspoon fine salt; 1 pinch freshly grated nutmeg; 1 ½ teaspoons vanilla extract; ½ teaspoon almond extract; ⅔ cup all-purpose flour; 3 cups thinly sliced sweet, ripe pears; ½ cup toasted sliced almonds; ½ tablespoon white sugar, or as needed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 10-inch baking dish generously with 1 tablespoon butter. 2. Whisk eggs, 1/3 cup sugar, milk, salt, nutmeg, vanilla extract, almond extract, and flour together in a bowl. 3. Reserve 12 to 14 pear slices for topping; add remaining pear slices to the prepared baking dish. Pour egg custard mixture over pears in the baking dish and top with almonds. Shake and tap the dish gently on the countertop to let mixture settle. Lay reserved pear slices flat on top. Melt remaining butter and brush over pears. Sprinkle with 1/2 tablespoon sugar. 4. Bake in the preheated oven until top is golden, fruit is soft, and custard is set, about 45 minutes. Remove from the oven and let cool to room temperature before serving, or serve chilled.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "218"
},
{
  "url": "https://www.allrecipes.com/recipe/284933/banana-pear-bread/",
  "name": "Banana-Pear Bread",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "1 medium ripe pear; 1 cup brown sugar; ½ cup unsalted butter, softened; 2 large eggs; 2 medium ripe bananas, mashed; 2 cups all-purpose flour; 2 teaspoons baking soda; ½ teaspoon vanilla extract; ½ teaspoon ground cinnamon; ½ teaspoon ground ginger; ¼ teaspoon almond extract",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan. 2. Peel and core pear. Grate pear flesh into a bowl. 3. Mix brown sugar and butter in a bowl with an electric mixer until well blended. Mix in eggs, then add bananas and pear. Gradually mix in flour and baking soda. Add vanilla, cinnamon, ginger, and almond extract; mix until just combined. Pour into the prepared loaf pan. 4. Bake on the center rack of the preheated oven until a toothpick inserted into the center comes out fairly clean, about 1 hour.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "302"
},
{
  "url": "https://www.allrecipes.com/recipe/10954/spicy-pear-cookies/",
  "name": "Spicy Pear Cookies",
  "rating": "4.5",
  "ratingcount": "61",
  "ingredients": "½ cup butter, softened; 1 ½ cups packed brown sugar; 1 large egg; 1 teaspoon vanilla extract; 2 cups all-purpose flour; 1 ½ teaspoons baking powder; 1 teaspoon ground cinnamon; 1 teaspoon ground ginger; 1  pear - peeled, cored and diced; ½ cup raisins; ½ cup chopped walnuts; 1 ½ cups confectioners' sugar; 2 ½ tablespoons lemon juice",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Beat butter and sugar in a large bowl until smooth. Beat in egg and vanilla. Combine flour, baking powder, cinnamon, and ginger; mix into batter. Stir in diced pear, raisins, and chopped walnuts. 3. Drop cookie dough about 2 inches apart by rounded tablespoonfuls onto baking sheets. 4. Bake in the preheated oven until edges are golden brown and center springs back when lightly touched, about 15 minutes. Remove to wire racks to cool. 5. Combine confectioners' sugar and lemon juice and mix until smooth. Spoon icing over cookies.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "299"
},
{
  "url": "https://www.allrecipes.com/recipe/94966/pear-bread-pudding/",
  "name": "Pear Bread Pudding",
  "rating": "4.3",
  "ratingcount": "13",
  "ingredients": "¼ cup brown sugar; ¼ cup white sugar; 1 ¼ cups all-purpose flour; 1 teaspoon ground cinnamon; 1 teaspoon salt; ½ cup butter, softened; 1 tablespoon vanilla extract; 8  eggs; 1 cup white sugar; 1 cup half-and-half cream; 1 teaspoon vanilla extract; ¼ cup pear brandy; ½ teaspoon salt; 2 (1 pound) loaves sliced artisan bread, cut into 3/4 inch strips with crusts removed; 4  pears - peeled, cored and sliced; 2 cups heavy cream; 1 pinch ground cinnamon",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. In a medium bowl, stir together the brown sugar, 1/4 cup white sugar, flour, cinnamon and salt. Mix in the butter and 1 tablespoon of vanilla just until the mixture resembles coarse crumbs. Set aside. 3. In a separate bowl, whisk together the eggs, 1 cup white sugar, half-and-half, 1 teaspoon of vanilla, pear brandy and salt. 4. Line the bottom of a 9x13 inch baking dish with a layer of bread. Top with a layer of pear. Pour about 1/4 of the custard over the layers followed by about 1/3 of the heavy cream. Sprinkle with some of the crumb topping. Repeat layers until you are out of ingredients, ending with the crumb topping on top. Press down on the layers as needed to help them absorb the liquid. Cover the pan with parchment paper then seal with aluminum foil. Place another baking pan on top or two dinner plates to keep it from puffing while it bakes. 5. Place the pudding onto a larger pan or cookie sheet with sides. Pour boiling water into the bottom pan until it is half way full. 6. Bake for 10 minutes in the preheated oven, then reduce the oven temperature to 350 degrees F (175 degrees C) and continue baking for 25 minutes. Pudding is done when a knife inserted into the center comes out clean.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "680"
},
{
  "url": "https://www.allrecipes.com/recipe/229775/creamy-baked-pears/",
  "name": "Creamy Baked Pears",
  "rating": "4.8",
  "ratingcount": "52",
  "ingredients": "2 tablespoons butter, divided; 2 tablespoons white sugar, divided; 2  Bosc pears, halved and cored; ½ cup heavy whipping cream",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease a 9-inch baking dish with 1 tablespoon butter. Sprinkle 1 tablespoon sugar into buttered dish. 2. Rub remaining 1 tablespoon butter over pear halves; arrange pears cut sides down in prepared baking dish and sprinkle with remaining 1 tablespoon sugar. 3. Bake in the preheated oven for 10 minutes. Pour cream over pears and continue baking until tender, about 20 minutes more.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "175"
},
{
  "url": "https://www.allrecipes.com/recipe/255594/pear-and-almond-tart-dairy-and-gluten-free/",
  "name": "Pear and Almond Tart (Dairy and Gluten Free)",
  "rating": "4.9",
  "ratingcount": "9",
  "ingredients": "1 ¼ cups almond meal; ¼ cup gluten-free oat flour; ½ teaspoon gluten-free baking powder; 1 large egg, beaten; ¼ cup maple syrup; 2 tablespoons coconut oil, melted; 1 teaspoon vanilla extract; ¼ teaspoon sea salt; ¼ teaspoon almond extract; 1 ½ (16 ounce) cans pear halves, drained and patted dry",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease the bottom of a tart pan with a removable bottom and line with parchment paper. 2. Mix together almond meal, oat flour, and baking powder in a medium bowl. 3. Whisk egg, maple syrup, coconut oil, vanilla, salt, and almond extract in a large bowl. Fold in almond meal mixture to form a sticky dough. 4. Press dough into the prepared tart pan. Arrange pears on top. 5. Bake in the preheated oven until golden brown, 22 to 25 minutes.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "234"
},
{
  "url": "https://www.allrecipes.com/recipe/81565/curried-cashew-pear-and-grape-salad/",
  "name": "Curried Cashew, Pear, and Grape Salad",
  "rating": "4.8",
  "ratingcount": "345",
  "ingredients": "¾ cup cashew halves; 4 slices bacon, coarsely chopped; 1 tablespoon melted butter; 1 teaspoon chopped fresh rosemary; 1 teaspoon curry powder; 1 tablespoon brown sugar; ½ teaspoon kosher salt; ½ teaspoon cayenne pepper; 3 tablespoons white wine vinegar; 3 tablespoons Dijon mustard; 2 tablespoons honey; ½ cup olive oil; salt and black pepper to taste; 1 (10 ounce) package mixed salad greens; ½ medium Bosc pear, thinly sliced; ½ cup halved seedless red grapes",
  "directions": "1. In a large, dry skillet over medium-high heat, toast cashews until golden brown, about 5 minutes. Remove cashews to a dish to cool slightly. 2. Return skillet to medium-high heat, cook bacon strips until crisp on both sides, about 7 minutes. Remove bacon with a slotted spoon, and soak up grease with a paper towel. Coarsely chop bacon, and set aside. 3. In a medium bowl, stir together butter, rosemary, curry powder, brown sugar, salt, cayenne pepper, and toasted cashews. Set aside. 4. In a small bowl, stir together white wine vinegar, mustard, and honey. Slowly whisk in olive oil, and sprinkle with salt and pepper to taste. 5. In a large salad bowl, toss dressing with greens, pear slices, grapes, and bacon, and sprinkle with nut mixture.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "45 mins",
  "calories": "372"
},
{
  "url": "https://www.allrecipes.com/recipe/234401/renees-pear-crisp/",
  "name": "Renee's Pear Crisp",
  "rating": "4.4",
  "ratingcount": "38",
  "ingredients": "6 cups sliced pears; ½ cup butter, melted; 2 tablespoons maple syrup; 2 cups all-purpose flour, or more as needed; 1 cup brown sugar; ½ cup white sugar; 1 teaspoon ground cinnamon; ½ teaspoon ground nutmeg; ¼ teaspoon vanilla extract; ½ cup butter, softened",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13-inch baking dish. 2. Spread pears to cover bottom of the baking dish; drizzle with melted butter and maple syrup. 3. Stir flour, brown sugar, white sugar, cinnamon, nutmeg, and vanilla extract together in a bowl. Cut softened butter into flour mixture until mixture resembles coarse crumbs, adding more flour if necessary. Sprinkle topping over pears. 4. Bake in preheated oven until pears are bubbling and topping is crisp, about 30 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "417"
},
{
  "url": "https://www.allrecipes.com/recipe/36466/pear-honey-cranberry-sauce/",
  "name": "Pear Honey Cranberry Sauce",
  "rating": "4.5",
  "ratingcount": "149",
  "ingredients": "½ cup water; ½ cup white sugar; 2  pears - peeled, cored and diced; 1 (12 ounce) package fresh or frozen cranberries; 1 cup honey; 1 tablespoon fresh lemon juice; 1 teaspoon grated lemon zest",
  "directions": "1. In a medium saucepan, stir together the water and sugar over medium-high heat. Bring to a boil. Stir in pears, and reduce heat to medium. Cook, stirring frequently for 3 minutes, then stir in cranberries and honey. Continue to cook until cranberries pop and the mixture thickens slightly, about 5 minutes. 2. Remove from heat and stir in the lemon juice and lemon zest. Cool to room temperature, then store covered in the refrigerator for up to one week.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "177"
},
{
  "url": "https://www.allrecipes.com/recipe/12279/fresh-fruit-cobbler/",
  "name": "Fresh Fruit Cobbler",
  "rating": "4.6",
  "ratingcount": "132",
  "ingredients": "1 cup sliced fresh peaches; ¾ cup peeled, cored and sliced apple; ¾ cup peeled, cored and sliced pear; ½ cup blueberries; ½ cup pitted and sliced cherries; ½ cup pitted and sliced plums; 1  egg; ¾ cup white sugar; ¼ cup milk; 1 cup all-purpose flour; 1 teaspoon baking powder; ½ teaspoon salt; ½ teaspoon vanilla extract; 2 tablespoons butter, melted",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 2-quart baking dish. 2. Arrange peaches, apple, pear, blueberries, cherries, and plums in the prepared baking dish. In a medium bowl, beat egg, sugar, and milk. In a separate bowl, sift together flour, baking powder, and salt; stir into egg mixture. Stir in vanilla and melted butter. Cover fruit with batter mixture. 3. Bake 30 minutes in the preheated oven. Cobbler should be bubbly and lightly browned. Serve warm.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "272"
},
{
  "url": "https://www.allrecipes.com/recipe/218073/momma-pritchetts-grilled-pork-chops-and-apple-pear-topping/",
  "name": "Momma Pritchett's Grilled Pork Chops and Apple-Pear Topping",
  "rating": "4.7",
  "ratingcount": "56",
  "ingredients": "1 cup light brown sugar; 1 cup soy sauce; 1 cup orange juice; ½ cup spicy brown mustard; ⅓ cup honey; 2 tablespoons Worcestershire sauce; 2 tablespoons ground black pepper; 1 tablespoon ground cumin; 8  pork chops, 1/2 to 1 inch thick; 1  lime, juiced; ½ cup butter; 1 tablespoon light brown sugar, or to taste; 2 tablespoons ground cinnamon; 4 large green apples - peeled, cored, and cut into eighths; 4  Bartlett pears - peeled, cored, and cut into eighths",
  "directions": "1. In a large bowl, mix together 1 cup brown sugar, soy sauce, orange juice, brown mustard, honey, Worcestershire sauce, black pepper, and cumin until thoroughly combined and the sugar has dissolved. Place the pork chops into the marinade, and spoon marinade to cover the chops. Let stand at room temperature for 45 minutes to 1 hour. 2. Preheat an outdoor grill for medium-high heat, and lightly oil the grate. 3. Remove the chops from the marinade, and discard marinade. Shake any excess drops of liquid from the chops, and grill until they are browned, no longer pink inside, and show good grill marks, about 8 minutes per side. Squeeze lime juice over the chops as they grill. An instant-read meat thermometer inserted into the thickest part of a chop should read at least 145 degrees F (63 degrees C). 4. Melt butter in a large skillet over high heat, then stir in 1 tablespoon of brown sugar and cinnamon; bring the mixture to a boil, stirring to dissolve the sugar. Stir in the apple and pear slices, and cook, stirring often, until the fruit is coated with the butter mixture and softened but not mushy, about 5 minutes. Transfer the apple and pear slices to a grilling basket. 5. Grill the fruit on the outdoor grill until the slices are browned, about 5 more minutes. Serve grilled fruit with pork chops.",
  "prep": "35 mins",
  "cook": "25 mins",
  "total": "1 hr 45 mins",
  "calories": "631"
},
{
  "url": "https://www.allrecipes.com/recipe/12123/apple-cranberry-and-pear-crisp/",
  "name": "Apple, Cranberry, and Pear Crisp",
  "rating": "4.7",
  "ratingcount": "347",
  "ingredients": "2  Rome Beauty apples - peeled, cored, and cubed; 2 medium Comice pears - peeled, cored, and cubed; ½ cup dried cranberries; 2 tablespoons honey; 1 ½ tablespoons lemon juice; 1 tablespoon all-purpose flour; ½ cup all-purpose flour; ½ cup packed brown sugar; ½ cup quick cooking oats; ¼ cup ground walnuts; ½ cup unsalted butter, cut into pieces",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Lightly grease an 8-inch baking dish. 2. Mix apples, pears, cranberries, honey, lemon juice, and 1 tablespoon flour together in the prepared dish. 3. Mix 1/2 cup flour, brown sugar, oats, and walnuts together in a medium bowl. Cut in butter until mixture resembles coarse crumbs. Sprinkle over fruit mixture. 4. Bake in the preheated oven until golden brown and crisp on top, about 45 minutes.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "303"
},
{
  "url": "https://www.allrecipes.com/recipe/228625/pear-jam/",
  "name": "Pear Jam",
  "rating": "4.4",
  "ratingcount": "47",
  "ingredients": "4 ½ cups mashed ripe pears; ¼ cup lemon juice; 3 tablespoons powdered fruit pectin; 1 teaspoon ground cinnamon; ½ teaspoon ground cloves; ½ teaspoon ground allspice; ½ teaspoon ground nutmeg; 7 ½ cups white sugar; 1 teaspoon butter; 8  half-pint canning jars with lids and rings, or as needed",
  "directions": "1. Gather all ingredients. 2. Mix pears, lemon juice, fruit pectin, cinnamon, cloves, allspice, and nutmeg in a large heavy pot; bring to a boil, stirring constantly. 3. Add sugar all at once, stirring, and bring back to a full rolling boil. Boil for 1 minute. 4. Mix in butter to settle foam. 5. Sterilize the jars and lids in boiling water for at least 5 minutes. 6. Pack the pear jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw-on rings. 7. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes. 8. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "99"
},
{
  "url": "https://www.allrecipes.com/recipe/229252/apple-and-pear-crumble/",
  "name": "Apple and Pear Crumble",
  "rating": "4.5",
  "ratingcount": "66",
  "ingredients": "1 ½ cups rolled oats; 1 ½ cups brown sugar, divided; ½ cup all-purpose flour; ½ cup butter, softened; 2 cups peeled and diced apples; 2 cups peeled and diced pears; 1 teaspoon ground cinnamon; ½ cup sliced almonds, or to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Mix oats, 3/4 cup brown sugar, flour, and butter together in a bowl until crumbly. 3. Mix apples, pears, remaining 3/4 cup brown sugar, and cinnamon together in a separate bowl; spread into the bottom of a 9x9-inch glass pan. Sprinkle oat mixture atop apple-pear mixture; top with almonds. 4. Bake in the preheated oven until the top is golden brown, about 40 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "366"
},
{
  "url": "https://www.allrecipes.com/recipe/247214/carrot-cake-jam/",
  "name": "Carrot Cake Jam",
  "rating": "4.4",
  "ratingcount": "13",
  "ingredients": "1 (20 ounce) can unsweetened crushed pineapple in 100% pineapple juice; 1 ½ cups chopped peeled ripe pears; 1 ½ cups shredded carrots; ½ cup flaked coconut (Optional); ½ cup raisins (Optional); 3 tablespoons lemon juice; 1 teaspoon ground cinnamon; ¼ teaspoon ground cloves; ¼ teaspoon ground nutmeg; 1 (1.75 ounce) package powdered fruit pectin; 6 ½ cups white sugar",
  "directions": "1. Place crushed pineapple with juice, pears, carrots, flaked coconut, raisins, lemon juice, cinnamon, cloves, and nutmeg in a large pot over medium heat; bring to a boil. Reduce heat and simmer, covered, stirring occasionally, until pears are tender, 15 to 20 minutes. 2. Remove pot from heat and stir in pectin. Return to heat and bring to a full rolling boil, stirring frequently. Pour in sugar and bring back to a full boil. Cook jam for 1 minute, stirring constantly. Remove from heat and skim foam off the top. 3. Pack jam into hot, sterilized jars, filling to within 1/4-inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe the rims to remove any excess residue. Top with lids and screw on rings. 4. Place a rack in the bottom of a large pot and fill halfway with water. Bring to a boil and lower jars into the boiling water 2-inches apart using a holder. Pour in more boiling water if necessary to bring the water level to at least 1-inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 5 minutes. 5. Remove the jars from the pot and place onto a cloth-covered or wood surface, several inches apart; cool undisturbed, at least 12 hours. Press the top of each lid with a finger to ensure that the seal is tight. Store in a cool, dark area.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "12 hrs 55 mins",
  "calories": "96"
},
{
  "url": "https://www.allrecipes.com/recipe/254409/prickly-pear-jelly/",
  "name": "Prickly Pear Jelly",
  "rating": "4.2",
  "ratingcount": "18",
  "ingredients": "27  prickly pears (cactus fruit); ¼ cup lemon juice; 1 (1.75 ounce) package fruit pectin (such as Sure-Jell®); 4 ½ cups white sugar",
  "directions": "1. Simmer 3 pint-size jars in a large pot of water until jelly is ready. Wash the lids and rings in warm, soapy water. 2. Slice ends off each prickly pear. Make 1 long vertical slit down each one. Use slit to hold skin and peel off. Discard peel. 3. Place peeled pears in a blender; purée in batches until liquefied. Press puréed mixture through a fine-mesh sieve set over a bowl. Discard pulp and seeds. 4. Measure out 3 cups prickly pear juice and pour into a large pot. Add lemon juice and pectin; bring to a boil, stirring constantly. Add sugar and return to a boil, stirring constantly. Let cook at a boil until thickened, about 3 minutes. Remove from heat. 5. Pour prickly pear jelly into the hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with the lids and screw on the rings. 6. Place a rack in the bottom of a stockpot and fill halfway with water; bring to a boil. Lower jars 2 inches apart into boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover the stockpot, and process for 15 minutes. 7. Remove the jars from the stockpot and place onto a cloth-covered or wood surface several inches apart. Let cool for at least 24 hours. Press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 day 1 hr",
  "calories": "193"
},
{
  "url": "https://www.allrecipes.com/recipe/269514/pear-tarte-tatin/",
  "name": "Pear Tarte Tatin",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 (15 ounce) package ready-to-use refrigerated pie crust; ⅛ teaspoon ground nutmeg; ½ teaspoon ground ginger; 2 tablespoons white sugar; 5  firm pears; 2 tablespoons good quality bourbon whiskey; 4 tablespoons unsalted butter; ⅔ cup white sugar; 1 pinch salt",
  "directions": "1. Remove refrigerated pie crust from package, and follow manufacturer's suggestions for unrolling crust. Set aside. 2. Combine nutmeg, ginger, and 2 tablespoons sugar in a small bowl. 3. Peel, quarter, and core 4 pears. Slice each quarter into 3 slices, from core end to bottom, and place in a large bowl. Cut remaining pear in half; peel, and core one half and add to the bowl. Peel, core, and slice the other half as directed above and add to the bowl. Drizzle pears with bourbon and sprinkle with spice-sugar mix, tossing to evenly coat. 4. Melt butter in a 9-inch cast-iron skillet over medium heat. Add 2/3 cup white sugar and salt to the melted butter, stirring to combine until mixture bubbles, 2 to 3 minutes. Place the single pear half in the center of the skillet. Fan remaining pear slices around the center, core end to the outside of the skillet and stem end toward the center. If possible, turn the pieces in the same direction. Keep adding pear slices, filling in any gaps, until they are all in the skillet. 5. Reduce heat to medium-low. Cook, undisturbed, until pears are fork-tender and color develops to the liquid, about 20 minutes. 6. Preheat the oven to 375 degrees F (190 degrees C). Place a baking sheet on a rack in the lower third of the oven. 7. Remove skillet from heat and place unbaked pie shell on top of the fruit, using a fork to tuck the edges of the pie shell toward the bottom of the skillet. Place skillet on the prepared baking sheet in the preheated oven. Reduce temperature to 350 degrees F (175 degrees C). 8. Bake until crust is brown, 28 to 30 minutes. Remove from oven. Place a heat-safe plate, larger than the skillet, upside down over the crust. 9. Use oven mitts to grab the plate and skillet together and quickly flip the skillet contents onto the plate; this move is tricky and requires some forearm strength and dexterity. After the flip, if the contents are not centered on the plate, use a spatula to gently move to the center. Add any fruit that remained in the skillet, and drizzle any remaining liquid over the top of the tarte tatin. 10. Allow to sit 15-20 minutes, then serve warm.",
  "prep": "20 mins",
  "cook": "50 mins",
  "total": "1 hr 25 mins",
  "calories": "444"
},
{
  "url": "https://www.allrecipes.com/recipe/149543/pear-scones/",
  "name": "Pear Scones",
  "rating": "4.4",
  "ratingcount": "79",
  "ingredients": "1 ¾ cups all-purpose flour; ⅓ cup packed brown sugar; 2 teaspoons baking powder; ½ teaspoon ground cinnamon; 1 pinch salt; ⅓ cup butter, chilled; 1  egg; ½ cup half-and-half cream; 1 cup chopped pear",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Sift together flour, brown sugar, baking powder, cinnamon, and salt in a large bowl; cut in butter until mixture has a crumbly texture. Whisk together egg and half-and-half in a separate bowl; stir egg mixture into flour mixture until combined; stir in pear. Drop large spoonfuls of the dough onto an ungreased baking sheet. 3. Bake in the preheated oven until golden brown, about 15 minutes; rest briefly on a cooling rack before serving.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "244"
},
{
  "url": "https://www.allrecipes.com/recipe/218334/pear-vinaigrette/",
  "name": "Pear Vinaigrette",
  "rating": "4.7",
  "ratingcount": "58",
  "ingredients": "1  ripe pear - peeled, cored, and chopped; ½ cup white wine; 1 clove garlic, chopped; 2 teaspoons Dijon mustard; ¼ cup white balsamic vinegar; 1 teaspoon ground black pepper; ¼ teaspoon sea salt; ½ cup olive oil",
  "directions": "1. Blend the pear, white wine, garlic, Dijon mustard, white balsamic vinegar, black pepper, and sea salt in a blender until well combined; drizzle the olive oil into the mixture in a thin, steady stream while continuing to blend. Blend a few seconds longer until the salad dressing is thick and creamy.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "101"
},
{
  "url": "https://www.allrecipes.com/recipe/91539/classic-pear-crisp/",
  "name": "Classic Pear Crisp",
  "rating": "4.2",
  "ratingcount": "75",
  "ingredients": "1 cup rolled oats; ⅓ cup brown sugar; ½ cup all-purpose flour; 1 teaspoon finely chopped crystallized ginger; 1 teaspoon ground cinnamon; ¼ cup butter; 2 tablespoons white sugar; 2 tablespoons all-purpose flour; 2 teaspoons finely chopped crystallized ginger; 8 cups peeled and sliced pears; 1 pint vanilla ice cream",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease a 2 quart casserole dish or 9 inch square baking dish. 2. In a medium bowl, stir together the oats, brown sugar, 1/2 cup flour, 1 teaspoon crystallized ginger, and cinnamon. Stir in the butter until the mixture is crumbly with pea sized lumps. Set aside. 3. In a separate bowl, stir together the white sugar, 2 tablespoons flour and 2 teaspoons of crystallized ginger. Add the sliced pears, and toss to blend. Transfer to the prepared baking dish. Spread with the oat topping. 4. Bake for 30 to 35 minutes in the preheated oven, until pears are soft and topping is golden brown. Cool slightly before serving with vanilla ice cream.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "449"
},
{
  "url": "https://www.allrecipes.com/recipe/218605/savory-blue-cheese-cheesecake-with-cherry-pear-compote-and-cherry-balsamic-glaze/",
  "name": "Savory Blue Cheese Cheesecake with Cherry Pear Compote and Cherry Balsamic Glaze",
  "rating": "4.8",
  "ratingcount": "4",
  "ingredients": "½ cup butter; 4 ounces freshly shredded Parmesan cheese; 1 teaspoon minced fresh thyme leaves; ½ teaspoon Kosher salt; ½ teaspoon ground black pepper; 1 ¼ cups all-purpose flour; ¼ cup chopped toasted pecans; 1 tablespoon butter, melted; 3 (8 ounce) packages cream cheese, softened; 8 ounces blue cheese, crumbled; 6 ounces freshly shredded Parmesan cheese; 4 large eggs at room temperature; ¼ cup heavy cream at room temperature; 1 teaspoon ground black pepper; 2 tablespoons olive oil; 2 large sweet onions, thinly sliced; 2  pears - peeled, cored and chopped; ½ cup dried cherries; 2 tablespoons black cherry balsamic vinegar; ½ cup brown sugar; ¼ teaspoon kosher salt; 1 (8 ounce) package cream cheese; 2 ounces freshly shredded Parmesan cheese; 4 ounces blue cheese, crumbled; ½ teaspoon ground black pepper; ¼ cup candied pecans; 1  firm green pear, cored and thinly sliced",
  "directions": "1. Beat 1/2 cup butter, 4 ounces Parmesan cheese, thyme, 1/2 teaspoon salt, and 1/2 teaspoon black pepper with an electric mixer in a large bowl until light and fluffy. Add the flour, and mix on low until mixture resembles large crumbles. Turn dough out and shape into a log. Wrap dough with plastic wrap, and refrigerate until chilled, about 1 hour. 2. Preheat an oven to 350 degrees F (175 degrees C). Slice the prepared dough into 1/4-inch thick pieces and place on a baking sheet. 3. Bake in the preheated oven until golden brown, about 22 minutes. Cool crackers on the sheets for 10 minutes before removing to cool completely on a wire rack. Reduce oven heat to 300 degrees F (150 degrees C). Line the bottom of a 10-inch springform pan with parchment paper, then butter the paper and the sides of the pan. 4. Place the toasted pecans, baked crackers, and 1 tablespoon melted butter in a food processor. Pulse until crumbled. Press the crumbs into the bottom of the prepared pan. Chill in the refrigerator while preparing the filling. 5. Beat three 8-ounce packages of cream cheese, 8 ounces of blue cheese, and 6 ounces of Parmesan cheese with an electric mixer in a large bowl until smooth and creamy. Add the eggs one at a time, allowing each egg to blend into the mixture before adding the next. Beat in the heavy cream and 1 teaspoon pepper with the last egg. Pour the mixture into prepared pan. 6. Bake in the preheated oven for about 1 1/2 hours. The cheesecake is ready when the edges have nicely puffed and the surface of the cheesecake is firm except for a small spot in the center that will jiggle when the pan is gently shaken. Run the tip of a paring knife around the edges of the pan, set the pan on a wire rack, and allow the cheesecake to cool at room temperature for 1 hour before placing into the refrigerator, and cooling 4 hours to overnight. 7. Heat the olive oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more. Add in the chopped pears, dried cherries, balsamic vinegar, brown sugar, and 1/4 teaspoon salt. Cook and stir until pears are tender. Remove the onion and fruit from the skillet using a slotted spoon. Drain the juice back into the skillet, then mash the fruit in a bowl with a fork. Simmer the juice in the skillet over medium heat until thickened, about 5 minutes. Transfer glaze to a separate bowl. 8. Beat the remaining 8-ounce package of cream cheese, 4 ounces of blue cheese, 2 ounces of Parmesan cheese, and 1/2 teaspoon of black pepper with an electric mixer in a bowl until smooth. Spread the cheese mixture over the cooled cheesecake. Sprinkle with candied pecans. Serve with cherry pear compote, sliced pear, and vinegar glaze on the side.",
  "prep": "1 hr 30 mins",
  "cook": "3 hrs",
  "total": "9 hrs 30 mins",
  "calories": "394"
},
{
  "url": "https://www.allrecipes.com/recipe/42833/ginger-pear-bread/",
  "name": "Ginger Pear Bread",
  "rating": "4.5",
  "ratingcount": "53",
  "ingredients": "1 cup peeled, cored, and chopped pears; ½ cup white sugar; ½ teaspoon ground ginger; ¼ teaspoon ground cloves; 1 cup all-purpose flour; 1 teaspoon baking soda; ½ teaspoon salt; ¼ teaspoon baking powder; ⅓ cup vegetable oil; 2 large eggs, beaten; 1 teaspoon vanilla extract",
  "directions": "1. Toss chopped pears with sugar, ginger, and cloves in a large bowl. Set aside until sugar dissolves, 10 to 15 minutes. 2. Preheat the oven to 325 degrees F (165 degrees C). Grease an 8x4-inch loaf pan. 3. Combine flour, baking soda, salt, and baking powder in a bowl. 4. Stir oil, eggs, and vanilla into pears. Add flour mixture and gently stir until just combined. Pour into the prepared loaf pan. 5. Bake in the preheated oven until golden brown and a toothpick inserted in the center comes out clean, about 40 minutes.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "216"
},
{
  "url": "https://www.allrecipes.com/recipe/75639/pear-honey/",
  "name": "Pear Honey",
  "rating": "4.5",
  "ratingcount": "166",
  "ingredients": "8 cups peeled, cored and chopped pears; 1 cup unsweetened pineapple juice; 8 cups white sugar",
  "directions": "1. Place chopped pears into a large pot, and pour pineapple juice over them to prevent them from browning. Stir in sugar, and bring to a boil over medium-high heat. Stir frequently to prevent scorching. When the pears are at a full boil, reduce heat to medium, and cook until the mixture is the color and texture of honey. The longer you cook it, the thicker it gets. Cooking time is usually 2 to 3 hours. 2. Ladle into hot sterile jars, filling to within 1/4 inch of the top. Wipe rims with a clean damp cloth, and seal jars with lids and rings. Process in a boiling water canner for 10 minutes, or the amount of time recommended by your local extension for your area.",
  "prep": "45 mins",
  "cook": "3 hrs",
  "total": "3 hrs 45 mins",
  "calories": "111"
},
{
  "url": "https://www.allrecipes.com/recipe/13643/cranberry-sauce-extraordinaire/",
  "name": "Cranberry Sauce Extraordinaire",
  "rating": "4.8",
  "ratingcount": "741",
  "ingredients": "1 cup water; 1 cup white sugar; 1 (12 ounce) package fresh cranberries; 1  orange, peeled and pureed; 1  apple - peeled, cored and diced; 1  pear - peeled, cored and diced; 1 cup chopped dried mixed fruit; 1 cup chopped pecans; ½ teaspoon salt; 1 teaspoon ground cinnamon; ½ teaspoon ground nutmeg",
  "directions": "1. In a medium saucepan, boil water and sugar until the sugar dissolves. Reduce the heat to simmer, and stir in cranberries, pureed orange, apple, pear, dried fruit, pecans, salt, cinnamon, and nutmeg. Cover, and simmer for 30 minutes, stirring occasionally, until the cranberries burst. Remove from heat, and let cool to room temperature.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "45 mins",
  "calories": "195"
},
{
  "url": "https://www.allrecipes.com/recipe/222276/pear-relish/",
  "name": "Pear Relish",
  "rating": "4.6",
  "ratingcount": "30",
  "ingredients": "12 large pears; 3 large onions, coarsely chopped; 3 large green bell peppers, seeded and coarsely chopped; 4  jalapeno peppers, coarsely chopped; 2 cups apple cider vinegar; 2 cups white sugar; 9 ounces prepared mustard; 1 tablespoon salt; 10  (1 pint) canning jars with lids and rings, or as needed",
  "directions": "1. Place pears into a large stock pot, add water to cover, and boil until tender, about 20 minutes. Drain and cool. When pears are cool, peel, core, and coarsely chop. 2. Place pears, onions, green bell peppers, and jalapeno peppers into a food processor, working in batches if necessary, and chop the pears and vegetables finely. Transfer pears and vegetables, including any juice, to a large pot. 3. Stir vinegar, sugar, prepared mustard, and salt into the pear mixture and bring to a boil; reduce heat to medium-low and simmer until flavors have blended and relish is thickened, about 1 hour. 4. Sterilize jars and lids in boiling water for at least 5 minutes. Pack pear relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings. 5. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for about 20 minutes or the amount of time recommended for your area. 6. Remove the jars from the stockpot and cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
  "prep": "30 mins",
  "cook": "1 hr 40 mins",
  "total": "3 hrs 10 mins",
  "calories": "19"
},
{
  "url": "https://www.allrecipes.com/recipe/12275/fresh-pear-pie/",
  "name": "Fresh Pear Pie",
  "rating": "4.8",
  "ratingcount": "460",
  "ingredients": "1 (14.1 ounce) package double-crust pie pastry, thawed; ½ cup white sugar; 3 tablespoons all-purpose flour; 1 teaspoon ground cinnamon; 1 teaspoon lemon zest; ¼ teaspoon salt; 5 cups peeled and sliced pears; 1 tablespoon butter; 1 tablespoon lemon juice",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). Place a baking sheet on the bottom oven rack. Line the bottom and sides of a 9-inch pie plate with one pie crust. Set second crust aside. 2. Combine sugar, flour, cinnamon, lemon zest, and salt in a mixing bowl. 3. Arrange pear slices in layers in prepared crust, sprinkling sugar mixture over each layer. Dot with butter and sprinkle with lemon juice. 4. Moisten the rim of bottom crust with some water, then cover filling with remaining pie crust and flute the edges to seal; trim off excess pastry and cut several slits in top crust to allow steam to escape. 5. Bake in the preheated oven on the baking sheet for 10 minutes. Reduce oven temperature to 350 degrees F (175 degrees C); bake until crust is golden brown and filling is bubbly, 35 to 40 minutes longer. Allow to cool several hours before serving.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "360"
},
{
  "url": "https://www.allrecipes.com/recipe/53839/grandmas-pear-preserves/",
  "name": "Grandma's Pear Preserves",
  "rating": "3.9",
  "ratingcount": "126",
  "ingredients": "6 cups peeled, cored, and sliced pears; 1 cup water; 1 tablespoon lemon juice; 1 (2 ounce) package powdered fruit pectin; 8 cups white sugar; ½ cup brown sugar; 2 teaspoons ground allspice; 2 teaspoons ground nutmeg",
  "directions": "1. Inspect six 8-ounce jars for cracks and rings for rust, discarding any defective ones. Immerse in simmering water for 10 minutes. Wash new, unused lids and rings in warm, soapy water. 2. Meanwhile, combine pears, water, and lemon juice in a large saucepan. Cover and simmer for 10 minutes. Stir in pectin, and bring to a full boil. Stir in white sugar; boil and stir until sugar is dissolved, about 1 minute. Remove from heat; stir in brown sugar, allspice, and nutmeg. 3. Pack pear preserves into hot, sterilized jars, filling to within 1/2 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe rims with a moist paper towel to remove any residue. Top with lids and screw rings on tightly. 4. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 10 minutes. 5. Remove the jars from the stockpot and let rest, several inches apart, for 12 to 24 hours. Press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area.",
  "prep": "30 mins",
  "cook": "15 mins",
  "total": "12 hrs 45 mins",
  "calories": "151"
},
{
  "url": "https://www.allrecipes.com/recipe/237472/grilled-brie-and-pear-sandwich/",
  "name": "Grilled Brie and Pear Sandwich",
  "rating": "4.8",
  "ratingcount": "24",
  "ingredients": "2 tablespoons butter, softened; 2 thick slices French bread; 6 thin slices  Brie cheese, or more to taste; 12  fresh thyme leaves, or to taste; 1 pinch cracked black pepper; 6 slices pear (such as Bosc); salt to taste",
  "directions": "1. Generously butter one side of each slice of bread. 2. Heat a skillet over medium heat. 3. Place bread slices butter-side down into hot skillet. Arrange Brie cheese slices on top of each piece of bread. Sprinkle thyme and cracked black pepper over the top. 4. Spread pear slices in a single layer over the Brie cheese on one slice of bread and top with a pinch of salt. 5. Flip the slice of bread without pears onto the slice of bread with the pear slices. Continue cooking sandwich until cheese and pear are heated through and cheese is melted, 2 to 3 minutes per side. Transfer to a plate and cut into halves.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "670"
},
{
  "url": "https://www.allrecipes.com/recipe/26897/pear-and-gorgonzola-cheese-pizza/",
  "name": "Pear and Gorgonzola Cheese Pizza",
  "rating": "4.6",
  "ratingcount": "244",
  "ingredients": "1 (16 ounce) package refrigerated pizza crust dough; 4 ounces sliced provolone cheese; 1  Bosc pear, thinly sliced; 2 ounces chopped walnuts; 2 ½ ounces Gorgonzola cheese, crumbled; 2 tablespoons chopped fresh chives",
  "directions": "1. Preheat oven to 450 degrees F (230 degrees C). 2. Place pizza crust dough on a medium baking sheet. Layer with Provolone cheese. Top cheese with Bosc pear slices. Sprinkle with walnuts and Gorgonzola cheese. 3. Bake in the preheated oven 8 to 10 minutes, or until cheese is melted and crust is lightly browned. Remove from heat. Top with chives and slice to serve.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "287"
},
{
  "url": "https://www.allrecipes.com/recipe/171402/apple-cranberry-salad/",
  "name": "Apple-Cranberry Salad",
  "rating": "4.5",
  "ratingcount": "24",
  "ingredients": "1 teaspoon stone-ground mustard; 2 tablespoons balsamic vinegar; ¼ cup olive oil; 1  apple, diced; 1  pear, diced; ¼ cup dried cranberries; 1 (10 ounce) package mixed baby greens; ¼ cup crumbled blue cheese; 2 tablespoons chopped walnuts",
  "directions": "1. Whisk the mustard and vinegar together in a small bowl. Drizzle in the olive oil while whisking to create a dressing; set aside. 2. Place the apple, pear, cranberries, baby greens, blue cheese, and walnuts into a large salad bowl. Toss gently to mix, then pour on the dressing, and toss to coat.",
  "prep": "25 mins",
  "cook": "",
  "total": "25 mins",
  "calories": "256"
},
{
  "url": "https://www.allrecipes.com/recipe/34613/roquefort-pear-salad/",
  "name": "Roquefort Pear Salad",
  "rating": "4.9",
  "ratingcount": "2",
  "ingredients": "½ cup pecans; ¼ cup white sugar; ⅓ cup olive oil; 3 tablespoons red wine vinegar; 1 ½ teaspoons white sugar; 1 ½ teaspoons prepared mustard; 1 clove garlic, chopped; ½ teaspoon salt; fresh ground black pepper to taste; 1 head green leaf lettuce, torn into bite-sized pieces; 3 medium pears - peeled, cored and chopped; 5 ounces Roquefort cheese, crumbled; 1 medium avocado - peeled, pitted, and diced; ½ cup thinly sliced green onions",
  "directions": "1. Gather all ingredients. 2. Make the pecans: Combine pecans and sugar in a skillet over medium heat. Cook, stirring gently, until sugar has melted and pecans are caramelized, 5 to 7 minutes. 3. Carefully transfer nuts onto a sheet of waxed paper to cool. 4. While the nuts are cooling, make the dressing: Whisk oil, vinegar, sugar, mustard, garlic, salt, and pepper together in a bowl. 5. Make the salad: Layer lettuce, pears, Roquefort cheese, avocado, and green onions in a large serving bowl. Pour dressing over top. 6. Break cooled pecans into pieces and sprinkle over salad.",
  "prep": "25 mins",
  "cook": "10 mins",
  "total": "35 mins",
  "calories": "426"
},
{
  "url": "https://www.allrecipes.com/recipe/8212/fresh-pear-cake/",
  "name": "Fresh Pear Cake",
  "rating": "4.6",
  "ratingcount": "395",
  "ingredients": "4 cups peeled, cored and chopped pears; 2 cups white sugar; 3 cups sifted all-purpose flour; 1 teaspoon salt; 1 ½ teaspoons baking soda; 1 teaspoon ground nutmeg; 1 teaspoon ground cinnamon; ½ teaspoon ground cloves; 4  egg whites; ⅔ cup canola oil; 1 cup chopped pecans",
  "directions": "1. Combine the pears and the sugar and let stand for one hour. 2. Preheat oven to 325 degrees F (165 degrees C). Spray a 10 inch bundt pan with non-stick cooking spray. 3. Slightly beat the egg whites and combine them with the oil, chopped pecans and pear mixture. 4. Stir the flour, salt, baking soda, nutmeg, cinnamon and cloves. Stir in the pear mixture. Pour batter into the prepared bundt pan. 5. Bake at 325 degrees F (165 degrees C) for 1 hour and 10 minutes. Remove from oven ant let cool on a wire rack for 10 minutes before removing form pan.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "455"
},
{
  "url": "https://www.allrecipes.com/recipe/233068/pear-or-apple-cobbler/",
  "name": "Pear or Apple Cobbler",
  "rating": "4.7",
  "ratingcount": "122",
  "ingredients": "4  pears, cored and cut into 1/2-inch slices; 1 teaspoon lemon juice; ⅓ cup maple syrup; 2 tablespoons melted butter; 1 cup rolled oats; 1 cup brown sugar; ½ cup melted butter; ½ cup all-purpose flour; 1 teaspoon ground cinnamon",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Toss pears and lemon juice together in a bowl until coated; spread into a 9x9-inch baking dish. Pour maple syrup and 2 tablespoons melted butter over pear mixture; toss to coat. 3. Mix oats, brown sugar, 1/2 cup melted butter, flour, and cinnamon together in a bowl until crumbly; sprinkle over pear mixture. 4. Bake in the preheated oven until crust is golden and pears are tender, about 45 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "339"
},
{
  "url": "https://www.allrecipes.com/recipe/156739/lime-pear-gelatin-salad/",
  "name": "Lime Pear Gelatin Salad",
  "rating": "4.7",
  "ratingcount": "48",
  "ingredients": "1 (.6 ounce) package sugar-free lime Jell-O®; 1 cup boiling water; 1 (15.25 ounce) can pear halves in juice; 1 (3 ounce) package reduced-fat cream cheese, softened; 1 ½ cups reduced-fat frozen whipped topping, thawed",
  "directions": "1. Whisk together the lime gelatin and boiling water in a large bowl until the gelatin dissolves. Pour the mixture into the container of a blender, and add the pear halves and cream cheese. Cover and blend until smooth. Pour back into the bowl, and gently whisk in the whipped topping. Transfer to a mold or serving bowl, cover and refrigerate until firm, at least 4 hours. To unmold, dip the mold briefly into hot tap water to loosen the gelatin, then invert onto a plate.",
  "prep": "10 mins",
  "cook": "",
  "total": "4 hrs 10 mins",
  "calories": "125"
},
{
  "url": "https://www.allrecipes.com/recipe/216536/blue-cheese-walnut-and-pear-pizza/",
  "name": "Blue Cheese, Walnut, and Pear Pizza",
  "rating": "4.7",
  "ratingcount": "13",
  "ingredients": "1  pre-baked pizza crust; 2 cloves garlic, minced; 1 tablespoon Dijon mustard; 2 sprigs fresh rosemary, chopped; ¼ cup white wine vinegar; ½ cup olive oil; ¼ cup crumbled blue cheese; salt and pepper to taste; ¼ cup crumbled blue cheese; ⅓ cup shredded mozzarella cheese; 2  pears - peeled, cored and sliced; ¼ cup toasted walnut pieces",
  "directions": "1. Preheat an oven to 425 degrees F (220 degrees C). 2. Place the pizza crust on a pizza pan. Bake in the preheated oven until just crisp, about 5 minutes. 3. Meanwhile, combine the garlic, Dijon mustard, rosemary, and vinegar in a food processor or blender. Turn on, and drizzle in the olive oil slowly until the dressing has thickened. Quickly pulse in 1/4 cup of blue cheese; season to taste with salt and pepper. 4. Spread the vinaigrette over the pizza crust. Sprinkle 1/4 cup of blue cheese evenly over the crust, followed by the mozzarella cheese. Arrange the sliced pears over the cheese, and sprinkle with the toasted walnuts. 5. Bake in the preheated oven until the cheese has melted and is bubbly, 7 to 10 minutes. Let cool slightly before cutting into slices.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "427"
},
{
  "url": "https://www.allrecipes.com/recipe/189936/curried-butternut-squash-and-pear-soup/",
  "name": "Curried Butternut Squash and Pear Soup",
  "rating": "4.8",
  "ratingcount": "526",
  "ingredients": "1 (2 pound) butternut squash; 3 tablespoons unsalted butter; 1  onion, diced; 2 cloves garlic, minced; 2 teaspoons minced fresh ginger root; 1 tablespoon curry powder; 1 teaspoon salt; 4 cups reduced sodium chicken broth; 2  firm ripe Bartlett pears, peeled, cored, and cut into 1 inch dice; ½ cup half and half",
  "directions": "1. Preheat an oven to 375 degrees F (190 degrees C). Line a rimmed baking sheet with parchment paper. 2. Cut squash in half lengthwise; discard seeds and membrane. Place squash halves, cut sides down, on the prepared baking sheet. Roast in preheated oven until very soft, about 45 minutes. Scoop the pulp from the peel, and reserve. 3. Melt butter in a large soup pot over medium heat. Stir in the onion, garlic, ginger, curry powder, and salt. Cook and stir until the onion is soft, about 10 minutes. Pour the chicken broth into the pot, and bring to a boil. Stir in the pears and the reserved squash, and simmer until the pears are very soft, about 30 minutes. 4. Pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender. Puree in batches until smooth. Return the soup to the pot, stir in the half and half, and reheat.",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "169"
},
{
  "url": "https://www.allrecipes.com/recipe/7214/pear-bread-i/",
  "name": "Pear Bread I",
  "rating": "4.6",
  "ratingcount": "237",
  "ingredients": "3 cups all-purpose flour; ¼ teaspoon baking powder; 1 teaspoon baking soda; 1 teaspoon salt; 1 tablespoon ground cinnamon; ¾ cup vegetable oil; 3  eggs; 2 cups white sugar; 2 cups peeled shredded pears; 1 cup chopped pecans; 2 teaspoons vanilla extract",
  "directions": "1. In a large mixing bowl combine flour, baking powder, baking soda, salt, and cinnamon. Make a well in the center of the bowl. 2. In a separate bowl combine the oil, eggs, sugar, grated pears, pecans, and vanilla. Blend well. Add to well of dry ingredients. Stir until just moistened. Spoon batter into 2 greased and floured 8x5x3 inch loaf pans. 3. Bake in a preheated 325 degree F (165 degrees C) oven for one hour and 15 minutes. Cool on wire rack before removing from the loaf pans.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "279"
},
{
  "url": "https://www.allrecipes.com/recipe/147395/pear-and-blue-cheese-salad/",
  "name": "Pear and Blue Cheese Salad",
  "rating": "4.9",
  "ratingcount": "293",
  "ingredients": "1 (10 ounce) bag mixed field greens; ½ cup sliced red onion (Optional); 1  Bosc pear, cored and sliced; ½ cup chopped candied pecans; ½ cup crumbled blue cheese; ¼ cup maple syrup; ⅓ cup apple cider vinegar; ½ cup mayonnaise; 2 tablespoons packed brown sugar; ¾ teaspoon salt; ¼ teaspoon freshly ground black pepper; ¼ cup walnut oil",
  "directions": "1. Place the salad greens in a large bowl. Add the red onion, pear, pecans, and blue cheese, and toss to mix evenly. 2. To make the dressing, place the maple syrup, vinegar, mayonnaise, brown sugar, salt, and pepper in a blender, and blend thoroughly. With the motor running, slowly pour in the walnut oil. Blend until mixture becomes creamy, about 1 minute. Pour over salad mixture, and toss to coat greens evenly. Serve immediately.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "397"
},
{
  "url": "https://www.allrecipes.com/recipe/13482/winter-fruit-salad-with-lemon-poppyseed-dressing/",
  "name": "Winter Fruit Salad with Lemon Poppyseed Dressing",
  "rating": "4.8",
  "ratingcount": "854",
  "ingredients": "½ cup white sugar; ½ cup lemon juice; 2 teaspoons diced onion; 1 teaspoon Dijon-style prepared mustard; ½ teaspoon salt; ⅔ cup vegetable oil; 1 tablespoon poppy seeds; 1 head romaine lettuce, torn into bite-size pieces; 4 ounces shredded Swiss cheese; 1 cup cashews; ¼ cup dried cranberries; 1  apple - peeled, cored and diced; 1  pear - peeled, cored and sliced",
  "directions": "1. In a blender or food processor, combine sugar, lemon juice, onion, mustard, and salt. Process until well blended. With machine still running, add oil in a slow, steady stream until mixture is thick and smooth. Add poppy seeds, and process just a few seconds more to mix. 2. In a large serving bowl, toss together the romaine lettuce, shredded Swiss cheese, cashews, dried cranberries, apple, and pear. Pour dressing over salad just before serving, and toss to coat.",
  "prep": "25 mins",
  "cook": "",
  "total": "25 mins",
  "calories": "277"
},
{
  "url": "https://www.allrecipes.com/recipe/75545/pear-butter/",
  "name": "Pear Butter",
  "rating": "4.3",
  "ratingcount": "83",
  "ingredients": "4 pounds medium pears, quartered and cored; 2 cups sugar; 1 teaspoon grated orange zest; ¼ teaspoon ground nutmeg; ¼ cup orange juice",
  "directions": "1. Place pears into a large pot over medium heat, and add just enough water to cover the bottom of the pot and keep them from sticking, about 1/2 cup. Cook until the pears are soft, about 30 minutes. Press pears through a sieve or food mill, and measure out 2 quarts of the pulp. 2. Pour the pear pulp and sugar into a large saucepan and stir to dissolve sugar. Stir in the orange zest, nutmeg and orange juice. Cook over medium heat until the mixture is thick enough to mound in a spoon. When the mixture begins to thicken, stir frequently to prevent scorching on the bottom. This will take about 1 hour. 3. Ladle the pear butter into hot sterile jars, leaving 1/4 inch of headspace. Remove air bubbles by sliding a metal spatula around where the pear butter touches the glass. Wipe jar rims clean, and seal with lids and rings. Process for 10 minutes in a boiling water bath. The water should cover the jars by 1 inch. Check with your local extension for exact processing times for your area.",
  "prep": "30 mins",
  "cook": "1 mins",
  "total": "31 mins",
  "calories": "82"
},
{
  "url": "https://www.allrecipes.com/recipe/229225/apple-pear-sauce/",
  "name": "Apple Pear Sauce",
  "rating": "4.7",
  "ratingcount": "45",
  "ingredients": "4  pears, cut into chunks; 3  apples, cut into chunks; ½ cup water; 1 teaspoon vanilla extract; ¼ teaspoon ground cinnamon",
  "directions": "1. Heat a skillet over medium heat; add pears, apples, water, and vanilla extract to the hot skillet. Cover and simmer fruit mixture for 10 minutes; remove lid and cook until most of liquid is evaporated and fruit is softened, 10 to 15 more minutes. 2. Remove skillet from heat and transfer fruit mixture and any remaining liquid to a food processor. Process until smooth; stir in cinnamon. Serve warm or refrigerate up to 4 days.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "77"
}]