[{
  "url": "https://www.allrecipes.com/recipe/17116/pineapple-glaze-for-ham/",
  "name": "Pineapple Glaze for Ham",
  "rating": "4.5",
  "ratingcount": "102",
  "ingredients": "1 (15.25 ounce) can sliced pineapple, drained with juice reserved; 1 (4 ounce) jar maraschino cherries, drained; 1 cup brown sugar",
  "directions": "1. Before baking ham, place pineapple slices on ham with toothpicks and place cherries in center of pineapple. 2. In a medium microwave safe bowl combine brown sugar and reserved pineapple juice. Mix together and microwave for about 5 minutes, until mixture is thick. Pour some of this glaze over the ham about every 15 minutes in the last hour of baking, until all is used.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "15 mins",
  "calories": "93"
},
{
  "url": "https://www.allrecipes.com/recipe/17265/cranberry-gelatin-salad-i/",
  "name": "Cranberry JELL-O Salad",
  "rating": "4.7",
  "ratingcount": "85",
  "ingredients": "2 cups boiling water; 2 (0.3 ounce) packages sugar-free cherry-flavored gelatin mix (such as Jell-O®); 1 (16 ounce) can jellied cranberry sauce; 1 (20 ounce) can crushed pineapple, drained; ½ cup chopped pecans",
  "directions": "1. Combine boiling water and gelatin mix in a bowl; stir until gelatin is dissolved. Stir in cranberry sauce and crushed pineapple. 2. Transfer to a large glass serving dish or 12 individual dishes. Sprinkle pecans over top. 3. Chill until set, 3 to 4 hours for individual dishes, or 4 hours to overnight for one large serving dish.",
  "prep": "15 mins",
  "cook": "",
  "total": "3 hrs 15 mins",
  "calories": "123"
},
{
  "url": "https://www.allrecipes.com/recipe/214024/southern-pineapple-casserole/",
  "name": "Southern Pineapple Casserole",
  "rating": "4.6",
  "ratingcount": "64",
  "ingredients": "1 (20 ounce) can pineapple chunks; 1 (20 ounce) can crushed pineapple, drained; 2 cups shredded sharp Cheddar cheese; ½ cup white sugar, or to taste; ⅓ cup all-purpose flour; 40  buttery round crackers (such as Ritz®), crushed; ½ cup butter, melted, or to taste",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). 3. Drain pineapple chunks, reserving 1/4 cup of the juice. Transfer both chunks and juice into a large bowl. 4. Add drained, crushed pineapple, cheese, sugar, and flour; mix to combine. 5. Pour into a 1 1/2-quart casserole dish. 6. Mix cracker crumbs and melted butter in a small bowl; sprinkle over pineapple mixture. 7. Bake in the preheated oven until golden brown, about 30 minutes.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "423"
},
{
  "url": "https://www.allrecipes.com/recipe/17801/ham-and-pineapple-dinner/",
  "name": "Ham and Pineapple Dinner",
  "rating": "4.3",
  "ratingcount": "208",
  "ingredients": "2 tablespoons butter; 2 ½ cups cooked and cubed ham; 2  green onions, chopped; 1 cup pineapple chunks, drained; 1 ⅓ cups pineapple juice; 4 teaspoons cider vinegar; 2 tablespoons brown sugar; 2 teaspoons prepared mustard; 2 tablespoons cornstarch",
  "directions": "1. Melt the butter in a large skillet over medium heat. Saute the ham, onions and pineapple chunks in the butter for about 5 minutes. 2. In a separate medium bowl, combine the pineapple juice, vinegar, brown sugar, mustard and cornstarch. Stir this together well and pour over the ham mixture in the skillet. Stir well and allow to heat through and thicken, about 5 minutes.",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "35 mins",
  "calories": "323"
},
{
  "url": "https://www.allrecipes.com/recipe/20489/pink-panther/",
  "name": "Pink Panther",
  "rating": "4.7",
  "ratingcount": "31",
  "ingredients": "1 cup crushed ice; 1 fluid ounce amaretto liqueur; 1 fluid ounce vodka; 8 fluid ounces pineapple juice; 1 teaspoon grenadine syrup; 1 slice fresh pineapple; 1  maraschino cherry",
  "directions": "1. In a blender combine ice, amaretto, vodka, pineapple juice and grenadine. Blend well and pour into a tall chilled glass. garnish with an umbrella, pineapple slice and cherry.",
  "prep": "3 mins",
  "cook": "",
  "total": "3 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/223329/white-peachy-sangria/",
  "name": "White Peachy Sangria",
  "rating": "4.9",
  "ratingcount": "69",
  "ingredients": "4 (750 milliliter) bottles moscato wine; 4 (12 fluid ounce) cans or bottles lemon-lime soda (such as Sprite®); 1 cup brandy; 1 cup peach schnapps; 2  fresh peaches, pitted and sliced; 1 (16 ounce) package fresh strawberries, sliced; 2  mangos - peeled, seeded, and sliced; ½  fresh pineapple - peeled, cored, and cut into chunks; 1 (6 ounce) container fresh raspberries",
  "directions": "1. Stir moscato wine, lemon-lime soda, brandy, peach schnapps, peaches, strawberries, mangos, pineapple chunks, and raspberries together in a large container and chill 8 hours or overnight.",
  "prep": "30 mins",
  "cook": "",
  "total": "8 hrs 30 mins",
  "calories": "376"
},
{
  "url": "https://www.allrecipes.com/recipe/222342/sweet-and-sour-pork-tenderloin/",
  "name": "Sweet and Sour Pork Tenderloin",
  "rating": "4.6",
  "ratingcount": "306",
  "ingredients": "1 (1 1/4 pound) pork tenderloin, trimmed of silver skin; salt and ground black pepper; ⅓ cup ketchup; ⅓ cup seasoned rice vinegar; 1 (8 ounce) can pineapple chunks, drained with juice reserved; 2 tablespoons brown sugar; 4 cloves garlic, minced; 2 teaspoons hot chili sauce (such as Sriracha®); 1 teaspoon soy sauce; 1 pinch red pepper flakes; 1 tablespoon vegetable oil; 1 teaspoon butter; ¼ cup chopped green onion (white part only); 2 tablespoons chopped green onion tops",
  "directions": "1. Cut tenderloin into 4 pieces. Arrange in a single layer between two sheets of plastic wrap and pound with a meat mallet until each is about 1-inch thick. Generously season with salt and black pepper. 2. Whisk ketchup, rice vinegar, reserved pineapple juice, brown sugar, garlic, hot chili sauce, soy sauce, and red pepper flakes in a bowl. Set aside. 3. Heat vegetable oil in a skillet over high heat. Place pork in pan; reduce heat to medium. Cook until browned on both sides and cooked through, 5 to 6 minutes per side. Transfer to a plate. 4. Return skillet to medium heat. Stir butter into hot pan. When butter melts and starts to brown, stir in pineapple chunks. Cook, stirring, until pineapple is golden brown, 3 to 4 minutes. 5. Stir in ketchup mixture and 1/4 cup green onion (white parts). Reduce heat to low and simmer until garlic and onion have softened, 5 minutes. 6. Return pork to skillet; cook, stirring, until pork is heated through. Garnish with 2 tablespoons green onion tops.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/233943/rosa-marina-fruit-salad/",
  "name": "Rosa Marina Fruit Salad",
  "rating": "4.6",
  "ratingcount": "28",
  "ingredients": "1 (16 ounce) package Rosa Marina (orzo) pasta; 2 (15 ounce) cans mandarin oranges, drained and juice reserved; 1 (16 ounce) can pineapple chunks, drained with juice reserved; 1 (16 ounce) can crushed pineapple, drained and juice reserved; 1 (4 ounce) jar maraschino cherries, drained and halved; ¾ cup white sugar; 2  large eggs; 3 tablespoons all-purpose flour; 1 (16 ounce) container whipped topping (such as Cool Whip®)",
  "directions": "1. Bring a large pot of lightly salted water to a boil. Cook orzo in the boiling water, stirring occasionally until cooked through but firm to the bite, about 11 minutes. Drain and transfer to a large bowl. Add mandarin oranges, pineapple chunks, crushed pineapple, and maraschino cherries to orzo. 2. Combine juice from mandarin oranges, juice from pineapple chunks, juice from crushed pineapple, sugar, eggs, and flour in a saucepan over low heat; cook, stirring often, until sauce is thickened, 5 to 7 minutes. Remove sauce from heat and cool, about 30 minutes. 3. Pour cooled sauce over orzo mixture and toss to coat. Refrigerate until flavors blend, 8 hours to overnight. Fold whipped topping into orzo mixture before serving.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "9 hrs",
  "calories": "196"
},
{
  "url": "https://www.allrecipes.com/recipe/8509102/chicken-al-pastor/",
  "name": "Chicken Al Pastor",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "4  dried guajillo chiles, stemmed and seeded; 2 tablespoons achiote paste; 6 large cloves garlic, peeled; 1 (7 ounce) can chipotle peppers in adobo sauce, drained; 1 ⅓ cups finely chopped onion, divided; ⅔ cup orange juice; 3 tablespoons apple cider vinegar; 3 tablespoons olive oil; 1 tablespoon ground cumin; 1 tablespoon light brown sugar; 1 teaspoon kosher salt; 3 pounds skinless, boneless chicken thighs, cut in half; 8 (12-inch) jumbo wooden skewers; 1 large fresh pineapple - peeled, cored, and sliced; 20 (6 inch) corn tortillas; ¼ cup roughly chopped fresh cilantro",
  "directions": "1. Heat a skillet over medium-high heat. Add dried chiles; cook, turning occasionally, until toasted and blistered in spots, 3 to 5 minutes. Add 1 cup water to just cover the chiles, and bring to a simmer over medium-high. Cover and cook, undisturbed, until softened, about 5 minutes. Drain well. 2. Combine chiles, achiote, garlic, chipotles, 2/3 cup onion, orange juice, vinegar, oil, cumin, brown sugar, and salt in a blender; process until smooth, about 30 seconds. Reserve 1/2 cup marinade, cover, and refrigerate until ready to use. 3. Place remaining marinade in a shallow dish or large resealable plastic bag, add chicken; toss to evenly coat. Cover chicken with plastic wrap, and refrigerate at least 8 hours or up to 24 hours. 4. Place wooden skewers in a shallow dish; cover with water by 1 inch. Let stand at room temperature while chicken marinates. 5. Preheat the oven to 400 degrees F (200 degrees C). Position oven rack 8 inches away from heating element. Line a small roasting pan or 13- x 9-inch baking dish with aluminum foil. 6. Thread 1 pineapple slice onto 2 skewers, being sure to pierce through the center core, (skewers will be about 1 inch apart), leaving a 1 1/2-inch space from end of skewer. Thread 5 to 6 pieces of marinated chicken, stacking on top of pineapple; thread 1 pineapple slice. Repeat process, ending with pineapple slice, until all chicken pieces and pineapple slices are used, making 4 stacks total. Brush with any remaining marinade from chicken. 7. Place stacked skewers in the prepared pan, resting skewer ends on edge of pan so that the chicken doesn't touch the bottom of the pan. 8. Bake in the preheated oven for 30 minutes. Flip skewers over, brush with reserved 1/2 cup marinade. Bake until chicken is no longer pink in the center and the juices run clear, about 30 minutes longer. An instant-read thermometer inserted into the center should read 160 degrees F (71 degrees C). Increase oven temperature to broil; broil until browned and crispy, 3 to 5 minutes. Flip, and broil until browned and crispy, 3 to 5 minutes. 9. Meanwhile, heat a large skillet over high heat. Working two at a time, add tortillas; cook, turning once, until heated and browning in some spots, 1 to 2 minutes per side. Repeat with remaining tortillas. 10. Remove chicken and pineapple from skewers, place on cutting board, roughly chop. 11. Divide chicken and pineapple between heated tortillas; top with remaining onion and cilantro.",
  "prep": "",
  "cook": "1 hr 30 mins",
  "total": "10 hrs 10 mins",
  "calories": "324"
},
{
  "url": "https://www.allrecipes.com/recipe/8496235/pineapple-margarita/",
  "name": "Pineapple Margarita",
  "rating": "4.7",
  "ratingcount": "3",
  "ingredients": "2 cups ice, or as needed; 3 fluid ounces pineapple juice; 2 fluid ounces silver tequila; ¾ fluid ounce triple sec; ¾ fluid ounce freshly squeezed lime juice; 1 tablespoon coarse salt, or as needed; 2 lime wedges; pineapple wedge for garnish (optional)",
  "directions": "1. Fill a cocktail shaker half-full with ice. Add pineapple juice, tequila, triple sec, and lime juice to the shaker. Seal and shake vigorously until outside is frosted, 10 to 15 seconds. 2. Sprinkle salt onto a plate. Moisten the rim of a glass with a lime wedge. Press the moistened rim into the salt. Fill glass with ice. 3. Strain margarita into the glass and garnish with pineapple and lime wedge, if desired.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "266"
},
{
  "url": "https://www.allrecipes.com/recipe/214947/perfect-summer-fruit-salad/",
  "name": "Perfect Summer Fruit Salad",
  "rating": "4.6",
  "ratingcount": "572",
  "ingredients": "⅔ cup fresh orange juice; ⅓ cup fresh lemon juice; ⅓ cup packed brown sugar; ½ teaspoon grated orange zest; ½ teaspoon grated lemon zest; 1 teaspoon vanilla extract; 2 cups cubed fresh pineapple; 2 cups strawberries, hulled and sliced; 3  kiwi fruit, peeled and sliced; 3  bananas, sliced; 2  oranges, peeled and sectioned; 1 cup seedless grapes; 2 cups blueberries",
  "directions": "1. For the sauce: Bring orange juice, lemon juice, brown sugar, orange zest, and lemon zest to a boil in a saucepan over medium-high heat. Reduce heat to medium-low and simmer until slightly thickened, about 5 minutes. Remove from heat and stir in vanilla extract. Set aside to cool. 2. For the salad: Layer fruit in a large, clear glass bowl in this order: pineapple, strawberries, kiwi fruit, bananas, oranges, grapes, and blueberries. Pour cooled sauce over fruit; cover and refrigerate for 3 to 4 hours before serving.",
  "prep": "25 mins",
  "cook": "5 mins",
  "total": "3 hrs 30 mins",
  "calories": "155"
},
{
  "url": "https://www.allrecipes.com/recipe/13811/watergate-salad/",
  "name": "Watergate Salad",
  "rating": "4.7",
  "ratingcount": "421",
  "ingredients": "1 (3.4 ounce) package instant pistachio pudding mix; 1 (8 ounce) can crushed pineapple, with juice; 1 cup miniature marshmallows; ½ cup chopped walnuts; 4 ounces frozen whipped topping, thawed",
  "directions": "1. Combine crushed pineapple with juice, instant pudding mix, mini marshmallows, and walnuts in a large bowl. Mix until well combined, then fold in whipped topping. 2. Chill for 1 to 2 hours before serving.",
  "prep": "5 mins",
  "cook": "",
  "total": "1 hr 5 mins",
  "calories": "173"
},
{
  "url": "https://www.allrecipes.com/recipe/20415/hawaiian-chicken-kabobs/",
  "name": "Hawaiian Chicken Kabobs",
  "rating": "4.5",
  "ratingcount": "793",
  "ingredients": "3 tablespoons soy sauce; 3 tablespoons brown sugar; 2 tablespoons sherry; 1 tablespoon sesame oil; ¼ teaspoon ground ginger; ¼ teaspoon garlic powder; 8  skinless, boneless chicken breast halves - cut into 2 inch pieces; 1 (20 ounce) can pineapple chunks, drained; 8 bamboo skewers, soaked in water for 20 minutes",
  "directions": "1. Mix together soy sauce, brown sugar, sherry, sesame oil, ginger, and garlic powder in a shallow glass dish. Stir in chicken pieces and pineapple chunks until well coated. Cover and marinate in the refrigerator for at least 2 hours. 2. Preheat the grill to medium-high heat and lightly oil the grate. 3. Thread chicken and pineapple alternately onto skewers. Discard excess marinade. 4. Cook on the preheated grill, turning occasionally, until chicken is longer pink in the center and the juices run clear, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "2 hrs 25 mins",
  "calories": "203"
},
{
  "url": "https://www.allrecipes.com/recipe/222550/blue-hawaiian-cocktail/",
  "name": "Blue Hawaiian Cocktail",
  "rating": "4.6",
  "ratingcount": "52",
  "ingredients": "1 cup crushed ice; 2 fluid ounces pineapple juice; 1 fluid ounce light rum; 1 fluid ounce blue Curacao liqueur; 1 fluid ounce cream of coconut; 1  pineapple slice; 1  maraschino cherry",
  "directions": "1. Combine crushed ice, pineapple juice, rum, blue Curacao, and cream of coconut in a blender. 2. Blend on high speed until smooth. 3. Pour into a chilled highball glass. Garnish with a slice of pineapple and a maraschino cherry.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "369"
},
{
  "url": "https://www.allrecipes.com/recipe/220808/pineapple-upside-down-cupcakes/",
  "name": "Pineapple Upside Down Cupcakes",
  "rating": "4.6",
  "ratingcount": "277",
  "ingredients": "cooking spray; ½ cup butter, melted; 1 ½ cups brown sugar; 24  maraschino cherries; 1 (20 ounce) can crushed pineapple; 1 (18.25 ounce) package pineapple cake mix (such as Duncan Hines® Pineapple Supreme); 1 ⅓ cups pineapple juice; ⅓ cup vegetable oil; 3  eggs; 1 tablespoon confectioners' sugar for dusting, or as needed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Move an oven rack to the middle of the oven. Spray 24 muffin cups with cooking spray. 2. Spoon 1 teaspoon melted butter into the bottom of each sprayed muffin cup. Spoon 1 tablespoon brown sugar into each muffin cup. Press a maraschino cherry into the center of the brown sugar in each muffin cup. Spoon a heaping tablespoon of crushed pineapple on top and compact it with the back of a spoon into an even layer. 3. Mix pineapple cake mix, pineapple juice, vegetable oil, and eggs in a large bowl with an electric mixer on low speed until moistened, about 30 seconds. Increase speed to medium; mix for 2 minutes. 4. Pour batter into the muffin cups, filling them to the top; do not overfill. 5. Bake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, about 20 minutes. 6. Line a work surface with waxed paper. Allow cupcakes to cool at least 5 minutes before inverting muffin cups onto the waxed paper; serve with pineapple and cherry sides up. Sprinkle cupcakes lightly with confectioners' sugar before serving.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "237"
},
{
  "url": "https://www.allrecipes.com/recipe/14439/frog-eye-salad/",
  "name": "Frog Eye Salad",
  "rating": "4.6",
  "ratingcount": "278",
  "ingredients": "1 ¾ cups unsweetened pineapple juice; 1 cup white sugar; 2  eggs, beaten; 2 tablespoons all-purpose flour; 2 ½ teaspoons salt, divided; 1 tablespoon lemon juice; 1 tablespoon vegetable oil; 1 (16 ounce) package acini di pepe pasta; 3 (11 ounce) cans mandarin oranges, drained; 2 (20 ounce) cans pineapple tidbits, drained; 1 (20 ounce) can crushed pineapple, drained; 1 (8 ounce) container frozen whipped topping, thawed; 1 cup miniature marshmallows; 1 cup shredded coconut",
  "directions": "1. Combine pineapple juice, sugar, eggs, flour, and 1/2 teaspoon salt in a saucepan. Stir and cook over medium heat until thickened. Remove from heat; stir in lemon juice. Let cool to room temperature, about 1 hour. 2. Bring a large pot of water to a boil; add oil and remaining 2 teaspoons salt. Add pasta and cook until al dente, 5 to 7 minutes. Drain and rinse under cold water. 3. Combine cooked pasta, cooled egg mixture, mandarin oranges, pineapple tidbits, crushed pineapple, and whipped topping in a large bowl; mix well. Refrigerate until chilled, 8 hours to overnight. 4. Before serving, add marshmallows and coconut; toss and serve.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "9 hrs 35 mins",
  "calories": "581"
},
{
  "url": "https://www.allrecipes.com/recipe/242231/tgi-fridays-jack-daniels-sauce/",
  "name": "T.G.I. Friday's Jack Daniels Sauce",
  "rating": "4.8",
  "ratingcount": "84",
  "ingredients": "1 head garlic; 1 tablespoon olive oil; 1 ⅓ cups dark brown sugar; 1 cup pineapple juice; ⅔ cup water; ¼ cup teriyaki sauce; 1 tablespoon soy sauce; 3 tablespoons lemon juice; 3 tablespoons minced white onion; 1 tablespoon bourbon whiskey; 1 tablespoon crushed pineapple; ¼ teaspoon cayenne pepper",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Cut about 1/2-inch off top of garlic head. Trim root, so garlic sits flat. Remove outer layers of papery skin, leaving enough so cloves remain intact. 3. Place garlic into a small baking dish, drizzle olive oil on top, and cover with a lid or aluminum foil. 4. Roast garlic in the preheated oven until cloves are soft and fragrant, about 1 hour. 5. Stir brown sugar, pineapple juice, water, teriyaki sauce, and soy sauce together in a saucepan and bring to a boil; reduce heat to low and keep at a simmer. 6. Squeeze sides of garlic until pasty roasted garlic emerges. 7. Measure 2 teaspoons roasted garlic into the saucepan and whisk until incorporated. Reserve remaining roasted garlic for another use. 8. Stir lemon juice, onion, bourbon whiskey, pineapple, and cayenne pepper into sauce. Bring to a simmer and cook until liquid reduces by half and turns thick and syrup-like, 40 to 50 minutes.",
  "prep": "10 mins",
  "cook": "1 hr 45 mins",
  "total": "1 hr 55 mins",
  "calories": "152"
},
{
  "url": "https://www.allrecipes.com/recipe/235932/brazilian-grilled-pineapple/",
  "name": "Brazilian Grilled Pineapple",
  "rating": "4.9",
  "ratingcount": "93",
  "ingredients": "1 cup brown sugar; 2 teaspoons ground cinnamon; 1  pineapple - peeled, cored, and cut into 6 wedges",
  "directions": "1. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 2. Whisk brown sugar and cinnamon together in a bowl. 3. Transfer into a large resealable plastic bag. Add pineapple wedges to the bag; shake well to coat each wedge. 4. Grill pineapple wedges on the preheated grill until heated through, 3 to 5 minutes per side.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "255"
},
{
  "url": "https://www.allrecipes.com/recipe/138159/pineapple-and-banana-smoothie/",
  "name": "Pineapple and Banana Smoothie",
  "rating": "4.6",
  "ratingcount": "177",
  "ingredients": "4  ice cubes; ¼  fresh pineapple - peeled, cored and cubed; 1 large banana, cut into chunks; 1 cup pineapple or apple juice",
  "directions": "1. Gather all ingredients. 2. Place ice cubes, pineapple, banana, and pineapple juice into the container of a blender. 3. Purée on high until smooth. 4. Enjoy!",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "313"
},
{
  "url": "https://www.allrecipes.com/recipe/18391/pineapple-stuffing/",
  "name": "Pineapple Stuffing",
  "rating": "4.7",
  "ratingcount": "317",
  "ingredients": "1 cup white sugar; ½ cup butter or margarine; 4  eggs; 1 (20 ounce) can crushed pineapple, drained; 5 slices white bread, cubed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch baking pan. 2. Combine sugar and butter in a large bowl; beat with an electric mixer until smooth and creamy. Beat in eggs one at a time, then stir in pineapple and bread cubes; transfer mixture into prepared baking dish. 3. Bake in the preheated oven for 1 hour. Let it sit a few minutes to firm up before serving.",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 5 mins",
  "calories": "506"
},
{
  "url": "https://www.allrecipes.com/recipe/236879/jamaican-rum-punch/",
  "name": "Jamaican Rum Punch",
  "rating": "4.8",
  "ratingcount": "25",
  "ingredients": "2 ½ cups pineapple juice; 2 ½ cups orange juice; 1 cup 151 proof rum (such as Bacardi®); ½ cup dark rum (such as Meyer's®); ¼ cup coconut-flavored rum (such as Malibu®); ¼ cup fresh lime juice; 3 tablespoons grenadine syrup; 1  orange, sliced; 1  lime, sliced; 1  lemon, sliced",
  "directions": "1. Gather all ingredients. 2. Stir pineapple juice, orange juice, 151 proof rum, dark rum, coconut-flavored rum, lime juice, and grenadine syrup together in a punch bowl. 3. Float orange slices, lime slices, and lemon slices in the punch. 4. Ladle the punch into ice filled glasses, or chill the punch in the refrigerator until ready to serve.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "254"
},
{
  "url": "https://www.allrecipes.com/recipe/221153/pineapple-upside-down-cake-in-a-glass/",
  "name": "Pineapple Upside-Down Cake in a Glass",
  "rating": "4.8",
  "ratingcount": "58",
  "ingredients": "ice; 1 splash grenadine syrup; 3 ounces pineapple juice; 1 (1.5 fluid ounce) jigger cake-flavored vodka; 1  maraschino cherry",
  "directions": "1. Gather all ingredients. 2. Fill a glass with ice. Splash grenadine over ice. 3. Pour in pineapple juice and cake-flavored vodka; stir. 4. Garnish with maraschino cherry to serve.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "221"
},
{
  "url": "https://www.allrecipes.com/recipe/51294/grilled-pineapple/",
  "name": "Grilled Pineapple",
  "rating": "4.7",
  "ratingcount": "250",
  "ingredients": "1 fresh pineapple - peeled, cored and cut into 1-inch rings; 3 tablespoons melted butter; ¼ teaspoon honey; 1 dash hot pepper sauce; salt to taste",
  "directions": "1. Place pineapple rings in a large resealable plastic bag. Add butter, honey, hot pepper sauce, and salt. Seal the bag and shake to coat evenly. Marinate for at least 30 minutes, or preferably overnight. 2. Preheat an outdoor grill for high heat and lightly oil grate. 3. Grill pineapple rings until heated through and grill marks appear, 2 to 3 minutes per side.",
  "prep": "10 mins",
  "cook": "5 mins",
  "total": "45 mins",
  "calories": "46"
},
{
  "url": "https://www.allrecipes.com/recipe/8281/pineapple-angel-food-cake-i/",
  "name": "Pineapple Angel Food Cake",
  "rating": "4.6",
  "ratingcount": "568",
  "ingredients": "cooking spray; 1 (20 ounce) can crushed pineapple with juice; 1 (16 ounce) package angel food cake mix; 1 (12 ounce) container frozen whipped topping, thawed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Spray a 9x13-inch pan with cooking spray. 2. Mix pineapple with juice and cake mix together in a large bowl until well combined; pour batter into the prepared pan. 3. Bake in the preheated oven until golden brown, about 25 minutes. Let cake cool; serve with whipped topping.",
  "prep": "5 mins",
  "cook": "25 mins",
  "total": "30 mins",
  "calories": "127"
},
{
  "url": "https://www.allrecipes.com/recipe/262797/easy-pineapple-chicken/",
  "name": "Easy Pineapple Chicken",
  "rating": "4.5",
  "ratingcount": "157",
  "ingredients": "3 tablespoons soy sauce; 3 tablespoons olive oil, divided; ½ teaspoon paprika; salt to taste; 1 pound boneless, skinless chicken breast, cut into strips; 1  red bell pepper, cubed; 1 bunch scallions, trimmed and sliced into 1/2-inch lengths; 1 (12 ounce) can pineapple chunks, drained and juice reserved; 1 tablespoon cornstarch",
  "directions": "1. Gather all ingredients. 2. Combine soy sauce, 2 tablespoons olive oil, paprika, and salt in a bowl. Add chicken strips and let marinate while preparing the remaining ingredients. 3. Heat remaining 1 tablespoon olive oil in a wok over medium-high heat. Add bell pepper and stir-fry for 3 minutes. 4. Add scallions and cook for 2 more minutes. 5. Remove chicken from marinade and add to the wok; discard marinade. Cook, stirring occasionally, until chicken is cooked through and no longer pink in the center, 10 to 15 minutes. 6. Combine pineapple juice and cornstarch in a bowl; mix together. Add pineapple chunks to the skillet and cook for 2 to 3 minutes. 7. Pour in pineapple juice mixture and bring to a boil. Simmer until sauce has thickened, about 3 minutes.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "307"
},
{
  "url": "https://www.allrecipes.com/recipe/7622/old-fashioned-pineapple-upside-down-cake/",
  "name": "Old Fashioned Pineapple Upside-Down Cake",
  "rating": "4.3",
  "ratingcount": "522",
  "ingredients": "½ cup butter; 1 cup packed light brown sugar; 1 (20 ounce) can sliced pineapple; 10  maraschino cherries, halved; 1 cup sifted cake flour; 1 teaspoon baking powder; ¼ teaspoon salt; 4 large eggs; 1 cup white sugar; 1 tablespoon butter, melted; 1 teaspoon almond extract",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Melt 1/2 cup butter over very low heat in a 10-inch heavy skillet with a heat-resistant handle or a cast iron pan. Remove from heat; sprinkle brown sugar evenly into the skillet. Arrange pineapple slices to cover the bottom of the skillet. Distribute cherries around pineapples; set aside. 3. Sift together flour, baking powder, and salt in a bowl; set aside. 4. Separate eggs; place whites in a large mixing bowl and yolks in a smaller bowl. 5. Beat egg whites on medium speed until soft peaks form. Add white sugar gradually, beating well after each addition. Beat until medium-stiff peaks form. 6. Beat egg yolks at high speed until very thick and yellow. Using a wire whisk or rubber scraper, gently fold egg yolks and flour mixture into whites with an over-and-under motion until blended. 7. Fold 1 tablespoon melted butter and almond extract into batter, then spread batter evenly over pineapple in the skillet. 8. Bake in the preheated oven until a toothpick inserted in the center comes out clean, 30 to 35 minutes. Loosen cake edges with a table knife. Cool cake for 5 minutes before inverting it onto a serving plate. 9. Enjoy!",
  "prep": "25 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "321"
},
{
  "url": "https://www.allrecipes.com/recipe/236413/pineapple-cleanser-smoothie/",
  "name": "Pineapple Cleanser Smoothie",
  "rating": "4.9",
  "ratingcount": "16",
  "ingredients": "1 cup coconut water, or to taste; 1 cup chopped fresh pineapple; 1 stalk celery; ½  cucumber, peeled; ½  lemon, peeled; ⅓ bunch fresh parsley; 1 (1 inch) piece fresh ginger root",
  "directions": "1. Gather all ingredients. 2. Blend coconut water, pineapple, celery, cucumber, lemon, parsley, and ginger together in a blender until smooth.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "169"
},
{
  "url": "https://www.allrecipes.com/recipe/221894/singapore-sling-cocktail/",
  "name": "Singapore Sling Cocktail",
  "rating": "4.9",
  "ratingcount": "7",
  "ingredients": "2 cups ice, divided; 4 fluid ounces pineapple juice; 1 ½ fluid ounces gin; ½ fluid ounce cherry-flavored brandy; ½ fluid ounce lime juice; ½ fluid ounce grenadine syrup; ¼ fluid ounce triple sec; ¼ fluid ounce Benedictine® liqueur; 1 slice fresh pineapple; 1  maraschino cherry",
  "directions": "1. Fill a Collins glass with 1 cup ice and place in the freezer. 2. Combine pineapple juice, gin, cherry-flavored brandy, lime juice, grenadine, triple sec, and Bénédictine in a cocktail shaker. Add 1 cup ice, cover, and shake until chilled. Strain into the prepared Collins glass. 3. Garnish with pineapple slice and cherry.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "356"
},
{
  "url": "https://www.allrecipes.com/recipe/274276/hawaiian-meatballs/",
  "name": "Hawaiian Meatballs",
  "rating": "4.3",
  "ratingcount": "42",
  "ingredients": "1 pound ground beef; ½ teaspoon ground ginger; ¼ teaspoon garlic powder; ¼ teaspoon ground black pepper; 1 (8 ounce) can pineapple chunks, juice reserved; ⅓ cup water, or as needed; ¼ cup brown sugar; 2 tablespoons cornstarch; ¼ cup white vinegar; 1 tablespoon soy sauce; 1  green bell pepper, chopped",
  "directions": "1. Make the meatballs: Mix ground beef, ginger, garlic powder, and black pepper together in a large bowl until well combined. Shape into 1 1/2-inch balls. 2. Sauté meatballs in a large skillet over medium-high heat until browned, about 10 minutes. 3. While the meatballs are cooking, prepare the sauce: Pour pineapple juice into a liquid measuring cup, and reserve pineapple chunks; add enough water to pineapple juice to make 1 cup. Mix brown sugar and cornstarch in a small bowl. 4. Transfer meatballs to a plate, reserving the pan drippings. Add pineapple juice and brown sugar mixtures to the warm pan drippings. Stir in vinegar and soy sauce and bring to a boil. Cook until sauce thickens, 2 to 3 minutes. 5. Return meatballs to the skillet; add pineapple chunks, and green pepper. Simmer until meatballs are no longer pink inside, about 10 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C).",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "50 mins",
  "calories": "336"
},
{
  "url": "https://www.allrecipes.com/recipe/18246/baked-pineapple-casserole/",
  "name": "Baked Pineapple Casserole",
  "rating": "4.6",
  "ratingcount": "378",
  "ingredients": "1 cup white sugar; ½ cup unsalted butter, softened; 4 large eggs; 1 pinch ground cinnamon (Optional); 1 pinch ground nutmeg (Optional); 1 (20 ounce) can crushed pineapple with juice; 5 slices white bread, torn",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a medium-sized casserole dish. 2. Beat sugar and butter in a mixing bowl with an electric mixer until creamy. Beat in eggs, one at a time, then stir in cinnamon and nutmeg. Mix in crushed pineapple and bread until incorporated; transfer to the prepared baking dish. 3. Bake in the preheated oven until bubbly and lightly browned on top, about 1 hour.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "425"
},
{
  "url": "https://www.allrecipes.com/recipe/273774/grandmas-skillet-pineapple-upside-down-cake/",
  "name": "Grandma's Skillet Pineapple Upside-Down Cake",
  "rating": "4.6",
  "ratingcount": "37",
  "ingredients": "1 stick butter; 1 ½ cups packed brown sugar; 1 (20 ounce) can sliced pineapple; 1 (4 ounce) jar cherries; 1 ½ cups all-purpose flour; 2 ½ teaspoons baking powder; ½ teaspoon salt; 1 ½ cups white sugar; ½ cup butter; 2 large eggs; 1 cup milk; 2 teaspoons vanilla extract",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Melt 1 stick butter in the bottom of a cast iron skillet over medium heat, about 3 minutes. Remove from heat and sprinkle brown sugar evenly over butter. Add pineapple slices to the skillet in a decorative layer with a cherry in the middle of each pineapple ring. Set aside. 3. Sift flour, baking powder, and salt together in a bowl. 4. Cream sugar and 1/2 cup butter together in a bowl. Add eggs and mix. Add flour mixture and milk in an alternating fashion. Add vanilla extract and mix well. Pour mixture evenly over pineapples in the skillet. 5. Bake in the preheated oven until cake is golden brown, about 40 minutes. 6. Let cake cool in the skillet for 10 minutes before inverting onto a serving plate. Serve warm.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "465"
},
{
  "url": "https://www.allrecipes.com/recipe/240617/auntie-midges-hawaiian-salad/",
  "name": "Auntie Midge's Hawaiian Salad",
  "rating": "4.7",
  "ratingcount": "19",
  "ingredients": "1 (30 ounce) can fruit cocktail, drained thoroughly; 1 (20 ounce) can pineapple chunks, drained thoroughly; 1 (8 ounce) can mandarin oranges, drained thoroughly; 1 (10.5 ounce) package miniature marshmallows; 1 (24 ounce) container sour cream",
  "directions": "1. Mix fruit cocktail, pineapple chunks, mandarin oranges, and marshmallows together in a large bowl. Add sour cream and stir until fruit is completely coated. Cover and refrigerate for 4 to 8 hours before serving.",
  "prep": "5 mins",
  "cook": "",
  "total": "4 hrs 5 mins",
  "calories": "333"
},
{
  "url": "https://www.allrecipes.com/recipe/86005/thai-pineapple-chicken-curry/",
  "name": "Thai Pineapple Chicken Curry",
  "rating": "4.5",
  "ratingcount": "523",
  "ingredients": "1 quart water; 2 cups uncooked jasmine rice; ¼ cup red curry paste; 2 (13.5 ounce) cans coconut milk, divided; 2  skinless, boneless chicken breast halves - cut into thin strips; 1 ½ cups sliced bamboo shoots, drained; ¼ cup white sugar; 3 tablespoons fish sauce; ½  red bell pepper, julienned; ½  green bell pepper, julienned; ½ small onion, chopped; 1 cup pineapple chunks, drained",
  "directions": "1. Bring water and rice to a boil in a pot. Reduce heat to low, cover, and simmer for 25 minutes. 2. Whisk together curry paste and 1 can coconut milk in a bowl. Transfer to a wok and mix in remaining coconut milk, chicken, bamboo shoots, sugar, and fish sauce. Bring to a boil and cook until chicken juices run clear, 15 minutes. 3. Mix bell peppers and onion into the wok. Continue cooking until peppers are tender, about 10 minutes. 4. Remove from heat and stir in pineapple. Serve over cooked rice.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "623"
},
{
  "url": "https://www.allrecipes.com/recipe/238576/pineapple-infused-vodka/",
  "name": "Pineapple-Infused Vodka",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "1  fresh pineapple, peeled and sliced; 1 liter vodka (such as Stolichnaya)",
  "directions": "1. Stack pineapple slices in a circle around the edges of a 2-quart wide-mouth glass jar, leaving the center open. Pour vodka into the jar so pineapple is completely covered. Seal the jar and store in a cool, dark place for 10 days. 2. Remove pineapple and strain vodka through a mesh strainer. Pour back into the jar. Seal and refrigerate for up to two weeks.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 days 10 mins",
  "calories": "99"
},
{
  "url": "https://www.allrecipes.com/recipe/32599/malibu-bay-breeze/",
  "name": "Malibu Bay Breeze",
  "rating": "4.8",
  "ratingcount": "60",
  "ingredients": "ice cubes; 2 (1.5 fluid ounce) jiggers coconut flavored rum; 4 fluid ounces pineapple juice; 1 tablespoon cranberry juice",
  "directions": "1. Fill a tall glass with ice. 2. Pour, in this order, coconut rum, pineapple juice, and cranberry juice over ice.",
  "prep": "2 mins",
  "cook": "",
  "total": "2 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/15903/pineapple-pie-iii/",
  "name": "Pineapple Pie",
  "rating": "4.7",
  "ratingcount": "135",
  "ingredients": "1 (20 ounce) can crushed pineapple with juice; ¾ cup white sugar; 3 tablespoons cornstarch; 1 tablespoon lemon juice; 1 (14.1 ounce) package double-crust pie pastry, thawed; 2 tablespoons milk; 1 tablespoon white sugar",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Combine crushed pineapple with juice, sugar, cornstarch, and lemon juice in a medium saucepan. Cook and stir over medium heat until thickened, then boil for 1 minute. Allow filling to cool slightly. 3. Line a 9-inch pie dish with 1 crust. Pour filling into the prepared pie dish. Cover with remaining crust; press and flute the edges to seal. Cut a few steam vents on top, brush with milk, and sprinkle with sugar. 4. Bake in the preheated oven until golden brown, about 35 minutes. Serve chilled or at room temperature.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "55 mins",
  "calories": "362"
},
{
  "url": "https://www.allrecipes.com/recipe/24221/sex-on-the-beach-iii/",
  "name": "Sex on the Beach",
  "rating": "4.9",
  "ratingcount": "67",
  "ingredients": "1 fluid ounce vodka; 1 fluid ounce peach schnapps; 3 fluid ounces orange juice; 3 fluid ounces cranberry juice",
  "directions": "1. Gather all ingredients. 2. Fill a highball glass with ice, pour in vodka and peach schnapps. 3. Add in orange juice and cranberry juice 4. Garnish and enjoy!",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/232612/pineapple-upside-down-cake-from-dole/",
  "name": "Pineapple Upside-Down Cake From Dole",
  "rating": "4.5",
  "ratingcount": "137",
  "ingredients": "cooking spray; 1 (20 ounce) can DOLE® Pineapple Slices; ¼ cup packed brown sugar; 2 tablespoons margarine, melted; 8  maraschino cherries; 1 (9 ounce) package yellow cake mix; ½ cup cold water; 1 large egg",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8-inch pan with cooking spray. 2. Drain pineapple slices; set aside. 3. Stir together brown sugar and melted margarine in the prepared pan; spread evenly in the bottom of the pan. Place pineapple slices into brown sugar mixture. Place a cherry into the center of each pineapple slice and the center of the pan. 4. Beat together cake mix, cold water, and egg in a large bowl with an electric mixer on low speed for 30 seconds. Beat on medium speed for 3 to 4 more minutes. Pour batter evenly over pineapple and cherries in the pan. 5. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 25 to 30 minutes. Cool in the pan for 5 minutes. Loosen edges and turn out onto a serving platter.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/214000/baked-ham-with-sweet-glaze/",
  "name": "Baked Ham with Sweet Glaze",
  "rating": "4.7",
  "ratingcount": "101",
  "ingredients": "1 (10 pound) fully-cooked, bone-in ham; 4 cups boiling water, or as needed; 1 cup packed brown sugar; 2 tablespoons all-purpose flour; 2 tablespoons dry mustard powder; ¼ cup honey; 1 teaspoon fresh lemon juice, or as needed; 1 (20 ounce) can pineapple chunks, drained; 1 (10 ounce) jar maraschino cherries, drained; toothpicks",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Place ham on a rack set in a roasting pan, and carefully pour about 1/2 inch of boiling water into the pan beneath the ham. 2. Bake the ham in the preheated oven for 2 hours, or until a meat thermometer inserted into the thickest part of the meat (do not touch the bone) reads at least 140 degrees F (60 degrees C.) 3. Reduce oven heat to 350 degrees F (175 degrees C.) In a bowl, mix together the brown sugar, flour, dry mustard, honey, and lemon juice as needed to make a thick, smooth paste. Brush the ham generously with glaze. Skewer 1 pineapple chunk and 1 maraschino cherry per toothpick, and insert the decorated picks all over the ham. 4. Return the ham to the oven, and roast for 15 minutes. Baste the ham, fruit and all, with glaze and juices that have collected in the bottom of the pan, return to the oven, and roast for an additional 15 minutes. Let the ham rest for at least 10 minutes before slicing.",
  "prep": "20 mins",
  "cook": "2 hrs 30 mins",
  "total": "3 hrs",
  "calories": "668"
},
{
  "url": "https://www.allrecipes.com/recipe/232598/angel-lush-with-pineapple-from-dole/",
  "name": "Angel Lush with Pineapple from Dole",
  "rating": "5.0",
  "ratingcount": "52",
  "ingredients": "1 (20 ounce) can Dole crushed pineapple, undrained; 1 (3.4 ounce) package instant vanilla pudding mix; 1 cup thawed whipped topping; 1 (10 ounce) round angel food cake, cut horizontally into 3 layers; 1 1/2 cups seasonal berries, or to taste",
  "directions": "1. Mix undrained pineapple and pudding mix in medium bowl. Gently stir in whipped topping. 2. Stack cake layers on a serving plate, spreading pudding mixture between each layer and on top of the cake. Refrigerate for 1 hour or until ready to serve. 3. Before serving, garnish with berries.",
  "prep": "15 mins",
  "cook": "",
  "total": "1 hr 15 mins",
  "calories": "157"
},
{
  "url": "https://www.allrecipes.com/recipe/7048/zucchini-pineapple-bread-i/",
  "name": "Zucchini Pineapple Bread",
  "rating": "4.5",
  "ratingcount": "260",
  "ingredients": "3 cups all-purpose flour; 1 ½ teaspoons baking powder; 1 ½ teaspoons baking soda; 1 teaspoon salt; 1 ½ cups white sugar; 1 cup vegetable oil; 4 large eggs; 2 teaspoons vanilla extract; 1 ½ teaspoons ground cinnamon; ¾ teaspoon ground nutmeg; 2 cups finely grated zucchini, excess moisture squeezed out; 1 (8 ounce) can crushed pineapple, drained",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9x5-inch loaf pans. 2. Whisk flour, baking powder, baking soda, and salt together in a bowl. 3. Mix sugar, oil, eggs, vanilla, sugar, cinnamon, and nutmeg together in a large bowl. Stir in zucchini and drained pineapple, then stir in dry ingredients. Pour batter into the prepared pans. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool on wire racks.",
  "prep": "20 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "207"
},
{
  "url": "https://www.allrecipes.com/recipe/265002/fresh-pineapple-salsa/",
  "name": "Fresh Pineapple Salsa",
  "rating": "4.9",
  "ratingcount": "13",
  "ingredients": "1 cup finely chopped fresh pineapple; ¼ cup finely chopped red onion; ¼ cup red bell pepper, chopped; 1 jalapeño  pepper, seeded and minced; 1 tablespoon finely chopped fresh cilantro; 1 tablespoon lime juice; 1 clove garlic, minced (Optional); ½ teaspoon white sugar; ½ teaspoon salt",
  "directions": "1. Mix pineapple, red onion, bell pepper, jalapeño, cilantro, lime juice, garlic, sugar, and salt together in a bowl until combined. Cover with plastic wrap and refrigerate for 1 hour so flavors can meld.",
  "prep": "15 mins",
  "cook": "",
  "total": "1 hr 15 mins",
  "calories": "22"
},
{
  "url": "https://www.allrecipes.com/recipe/244615/hawaiian-cole-slaw/",
  "name": "Hawaiian Cole Slaw",
  "rating": "4.6",
  "ratingcount": "119",
  "ingredients": "1 (8.5 ounce) package coleslaw mix; 1 (15 ounce) can crushed pineapple, drained; ½ cup finely chopped onion; ½ cup mayonnaise; ¼ cup apple cider vinegar; 2 tablespoons brown sugar; 1 teaspoon dried cilantro; ½ teaspoon salt; ¼ teaspoon ground black pepper",
  "directions": "1. Mix coleslaw mix, pineapple, and onion together in a bowl. 2. Whisk mayonnaise, vinegar, brown sugar, cilantro, salt, and pepper together in a bowl until dressing is smooth. Pour dressing over coleslaw mixture and toss to coat. Refrigerate.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "86"
},
{
  "url": "https://www.allrecipes.com/recipe/6937/pineapple-bread/",
  "name": "Pineapple Bread",
  "rating": "4.0",
  "ratingcount": "111",
  "ingredients": "2  eggs; 1 cup white sugar; ½ cup melted butter; 1 cup crushed pineapple with juice; 1 teaspoon vanilla extract; 2 ½ cups all-purpose flour; ½ cup chopped walnuts; 1 teaspoon baking powder; ¾ teaspoon salt; ½ teaspoon baking soda",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan. 2. Place eggs in a large bowl; beat with an electric mixer. Add sugar and melted butter; continue to beat until smooth. Stir in pineapple and vanilla. 3. Stir flour, walnuts, baking powder, salt, and baking soda together in a separate bowl; add to pineapple mixture and stir until just combined. Pour mixture into the prepared loaf pan. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pan briefly, then invert onto a wire rack to cool completely.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "328"
},
{
  "url": "https://www.allrecipes.com/recipe/69664/delicious-pineapple-muffins/",
  "name": "Delicious Pineapple Muffins",
  "rating": "3.9",
  "ratingcount": "188",
  "ingredients": "2 1/2 cups all-purpose flour, divided; ½ cup white sugar; 1 tablespoon baking powder; ½ teaspoon salt; 1 (8 ounce) can crushed pineapple; ¾ cup milk; 1/2 cup butter, melted, divided; 1 large egg, beaten; ⅓ cup packed brown sugar; ¼ teaspoon ground cinnamon",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Grease and flour 16 muffin cups or line with paper liners. 2. Stir together 2 cups flour, white sugar, baking powder, and salt in a large bowl; form a well in the center. Drain pineapple, reserving 1/4 cup juice; add juice to the well. Pour in milk, 1/4 cup melted butter, and beaten egg; mix just until blended. Portion batter into the prepared muffin cups. Spoon crushed pineapple over batter. 3. Stir together remaining 1/2 cup flour, brown sugar, remaining 1/4 cup melted butter, and cinnamon in a small bowl until well combined; sprinkle over crushed pineapple. 4. Bake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, about 30 minutes.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "181"
},
{
  "url": "https://www.allrecipes.com/recipe/8527294/hawaiian-pizza/",
  "name": "Hawaiian Pizza",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "1 tablespoon extra-virgin olive oil, plus more for pan; 2 slices applewood-smoked bacon; 4  canned pineapple rings; 1 pound fresh pizza dough, at room temperature; ½ cup pizza sauce; 2 cups shredded mozzarella cheese; ¼ cup thinly sliced red onion; 4 slices Canadian bacon, cut into 1-inch triangles",
  "directions": "1. Preheat the oven to 500 degrees F (260 degrees C) with a rack in the lower position. Oil a large rimmed baking sheet with olive oil. 2. Meanwhile, heat a large skillet over medium heat. Add bacon and cook, flipping occasionally, until golden brown and crisp, 5 to 7 minutes. Transfer to a paper towel-lined plate. 3. Pour out pan drippings without wiping pan clean, and return skillet to heat. Add pineapple, cook until lightly browned and caramelized, 3 minutes per side. Remove from pan. Chop bacon and cut pineapple rings into 3/4-inch pieces. 4. On a lightly floured surface, roll dough to a 12-inch circle and place on the oiled baking sheet. Prick dough with a fork several times to reduce air bubbles. Spread pizza sauce evenly over dough, leaving a 1 1/2-inch border around edges. Sprinkle with cheese, red onion, Canadian bacon, chopped pineapple, and chopped bacon. 5. Bake in preheated oven until cheese is melted and bubbly, toppings are lightly charred, and crust is golden brown, 10 to 15 minutes. Let stand 5 minutes before serving.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "322"
},
{
  "url": "https://www.allrecipes.com/recipe/214002/brown-sugar-and-pineapple-glazed-ham/",
  "name": "Brown Sugar and Pineapple Glazed Ham",
  "rating": "4.6",
  "ratingcount": "56",
  "ingredients": "1 (6 pound) fully-cooked, bone-in ham; 1  fresh pineapple; 2 (6 ounce) cans pineapple juice; 1 cup brown sugar",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 325 degrees F (165 degrees C). Place ham, cut-side down, into a roasting pan. 3. Cut skin off pineapple with a sharp knife and slice off any brown spots or skin left behind. Cut pineapple into 1/2-inch-thick rings and use a round cutter to remove cores. Pin rings onto ham with toothpicks. 4. Bake ham in the preheated oven for 30 minutes. 5. While ham bakes, mix pineapple juice and brown sugar in a microwave-safe bowl. Microwave on medium power until glaze is boiling and slightly thickened. Work carefully because glaze will be sticky and very hot. 6. Pour 1/2 of the glaze evenly over ham and pineapple rings. Bake ham for 30 minutes more, then pour remaining glaze over ham. 7. Continue baking ham until a meat thermometer inserted into the thickest part of ham reads 140 degrees F (60 degrees C), 30 to 60 minutes more. 8. Enjoy!",
  "prep": "20 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 50 mins",
  "calories": "396"
},
{
  "url": "https://www.allrecipes.com/recipe/45000/ham-with-pineapple/",
  "name": "Ham with Pineapple",
  "rating": "4.7",
  "ratingcount": "247",
  "ingredients": "1 (12 pound)  bone-in ham; ½ cup whole cloves; 1 (20 ounce) can pineapple rings in heavy syrup; 1 (12 fluid ounce) can or bottle lemon-lime flavored carbonated beverage; ½ cup packed brown sugar; 1 (4 ounce) jar chopped maraschino cherries",
  "directions": "1. Preheat the oven to 325 degrees F (160 degrees C). 2. Place ham in a roasting pan. Use a sharp knife to score ham rind with a diamond pattern. Press a clove into the center of each diamond. 3. Drain juice from pineapple rings into a medium bowl; stir in lemon-lime soda and brown sugar. Coat ham with juice mixture and arrange pineapple rings on ham. Place a maraschino cherry in the center of each pineapple ring and secure with a toothpick. 4. Bake uncovered, basting frequently with pan juices, in the preheated oven until the internal temperature of the ham is 160 degrees F (72 degrees C), 4 to 5 hours. Be sure the meat thermometer does not touch the bone. 5. Remove toothpicks before serving.",
  "prep": "20 mins",
  "cook": "4 hrs",
  "total": "4 hrs 20 mins",
  "calories": "586"
},
{
  "url": "https://www.allrecipes.com/recipe/270608/instant-pot-tacos-al-pastor/",
  "name": "Instant Pot Tacos al Pastor",
  "rating": "4.4",
  "ratingcount": "11",
  "ingredients": "3 pounds pork butt, cut into 2-inch cubes; 2 cups pineapple juice; 1 cup chopped onion; ¼ cup white vinegar; 1 medium orange, juiced; 1 medium lime, juiced; 4 cloves garlic, chopped; 2  chipotle peppers in adobo sauce; 1 (1.41 ounce) package sazón seasoning with achiote; 1 tablespoon chili powder; 1 ½ teaspoons salt; 1 teaspoon cumin; ½ teaspoon ground black pepper; 1 tablespoon vegetable oil, or more as needed; 20 ounces pineapple chunks, drained; 12 (10 inch) flour tortillas; ½ cup chopped red onion; 1/2 cup pico de gallo salsa, or more to taste; 1 medium avocado, diced (Optional); ⅛ cup chopped cilantro; 1  lime, cut into wedges",
  "directions": "1. Place pork into a large lidded container. 2. Blend pineapple juice, onion, vinegar, orange juice, lime juice, garlic, chipotle peppers in adobo sauce, sazón, chili powder, salt, cumin, and black pepper in a blender until smooth. Pour over pork and toss until all meat is covered. Seal the container and marinate for at least 8 hours or up to 24 hours. 3. Turn on a multi-functional pressure cooker (such as Instant Pot), select the Sauté function, and add vegetable oil. When hot, add marinated pork and brown on all sides, working in batches if necessary, about 5 minutes per batch. Reserve any extra marinade in the lidded container. 4. Turn off the Sauté function. Pour in reserved marinade, then close and lock the lid. Select high pressure according to the manufacturer's instructions; set the timer for 35 minutes. Allow 10 to 15 minutes for pressure to build. 5. Release the pressure using the natural-release method according to the manufacturer's instructions, about 10 minutes. Release the remaining pressure with the quick release method, about 5 minutes. Unlock and remove the lid. 6. Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil. 7. Transfer pork to the prepared baking sheet. Keep any sauce in the Instant Pot. Use forks to coarsely shred the pork, removing and discarding any excess fatty chunks. Spread meat out evenly onto the baking sheet. Add pineapple chunks. 8. Broil in the preheated oven until the tips of the meat and pineapples are beginning to get a little brown and crispy, about 5 minutes. Remove from the oven. 9. Drizzle the reserved sauce from the Instant Pot over pork to moisten it and add more flavor. Arrange pork and pineapple chunks on tortillas. Add onion, pico de gallo, avocado, and cilantro. Garnish with lime wedges.",
  "prep": "1 hr",
  "cook": "1 hr",
  "total": "10 hrs 15 mins",
  "calories": "431"
},
{
  "url": "https://www.allrecipes.com/recipe/15857/easy-pineapple-cake/",
  "name": "Easy Pineapple Cake",
  "rating": "4.1",
  "ratingcount": "263",
  "ingredients": "2 cups all-purpose flour; 2 cups white sugar; 2 teaspoons baking soda; 2 large eggs; 1 (20 ounce) can crushed pineapple with juice; 1 teaspoon vanilla extract; 1 (8 ounce) package cream cheese; ½ cup unsalted butter, softened; 1 ½ cups confectioners' sugar; 1 teaspoon vanilla extract",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-baking dish. 2. Mix together flour, white sugar, and baking soda for cake in a large bowl and make a well in the center. Add eggs, crushed pineapple with juice, and vanilla; mix until well-combined. Pour into the prepared baking dish. 3. Bake in the preheated oven until a toothpick inserted into cake comes out clean, about 45 minutes. 4. Meanwhile, combine cream cheese and butter for frosting in a mixing bowl; beat until smooth. Add confectioners' sugar and vanilla; beat until creamy. 5. Spread frosting on warm cake.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "219"
},
{
  "url": "https://www.allrecipes.com/recipe/220314/easy-sweet-and-sour-chicken/",
  "name": "Easy Sweet and Sour Chicken",
  "rating": "4.3",
  "ratingcount": "221",
  "ingredients": "3 tablespoons all-purpose flour; ½ teaspoon garlic powder; ½ teaspoon salt; ½ teaspoon ground black pepper; 1 pound skinless, boneless chicken breast halves, cut into 1-inch cubes; 3 tablespoons vegetable oil, divided; 3  celery ribs, sliced; 2  green bell peppers, diced; 1  onion, chopped; ½ cup ketchup; ½ cup lemon juice; ½ cup crushed pineapple with syrup; ⅓ cup packed brown sugar",
  "directions": "1. Combine flour, garlic powder, salt, and pepper in a shallow dish. Roll chicken in flour mixture to coat. 2. Heat 2 tablespoons oil in a skillet over medium-high heat. Add chicken; cook and stir until no longer pink in the center and the juices run clear, 8 to 10 minutes. Transfer to a plate. 3. Heat remaining 1 tablespoon oil in the same skillet over medium heat. Add celery, bell peppers, and onion; cook and stir until slightly tender, about 5 minutes. 4. Meanwhile, whisk ketchup, lemon juice, pineapple with syrup, and brown sugar together in a bowl. 5. Return chicken to the skillet, pour in pineapple mixture, and bring to a boil. Cook and stir chicken and vegetables in the sauce until heated through, 2 to 3 minutes.",
  "prep": "25 mins",
  "cook": "20 mins",
  "total": "45 mins",
  "calories": "421"
},
{
  "url": "https://www.allrecipes.com/recipe/19829/pineapple-crisp/",
  "name": "Pineapple Crisp",
  "rating": "4.4",
  "ratingcount": "200",
  "ingredients": "2 (20 ounce) cans crushed pineapple, drained; 1 cup all-purpose flour; 1 cup brown sugar; 1 teaspoon baking powder; ½ teaspoon salt; 1  egg; ½ cup butter, melted; 1 teaspoon ground cinnamon",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Spread well-drained pineapple into a 9x9-inch square baking pan. 3. Mix together flour, sugar, baking powder, salt, and egg in a medium bowl until well combined and crumbly. Spoon mixture evenly over pineapple. Pour melted butter over mixture, then sprinkle with cinnamon. 4. Bake in the preheated oven until top is lightly browned and filling is bubbly, 40 to 45 minutes. Serve hot or cold.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "215"
},
{
  "url": "https://www.allrecipes.com/recipe/18452/baked-pineapple/",
  "name": "Baked Pineapple",
  "rating": "4.4",
  "ratingcount": "100",
  "ingredients": "1 (20 ounce) can crushed pineapple, drained; 1 cup white sugar; 2 tablespoons cornstarch; ¼ cup cold water; 2  eggs; 1 tablespoon vanilla extract; 1 tablespoon butter; 1 teaspoon ground cinnamon",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9 inch baking dish. 2. In a mixing bowl, mix together the pineapple, sugar, cornstarch, water, eggs and vanilla. Pour the mixture into the prepared baking dish. Dot the mixture with butter and sprinkle with cinnamon. 3. Bake in a preheated 350 degrees F (175 degrees C) oven for 1 hour.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "207"
},
{
  "url": "https://www.allrecipes.com/recipe/19077/precious-pineapple-cake/",
  "name": "Precious Pineapple Cake",
  "rating": "4.5",
  "ratingcount": "113",
  "ingredients": "½ cup margarine, softened; 3 large eggs; 1 (18.25 ounce) package yellow cake mix; 1 (20 ounce) can crushed pineapple with juice; ½ cup chopped pecans; ½ cup margarine, softened; 1 (8 ounce) package cream cheese, softened; 4 cups confectioners' sugar; ½ cup chopped pecans",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour three 8-inch round pans. 2. Cream margarine in a large bowl until smooth. Blend in eggs. Add cake mix and pineapple with juice; mix until smooth. Stir in pecans. Pour batter into the prepared pans. 3. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 30 minutes. Cool cakes in pans on wire racks for 5 minutes. Run a table knife around the edges to loosen. Invert carefully onto cooling racks. Let cool completely, about 1 hour. 4. To make frosting: Beat margarine and cream cheese in a medium bowl until smooth. Gradually blend in the confectioners' sugar. Mix in pecans. 5. Spread frosting onto the cooled cake layers. Stack layers; frost top and sides.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "1 hr 35 mins",
  "calories": "649"
},
{
  "url": "https://www.allrecipes.com/recipe/272616/pineapple-upside-down-bundt-cake/",
  "name": "Pineapple Upside-Down Bundt Cake",
  "rating": "4.9",
  "ratingcount": "83",
  "ingredients": "cooking spray with flour; ½ cup melted butter; ½ cup packed brown sugar; 1 (8 ounce) can pineapple rings; 1 (4 ounce) jar maraschino cherries; 1 (15.25 ounce) package yellow cake mix; 1 (3.5 ounce) package instant vanilla pudding mix; ¼ cup whole milk, or more as needed; ⅓ cup vegetable oil; 3 large eggs",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 10-inch fluted tube pan (such as Bundt) with cooking spray with flour. 2. Pour melted butter into the bottom of the prepared pan. Sprinkle brown sugar evenly on top. Drain pineapple rings over a measuring cup; reserve juice. Cut rings in half. Alternate placing halved pineapple rings and maraschino cherries around the pan. Set aside. 3. Combine cake mix and pudding mix in a large mixing bowl. Pour enough milk into the reserved pineapple juice to make 1 cup of liquid; add to cake and pudding mixture. Pour in vegetable oil. Mix on low speed, adding 1 egg at a time, until blended. Increase speed to medium; mix until thoroughly combined and smooth, about 2 minutes. Pour batter over pineapples and cherries in the pan. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Let cool for 10 minutes before removing from the pan.",
  "prep": "30 mins",
  "cook": "35 mins",
  "total": "1 hr 15 mins",
  "calories": "417"
},
{
  "url": "https://www.allrecipes.com/recipe/27011/worlds-best-cream-cheese-and-pineapple-dip/",
  "name": "World's Best Cream Cheese and Pineapple Dip",
  "rating": "4.2",
  "ratingcount": "92",
  "ingredients": "1 (8 ounce) package cream cheese, softened; 2 cups crushed pineapple, drained with juice reserved; 1 teaspoon onion powder; 2 cloves garlic, peeled and crushed",
  "directions": "1. In a medium bowl, mix together cream cheese, crushed pineapple, onion powder and garlic. Mix in reserved juice from pineapple as desired. Chill in the refrigerator until serving.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "45"
},
{
  "url": "https://www.allrecipes.com/recipe/247116/pineapple-sweet-and-sour-sauce/",
  "name": "Pineapple Sweet and Sour Sauce",
  "rating": "4.9",
  "ratingcount": "59",
  "ingredients": "2 cups pineapple juice, divided; 3 tablespoons cornstarch; 1 cup white sugar; ¾ cup ketchup, or more to taste; ⅔ cup apple cider vinegar; 2 tablespoons soy sauce, or more to taste; 2 tablespoons crushed pineapple, or more to taste; 1 teaspoon garlic powder",
  "directions": "1. Whisk 1/4 cup pineapple juice and cornstarch together in a small bowl until smooth. 2. Combine remaining 1 3/4 cup pineapple juice, sugar, ketchup, vinegar, soy sauce, crushed pineapple, and garlic powder in a large pot over high heat. Stir in cornstarch mixture and cook, stirring frequently, until sauce comes to a gentle boil. Reduce the heat and simmer until sauce is clear and reaches desired consistency, 15 to 25 minutes.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "58"
},
{
  "url": "https://www.allrecipes.com/recipe/69660/pineapple-pork-chops/",
  "name": "Pineapple Pork Chops",
  "rating": "4.1",
  "ratingcount": "161",
  "ingredients": "1 tablespoon olive oil; 4  boneless pork chops; 1 (14.5 ounce) can chicken broth; 2 tablespoons soy sauce; 1 tablespoon vinegar; ½ cup pineapple juice; 2 tablespoons brown sugar; 2 tablespoons cornstarch; 1 (15 ounce) can pineapple chunks, drained (Optional)",
  "directions": "1. Heat oil in a skillet over medium heat. Sear pork chops in the hot skillet for 5 minutes per side. Transfer chops to a plate. 2. Add broth, soy sauce, and vinegar to the skillet; bring to a boil. Return chops to the skillet, reduce the heat, and simmer until no longer pink in the center, about 20 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Turn off the heat; transfer chops to a plate and keep warm. Leave cooking liquid in the skillet. 3. Stir pineapple juice, brown sugar, and cornstarch together in a bowl. 4. Pour pineapple juice mixture into the skillet and mix with cooking liquid. Cook over medium-low heat, stirring occasionally, until sauce comes to a boil and thickens slightly. Add pineapple chunks and cook until heated through, 1 to 2 minutes. Serve sauce with chops.",
  "prep": "5 mins",
  "cook": "45 mins",
  "total": "50 mins",
  "calories": "213"
},
{
  "url": "https://www.allrecipes.com/recipe/267260/instant-pot-ham/",
  "name": "Instant Pot Ham",
  "rating": "4.6",
  "ratingcount": "8",
  "ingredients": "1 (2 pound) frozen whole ham; 1 (16 ounce) can crushed pineapple; ¼ cup dark brown sugar; 2 tablespoons maple syrup; 2 tablespoons water, or as needed; 1 tablespoon cornstarch",
  "directions": "1. Place ham on a trivet and set it inside a multi-functional pressure cooker (such as Instant Pot). Pour crushed pineapple over ham, then sprinkle with brown sugar and drizzle with maple syrup. Close and lock the lid. Select high pressure according to the manufacturer's instructions; set the timer for 35 minutes. Allow 10 to 15 minutes for pressure to build. 2. Release pressure using the natural-release method according to the manufacturer's instructions, 10 to 40 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C) for fresh ham or 140 degrees F (60 degrees C) for pre-cooked ham. 3. Remove ham and trivet. Cut ham into slices and place onto a serving plate. 4. Select the Sauté function on the pressure cooker. Mix water and cornstarch together in a small bowl; pour into the cooker and stir to combine with sauce. Bring to a boil; cook and stir until thickened. Pour over ham.",
  "prep": "15 mins",
  "cook": "55 mins",
  "total": "1 hr 20 mins",
  "calories": "356"
},
{
  "url": "https://www.allrecipes.com/recipe/17747/sweet-and-sour-chicken-iii/",
  "name": "Sweet and Sour Chicken Stir Fry",
  "rating": "4.4",
  "ratingcount": "609",
  "ingredients": "2 tablespoons vegetable oil; 1 pound skinless, boneless chicken breast meat - cubed; 1 cup carrot strips; ½ cup sliced green bell pepper; ½ cup sliced red bell pepper; 1 clove garlic, minced; ¼ cup low sodium soy sauce; 1 tablespoon cornstarch; 1 (8 ounce) can pineapple chunks, juice reserved; 1 tablespoon vinegar; 1 tablespoon brown sugar; ½ teaspoon ground ginger",
  "directions": "1. Heat oil in a large skillet over medium-high heat. Cook and stir chicken in hot oil until browned. Add carrot, bell peppers, and garlic; stir-fry for 1 to 2 minutes. 2. Mix together soy sauce and cornstarch in a small bowl until well combined, then pour into the skillet. Stir in pineapple with juice, vinegar, brown sugar, and ginger. Bring to a full boil and cook until sauce is thickened.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "259"
}]