[{
  "url": "https://www.allrecipes.com/recipe/24227/christmas-plum-pudding/",
  "name": "Christmas Plum Pudding",
  "rating": "4.4",
  "ratingcount": "5",
  "ingredients": "1 cup whole wheat flour; 2 ½ cups fresh bread crumbs; 4 ounces shredded suet; 3  eggs, beaten; 1 small carrot, grated; 1  apple - peeled, cored and shredded; ½ cup dark brown sugar; ½ cup chopped blanched almonds; 2 ounces preserved stem ginger in syrup, chopped; ⅛ cup ground almonds; ½ cup chopped walnuts; ⅜ cup halved candied cherries; ⅓ cup raisins; ⅜ cup dried currants; ⅜ cup golden raisins; 4 ounces candied mixed fruit peel, chopped; 4  plums, pitted and chopped; 1  lemon, juiced and zested; 1 ½ teaspoons mixed spice; ¾ teaspoon baking powder; ½ cup ale",
  "directions": "1. In a large bowl, combine flour, bread crumbs, suet, eggs, carrot, apple, brown sugar, chopped blanched almonds, stem ginger, ground almonds, cherries, raisins, currants, golden raisins, mixed peel, plums, lemon juice and zest, mixed spice, baking powder and ale. Let each family member take a turn stirring and make a wish. If you have used more dry fruit than fresh, add a little extra ale to make the mixture less stiff. 2. Grease 2 large or 4 small pudding basins. Fill with pudding mixture about 7/8 full. Cover tightly with greased waxed paper, then foil; secure with string. Stand pudding on a trivet in a large pot of boiling water that reaches halfway up the sides of the pudding basin. Steam puddings over medium-low heat in boiling water 10 hours for large puddings, 5 hours for small puddings, topping off water regularly until quite firm and set. 3. If not serving immediately, let cool completely, then replace covers with fresh waxed paper and foil and store in a cool, dry place, basting from time to time with rum or brandy, for up to 3 months. To serve, reheat by steaming 2 to 3 hours.",
  "prep": "30 mins",
  "cook": "5 hrs",
  "total": "5 hrs 30 mins",
  "calories": "228"
},
{
  "url": "https://www.allrecipes.com/recipe/8323/old-fashioned-prune-cake/",
  "name": "Old Fashioned Prune Cake",
  "rating": "4.7",
  "ratingcount": "67",
  "ingredients": "1 cup vegetable oil; 3  eggs; 1 ½ cups white sugar; 2 cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon salt; 1 teaspoon ground allspice; 1 teaspoon ground cinnamon; 1 teaspoon ground nutmeg; 1 cup buttermilk; 1 ¼ teaspoons vanilla extract; 1 cup prunes, pitted and chopped; 1 ½ cups chopped pecans; ¾ cup butter; ¾ cup buttermilk; 1 ½ teaspoons dark corn syrup; 1 ½ cups white sugar; 2 teaspoons vanilla extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease and flour Bundt or tube pan. 2. In a medium bowl, mix together flour, soda, salt, allspice, cinnamon and nutmeg. Set aside. 3. In a large bowl, combine oil, eggs and 1 1/2 cup sugar. Beat 2 minutes at medium speed. 4. Add flour mixture, alternating with 1 cup buttermilk, starting and ending with dry ingredients. beat well after each addition. Stir in prunes, pecans and 1 1/4 teaspoon vanilla. 5. Pour into greased and floured bundt or tube pan and bake at 350 degrees F (175 degrees C) for 1 hour or until a toothpick comes out clean when inserted in the center. 6. Make large, deep holes in hot cake and pour topping in holes and on top of cake a little at a time, giving it time to soak in. 7. For the topping: In saucepan, over medium heat, cook butter, 3/4 cup buttermilk, corn syrup and 1 1/2 cup sugar until sugar and butter melt. Remove from heat and add 2 teaspoons vanilla and stir.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "702"
},
{
  "url": "https://www.allrecipes.com/recipe/67532/duck-sauce/",
  "name": "Duck Sauce",
  "rating": "4.4",
  "ratingcount": "10",
  "ingredients": "5 cups coarsely chopped mixed fruit (apples, plums, and pears); 1 cup water, or more as needed; ¾ cup apple juice; ½ cup packed light brown sugar; 1 tablespoon apricot preserves; 1 teaspoon soy sauce; ½ teaspoon garlic powder; ½ teaspoon dry mustard",
  "directions": "1. Place fruit in a stockpot over medium-high heat. Stir in 1 cup water, apple juice, brown sugar, apricot preserves, soy sauce, garlic powder, and dry mustard. Bring to a simmer, stirring frequently to dissolve brown sugar. Reduce the heat and continue simmering until fruit is completely soft, about 40 minutes. Remove from the heat and let cool for 30 minutes. 2. Transfer cooled mixture to a food processor or blender. Blend until completely smooth, adjusting the consistency with additional water if desired. Cover and refrigerate until ready to use.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 35 mins",
  "calories": "41"
},
{
  "url": "https://www.allrecipes.com/recipe/215131/plum-jam/",
  "name": "Plum Jam",
  "rating": "4.3",
  "ratingcount": "105",
  "ingredients": "4 ½ cups pitted, chopped plums; ½ cup water; 7 ½ cups white sugar; ½ teaspoon butter (Optional); 1 (1.75 ounce) package powdered fruit pectin",
  "directions": "1. Inspect 8 half-pint jars for cracks and rings for rust, discarding any defective ones. Immerse in simmering water until jam is ready. Wash new, unused lids and rings in warm soapy water. 2. Combine plums and water in a large pot over medium-high heat; bring to a boil. Reduce the heat to medium-low, cover, and simmer for 5 minutes. Stir in sugar, then add butter to reduce foaming if needed. 3. Increase the heat to high and stir constantly until mixture comes to a full, rolling boil. Quickly stir in pectin and return to a full boil. Boil, stirring constantly, for 1 minute. Remove from the heat; skim off and discard any foam. 4. Pack jam into hot, sterilized jars, filling to within 1/8 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe rims with a moist paper towel to remove any residue. Top with lids and screw rings on tightly. 5. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 10 minutes. 6. Remove the jars from the stockpot and let rest on a cloth-covered or wood surface, several inches apart, for 12 to 24 hours. Press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "13 hrs",
  "calories": "48"
},
{
  "url": "https://www.allrecipes.com/recipe/215130/my-mother-in-laws-plum-bread/",
  "name": "My Mother-in-Law's Plum Bread",
  "rating": "4.8",
  "ratingcount": "196",
  "ingredients": "1 cup pitted, chopped plums; 1 tablespoon all-purpose flour; ½ cup margarine; 1 cup white sugar; ½ teaspoon vanilla extract; 2  eggs; 1 ½ cups all-purpose flour; ½ teaspoon salt; ¼ teaspoon baking soda; ⅓ cup plain yogurt; ¼ cup brown sugar",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Spray a 9x5-inch loaf pan with cooking spray, or line with parchment paper. 2. Sprinkle chopped plums with 1 tablespoon of flour in a bowl, and toss to coat. Set aside. In a large bowl, beat the margarine, white sugar, and vanilla extract with an electric mixer until light and fluffy. Beat in the eggs. In another bowl, sift together 1 1/2 cup of flour with salt and baking soda. Stir the dry ingredients into the egg mixture, alternating with yogurt until the mixture forms a smooth batter. Lightly stir in the flour-coated plums, and pour the batter into the prepared loaf pan. Sprinkle the top of the batter with brown sugar. 3. Bake in the preheated oven until a toothpick inserted into the center of the loaf comes out clean, 45 to 50 minutes. Remove from oven, and let cool in the pan 10 to 15 minutes before removing from pan for slicing.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "338"
},
{
  "url": "https://www.allrecipes.com/recipe/283464/easy-plum-cake/",
  "name": "Easy Plum Cake",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "¾ cup white sugar; ½ cup unsalted butter, at room temperature; 2 large eggs; 1 cup all-purpose flour; 1 teaspoon baking powder; 1 pinch salt; 12 medium Italian plums, halved and pitted; 1 ½ tablespoons cinnamon sugar, or to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 10-inch springform pan. 2. Combine sugar and butter in a large bowl and beat with an electric mixer until creamy. Add eggs, 1 at a time, and beat well after each addition. Combine flour, baking powder, and salt in a separate bowl and sift on top of the butter mixture. Mix to combine. Transfer batter into the prepared springform pan and smooth out. 3. Set plums inside batter, cut-side up, and sprinkle evenly with cinnamon sugar. 4. Bake in preheated oven on the lowest rack until a skewer comes out clean, 40 to 50 minutes. Serve warm or cool to room temperature.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "304"
},
{
  "url": "https://www.allrecipes.com/recipe/25274/plum-sauce/",
  "name": "Plum Sauce",
  "rating": "4.7",
  "ratingcount": "65",
  "ingredients": "12 ounces plum jam; 2 tablespoons vinegar; 1 tablespoon brown sugar; 1 tablespoon dried minced onion; 1 teaspoon crushed red pepper flakes; 1 clove garlic, minced; ½ teaspoon ground ginger",
  "directions": "1. Combine jam, vinegar, brown sugar, dried onion, red pepper, garlic, and ginger in a saucepan over medium heat. Bring to a boil; cook and stir until thickened to desired consistency. Allow to cool before storing in the refrigerator.",
  "prep": "5 mins",
  "cook": "15 mins",
  "total": "20 mins",
  "calories": "102"
},
{
  "url": "https://www.allrecipes.com/recipe/24053/plum-pudding/",
  "name": "Plum Pudding",
  "rating": "4.4",
  "ratingcount": "26",
  "ingredients": "12  plums, pitted and halved; 1 cup white sugar; ½ cup water; 2 tablespoons tapioca; ½ teaspoon ground cinnamon; 2 ¼ cups all-purpose baking mix; 3 tablespoons white sugar; ⅔ cup milk; 3 tablespoons margarine, melted",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. In a 2 quart baking dish, stir together plums, 1 cup sugar, water, tapioca and cinnamon. Bake in preheated oven for 25 minutes. (You can also cook the plum mixture in the microwave for 15 minutes.) 3. Raise oven temperature to 450 degrees F (230 degrees C). 4. In a medium bowl, stir together baking mix, 3 tablespoons sugar, milk and melted margarine to form a biscuit dough. Drop dough by spoonfuls onto plum mixture. Bake in preheated oven 10 minutes, until golden brown. Let cool slightly before serving.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "468"
},
{
  "url": "https://www.allrecipes.com/recipe/215134/tangy-plum-liqueur/",
  "name": "Tangy Plum Liqueur",
  "rating": "3.7",
  "ratingcount": "6",
  "ingredients": "16 cups black or red plums, pitted and cut into eighths; 3 ¼ cups white sugar, divided; 3 cups 100 proof vodka; 1 ½ tablespoons vanilla extract, divided; 1  orange peel in pieces, divided",
  "directions": "1. Layer half the plums into the bottom of a very large jar with a lid, pressing the plums down as tightly as possible. Pour half the sugar over the plums, then half the vodka over the sugar. Sprinkle on half the vanilla extract, and place about half the orange peel pieces into the jar. Layer the rest of the plums into the jar, pressing them down, and top them with the remaining sugar, vodka, vanilla extract, and orange peel pieces. Screw on the jar lid. 2. Using an unscented candle, drip a coating of wax around the jar lid to prevent leaking. Cover the jar with a dark-colored towel. Place the jar on its side in a dark, cool place, and turn the jar every day for 21 days, replacing the towel to keep out light. 3. After 21 days, strain out the liqueur from the plums and peel with a fine strainer lined with cheesecloth, and bottle the liqueur in attractive bottles with tight-fitting caps.",
  "prep": "1 hr",
  "cook": "",
  "total": "21 days 1 hr",
  "calories": "74"
},
{
  "url": "https://www.allrecipes.com/recipe/7792/plum-cake/",
  "name": "Plum Cake",
  "rating": "4.1",
  "ratingcount": "69",
  "ingredients": "3  eggs; ½ cup butter, softened; ½ cup white sugar; 1 teaspoon lemon zest; 1 cup all-purpose flour; ½ teaspoon baking powder; 1 ¼ cups plums, pitted and quartered",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Grease and flour one 9-inch tube pan. 2. Separate the eggs. In a small bowl, beat the egg whites until stiff peaks form, and set aside. 3. In a large bowl, cream the butter and sugar. Beat in the egg yolks and the lemon zest. 4. Stir together the flour and baking powder and then blend the flour mixture into the creamed mixture. Gently fold in the egg whites. Spread the batter evenly into the prepared pan. There will only be a little over an inch of batter. Arrange the plums, skin side down, attractively over the batter. 5. Bake in preheated oven until a tester inserted in the center comes out clean, about 40 minutes. Transfer to a cooling rack and allow to cool before serving.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "246"
},
{
  "url": "https://www.allrecipes.com/recipe/233232/plum-kuchen/",
  "name": "Plum Kuchen",
  "rating": "4.6",
  "ratingcount": "56",
  "ingredients": "½ cup white sugar; 2 tablespoons margarine; 2  eggs, beaten; 1 cup all-purpose flour; 1 teaspoon baking powder; ¼ teaspoon salt; 1 teaspoon vanilla extract; 10  Italian plums, halved and pitted; 1 cup white sugar; ½ cup all-purpose flour; 3 tablespoons margarine, melted; ½ teaspoon ground cinnamon",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 7x11-inch baking dish. 2. Beat 1/2 cup sugar and 2 tablespoons margarine together in a bowl using an electric mixer until smooth and creamy. Mix eggs, 1 cup flour, baking powder, and salt into creamed margarine mixture; stir in vanilla. Pour batter into the prepared baking dish. Arrange plums, skin side-down, atop batter. 3. Mix 1 cup sugar, 1/2 cup flour, 3 tablespoons margarine, and cinnamon together in a bowl until crumbly; spoon over batter and plums. 4. Bake in the preheated oven until plums are softened, about 35 minutes.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "232"
},
{
  "url": "https://www.allrecipes.com/recipe/15834/plum-pie/",
  "name": "Plum Pie",
  "rating": "4.3",
  "ratingcount": "62",
  "ingredients": "3 cups all-purpose flour; ¾ cup white sugar; 2 ½ teaspoons baking powder; ⅛ teaspoon salt; ⅔ cup butter; 2  eggs; 1 teaspoon vanilla extract; 3 tablespoons milk; ½ teaspoon lemon zest; ½ cup all-purpose flour; ¼ cup packed brown sugar; ½ teaspoon ground cinnamon; ¼ teaspoon salt; ⅓ cup chopped hazelnuts; 1 teaspoon lemon zest; 3 tablespoons butter; 5 cups plums, pitted and sliced; 1 cup white sugar; ¼ cup all-purpose flour; 1 teaspoon ground cinnamon; ½ teaspoon ground nutmeg",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. To Make Crust: In a large bowl combine 3 cups flour, 3/4 cups white sugar, baking powder, and 1/8 teaspoon salt. Mix thoroughly, then cut in 2/3 cup butter or margarine with a pastry blender, until pieces are the size of small peas. Stir in eggs, vanilla extract, milk and lemon zest. Mix just until all ingredients are combined. Allow dough to rest in refrigerator. 3. To Make Streusel Topping: In a medium bowl mix 1/2 cup flour, brown sugar, 1/2 teaspoon cinnamon, 1/4 teaspoon salt, chopped nuts, and grated lemon zest. Work in butter or margarine with fingers until all ingredients are well combined. Set aside. 4. To Make Fruit Filling: Place pitted and sliced fruit in a large bowl. In a small bowl, mix remaining sugar, flour, cinnamon, and nutmeg until thoroughly combined. Pour over fruit and stir gently until all fruit is evenly coated. 5. Roll out pie crust and place in a 9 inch pie pan. Trim and flute edges, then pour in fruit filling. Evenly cover fruit with streusel topping and bake in preheated oven for 45 to 55 minutes. Serve warm, or at room temperature.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "685"
},
{
  "url": "https://www.allrecipes.com/recipe/23222/plum-pudding-sauce/",
  "name": "Plum Pudding Sauce",
  "rating": "4.9",
  "ratingcount": "8",
  "ingredients": "2 tablespoons margarine; ¾ cup white sugar; 1  egg; 2 cups milk; 2 teaspoons all-purpose flour; 1 teaspoon vanilla extract",
  "directions": "1. In a small saucepan over medium heat combine margarine, sugar and the egg. Pour in milk and cook until mixture begins to bubble; be careful not to scald. Stir in flour and vanilla; mix well and serve.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "279"
},
{
  "url": "https://www.allrecipes.com/recipe/255523/plum-butter/",
  "name": "Plum Butter",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "4 ½ pounds plums, pitted and diced; ¼ cup water, or as needed; 1 cup white sugar",
  "directions": "1. Place plums in a large stockpot and add enough water to cover the bottom of stockpot; cook over very low heat, stirring occasionally, until plums are broken down, about 2 hours. Remove stockpot from heat and cool for 2 hours. 2. Return stockpot to stovetop over low heat; cook gently for 2 to 3 hours. Remove from heat and keep at room temperature, 8 hours to overnight. 3. Cook plums over low heat, stirring occasionally, about 2 hours. Remove from heat and let stand at room temperature for 2 hours. 4. Bring plums to a boil; add sugar, lower heat, and simmer until thickened, about 15 minutes. 5. Sterilize jars and lids in boiling water for at least 5 minutes. Pack plum butter into hot jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings. 6. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes. 7. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
  "prep": "10 mins",
  "cook": "6 hrs 45 mins",
  "total": "18 hrs 55 mins",
  "calories": "54"
},
{
  "url": "https://www.allrecipes.com/recipe/215128/pork-with-plum-sauce/",
  "name": "Pork with Plum Sauce",
  "rating": "3.8",
  "ratingcount": "9",
  "ingredients": "2 tablespoons vegetable oil; 4  boneless pork chops; salt and ground black pepper to taste; 1 large clove garlic, minced; ¼ cup soy sauce; 2 tablespoons red wine vinegar; 2 tablespoons brown sugar; ¼ teaspoon ground ginger; ⅛ teaspoon ground cloves; 5  fresh plums, pitted and coarsely chopped",
  "directions": "1. Heat vegetable oil in a skillet over medium-high heat. Season pork chops with salt and pepper; cook in hot oil until browned, about 2 minutes per side. Remove pork chops to a plate. 2. Reduce the heat to medium; cook and stir garlic in the skillet just until fragrant, 10 to 20 seconds. Pour in soy sauce, red wine vinegar, brown sugar, ginger, and cloves; bring to a boil. Stir the mixture until the brown sugar dissolves; add plums. 3. Cover the skillet, reduce the heat, and simmer the mixture until the sauce has thickened and plums are very soft, about 45 minutes. 4. Mash plums with a potato masher to an applesauce-like texture. Place pork chops back into the pan and cook in the sauce until no longer pink in the middle, 10 to 15 minutes. A meat thermometer inserted into the middle of a chop should read 145 degrees (63 degrees C).",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "301"
},
{
  "url": "https://www.allrecipes.com/recipe/41234/plum-clafouti/",
  "name": "Plum Clafouti",
  "rating": "4.3",
  "ratingcount": "174",
  "ingredients": "6 tablespoons white sugar, divided; 14  Italian prune plums, halved and pitted; 3  eggs; 1 ⅓ cups milk; ⅔ cup all-purpose flour; 1 ½ teaspoons grated lemon zest; 2 teaspoons vanilla; 1 pinch salt; ½ teaspoon ground cinnamon; 2 tablespoons confectioners' sugar",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Butter a 10 inch pie plate, and sprinkle 1 tablespoon of sugar over the bottom. 2. Arrange the plum halves, cut side down, so that they cover the entire bottom of the pie plate. Sprinkle 2 tablespoons of sugar over the top of the plums. In a blender, combine the remaining 3 tablespoons of sugar, eggs, milk, flour, lemon zest, cinnamon, vanilla, and salt. Process until smooth, about 2 minutes. Pour over the fruit in the pan. 3. Bake for 50 to 60 minutes in the preheated oven, or until firm and lightly browned. Let stand 5 minutes before slicing. Dust with confectioners' sugar before serving.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "186"
},
{
  "url": "https://www.allrecipes.com/recipe/147069/spicy-oven-roasted-plums/",
  "name": "Spicy Oven-Roasted Plums",
  "rating": "4.4",
  "ratingcount": "24",
  "ingredients": "4  plums, halved and pitted; ½ cup orange juice; 2 tablespoons packed brown sugar; ½ teaspoon ground cinnamon; ⅛ teaspoon ground nutmeg; ⅛ teaspoon cumin; ⅛ teaspoon ground cardamom; ¼ cup toasted slivered almonds (Optional)",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Grease a shallow baking dish with cooking spray. 2. Place plums, cut-side up, in a single layer in the prepared baking dish. 3. Whisk together orange juice, brown sugar, cinnamon, nutmeg, cumin, and cardamom in a bowl; drizzle over plums. 4. Bake in the preheated oven until plums are hot and sauce is bubbly, about 20 minutes. Top with toasted almonds.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "113"
},
{
  "url": "https://www.allrecipes.com/recipe/90225/plum-dumplings/",
  "name": "Plum Dumplings",
  "rating": "4.4",
  "ratingcount": "29",
  "ingredients": "25  Italian prune plums; 3 tablespoons sugar; 2 large potatoes, peeled and quartered; 2 ½ cups all-purpose flour; 1 teaspoon sugar; ½ teaspoon baking powder; ½ teaspoon salt; 3  egg yolks; 2 tablespoons shortening or butter, softened; ½ cup butter; 1 ½ cups dark brown sugar; ¼ cup fine dry bread crumbs",
  "directions": "1. To pit the plums, slice them almost in half, open, and remove pit. Place about 1/3 teaspoon of sugar in the hollow of each plum; close the plum, and place in a bowl. Set aside. 2. Place potatoes in a large pot with enough water to cover. Bring to a boil, and cook until tender. Drain. When cool enough to handle, mash potatoes with a fork or potato masher. You will need 1 cup of mashed potatoes. Set aside, and keep warm. 3. To make the dough, sift the flour, sugar, baking powder, and salt together into a pile on a breadboard. Make a well in the center; add 1 cup mashed potatoes, egg yolks, and shortening into the well, and work in until the dough is pliable and smooth. 4. When dough is thoroughly kneaded, roll it out onto a floured board to a thickness of about 1/4 inch. Cut into roughly 4-inch rounds with a biscuit cutter. Holding one piece of dough in your hand, place a whole pitted plum in the center. Place another piece of dough on top, and press to seal the edges of the dough together. Make sure there are no leaks, or the plum will come out during cooking. 5. To cook, bring a deep pot of salted water to boil. Place dumplings in water, and boil gently for about 10 minutes. 6. Meanwhile, to make the sauce, melt butter in a large frying pan over medium heat. Stir in brown sugar. (If you like, stir in some of the juice that collects in the bowl of pitted plums.) Stir in a small amount of bread crumbs to slightly thicken the sauce. 7. When dumplings are done, remove them from boiling water, and place them in the frying pan, and turn to coat the dumplings. Serve hot with extra sauce poured over them.",
  "prep": "1 hr 30 mins",
  "cook": "45 mins",
  "total": "2 hrs 15 mins",
  "calories": "519"
},
{
  "url": "https://www.allrecipes.com/recipe/210194/damson-plum-cardamom-jam/",
  "name": "Damson Plum Cardamom Jam",
  "rating": "4.7",
  "ratingcount": "23",
  "ingredients": "5 pounds fresh Damson or Damask plums; 1 cup water; 12  whole cardamom pods; 4 cups white sugar; ¼ teaspoon butter",
  "directions": "1. In a sink full of cool water, rinse and de-stem the plums. Place them in a thick-bottomed pan suitable for slow cooking and deep enough to allow frothing when the plums begin to boil. Add the water and cardamom pods and bring the mixture to a low boil over medium heat. Turn heat to low for a slow simmer and allow the fruit to cook down uncovered for 1 1/2 hours. Allow the plums to cool. 2. To pit the plums, strain the cooled plums with a colander, pressing the juice out with your hands and collecting it in a large bowl. Pick up the pit-and-fruit slurry in the colander by small handfuls and squeeze the plum pulp and skins gently into the bowl with the syrup, retaining the pits in the palm of your hand and then discarding them. 3. Put the plums back into the original pot with the sugar and butter. Cook at a very low simmer until the mixture begins to thicken, about 4 hours. To test for adequate development of pectin, drop a spoonful of the jam on a plate and put it in the refrigerator for a few minutes: the mixture should be soft-set and no longer syrupy. 4. Ladle the hot jam into hot, sterile jars, wipe the rims clean, place sterile lids on, and tighten the screw caps. Allow the jars to cool to room temperature and check to be sure that each jar has sealed.",
  "prep": "",
  "cook": "5 hrs 30 mins",
  "total": "7 hrs 30 mins",
  "calories": "42"
},
{
  "url": "https://www.allrecipes.com/recipe/14265/prune-whip/",
  "name": "Prune Whip",
  "rating": "3.8",
  "ratingcount": "4",
  "ingredients": "1 tablespoon unsalted butter, or as needed; 1 tablespoon white sugar, or as needed; 1 ⅓ cups pitted prunes; ⅓ cup white sugar; 1 teaspoon lemon juice; 1 teaspoon vanilla extract; 6 large egg whites; ¼ teaspoon cream of tartar",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). Butter and sugar a 2-quart baking dish. 2. Combine prunes and 1/3 cup water in a medium saucepan over medium heat; bring to a simmer and cook until soft, about 5 minutes. Drain. 3. Purée prunes in a blender, then transfer back to the saucepan. Add 1/3 cup sugar and heat until sugar dissolves. Remove from the heat and stir in lemon juice and vanilla. 4. Beat egg whites in a glass, metal, or ceramic bowl until frothy. Add cream of tartar and continue to beat until stiff peaks form. Fold in prune purée. Pour mixture into the prepared baking dish. 5. Bake in the preheated oven until nicely browned on top, 15 to 20 minutes. Cool to room temperature, then chill for at least 2 hours before serving.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "2 hrs 50 mins",
  "calories": "152"
},
{
  "url": "https://www.allrecipes.com/recipe/155762/schnitzbrot-german-christmas-bread/",
  "name": "Schnitzbrot (German Christmas Bread)",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "1 cup warm water (110 degrees F/45 degrees C); 2 (.25 ounce) envelopes active dry yeast; 2 tablespoons white sugar; 3 cups all-purpose flour; 1 ½ cups prune juice; 1 (9 ounce) package condensed mincemeat; 2 cups prunes, pitted and chopped; ½ cup butter, softened; 1 cup black raisins; 1 cup walnuts, chopped; 1 cup brown sugar, packed; 2 teaspoons salt; 7 cups all-purpose flour; 3 teaspoons butter",
  "directions": "1. Grease a large bowl. Lightly grease three 5 x 9-inch loaf pans. 2. Pour the warm water into a large mixing bowl, and stir in the yeast until dissolved. Allow to rest until the mixture becomes creamy, about 15 minutes. Stir in 2 tablespoons of white sugar and 3 cups of flour until evenly blended. 3. Pour the prune juice into a pan, and stir in the condensed mincemeat. Bring the mixture to a boil over medium heat, stirring occasionally, and cook 1 minute at a rolling boil. Remove from the heat, and stir in the prunes, butter, raisins, walnuts, brown sugar, and salt. Combine the prune mixture with the yeast mixture in the mixing bowl. Gradually stir in the flour, 1 cup at a time, until well blended to make a moist dough. Turn out onto a floured board, and knead in any remaining flour to make 9 cups. Gather dough into a ball and place into greased bowl. Cover with a cloth, and place in a warm place until doubled in size, about 1 1/2 hours. 4. Punch down dough, knead lightly on a floured board, and return to the bowl. Allow to rise again, about 1 hour. 5. Turn dough out onto a floured board. Punch down and shape into 3 loaves. Place each loaf into a prepared loaf pan. Lightly grease tops of each loaf with1 teaspoon butter. Cover with a clean cloth, and allow to rise until doubled in size, about 1 hour. 6. Preheat oven to 300 degrees F (150 degrees C). 7. Bake in preheated oven for 1 hour. Lower heat to 250 degrees F (120 degrees C), and bake 1/2 hour more. Remove from pans, and cool on racks.",
  "prep": "30 mins",
  "cook": "1 hr 40 mins",
  "total": "3 days 4 hrs 55 mins",
  "calories": "400"
},
{
  "url": "https://www.allrecipes.com/recipe/262728/rogaliki-polish-jam-filled-crescents/",
  "name": "Rogaliki (Polish Jam-Filled Crescents)",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "3 ½ ounces compressed fresh yeast; 7 tablespoons milk; 5 ½ cups all-purpose flour, or more as needed; 2 ¼ cups unsalted butter, at room temperature; 4 tablespoons sour cream; 4 tablespoons white sugar; 2  eggs; 3  egg yolks; 1 ½ cups plum jam; 2 ½ cups confectioners' sugar; 2 tablespoons water, or as needed",
  "directions": "1. Stir milk and yeast together in a bowl until smooth. Set aside until foamy, about 10 minutes. 2. Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper. 3. Combine flour, butter, sour cream, sugar, eggs, and egg yolks in a large bowl. Stir in yeast mixture. Mix well using an electric mixer at first, then using your hands. 4. Turn out dough onto a floured work surface and knead until smooth, adding more flour, 1 tablespoon at a time, if dough is sticking to your hands. Form dough into a long log and cut into 1 1/2-inch rounds. Cover rounds with a cloth. 5. Roll each round of dough into a thin circle. Cut the circle into six triangles, as you would a pizza. Place 1 teaspoon jam at the wider end of each triangle, then roll up like a croissant. Place on the prepared baking sheet. Repeat until all the dough is used up. 6. Bake in the preheated oven until rogaliki have risen and are golden brown, about 20 minutes. Remove from oven and cool completely, about 30 minutes. 7. Place confectioners' sugar in a bowl and stir in water, 1 tablespoon at a time, until a drizzling consistency is reached. Drizzle icing over cooled rogaliki.",
  "prep": "1 hr",
  "cook": "20 mins",
  "total": "2 hrs",
  "calories": "236"
},
{
  "url": "https://www.allrecipes.com/recipe/215133/zwetschekuchen-german-plum-tart/",
  "name": "Zwetschekuchen (German Plum Tart)",
  "rating": "4.3",
  "ratingcount": "10",
  "ingredients": "4 cups all-purpose flour; 1 ⅓ cups white sugar; 1 teaspoon grated fresh lemon peel; 1 pinch ground cinnamon; 1 cup butter, cut into chunks; 2  eggs; 2  egg yolks; 1 teaspoon water, if needed; 3 pounds Italian prune plums; 1 tablespoon white sugar, or to taste",
  "directions": "1. Place the flour, 1 1/3 cup of sugar, lemon peel, cinnamon, and butter into the work bowl of a food processor, and process until the mixture turns grainy. Stop the machine, add eggs and egg yolks, and process in the machine until the mixture gathers itself up into one dough ball. If the dough doesn't ball up, stop the machine, sprinkle several drops of water onto the dough, and process again. Place the dough into a covered container and refrigerate at least 3 hours or preferably overnight. 2. The next day, preheat oven to 350 degrees F (175 degrees C). Allow the dough to rest at room temperature for about 30 minutes to warm up. 3. Roll out the dough on a well-floured surface to make a 9 1/2-inch circle. Dough will be rich and sticky. Scrape up the dough circle, and press into a 9-inch pie dish. Quarter and slice the plums, and place skin sides down onto the dough in a neat ring, starting at the outer edge and working in a neat row towards the center. 4. Bake in the preheated oven until the plums are bubbling hot and the crust starts to brown, about 45 minutes. 5. Allow the tart to cool, and sprinkle with 1 tablespoon of sugar before serving.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "5 hrs 15 mins",
  "calories": "451"
},
{
  "url": "https://www.allrecipes.com/recipe/234327/zucchini-plum-bread/",
  "name": "Zucchini Plum Bread",
  "rating": "4.9",
  "ratingcount": "24",
  "ingredients": "2 cups shredded zucchini; 1 cup vegetable oil; 1 cup white sugar; 1 cup packed brown sugar; 3  eggs; 2 teaspoons vanilla extract; 2 cups all-purpose flour; 1 cup whole wheat flour; 1 teaspoon baking soda; 1 teaspoon salt; 1 teaspoon ground cinnamon; ½ teaspoon baking powder; 3 cups chopped plums; 1 tablespoon white sugar; 1 teaspoon ground cinnamon",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Line 2 bread pans with parchment paper or spray with cooking spray. 2. Whisk zucchini, oil, 1 cup white sugar, brown sugar, eggs, and vanilla extract together in a bowl until well mixed. Combine all-purpose flour, whole wheat flour, baking soda, salt, 1 teaspoon cinnamon, and baking powder together in a separate bowl. Gradually stir flour mixture into zucchini mixture until batter is just combined; fold in plums. Pour batter into the prepared pans. 3. Mix 1 tablespoon white sugar and 1 teaspoon cinnamon together in a small bowl; sprinkle over batter. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 25 mins",
  "calories": "227"
},
{
  "url": "https://www.allrecipes.com/recipe/46818/ponche-de-frutas-fruit-punch/",
  "name": "Ponche de Frutas (Fruit Punch)",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "3  oranges, juiced; 3  lemons, juiced; ½ pound seedless green grapes, halved; ½ pound plums, pitted and chopped into small bite-size pieces; 1  fresh pineapple - peeled, cored and chopped into small bite-size pieces; 1 cup white sugar; 4 cups strong brewed black tea, chilled; 4 cups crushed ice",
  "directions": "1. In a large punch bowl, combine orange juice, lemon juice, grapes, plums and pineapple. Stir in sugar. Pour in tea and crushed ice.",
  "prep": "20 mins",
  "cook": "",
  "total": "20 mins",
  "calories": "79"
},
{
  "url": "https://www.allrecipes.com/recipe/229642/prune-cake/",
  "name": "Prune Cake",
  "rating": "4.6",
  "ratingcount": "11",
  "ingredients": "1 cup pitted prunes; ½ cup water; 2 cups all-purpose flour; 1 ½ cups white sugar; 1 tablespoon ground allspice; 1 teaspoon baking soda; 1 teaspoon ground nutmeg; 1 teaspoon ground cinnamon; ½ teaspoon salt; 1 cup vegetable oil; 1 cup buttermilk; 2  eggs, lightly beaten; 1 ½ cups chopped pecans; 1 cup white sugar; ½ cup margarine; ½ cup buttermilk; 1 teaspoon vanilla extract; 2 tablespoons corn syrup, such as Karo®",
  "directions": "1. Combine prunes and water in a small saucepan over medium-high heat. Bring to a boil, reduce heat to low, and simmer until prunes are tender, about 5 minutes. Drain and set aside. 2. Preheat oven to 350 degrees F (175 degrees C). Grease and flour a fluted tube pan (such as a Bundt®). 3. Mix flour, 1 1/2 cups sugar, allspice, baking soda, nutmeg, cinnamon, and salt together in a mixing bowl. Combine vegetable oil, 1 cup buttermilk, and eggs in a separate bowl; pour them into the flour mixture. Mix until fully incorporated. Use an electric mixer to blend in the drained prunes; the mixer will break them up a bit. Stir in the chopped pecans. 4. Pour batter into prepared pan and bake in preheated oven until a tester comes out clean, about 45 minutes. Remove cake from oven and allow it to cool for at least 10 minutes on a wire rack. 5. To make icing, combine 1 cup sugar, margarine, 1/2 cup buttermilk, vanilla extract, and corn syrup in a saucepan and bring it to a boil over medium-high heat. Boil for a full 5 minutes, stirring occasionally. 6. Invert cake onto a platter and pour hot icing over the cake.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 25 mins",
  "calories": "631"
},
{
  "url": "https://www.allrecipes.com/recipe/152260/delicious-oat-bran-cereal/",
  "name": "Delicious Oat Bran Cereal",
  "rating": "4.2",
  "ratingcount": "16",
  "ingredients": "1 cup water; ¼ teaspoon ground cinnamon; 5  dried pitted prunes, chopped; 1 teaspoon sugar substitute (such as Splenda); ¼ cup oat bran",
  "directions": "1. Combine water, cinnamon, prunes, and sugar substitute in a saucepan over medium heat; bring to a boil; stir in the oat bran and boil for 2 minutes.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "160"
},
{
  "url": "https://www.allrecipes.com/recipe/12279/fresh-fruit-cobbler/",
  "name": "Fresh Fruit Cobbler",
  "rating": "4.6",
  "ratingcount": "132",
  "ingredients": "1 cup sliced fresh peaches; ¾ cup peeled, cored and sliced apple; ¾ cup peeled, cored and sliced pear; ½ cup blueberries; ½ cup pitted and sliced cherries; ½ cup pitted and sliced plums; 1  egg; ¾ cup white sugar; ¼ cup milk; 1 cup all-purpose flour; 1 teaspoon baking powder; ½ teaspoon salt; ½ teaspoon vanilla extract; 2 tablespoons butter, melted",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease a 2-quart baking dish. 2. Arrange peaches, apple, pear, blueberries, cherries, and plums in the prepared baking dish. In a medium bowl, beat egg, sugar, and milk. In a separate bowl, sift together flour, baking powder, and salt; stir into egg mixture. Stir in vanilla and melted butter. Cover fruit with batter mixture. 3. Bake 30 minutes in the preheated oven. Cobbler should be bubbly and lightly browned. Serve warm.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "272"
},
{
  "url": "https://www.allrecipes.com/recipe/48308/potato-plum-dumplings/",
  "name": "Potato Plum Dumplings",
  "rating": "4.6",
  "ratingcount": "45",
  "ingredients": "4 large russet potatoes; ½ teaspoon salt; 1 tablespoon butter, softened; 2  eggs, beaten; ¼ cup farina; 1 cup all-purpose flour, or as needed; 12  Italian prune plums; 12 cubes  white sugar; ½ cup butter, melted; ¼ cup white sugar; 1 cup dry bread crumbs; additional melted butter and sugar for garnish (optional)",
  "directions": "1. Scrub potatoes, and place them into a large pot with enough water to cover. bring to a boil, and cook until tender, about 40 minutes. Drain, and cool. When potatoes are cool enough to handle, peel, and press through a ricer into a large bowl. Set aside to cool. This part of the process can be done as much as one day in advance. 2. In a large bowl, mix together the prepared potatoes, salt, egg, and 1 tablespoon of butter until well blended. Gradually stir in the farina, and then the flour. If dough is still wet, more flour can be mixed in. Turn dough out onto a floured surface, and knead until smooth, about 5 to 10 minutes. 3. Split open each plum where it cracks, and remove the pit. Replace each pit with a sugar cube, and close. 4. On a floured surface, roll out the dough to 1/4 inch thickness. Cut into twelve 3 inch squares. Place one plum into each square, and bring the corners around to the top. Pinch together all of the seams to seal. 5. Bring a large pot of water to a slow boil. Place about 4 dumplings into the water at a time. Once they float to the surface, continue to cook them for about 5 more minutes. Transfer cooked dumplings to a covered bowl, and keep warm. 6. Melt the remaining 1/2 cup of butter in a small skillet over medium heat. Stir in bread crumbs, and 1/4 cup of sugar. Continue to cook and stir until browned. Remove the bread crumbs to a plate, and roll warm dumplings in the mixture until entirely coated. To serve, place a dumpling or two on a plate, sprinkle with a little sugar and a little extra melted butter, if desired.",
  "prep": "35 mins",
  "cook": "20 mins",
  "total": "2 hrs 55 mins",
  "calories": "326"
},
{
  "url": "https://www.allrecipes.com/recipe/65237/grandma-skeets-prune-kolaches/",
  "name": "Grandma Skeet's Prune Kolaches",
  "rating": "4.7",
  "ratingcount": "15",
  "ingredients": "1 cup warm water; 1 teaspoon salt; 1  egg; 2 tablespoons butter, room temperature; 3 cups bread flour; ¼ cup white sugar; 3 teaspoons bread machine yeast; 2 cups pitted prunes; 2 cups prune juice or water; ¼ cup white sugar; 1 teaspoon ground cinnamon, or to taste (Optional); ½ teaspoon ground cloves, or to taste; 2 tablespoons lime juice; 1 cup white sugar; ½ cup all-purpose flour; 2 tablespoons butter, melted; 1 teaspoon cinnamon (Optional)",
  "directions": "1. Place the warm water, salt, egg and 2 tablespoons butter in the pan of a bread machine. Add bread flour, and pour 1/4 cup sugar on the edge of the pan. Make a shallow hole in the flour and add the yeast. Close the lid, and set machine for the DOUGH cycle. 2. While the dough is mixing, combine the prunes, prune juice, 1/4 cup sugar, cinnamon, cloves and lime juice in a saucepan. Bring to a boil, then reduce heat to low, and simmer until prunes are soft and the sauce has thickened, about 15 minutes. Remove from heat and blend in a mixer or food processor until smooth. 3. When the bread machine signals the end of the dough cycle, transfer the dough to a lightly floured surface. Divide the dough into 20 small egg-sized pieces. Cover with greased plastic wrap, and set aside for 10 minutes. 4. In a small bowl, mix together 1 cup sugar and 1/2 cup flour. Stir in melted butter and 1 teaspoon cinnamon to make a crumbly streusel. 5. Preheat the oven to 350 degrees F (175 degrees C). Grease a large baking sheet or line it with parchment paper. 6. Shape the kolache dough into balls and place them on the prepared baking sheet. Press a shallow hole in the center of each one, and fill with prune filling. Top each of the kolaches with streusel. Let the kolaches rest until doubled in size, about 20 minutes. 7. Bake until the tops are lightly browned, 14 to 16 minutes.",
  "prep": "55 mins",
  "cook": "15 mins",
  "total": "2 hrs 50 mins",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/134592/far-breton/",
  "name": "Far Breton",
  "rating": "4.6",
  "ratingcount": "9",
  "ingredients": "9 ounces pitted prunes; 1 cup all-purpose flour; ⅝ cup white sugar; 1 tablespoon vanilla sugar; 1 teaspoon baking powder; 1 pinch salt; 4  eggs; 3 cups whole milk; 2 tablespoons rum",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). Grease a shallow 2 quart baking dish. 2. Place the pitted prunes in a saucepan with enough water to cover. Bring to a simmer, and cook until the prunes are tender but still hold their shape, about 10 minutes. Drain the prunes and arrange them in the bottom of the prepared baking dish. 3. Whisk together the flour, white sugar, vanilla sugar, baking powder, and salt in a large bowl. Whisk in the eggs one at a time, beating well after each addition. Gradually pour in the milk, stirring vigorously with a wooden spoon until combined. Stir in the rum. Pour the batter evenly over the prunes. 4. Bake in the preheated oven for 10 minutes. Reduce the oven temperature to 400 degrees F, and bake until the filling is firm, has risen a little, and the top is browned, about 30 minutes. Serve warm or at room temperature.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "298"
},
{
  "url": "https://www.allrecipes.com/recipe/215139/banana-plum-bread/",
  "name": "Banana Plum Bread",
  "rating": "4.3",
  "ratingcount": "24",
  "ingredients": "½ cup white sugar; ½ cup margarine, softened; 2  eggs; 2 ¾ cups all-purpose flour; 1 ½ teaspoons baking powder; ½ teaspoon baking soda; 1 ½ cups mashed ripe bananas; 1 cup plums, pitted and chopped",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 2. In a large bowl, mash the sugar and margarine together until creamy, and beat in the eggs. In a separate bowl, sift the flour with baking powder and baking soda. Stir the flour mixture into the egg mixture in thirds, alternating with the mashed bananas until the batter is smooth and well combined. Gently fold in the plums, and place the batter into the prepared baking dish. 3. Bake in the preheated oven until golden brown, about 1 hour.",
  "prep": "25 mins",
  "cook": "1 hr",
  "total": "1 hr 25 mins",
  "calories": "247"
},
{
  "url": "https://www.allrecipes.com/recipe/215136/drozdzowka-polish-yeast-plum-cake/",
  "name": "Drozdzowka (Polish Yeast Plum Cake)",
  "rating": "4.1",
  "ratingcount": "7",
  "ingredients": "½ cup whole milk; 1 tablespoon all-purpose flour; 1 tablespoon white sugar; 2 (0.6 ounce) cakes cake yeast; 1 ⅓ cups margarine; ½ cup dry bread crumbs; 4  eggs; 1 ⅛ cups white sugar; 8 cups all-purpose flour; 4 teaspoons vanilla sugar; 1 cup whole milk, or as needed; 6 cups fresh plums, pitted and quartered; 1 ½ cups all-purpose flour; ½ cup butter; ½ cup white sugar; ½ teaspoon ground cinnamon (Optional)",
  "directions": "1. In a saucepan over very low heat, warm up 1/2 cup of milk to no more than 100 degrees F (38 degrees C); stir in 1 tablespoon of flour and 1 tablespoon of sugar. Remove from heat and transfer to a bowl. Crumble the cake yeast into the milk mixture, and gently stir until the mixture becomes creamy. Cover the pan with a cloth, and set aside in a warm place until the yeast forms a spongy texture, 20 to 30 minutes. 2. Melt margarine in a saucepan over low heat; remove from heat and allow to cool to lukewarm. 3. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish, and sprinkle with bread crumbs. 4. Place eggs and 1 1/8 cup sugar into a blender, and process until the mixture is yellow and fluffy. In a large mixing bowl, whisk together 8 cups of flour with vanilla sugar. Stir in the egg mixture, activated yeast mixture, and lukewarm margarine; start kneading 1 cup milk, or as needed, into the dough, a little at a time, until the dough stops sticking to your fingers and becomes smooth and even. Knead for at least 15 minutes, working to incorporate as much air as possible into the dough as you knead. 5. Press the dough evenly into the prepared baking sheet, and arrange the plums over the top of the dough. Set aside. 6. In a bowl, cut together 1 1/2 cup flour, the butter, and 1/2 cup of sugar with a pastry cutter until the mixture resembles fine crumbs; sprinkle the streusel mixture over the plums. Dust streusel with cinnamon, if desired. 7. Bake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 1 hour to 1 hour and 10 minutes.",
  "prep": "1 hr",
  "cook": "1 hr",
  "total": "2 hrs 20 mins",
  "calories": "415"
},
{
  "url": "https://www.allrecipes.com/recipe/215138/plum-crisp/",
  "name": "Plum Crisp",
  "rating": "4.6",
  "ratingcount": "190",
  "ingredients": "12  plums, pitted and chopped; 1 cup white sugar, divided; 1 cup sifted all-purpose flour; 1 ½ teaspoons baking powder; 1 teaspoon salt; 1 large beaten egg; ½ cup melted butter",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish. 2. Spread plums evenly into the prepared baking dish and sprinkle with 1/4 cup sugar. 3. Mix together flour, remaining 3/4 cup sugar, baking powder, and salt in a large bowl. Stir in beaten egg and spoon mixture over plums. Drizzle batter with melted butter. 4. Bake in the preheated oven until the topping is brown, about 40 minutes.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "414"
},
{
  "url": "https://www.allrecipes.com/recipe/247144/baby-food-plum/",
  "name": "Baby Food: Plum",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "4  plums - peeled, pitted, and cut into small chunks",
  "directions": "1. Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add plums, cover, and steam until tender, about 10 minutes. 2. Transfer plums to a food processor and blend, adding water from the saucepan as needed, until desired consistency is reached. Allow pureed plums to reach room temperature before serving or freezing.",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "20"
},
{
  "url": "https://www.allrecipes.com/recipe/26053/plum-custard-kuchen/",
  "name": "Plum Custard Kuchen",
  "rating": "4.3",
  "ratingcount": "57",
  "ingredients": "1 cup all-purpose flour; 1 tablespoon white sugar; 1 teaspoon baking powder; ½ cup butter; 2 tablespoons heavy cream; 1  egg; 2 ½ cups pitted and sliced plums; ½ cup heavy cream; ½ cup white sugar; 1  egg; 1 teaspoon vanilla extract",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). In a large bowl, mix flour, 1 tablespoon sugar and baking powder in a bowl. Cut in butter until mixture looks like coarse crumbs. Stir in 2 tablespoons whipping cream and 1 egg. Press in bottom of ungreased 9-inch square pan and arrange plums over the top. 2. Bake in the preheated oven for 25 to 30 minutes. While cake is baking, in a bowl, combine 1/2 cup whipping cream, 1/2 cup sugar, 1 teaspoon vanilla and 1 egg. Beat well, and pour mixture over plums and bake an additional 20 to 30 minutes or until custard is set. Serve warm or cool. Store in refrigerator.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "285"
},
{
  "url": "https://www.allrecipes.com/recipe/239147/roasted-pork-tenderloin-with-fresh-plum-sauce/",
  "name": "Roasted Pork Tenderloin with Fresh Plum Sauce",
  "rating": "4.6",
  "ratingcount": "59",
  "ingredients": "1  pork tenderloin; salt and ground black pepper to taste; 1 tablespoon vegetable oil; 1  red onion, sliced; 2  shallots, sliced; 3  fresh thyme sprigs, or more to taste; 2  firm plums, pitted and each cut into 4 wedges; 1 cup water; 1 tablespoon balsamic vinegar; 1 teaspoon cold butter",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Generously season pork tenderloin with salt and black pepper. 2. Heat oil in a large, oven-proof skillet over medium-high heat. Cook tenderloin until browned on all sides, 2 to 4 minutes per side. Transfer tenderloin to a plate. 3. Saute onion with a pinch of salt in the same skillet until just softening, 3 to 5 minutes. Add shallots, reduce heat to medium, and cook and stir until shallots and onion are golden brown and caramelized, about 10 minutes. 4. Stir thyme into onion mixture; place tenderloin over onion mixture, and set plum quarters, skin-side down, around pork tenderloin. Transfer skillet to preheated oven. 5. Cook until pork is slightly pink in the center, about 20 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Transfer pork and plums to a plate. 6. Place skillet over medium-high heat and pour water and balsamic vinegar into onion mixture. Bring mixture to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Cook and stir until liquid is reduced by half, 5 to 10 minutes; remove from heat. Whisk butter into mixture until melted and sauce is shiny. Pour sauce over pork and plums.",
  "prep": "10 mins",
  "cook": "50 mins",
  "total": "1 hr",
  "calories": "370"
},
{
  "url": "https://www.allrecipes.com/recipe/215141/pork-tenderloin-with-balsamic-plum-reduction/",
  "name": "Pork Tenderloin with Balsamic Plum Reduction",
  "rating": "4.7",
  "ratingcount": "69",
  "ingredients": "1  pork tenderloin; salt and ground black pepper to taste; 1 tablespoon olive oil; 1 ½  plums, pitted and chopped; 2 tablespoons balsamic vinegar; 1 tablespoon brown sugar; 1 tablespoon honey; 2 tablespoons blueberry juice (Optional)",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with foil. 2. Season the pork tenderloin with salt and pepper. Heat olive oil in a heavy skillet over high heat until the oil shimmers; gently lay the tenderloin into the hot oil. After about 1 minute, gently loosen the meat from the bottom of the skillet, if necessary. Cook until the pork is seared a golden brown color, about 3 minutes per side. Transfer the pork to the lined baking sheet. 3. Roast the seared tenderloin in the preheated oven until a thermometer inserted into the center of the pork reads at least 145 degrees F (63 degrees C), about 15 minutes. Remove the pork from the oven and allow to rest for 10 minutes before slicing into medallions. 4. Cook the plums, balsamic vinegar, brown sugar, honey, and blueberry juice in a small saucepan over medium-low heat, stirring often, until the plums are soft, about 10 minutes. Transfer the sauce to a blender and blend until smooth. Return the sauce to the saucepan and simmer until reduced and thickened to the consistency of apple butter, about 5 more minutes. Spoon plum sauce over the sliced pork to serve.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "176"
},
{
  "url": "https://www.allrecipes.com/recipe/23730/plum-blueberry-upside-down-cake/",
  "name": "Plum Blueberry Upside Down Cake",
  "rating": "4.7",
  "ratingcount": "388",
  "ingredients": "1 ¼ cups all-purpose flour; 1 ½ teaspoons baking powder; ¼ teaspoon salt; 3 tablespoons margarine; ¼ cup brown sugar; ⅓ cup margarine; 1 cup white sugar; 1  egg; 1 teaspoon vanilla extract; ¾ cup milk; 4  black plums, pitted and thinly sliced; ¾ cup blueberries",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch cake pan. Combine the flour, baking powder and salt. Set aside. 2. In the prepared pan, combine 3 tablespoons margarine and brown sugar. Place pan inside the preheated oven until the margarine melts and begins to bubble. Set aside. In a large bowl, cream together the 1/3 cup margarine and 1 cup white sugar until light and fluffy. Beat in the egg, then stir in the vanilla. Beat in the flour mixture alternately with the milk, mixing just until incorporated. 3. Arrange plums around the edges of the prepared pan, overlapping slightly. Distribute the blueberries in the center. Pour batter into prepared pan, covering fruit completely. Bake in the preheated oven for 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool 15 minutes before serving.",
  "prep": "30 mins",
  "cook": "40 mins",
  "total": "1 hr 10 mins",
  "calories": "229"
},
{
  "url": "https://www.allrecipes.com/recipe/215124/judys-brown-sauce/",
  "name": "Judy's Brown Sauce",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "10 cups peeled, cored, and roughly chopped tart apples; 10 cups pitted and halved fresh prune plums; 5 cups chopped onions; 6 cups malt vinegar; 5 cups white sugar; ½ cup salt; ½ cup Worcestershire sauce; 4 cloves garlic, minced; 2 teaspoons ground ginger; 2 teaspoons ground nutmeg; 2 teaspoons ground allspice; 2 teaspoons ground cayenne pepper; 15  half-pint canning jars with lids and rings",
  "directions": "1. Working in batches, place the apples, plums and onions into the work bowl of a food processor, and grind until fine. Transfer the ground fruit and onions into a large pot, and stir in the malt vinegar, sugar, salt, Worcestershire sauce, garlic, ginger, nutmeg, allspice, and cayenne pepper until the mixture is well combined. Bring to a simmer over low heat, and simmer until brown and thickened, about 3 to 4 hours. 2. Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the sauce into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. 3. Place a rack in the bottom of a large stockpot, and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes. 4. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
  "prep": "2 hrs",
  "cook": "3 hrs",
  "total": "6 hrs",
  "calories": "32"
},
{
  "url": "https://www.allrecipes.com/recipe/275561/plum-chutney/",
  "name": "Plum Chutney",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "10 medium plums, pitted and chopped, or more to taste; 1 cup white sugar; ½ teaspoon fine sea salt; ½ teaspoon ground ginger; ½ teaspoon chili powder, or to taste; ½ teaspoon ground cloves, or more to taste; ⅛ teaspoon ground cinnamon; 2 tablespoons white vinegar",
  "directions": "1. Mix plums and sugar together in a heavy-bottomed stockpot. Cook over medium heat, stirring occasionally, until mixture turns to liquid, 8 to 10 minutes. 2. Stir salt, ginger, chili powder, cloves, and cinnamon into the mixture. Cook over low heat until desired consistency is reached, stirring often to prevent chutney from sticking, about 15 minutes. Taste and adjust spices if needed. 3. Mix vinegar into the pot and cook over low heat, stirring frequently to prevent burning, for 5 minutes more. Let cool completely, about 30 minutes. Refrigerate and use within 3 to 4 weeks.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "1 hr 10 mins",
  "calories": "68"
},
{
  "url": "https://www.allrecipes.com/recipe/265860/fresh-fruit-frangipane-tart/",
  "name": "Fresh Fruit Frangipane Tart",
  "rating": "4.7",
  "ratingcount": "13",
  "ingredients": "3  puff pastry rectangles; 1 ½ tablespoons butter, softened; ⅓ cup white sugar; 1 tablespoon white sugar; 1 large egg; ¾ cup almond flour; ¼ teaspoon fine salt; ⅛ teaspoon vanilla extract; ¼ teaspoon almond extract (Optional); 3  pluots, or to taste; 3 tablespoons apricot jam (Optional); 2 teaspoons water (Optional)",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). 2. Place 1 piece of puff pastry on a baking sheet lined with a silicone mat or parchment paper. Lightly moisten one of the short edges with water. Connect the end of other puff pastry to the moistened edge. Press pieces together to form a long rectangle, trimming off loose ends with a dough scraper as needed. 3. Cut third puff pastry piece lengthwise into 1-inch strips. Moisten the outer edges of the long rectangle with your finger; stick pastry strips on top. Poke shallow holes all over bottom of dough using a fork. Do not prick the raised border. 4. Bake pastry shell in the preheated oven until it starts to turn golden brown, about 15 minutes. Remove from oven. Reduce oven temperature to 375 degrees F (190 degrees C). Readjust the borders and push the bottom down with the flat side of a fork. Let cool completely while preparing filling. 5. Place butter and 1/3 cup plus 1 tablespoon sugar in a bowl; smear together using a spatula until combined. Whisk in egg until mixture is creamy. Add almond flour, salt, vanilla extract, and almond extract. Mix thoroughly. Cut each pluot into 6 wedges. Fill pastry shell with almond paste. Stick pluots snugly, but not too deeply, into filling. 6. Bake in the preheated oven until browned and almond filling is set, 30 to 40 minutes. Transfer tart onto a wire rack and let cool completely, at least 40 minutes. 7. Combine apricot jam and water in a microwave-safe bowl. Bring to a boil in the microwave. Let cool until warm. Brush glaze over cooled tart.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 55 mins",
  "calories": "397"
},
{
  "url": "https://www.allrecipes.com/recipe/215150/fruit-crumble/",
  "name": "Fruit Crumble",
  "rating": "4.4",
  "ratingcount": "7",
  "ingredients": "3  apples - peeled, cored and sliced; 3  fresh peaches - peeled, pitted, and sliced; 3  ripe plums, peeled, pitted and sliced; 4 large strawberries, sliced; 1 tablespoon white sugar (Optional); ½ teaspoon ground cinnamon (Optional); ½ cup water; ½ cup melted butter; 1 cup white sugar (Optional); ½ cup apricot nectar; 1 cup all-purpose flour; ½ cup quick-cooking rolled oats; ½ cup graham cracker crumbs; 1 tablespoon ground cinnamon (Optional)",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 2. Scatter the apples, peaches, plums, and strawberries into the bottom of the prepared baking dish, mixing the fruit well. Sprinkle with 1 tablespoon of sugar and 1/2 teaspoon of cinnamon if desired. Pour the water over the fruit. 3. Mix together the butter, 1 cup of sugar, the apricot nectar, flour, rolled oats, graham cracker crumbs, and 1 tablespoon of cinnamon in a bowl until the mixture is crumbly and well combined. Sprinkle the crumbly mixture over the pan of fruit. 4. Bake in the preheated oven until the topping is lightly browned and the fruit is tender, about 45 minutes.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "365"
},
{
  "url": "https://www.allrecipes.com/recipe/275173/peach-and-plum-cake/",
  "name": "Peach and Plum Cake",
  "rating": "3.7",
  "ratingcount": "3",
  "ingredients": "1 teaspoon unsalted butter, or as needed; 1 ½ cups white sugar, divided; 1 stick unsalted butter, room temperature; 2 extra large eggs; 1 cup plain yogurt; 1 teaspoon vanilla extract; 2 cups all-purpose flour; 1 teaspoon baking soda; 1 teaspoon baking powder; ½ teaspoon salt; 1 teaspoon ground cinnamon; 5 medium ripe plums, pitted and sliced; 3 large  ripe peaches - peeled, pitted, and sliced",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Butter a 9-inch square baking pan. 2. Beat 1 cup sugar and 1 stick butter together using an electric mixer until light and fluffy. Add eggs, 1 at a time, beating after each addition. Add yogurt and vanilla extract; mix until batter is smooth. Add flour, baking soda, baking powder, and salt to the batter and mix until just combined. Combine remaining 1/2 cup sugar and cinnamon in a separate bowl. 3. Spread batter evenly into the prepared pan and sprinkle with 1/2 of the cinnamon-sugar mixture. Top batter with plums and peaches; sprinkle with remaining cinnamon-sugar mixture. 4. Bake in the preheated oven until a toothpick inserted into the center comes out clean, 45 minutes to 1 hour, making sure not to overbake. Serve warm or at room temperature.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "293"
},
{
  "url": "https://www.allrecipes.com/recipe/26216/prune-filling/",
  "name": "Prune Filling",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 cup chopped pecans; 1 (16 ounce) can stewed prunes; 2 tablespoons white sugar; ½ teaspoon ground cinnamon; ¼ teaspoon ground cloves; 1 tablespoon lime juice",
  "directions": "1. Chop pecans and prunes together in a blender or food processor, stir in the sugar, cinnamon, cloves and lime juice. Use as a filling for cookies or pastries.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "55"
},
{
  "url": "https://www.allrecipes.com/recipe/283445/rhubarb-plum-jam/",
  "name": "Rhubarb-Plum Jam",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "2 ½ pounds chopped rhubarb; 2 ½ pounds Italian prune plums; 3 cups white sugar, or more to taste; ⅔ cup orange juice; ⅓ cup water; 2 teaspoons grated orange zest, or more to taste",
  "directions": "1. Combine rhubarb, plums, sugar, orange juice, water, and orange zest in a saucepan over medium heat; bring to a boil. Reduce heat to medium-low and cook, stirring occasionally, until thick, about 45 minutes. 2. Meanwhile, inspect 6 pint-sized jars for cracks and rings for rust, discarding any defective ones. Immerse in simmering water until jam is ready. Wash new, unused lids and rings in warm soapy water. 3. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil. 4. Pack jam into hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars to remove any air bubbles. Wipe rims with a moist paper towel to remove any residue. Top with lids and screw rings on tightly. 5. Lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water to cover jars by at least 1 inch. Bring to a rolling boil, cover, and process for 5 minutes. 6. Remove the jars from the stockpot and let rest, several inches apart, for 12 to 24 hours. Press the center of each lid with a finger to ensure the lid does not move up or down. Remove the rings for storage and store in a cool, dark area.",
  "prep": "25 mins",
  "cook": "50 mins",
  "total": "13 hrs 20 mins",
  "calories": "33"
},
{
  "url": "https://www.allrecipes.com/recipe/215145/plum-flummery/",
  "name": "Plum Flummery",
  "rating": "4.4",
  "ratingcount": "14",
  "ingredients": "2 cups plums, pitted and sliced; 1 tablespoon water (Optional); 1 (.25 ounce) package unflavored gelatin; ½ cup hot water (Optional); ½ cup white sugar; 2 tablespoons lemon juice; ½ cup evaporated milk",
  "directions": "1. Place the plums into a saucepan over medium-low heat, cover, and simmer, stirring occasionally, until the plums are soft, 5 to 10 minutes. If the mixture becomes too thick or starts to burn, add a tablespoon of water. Remove from heat, and allow to cool. 2. Dissolve the gelatin in 1/2 cup of hot water in a bowl, and stir in the cooled plums, sugar, and lemon juice. Mix until the gelatin and sugar have dissolved. Chill the plum mixture in refrigerator until it begins to thicken, about 30 minutes. Whip the evaporated milk in a mixing bowl with an electric mixer until thick, then gently spoon the whipped milk into the plum mixture. Beat again with electric mixer until the dessert is fluffy and well combined. Chill for at least 3 hours before serving.",
  "prep": "15 mins",
  "cook": "5 mins",
  "total": "3 hrs 50 mins",
  "calories": "148"
},
{
  "url": "https://www.allrecipes.com/recipe/215132/plum-buckle/",
  "name": "Plum Buckle",
  "rating": "4.6",
  "ratingcount": "93",
  "ingredients": "7 cups pitted and quartered plums; ⅔ cup butter, softened; 1 ½ cups white sugar; 2  eggs; 3 cups sifted all-purpose flour; 1 tablespoon baking powder; ½ teaspoon salt; 2 cups milk; 2 teaspoons vanilla extract; 1 cup white sugar; ½ cup butter, softened; ¼ cup all-purpose flour; 1 teaspoon cinnamon",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 2. Place the plums into the bottom of the prepared baking dish. In a large bowl, mash together 2/3 cup butter with 1 1/2 cup of white sugar until the mixture is smooth and creamy. Beat in eggs, one at a time. Stir in 3 cups of flour, the baking powder, and salt. Mix in the milk and vanilla extract to make a smooth batter. Pour the batter over the plums. Mix 1 cup of sugar, 1/2 cup of butter, 1/4 cup of flour, and cinnamon together in a bowl to make a crumbly topping; spread over the batter. 3. Bake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 45 to 50 minutes.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "522"
},
{
  "url": "https://www.allrecipes.com/recipe/215135/rachels-sugar-plum-spice-jam/",
  "name": "Rachel's Sugar Plum Spice Jam",
  "rating": "4.7",
  "ratingcount": "43",
  "ingredients": "10  red plums, pitted and chopped; 2 cups chopped fresh pineapple; ½ cup apple juice; ½ (12 fluid ounce) can frozen orange juice concentrate; 1  lemon, juiced; 1 ½ teaspoons ground cloves; 1 teaspoon ground allspice; 1 (1.75 ounce) package powdered fruit pectin; 1 tablespoon butter; 8 cups white sugar; 4 drops red food coloring",
  "directions": "1. Place the plums, pineapple, apple juice, orange juice concentrate, and lemon juice into a large pot over medium-low heat, cover, and cook until the plums are soft, 15 to 20 minutes. Mash the plums and pineapple with a potato masher until thoroughly broken up, but leave small chunks of fruit in the mixture. With the fruit mixture at a slow simmer, stir in the cloves, allspice, pectin, and butter (to reduce foaming). Raise heat to high and bring the mixture to a full, rolling boil for 1 minute, stirring constantly. Mix in the sugar, stirring constantly, and cook for 1 more minute at a full, rolling boil. Remove from heat, stir in red food coloring until even in color, and skim off any foam. 2. Sterilize 12-ounce canning jars and lids in boiling water for at least 5 minutes. Pack the plum jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. 3. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes. 4. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "2 hrs 15 mins",
  "calories": "59"
},
{
  "url": "https://www.allrecipes.com/recipe/265475/zwetschgendatschi-german-plum-sheet-cake/",
  "name": "Zwetschgendatschi (German Plum Sheet Cake)",
  "rating": "4.8",
  "ratingcount": "5",
  "ingredients": "4 ¾ cups all-purpose flour; 4 teaspoons baking powder; 1 cup white sugar; 2 teaspoons vanilla sugar; 2 pinches salt; 1 ⅓ cups unsalted butter, room temperature and cut into chunks; 2 large eggs; 2 ¼ pounds Italian prune plums, halved and pitted; 2 tablespoons white sugar; 1 teaspoon ground cinnamon; 2 tablespoons unsalted butter, room temperature and cut into chunks; 1 tablespoon sliced almonds (Optional)",
  "directions": "1. Combine flour and baking powder in a large bowl. Mix in 1 cup sugar, vanilla sugar, and salt. Add 1 1/3 cups butter and eggs. Knead everything into a smooth dough. Shape dough into a ball, press flat, cover, and chill in the refrigerator 1 hour to overnight. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease a baking sheet with butter. 3. Cut halved plums in half again, without cutting all the way through, so they fan out. 4. Roll pastry dough out on a lightly floured work surface. Line the bottom and sides of the prepared baking sheet with dough. Mix 2 tablespoons sugar and cinnamon together in a bowl. 5. Arrange plums side by side on the pastry dough; very small plums should overlap. Dot plums with 2 tablespoons butter and sprinkle with cinnamon sugar and almonds. 6. Bake in the preheated oven until pastry crust is lightly browned, 30 to 40 minutes. Remove from oven. Allow plum cake to cool, then cut into squares. Serve lukewarm or at room temperature.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "2 hrs",
  "calories": "381"
},
{
  "url": "https://www.allrecipes.com/recipe/24302/plum-pudding-ii/",
  "name": "Plum Pudding II",
  "rating": "4.9",
  "ratingcount": "15",
  "ingredients": "¼ cup butter; ⅓ cup brown sugar; 1 cup milk; 12  dates, pitted and chopped; ½ cup raisins; ¼ cup dried currants; ¼ cup candied mixed fruit peel, chopped; 1  orange, zested; 1 teaspoon baking soda; 1 cup self-rising flour; 2 teaspoons ground cinnamon; 1 pinch salt",
  "directions": "1. Well grease a pudding mold. 2. In a large saucepan combine butter, sugar, milk, dates, raisins, currants, mixed fruit peel and zest of the orange; bring to a boil. Remove from heat and stir in baking soda. Sift in the flour, cinnamon and salt; mix gently until blended. Pour into prepared pudding mold. 3. Cover with a double layer of greased wax paper and steam for 2 hours.",
  "prep": "20 mins",
  "cook": "2 hrs",
  "total": "2 hrs 20 mins",
  "calories": "308"
},
{
  "url": "https://www.allrecipes.com/recipe/230418/fruit-stuffed-pork-loin/",
  "name": "Fruit-Stuffed Pork Loin",
  "rating": "4.3",
  "ratingcount": "13",
  "ingredients": "¾ cup chopped pitted prunes; ¾ cup chopped dried apricots; 1 tablespoon grated fresh ginger; 1 teaspoon grated orange zest; ½ teaspoon ground cumin; ½ teaspoon ground cinnamon; salt and ground black pepper to taste; 1 (4 pound) boneless pork loin roast, butterflied; ¼ cup packed brown sugar; 2 teaspoons all-purpose flour; 2 teaspoons cider vinegar; 1 teaspoon ground cumin; 1 teaspoon mustard powder; ½ cup water; 1 teaspoon cornstarch; 1 tablespoon water",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Mix prunes, apricots, ginger, orange zest, 1/2 teaspoon cumin, and cinnamon in a bowl; season with salt and black pepper. 3. Open pork roast and spoon stuffing down the center; fold meat over stuffing and tie securely in several places with kitchen twine. Set roast onto a rack in a roasting pan. 4. Combine brown sugar, flour, cider vinegar, 1 teaspoon cumin, and mustard powder into a paste; spread brown sugar mixture over the roast. 5. Bake in the preheated oven until a meat thermometer inserted into center of stuffing reads 160 degrees F (70 degrees C), about 1 1/2 hours. Transfer roast to a serving platter and tent with aluminum foil while you make gravy. 6. Skim fat from roasting pan and transfer defatted drippings into a small saucepan. Pour 1/2 cup water into roasting pan and scrape up and dissolve any browned bits of food into water; pour into saucepan with pan juices. Bring pan juices to a boil over medium heat. Dissolve cornstarch in 1 tablespoon water in a small bowl and whisk cornstarch mixture into pan juices, stirring constantly until thickened, about 1 minute. Strain gravy into a gravy boat. Serve gravy with roast.",
  "prep": "20 mins",
  "cook": "1 hr 40 mins",
  "total": "2 hrs",
  "calories": "435"
},
{
  "url": "https://www.allrecipes.com/recipe/215144/plum-chipotle-sauce/",
  "name": "Plum Chipotle Sauce",
  "rating": "4.8",
  "ratingcount": "34",
  "ingredients": "5 quarts very ripe plums, pitted, or as needed; 4 cloves garlic, pressed; 1  onion, finely chopped; 6 cups white sugar; ½ cup apple cider vinegar; 2 tablespoons Southwest chipotle seasoning; 1 tablespoon roasted garlic seasoning; 1  jalapeno pepper, finely chopped (remove seeds for milder flavor if desired); 7 teaspoons salt; 1 teaspoon liquid smoke flavoring; 8  half-pint canning jars with lids and rings",
  "directions": "1. Place the plums, a few at a time, into a colander set over a large bowl. With gloved hands, squeeze the plums in the colander, forcing the juice through the holes of the colander. Discard spent pulp, and repeat to produce 8 cups of plum juice. 2. Pour 3/4 cup of plum juice into a small saucepan with garlic and onion, place over medium heat, and bring to a boil. Reduce heat to medium-low, and simmer until the onion is translucent, about 5 minutes. 3. Pour the juice-onion mixture into a large pot, and add the remaining 7 1/2 cups of plum juice. Stir in the sugar, apple cider vinegar, Southwest chipotle seasoning, roasted garlic seasoning, jalapeno pepper, salt, and liquid smoke flavoring until the sugar and salt have dissolved. Bring the mixture to a boil over medium heat, reduce heat to a simmer, and cook the sauce down until thickened, about 1 1/2 hours. Stir frequently to prevent burning. 4. Sterilize the jars and lids in boiling water for at least 5 minutes. Pack the sauce into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. 5. Place a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes. 6. Remove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.",
  "prep": "1 hr",
  "cook": "1 hr 40 mins",
  "total": "4 hrs 40 mins",
  "calories": "50"
}]