[{
  "url": "https://www.allrecipes.com/recipe/245347/arugula-salad-with-pomegranate-molasses/",
  "name": "Arugula Salad with Pomegranate Molasses",
  "rating": "3.0",
  "ratingcount": "4",
  "ingredients": "⅓ cup freshly squeezed lemon juice; 1 tablespoon pomegranate molasses; 1 tablespoon white vinegar; 1 teaspoon sumac powder (Optional); salt and ground black pepper to taste; 1 cup halved cherry tomatoes; 2 cups arugula leaves; ¼ cup walnut halves",
  "directions": "1. Whisk lemon juice, pomegranate molasses, vinegar, sumac, salt, and black pepper together in a small bowl to make the dressing. 2. Mix cherry tomatoes, arugula leaves, and walnut halves together in a large bowl. Pour dressing into bowl and toss salad well to coat.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "132"
},
{
  "url": "https://www.allrecipes.com/recipe/254539/zesty-salad/",
  "name": "Zesty Salad",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1 small potato, cut into cubes; ½ cup finely chopped cabbage; ¼ cup fresh pomegranate seeds; ½  carrot, cut into matchsticks; 1 tablespoon extra-virgin olive oil; 1 teaspoon lemon juice; 1 clove garlic, minced; ½ teaspoon salt; ¼ teaspoon brown sugar; ¼ teaspoon red pepper flakes",
  "directions": "1. Place potato cubes into a small pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 5 to 10 minutes. Drain and let cool, about 10 minutes. 2. Combine cooled potato, cabbage, pomegranate seeds, and carrot in a large bowl. 3. Whisk olive oil, lemon juice, garlic, salt, brown sugar, and red pepper flakes in a small bowl until well-mixed. Poured over potato mixture and toss to combine.",
  "prep": "20 mins",
  "cook": "10 mins",
  "total": "40 mins",
  "calories": "121"
},
{
  "url": "https://www.allrecipes.com/recipe/276587/healthy-apple-and-kale-salad/",
  "name": "Healthy Apple and Kale Salad",
  "rating": "3.0",
  "ratingcount": "1",
  "ingredients": "10 ounces kale, shredded; 2  Honeycrisp apples, thinly sliced; 1  pomegranate, seeds only; ½ teaspoon ground cinnamon; Dressing:; 2 tablespoons extra-virgin olive oil; 2 tablespoons lemon juice; 1  shallot, thinly sliced; 1 tablespoon chopped fresh thyme; ground black pepper to taste; 1 pinch crushed red pepper flakes",
  "directions": "1. Massage kale with your hands until leaves have softened, about 2 minutes. Place in a large bowl. Add apples, pomegranate seeds, and cinnamon. 2. Stir together olive oil, lemon juice, shallot, thyme, pepper, and red pepper flakes in a small bowl. Pour dressing over kale salad and toss to combine.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "257"
},
{
  "url": "https://www.allrecipes.com/recipe/229672/pomegranate-glazed-carrots/",
  "name": "Pomegranate Glazed Carrots",
  "rating": "3.8",
  "ratingcount": "4",
  "ingredients": "1 tablespoon butter; 3 cups peeled, sliced carrots; salt and ground black pepper to taste; ¼ cup orange juice; ¼ cup pomegranate juice",
  "directions": "1. Melt butter in a skillet over medium heat. Cook and stir carrots in the hot butter until they begin to soften, about 5 minutes; season with salt and black pepper. 2. Stir orange juice and pomegranate juice into carrots, bring to a simmer, and reduce heat to low. Simmer carrots until tender, stirring occasionally, 10 to 12 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "80"
},
{
  "url": "https://www.allrecipes.com/recipe/246792/stuffed-eggplant-with-israeli-couscous/",
  "name": "Stuffed Eggplant with Israeli Couscous",
  "rating": "3.7",
  "ratingcount": "3",
  "ingredients": "2  medium eggplants; 1 tablespoon olive oil; 2 teaspoons minced garlic; ¾ cup Israeli couscous, uncooked; ½ teaspoon allspice; 2  dried bay leaves; 1  cinnamon stick; 1 cup low-sodium chicken broth; ½ teaspoon salt; 1 ½ tablespoons chopped fresh parsley; ½ cup crumbled feta cheese; ¼ cup pomegranate seeds; 1 sheet Reynolds Wrap® Aluminum Foil",
  "directions": "1. Preheat the oven to 400 degrees F. Cut the eggplants in half lengthwise, wrap each half in a sheet of Reynolds Wrap® Aluminum Foil and arrange them on a baking sheet. Roast the eggplants until the centers are soft and tender, about 30 minutes. Unwrap the eggplants and scoop out the center pulp, leaving a 1/2-inch border around the edges of each eggplant. Roughly chop the reserved pulp and set it aside. 2. Add the olive oil to a medium saucepan set over medium-low heat. Add the garlic and cook, stirring constantly for 1 minute, then add the couscous, allspice, bay leaves and cinnamon stick and cook, stirring constantly, for an additional 2 minutes. 3. Add the chicken broth and 1/2 teaspoon salt then bring the mixture to a boil. Reduce the mixture to a simmer, cover the saucepan, and cook the couscous until it is tender and the liquid has absorbed, 10 to 12 minutes. Remove the bay leaves and cinnamon stick. Stir in the reserved eggplant, parsley and feta cheese, then divide the couscous mixture evenly among the eggplants. 4. Arrange the stuffed eggplants on a foil-lined baking sheet and return them to the oven, uncovered, and bake until they are warmed throughout, about 5 minutes. Remove the eggplants from the oven, top them with pomegranate seeds and serve immediately.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/263464/quinoa-salad-with-broccoli-nuts-and-pomegranate/",
  "name": "Quinoa Salad with Broccoli, Nuts, and Pomegranate",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "2 cups water; 1 cup quinoa; 1 cube vegetable bouillon; 2 cups broccoli florets; ½ cup finely diced red onion; ½ cup finely chopped Brazil nuts; 1 large pomegranate, seeded; 2 tablespoons olive oil, or to taste; 1 tablespoon balsamic vinegar, or to taste; 1 teaspoon honey, or to taste; salt and ground black pepper to taste",
  "directions": "1. Combine water, quinoa, and vegetable bouillon in a saucepan. Bring to a boil over medium-high heat. Reduce heat, cover, and simmer until quinoa has doubled in size and looks like transparent little pearls, 25 to 30 minutes. 2. Meanwhile, cook broccoli in boiling water until tender, 5 to 10 minutes. Drain and rinse under cold water. 3. Drain and rinse quinoa under cold water. Combine quinoa, broccoli, red onion, Brazil nuts, and pomegranate seeds in a large bowl. Drizzle with olive oil, vinegar, and honey and season with salt and pepper.",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "417"
},
{
  "url": "https://www.allrecipes.com/recipe/259373/chiles-en-nogada-mexican-stuffed-poblano-peppers-in-walnut-sauce/",
  "name": "Chiles en Nogada (Mexican Stuffed Poblano Peppers in Walnut Sauce)",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "8  poblano peppers; 1 tablespoon olive oil; 1  onion, chopped; 2 cloves garlic, finely chopped; 1 ¾ pounds ground pork; 2 cups peeled, seeded, and chopped tomatoes; 1  ripe plantain, chopped; 1  apple, chopped; 1  fresh peach, chopped; 1 bunch fresh parsley, chopped; 2 tablespoons chopped candied orange peel; 2 tablespoons pine nuts; 2 tablespoons raisins; 2 tablespoons blanched almonds, chopped; 4  whole cloves, ground; salt and pepper to taste; 2 ½ cups chopped walnuts; 1 ¾ cups milk; ¾ cup soft goat cheese; 1 tablespoon white sugar; 1 (1 inch) piece cinnamon stick; 1 ½ cups pomegranate seeds; ½ cup chopped fresh parsley",
  "directions": "1. Roast poblano chiles over an open flame on a gas stove or grill until the skin is black and charred on all sides, turning often, 10 to 15 minutes. 2. Place the charred chiles in a plastic bag or in a large bowl covered with plastic wrap. Allow to sit for 5 to 10 minutes, then open and peel off the skin. Cut a slit in each chile lengthwise and remove the seeds. 3. Heat olive oil in a large pot over medium heat. Add onion and garlic and cook until soft and translucent, 3 to 4 minutes. Add ground pork and cook until browned, breaking up with a spoon while cooking, about 7 minutes. Mix in tomatoes, plantain, apple, peach, parsley, candied orange peel, pine nuts, raisins, almonds, cloves, salt, and pepper. Simmer until filling is cooked through and flavors are well combined, about 10 minutes. 4. Combine walnuts, milk, goat cheese, sugar, and cinnamon stick in a blender; blend until walnut sauce is smooth and creamy. 5. Fill each poblano chile with the pork filling and place on a plate. Spoon walnut sauce over chile and sprinkle with pomegranate seeds and parsley.",
  "prep": "1 hr",
  "cook": "30 mins",
  "total": "1 hr 35 mins",
  "calories": "724"
},
{
  "url": "https://www.allrecipes.com/recipe/163121/cosmo-style-pomegranate-martini/",
  "name": "Cosmo-Style Pomegranate Martini",
  "rating": "4.7",
  "ratingcount": "44",
  "ingredients": "ice cubes; 2 fluid ounces citron vodka; 2 fluid ounces pomegranate juice; 1 fluid ounce Cointreau or other orange liqueur; ½ fluid ounce lemon juice",
  "directions": "1. Fill a cocktail shaker with ice. 2. Pour vodka, pomegranate juice, Cointreau, and lemon juice over ice in the cocktail shaker. Cover and shake until the outside of the shaker has frosted. 3. Strain into a chilled martini glass.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/77493/brendas-apple-and-pomegranate-crisp/",
  "name": "Brenda's Apple and Pomegranate Crisp",
  "rating": "4.5",
  "ratingcount": "104",
  "ingredients": "4 medium apples - peeled, cored and sliced; ½  pomegranate, skin and light-colored membrane removed; ½ cup brown sugar; 1 tablespoon ground cinnamon; ½ teaspoon ground nutmeg; ½ cup rolled oats; ½ cup all-purpose flour; ½ cup white sugar; ½ cup unsalted butter, melted",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). Butter a 9x13-inch baking dish. 2. In a large bowl, toss together the apples, pomegranate seeds, brown sugar, cinnamon, and nutmeg. Spread evenly into the prepared pan. In the same bowl, stir together the oats, flour and sugar. Rub in the butter between your fingers until the mixture resembles coarse crumbs. Sprinkle over the top of the fruit. 3. Bake for 45 minutes in the preheated oven, or until the apples are soft. Let stand 10 minutes before serving. Serve warm or at room temperature.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "296"
},
{
  "url": "https://www.allrecipes.com/recipe/268727/christmas-pomegranate-salad/",
  "name": "Christmas Pomegranate Salad",
  "rating": "4.9",
  "ratingcount": "7",
  "ingredients": "3 cups leafy salad green mix; ½ cup pomegranate seeds; ⅓ cup crumbled blue cheese; ¼ cup crushed walnuts; ¼ cup cranberry vinaigrette",
  "directions": "1. Toss leafy greens, pomegranate seeds, blue cheese, and walnuts together in a medium-sized salad bowl. Add cranberry vinaigrette just before serving.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "259"
},
{
  "url": "https://www.allrecipes.com/recipe/9399/pomegranate-jelly/",
  "name": "Pomegranate Jelly",
  "rating": "4.5",
  "ratingcount": "52",
  "ingredients": "7 ½ cups white sugar; 4 cups pomegranate juice; 2  lemons, juiced; 1 (6 fluid ounce) container liquid pectin",
  "directions": "1. Combine sugar and pomegranate and lemon juices in a large stainless steel saucepan. Bring to boil over high heat; at once, stir in liquid pectin. Bring to a full rolling boil and boil for exactly 30 seconds. Remove from heat and skim off foam. 2. Ladle into hot, sterilized jars to within about 1/4 inch of the top. Seal, then process in a boiling water canner for 5 minutes.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "44"
},
{
  "url": "https://www.allrecipes.com/recipe/214977/pomegranate-molasses-barbecue-sauce/",
  "name": "Pomegranate Molasses Barbecue Sauce",
  "rating": "4.8",
  "ratingcount": "6",
  "ingredients": "1 ½ tablespoons dark soy sauce; 2 tablespoons ketchup; 2 tablespoons pomegranate molasses; 2 tablespoons honey; 1 tablespoon sunflower seed oil; 1 teaspoon smooth mustard; 1 clove garlic, minced; ¼ teaspoon sea salt; ¼ teaspoon coarsely ground black pepper; ¼ teaspoon ground paprika",
  "directions": "1. In a bowl, stir together soy sauce, ketchup, pomegranate molasses, honey, sunflower seed oil, mustard, garlic, sea salt, black pepper, and paprika to make a smooth paste.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "38"
},
{
  "url": "https://www.allrecipes.com/recipe/222191/lamb-braised-in-pomegranate/",
  "name": "Lamb Braised in Pomegranate",
  "rating": "4.8",
  "ratingcount": "41",
  "ingredients": "3 pounds lamb shoulder blade chops; salt and freshly ground pepper to taste; 1 tablespoon vegetable oil; 1  onion, sliced; 1 pinch salt; 4 cloves garlic, sliced; 2 cups pomegranate juice; ⅓ cup aged balsamic vinegar; 8  fresh mint leaves; ¼ teaspoon dried rosemary; ¼ teaspoon red pepper flakes; 1 tablespoon honey, or more to taste; 2 tablespoons pomegranate seeds; 1 tablespoon sliced fresh mint leaves; 1 tablespoon pumpkin seeds",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Generously season lamb chops with salt and black pepper. 3. Heat vegetable oil in a Dutch oven over high heat. Place lamb chops in Dutch oven and cook until browned on all sides, about 8 minutes. Transfer lamb to a plate and reduce heat to medium. 4. Stir onion and a pinch of salt into the Dutch oven; cook until onions are slightly golden, about 3 minutes. Stir in garlic and cook for 30 seconds. 5. Pour pomegranate juice into the Dutch oven and scrape any browned bits off of the bottom of the pot. Pour in balsamic vinegar, increase heat to high, and bring to a boil. 6. Stir mint leaves, rosemary, and red pepper flakes into pomegranate juice mixture. Continue to boil until liquid is reduced by half, about 10 minutes. Return lamb and any accumulated juices to the Dutch oven, spoon pomegranate mixture over lamb, and cover. 7. Cook in the preheated oven until lamb is fork tender, about 2 hours. 8. Transfer lamb to a plate and set the Dutch oven on the stovetop over high heat. Bring pomegranate mixture to a boil; cook, skimming any fat that accumulates, until liquid is reduced by 1/3, about 5 minutes. 9. Stir in honey and season with salt and black pepper. Return lamb to the Dutch oven; stir to combine. Garnish with pomegranate seeds, sliced mint leaves, and pumpkin seeds.",
  "prep": "15 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 45 mins",
  "calories": "546"
},
{
  "url": "https://www.allrecipes.com/recipe/260447/middle-eastern-rice-pilaf-with-pomegranate/",
  "name": "Middle Eastern Rice Pilaf with Pomegranate",
  "rating": "5.0",
  "ratingcount": "4",
  "ingredients": "2 tablespoons olive oil; 1  onion, finely chopped; 1 cup long-grain rice; 2 ¼ cups hot vegetable broth; 4  saffron threads; 1 pinch ground allspice; 3 tablespoons unsalted shelled pistachios; 1 tablespoon butter; 1 large pomegranate, peeled and seeds separated; salt and freshly ground black pepper",
  "directions": "1. Heat oil in a saucepan over medium heat and cook onion until soft and translucent. Add rice and toast until fragrant, 2 to 3 minutes. Pour in hot vegetable broth and bring to a boil. Add saffron and allspice, reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, about 20 minutes. 2. Toast pistachios in a skillet over medium heat until nuts start to turn golden brown and become fragrant, 5 to 10 minutes. Set aside. 3. Stir butter into the cooked rice. Remove from heat and mix in pistachios and pomegranate seeds. Fluff with fork and season with salt and pepper.",
  "prep": "10 mins",
  "cook": "25 mins",
  "total": "35 mins",
  "calories": "376"
},
{
  "url": "https://www.allrecipes.com/recipe/213165/pear-and-pomegranate-salad/",
  "name": "Pear and Pomegranate Salad",
  "rating": "4.4",
  "ratingcount": "75",
  "ingredients": "3 cups green leaf lettuce, rinsed and torn; 1  Bartlett or Anjou pear; ⅓ cup pomegranate seeds; 1 tablespoon vegetable oil; 2 tablespoons pomegranate juice; 1 tablespoon lemon juice; 1 teaspoon prepared Dijon-style mustard; ½ tablespoon honey; ground black pepper to taste",
  "directions": "1. Divide the lettuce between two bowls. Halve and core the pear, then cut each half in slices. Divide the pear slices and pomegranate seeds among the two bowls and mix gently. 2. Combine the vegetable oil, pomegranate juice, lemon juice, mustard, honey, and pepper in a saucepan. Bring to a boil over high heat; reduce heat and simmer, stirring frequently, until the dressing thickens slightly, about 2 minutes. Pour the warm dressing over the salads and serve.",
  "prep": "10 mins",
  "cook": "2 mins",
  "total": "12 mins",
  "calories": "153"
},
{
  "url": "https://www.allrecipes.com/recipe/56148/spiced-pears-and-pomegranate/",
  "name": "Spiced Pears and Pomegranate",
  "rating": "4.4",
  "ratingcount": "99",
  "ingredients": "3  pears - peeled, cored and cut into wedges; 1  pomegranate, skin and light-colored membrane removed; 1 tablespoon fresh lemon juice; 2 tablespoons light brown sugar; ¼ teaspoon ground nutmeg; ½ teaspoon ground cinnamon; 2 tablespoons finely chopped almonds (Optional); 4 sprigs fresh mint leaves for garnish (Optional)",
  "directions": "1. Place the sliced pears and pomegranate seeds into a bowl. Toss with lemon juice to coat. Combine the brown sugar, nutmeg, and cinnamon in a small cup or bowl, then mix into the fruit. Cover and refrigerate for at least 1 hour before serving to blend the flavors. Serve in individual dishes, and garnish with a sprinkling of chopped almonds and a sprig of mint.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "164"
},
{
  "url": "https://www.allrecipes.com/recipe/235261/heart-healthy-blueberry-smoothie/",
  "name": "Heart Healthy Blueberry Smoothie",
  "rating": "4.0",
  "ratingcount": "10",
  "ingredients": "1 cup blueberries; ¾ cup pomegranate juice; ½ cup low-fat plain Greek-style yogurt; ½ cup skim milk; ½ cup rolled oats; ¼ cup granular sucralose sweetener (such as Splenda®); 1 teaspoon ground cinnamon",
  "directions": "1. Blend blueberries, pomegranate juice, yogurt, milk, oats, sweetener, and cinnamon together in a blender until smooth, about 2 minutes.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "238"
},
{
  "url": "https://www.allrecipes.com/recipe/269274/pavlova-with-winter-fruits/",
  "name": "Pavlova with Winter Fruits",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "4  egg whites, at room temperature; ¾ cup white sugar; ¼ cup superfine sugar; 1 ½ teaspoons cornstarch; ½ teaspoon orange blossom water (Optional); ½ teaspoon white vinegar; 3  lemons, zested and juiced; ⅓ cup white sugar; 4 large egg yolks; 1 pinch sea salt; 3 tablespoons coconut oil, at room temperature; 1 cup heavy cream; 2 tablespoons confectioners' sugar; 1 teaspoon orange blossom water (Optional); 1  pink grapefruit, peeled and sliced crosswise; 1  orange, peeled and sliced crosswise; 1  ripe Fuyu persimmon, peeled and thinly sliced; ½  pomegranate, seeded",
  "directions": "1. Preheat the oven to 250 degrees F (120 degrees C). Line a large baking sheet with parchment paper. Invert a small bowl onto the parchment paper and trace the rim with a pencil. Repeat twice more. Flip parchment paper over. 2. Beat egg whites in a large bowl with an electric mixer until soft peaks begin to form. Gradually add white sugar, with the mixer running. Whisk superfine sugar and cornstarch in a small bowl. Gradually beat into the meringue. Continue beating meringue until stiff, glossy peaks form. Beat in orange blossom water and vinegar. 3. Spoon meringue into the traced circles. Make the borders higher than the center, to leave room for the filling. 4. Bake meringues in the preheated oven until firm and dry to the touch, about 1 hour. 5. Meanwhile, make the lemon curd. Fill a medium saucepan with 1 inch of water and bring to a bare simmer. 6. Whisk lemon juice, lemon zest, sugar, egg yolks, and salt together in a glass bowl. Set the bowl over the simmering water. Cook, whisking constantly, until curd foams, then thickens, about 10 minutes. Remove the bowl from the simmering water. Gradually whisk in coconut oil until melted and incorporated. 7. Strain the curd through a fine-mesh sieve; discard solids left in the strainer. Press a sheet of plastic wrap directly onto the surface to prevent a skin from forming. Transfer to the refrigerator. 8. Turn off oven and keep meringues inside until completely dry, about 1 hour. 9. Combine heavy cream, confectioners' sugar, and orange blossom water in a bowl. Beat with an electric mixer until soft peaks form. 10. Spoon lemon curd into the center of the cooled meringues. Mound whipped cream over the curd. Arrange grapefruit, orange, and persimmon slices on top. Sprinkle pomegranate seeds over the top.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "2 hrs 30 mins",
  "calories": "962"
},
{
  "url": "https://www.allrecipes.com/recipe/141348/pomegranate-martini-ii/",
  "name": "Pomegranate Martini II",
  "rating": "4.6",
  "ratingcount": "18",
  "ingredients": "4 fluid ounces pomegranate juice; 2 fluid ounces cranberry juice cocktail; 2 fluid ounces raspberry vodka; 2 fluid ounces orange-flavored liqueur; 1 fluid ounce grenadine syrup; 1 cup crushed ice",
  "directions": "1. Combine pomegranate juice, cranberry juice, raspberry vodka, orange-flavored liqueur, grenadine syrup, and crushed ice in a shaker. Shake vigorously to chill. Pour into martini glasses, and serve.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/160565/tangy-pomegranate-martini/",
  "name": "Tangy Pomegranate Martini",
  "rating": "4.0",
  "ratingcount": "5",
  "ingredients": "1  lemon twist; 1 tablespoon white sugar; 2 fluid ounces citron vodka; 1 fluid ounce fresh lemon juice; 1 fluid ounce pomegranate juice; 1 ½ fluid ounces simple syrup",
  "directions": "1. Moisten the rim of a chilled martini glass with a twist of lemon. Pour the sugar onto a small plate, and dip the glasses into the sugar. Place the lemon twist in the rimmed glass, and set aside. 2. Pour the vodka, lemon juice, pomegranate juice, and simple syrup into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into the rimmed martini glass to serve.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/85118/pomegranate-stew-with-chicken-khoresh-fesenjan/",
  "name": "Pomegranate Stew with Chicken (Khoresh Fesenjan)",
  "rating": "4.2",
  "ratingcount": "76",
  "ingredients": "2 tablespoons olive oil; 1 ½ pounds chicken legs, cut up; 1  white onion, thinly sliced; ½ pound walnuts, toasted and finely ground in a food processor; 1 teaspoon salt; 4 cups pomegranate juice; ½ teaspoon cardamom (Optional); 2 tablespoons sugar (Optional)",
  "directions": "1. Heat olive oil in a large skillet over medium heat. Place chicken and onions in skillet, and cook 20 minutes, stirring occasionally. Mix in pureed walnuts, salt, pomegranate juice, and cardamom. Bring to a boil. Reduce heat to low, cover, and simmer for 1 1/2 hours, stirring occasionally. (If the sauce becomes too thick, stir in 1/4 cup warm water.) Mix in sugar, adjust seasoning, and simmer 30 minutes more.",
  "prep": "15 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 45 mins",
  "calories": "785"
},
{
  "url": "https://www.allrecipes.com/recipe/217210/homemade-grenadine/",
  "name": "Homemade Grenadine",
  "rating": "4.3",
  "ratingcount": "6",
  "ingredients": "1 cup white sugar; ½ cup pomegranate juice",
  "directions": "1. Pour sugar and pomegranate juice into a sauce pan and warm over low heat, whisking continuously until the sugar dissolves. Cool, pour into a bottle or jar, and store sealed in the refrigerator.",
  "prep": "1 mins",
  "cook": "10 mins",
  "total": "11 mins",
  "calories": "71"
},
{
  "url": "https://www.allrecipes.com/recipe/276187/cranberry-pomegranate-mimosa/",
  "name": "Cranberry-Pomegranate Mimosa",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "2 tablespoons white sugar, or as needed; 3  frozen cranberries; 1 fluid ounce cranberry-pomegranate juice (such as Ocean Spray®); 1 fluid ounce orange juice; 2 fluid ounces champagne",
  "directions": "1. Fill a small plate with 1/4 inch of water. Pour sugar onto a second small plate, making a depth of 1/8 to 1/4 inch. Gently dip the rim of a champagne glass into the water. Raise the glass to allow excess water to drip off, then dip the rim into the sugar. Twist the glass to ensure the entire rim is coated. Discard remaining sugar. 2. Place cranberries in the bottom of the champagne glass. Add cranberry-pomegranate juice, orange juice, and champagne.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "178"
},
{
  "url": "https://www.allrecipes.com/recipe/261792/chef-johns-sweet-potato-biscuits/",
  "name": "Chef John's Sweet Potato Biscuits",
  "rating": "4.8",
  "ratingcount": "13",
  "ingredients": "1 large orange-fleshed sweet potato, peeled; 1 teaspoon salt; 1 tablespoon brown sugar; ½ cup buttermilk; 3 ¼ cups self-rising flour; 1 ½ sticks unsalted butter, frozen; 1 tablespoon melted butter; 4 tablespoons butter, room temperature; 1 teaspoon pomegranate molasses; 1 teaspoon pomegranate juice; Fresh pomegranate seeds for garnish",
  "directions": "1. Cut sweet potato in half lengthwise. Cut each in half again lengthwise, then in half cross-wise. Cut each piece in half to make about 16 evenly sized chunks. Transfer into pot; cover with water and add salt. Bring to a simmer on high heat; reduce heat to medium-low and cook until potatoes are tender, about 17 minutes. Drain thoroughly; return to pot and mash potatoes. You will need 1 1/2 cups mashed sweet potatoes. Cool thoroughly. 2. Transfer cooled mashed potatoes to a mixing bowl. Add brown sugar and buttermilk. Mix together until well combined. 3. Place self-rising flour in a separate mixing bowl. Grate frozen butter into flour, tossing with a fork to coat with flour after each addition of about 1/3 to 1/2 stick. This will prevent butter from clumping. Mixture should look like floury pieces of butter. Add sweet potato mixture. Toss with a fork until evenly distributed, but don't overmix. 4. Transfer mixture onto a lightly floured work surface. Push and press mixture together into a rectangular shape, about 1 1/2 inches thick. Dough will be floury and a bit crumbly. Fold rectangle into thirds, lifting up one-third and folding onto the middle and doing the same with the other side. Dust with a bit of flour if sticking. 5. Preheat oven to 425 degrees F (220 degrees C). Line a rimmed baking sheet with a silicone mat. 6. Press dough into a rectangle again, about 1 inch thick. Repeat the tri-fold step. Press out into a rectangle, about 1 inch thick. Trim off the rough edges to square off the sides; this will maximize rising. Cut into 8 equal portions. Transfer to prepared baking pan, spacing biscuits evenly. Brush tops lightly with 1 tablespoon melted butter. 7. Bake in preheated oven until browned, 20 to 25 minutes. Cool slightly before serving. 8. Mix 4 tablespoons butter (room temperature), pomegranate syrup, and pomegranate juice together in a small bowl. Spread on warm biscuits. Sprinkle with a few pomegranate seeds for garnish.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "459"
},
{
  "url": "https://www.allrecipes.com/recipe/130578/holiday-cranberry-pomegranate-sauce/",
  "name": "Holiday Cranberry-Pomegranate Sauce",
  "rating": "4.6",
  "ratingcount": "31",
  "ingredients": "1 (12 ounce) bag fresh cranberries, rinsed and sorted; 1 cup white sugar; 1 cup orange juice; 1 teaspoon orange zest; ¼ teaspoon ground cloves; 2  cinnamon sticks; 1  pomegranate, peeled and seeds separated",
  "directions": "1. Mix the cranberries, sugar, orange juice, orange zest, ground cloves, and cinnamon sticks together in a saucepan. Bring to a boil. Lower heat to medium, and simmer for 10 minutes, stirring constantly. Remove from the heat and cool. 2. Stir the pomegranate seeds into the cranberry mixture, and refrigerate at least 8 hours or overnight. Remove the cinnamon sticks before serving.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "8 hrs 35 mins",
  "calories": "49"
},
{
  "url": "https://www.allrecipes.com/recipe/130639/cranberry-pomegranate-sauce/",
  "name": "Cranberry Pomegranate Sauce",
  "rating": "4.5",
  "ratingcount": "15",
  "ingredients": "2 large tart apples; 2  pomegranates, peeled and seeds separated; 1 (16 fl oz) bottle pomegranate juice; 2 cups white sugar; 2 large  oranges; 2 (12 ounce) bags fresh cranberries, rinsed and sorted; 1 cup pecans, chopped",
  "directions": "1. Peel and core apples, and put peelings and cores in a small saucepan with pomegranate seeds, 1/2 cup juice, and 1/2 cup sugar. Bring to a boil, and then reduce heat to simmer. Cook for 30 minutes. 2. Chop the peeled apples, and place in a large saucepan. Remove zest from half of one orange, chop very fine, and add to apples. Peel oranges, chop coarsely, and add to pan along with cranberries and remaining juice and sugar. Bring to a boil, reduce heat to simmer, and cook for 30 minutes. 3. Remove small pan from heat, and strain juice into larger pan. Cool solids slightly, and then push though a sieve to remove seeds and peels, adding remaining pulp to larger pan. Stir in nuts, if desired. Cook about 10 minutes longer. Serve warm, room temperature, or chilled.",
  "prep": "30 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "150"
},
{
  "url": "https://www.allrecipes.com/recipe/237763/pomegranate-grenadine/",
  "name": "Pomegranate Grenadine",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "4 cups pomegranate juice, divided; 1 cup white sugar",
  "directions": "1. Combine 3 cups pomegranate juice and sugar together in a saucepan; heat to 244 degrees F (118 degrees C) or until a small amount of mixture dropped into cold water forms a firm ball. Remove saucepan from heat and cover with a lid; let cool until pan is cool enough to touch. Stir remaining 1 cup pomegranate juice into mixture. Refrigerate.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "55 mins",
  "calories": "44"
},
{
  "url": "https://www.allrecipes.com/recipe/235260/smokey-butternut-squash-soup/",
  "name": "Smokey Butternut Squash Soup",
  "rating": "3.7",
  "ratingcount": "3",
  "ingredients": "1  butternut squash - peeled and cut into cubes, seeds removed and reserved; ½  shallot, diced; 3 tablespoons canola oil, divided; 2 teaspoons smoked paprika; 1 ½ teaspoons chili powder; 1 ½ teaspoons chipotle chile powder; 1 teaspoon minced fresh ginger; salt and ground black pepper to taste; 6  fresh Brussels sprouts, cored and separated into leaves; 2 tablespoons maple syrup; 1 ½ cups almond milk; ¼ cup crumbled goat cheese, or to taste; seeds of 1 pomegranate",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Line a roasting pan with a large sheet of aluminum foil. 2. Toss butternut squash, shallot, 2 tablespoons canola oil, paprika, chili powder, chipotle powder, and ginger together in a bowl until evenly mixed and coated. Pour into prepared roasting pan and wrap aluminum foil around squash mixture. 3. Bake in the preheated oven until squash is tender, 30 to 40 minutes. 4. Heat 1 tablespoon canola oil in a cast-iron skillet over medium heat. Cook and stir reserved butternut squash seeds, pinch salt, and pinch ground black pepper in the skillet until lightly toasted, 5 minutes. Add Brussels sprouts leaves and cook, stirring occasionally, until leaves are slightly crispy and seeds are browned, 10 to 15 minutes. Stir maple syrup into seed mixture and immediately remove from heat. 5. Pour butternut squash mixture and almond milk into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until soup is smooth. 6. Pour butternut squash soup into bowls and top with squash seeds and Brussels sprouts mixture, pomegranate seeds, and goat cheese.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/266602/halloumi-three-bean-salad-with-pomegranate-harissa-vinaigrette/",
  "name": "Halloumi Three-Bean Salad with Pomegranate-Harissa Vinaigrette",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "7 ounces halloumi cheese, cut into 1-inch slabs; 2 tablespoons pomegranate vinegar; 1 tablespoon honey; 1 ½ teaspoons harissa, or more to taste; 3 tablespoons olive oil; 1 pinch freshly ground black pepper; 1 cup black beans, drained and rinsed; 1 cup kidney beans, drained and rinsed; 1 cup white beans, drained and rinsed; ⅓ cup chopped red onion; 2 tablespoons chopped fresh mint; 2 tablespoons chopped fresh cilantro",
  "directions": "1. Heat a large nonstick pan over medium-high heat. Cook each halloumi slab on all 4 sides, about 5 minutes. Set aside and allow to cool slightly; cut into 1/4-inch cubes. 2. While cheese is cooking, whisk pomegranate vinegar, honey, harissa, olive oil, and black pepper together in a dressing jar. Set aside. 3. Combine black beans, kidney beans, white beans, onion, mint, and cilantro in a bowl and toss with a spoon. Add cooked halloumi. Drizzle vinaigrette dressing over salad and toss to coat. Cover and allow to sit at room temperature at least 15 minutes.",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "40 mins",
  "calories": "224"
},
{
  "url": "https://www.allrecipes.com/recipe/281968/apple-pomegranate-and-pecan-salad/",
  "name": "Apple, Pomegranate, and Pecan Salad",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "½ cup pomegranate juice; 1 tablespoon balsamic vinegar; 1 teaspoon Dijon mustard; 1 teaspoon honey; ¼ cup canola oil; ⅛ teaspoon salt; ⅛ teaspoon ground black pepper; 2 medium Granny Smith apples, cored and chopped; 1 (5 ounce) package baby spinach; ⅔ cup pomegranate seeds; ⅓ cup candied pecans; ¼ cup crumbled feta cheese",
  "directions": "1. Combine pomegranate juice, balsamic vinegar, Dijon, and honey in the bowl of a food processor; pulse until combined. Keep the blade running and slowly pour canola oil in through the food chute until smooth. Add salt and pepper and set dressing aside. 2. Toss apples, spinach, pomegranate seeds, pecans, and feta cheese together in a large bowl. Drizzle dressing on top and toss until well combined.",
  "prep": "20 mins",
  "cook": "",
  "total": "20 mins",
  "calories": "150"
},
{
  "url": "https://www.allrecipes.com/recipe/159556/spiced-pomegranate-syrup/",
  "name": "Spiced Pomegranate Syrup",
  "rating": "4.0",
  "ratingcount": "5",
  "ingredients": "¾ cup pomegranate juice; ¾ cup Shiraz or other dry red wine; 2 tablespoons fresh lemon juice; 1 ½ teaspoons ground cinnamon; ¼ teaspoon ground nutmeg; ⅛ teaspoon ground cloves; ⅛ teaspoon ground ginger; 1 tablespoon butter; ½ cup packed brown sugar, divided",
  "directions": "1. Combine the pomegranate juice, wine, and lemon juice in a bowl. Whisk in the cinnamon, nutmeg, cloves and ginger. Crumble in half of the brown sugar and whisk mixture until sugar dissolves. 2. Melt the butter in a skillet over medium heat and swirl to coat the pan. Immediately pour in the juice/spice mixture and increase the heat to high. Bring mixture to a boil while whisking to prevent scorching. Reduce heat to medium and, while stirring, add the remaining brown sugar a little at a time. Cook and stir until mixture thickens to a syrupy consistency or when it can coat the back of a spoon. 3. Remove from heat and allow to cool slightly and continue to cool, 5 to 10 minutes. Stir and serve.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "20 mins",
  "calories": "135"
},
{
  "url": "https://www.allrecipes.com/recipe/258360/salmon-with-pomegranate-glaze/",
  "name": "Salmon with Pomegranate Glaze",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "⅓ cup pomegranate juice; 1 tablespoon soy sauce, or to taste; 1 clove garlic, sliced; 4 (6 ounce) fillets salmon; 2 tablespoons olive oil; ½  pomegranate, peeled and seeds separated",
  "directions": "1. Whisk pomegranate juice, soy sauce, and garlic together in a shallow non-reactive bowl until marinade is well mixed. Add salmon and turn to coat. Cover and marinate for 15 minutes. 2. Heat olive oil in a skillet over medium heat; add garlic from the marinade and cook until lightly browned, 1 to 2 minutes. Pour in the marinade and cook until reduced and thickened to a glaze, 4 to 5 minutes. 3. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 4. Cook salmon on the preheated grill until flesh flakes easily with a fork, about 3 minutes per side. Serve salmon topped with glaze and garnished with pomegranate seeds.",
  "prep": "10 mins",
  "cook": "11 mins",
  "total": "36 mins",
  "calories": "395"
},
{
  "url": "https://www.allrecipes.com/recipe/153265/roasted-pork-shoulder-with-pomegranate-sauce/",
  "name": "Roasted Pork Shoulder with Pomegranate Sauce",
  "rating": "4.3",
  "ratingcount": "23",
  "ingredients": "1 (3 pound) bone-in pork shoulder roast; 2 teaspoons minced garlic; kosher salt and ground black pepper to taste; 2  pomegranates with the seeds removed; ½ cup water; 2 tablespoons balsamic vinegar; 2 tablespoons turbinado sugar; ¼ teaspoon ground cinnamon",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Season the pork roast with garlic, kosher salt, and pepper. Place in a roasting pan. 2. Bake the roast for 1 hour in the preheated oven. While the roast is baking, combine the pomegranate seeds and water in a large saucepan. Bring to a boil, then reduce the heat to low and simmer for 20 to 30 minutes, until the pomegranate seeds have broken down and released their juices. Press through a strainer to get as much juice as possible. You should have about 3/4 cup of juice. 3. Pour the juice from the pomegranate into a saucepan and bring to a boil. Simmer over medium heat until reduced by half. Remove from the heat and mix in the balsamic vinegar, sugar, and cinnamon. 4. After the roast has been in the oven for 45 minutes, baste it with pomegranate sauce, using a brush to apply it to the top and sides. Continue to roast the pork, basting every 10 minutes, until the internal temperature has reached 180 degrees F (80 degrees C), about 30 minutes. Remove from the oven, tent with foil, and allow to rest for 20 minutes before carving and serving.",
  "prep": "20 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 55 mins",
  "calories": "490"
},
{
  "url": "https://www.allrecipes.com/recipe/200443/creamy-pomegranate-ice-cream/",
  "name": "Creamy Pomegranate Ice Cream",
  "rating": "3.6",
  "ratingcount": "8",
  "ingredients": "1 cup heavy cream; 1 cup white sugar; 1 cup pomegranate juice; 1 teaspoon vanilla extract; 1 pinch salt",
  "directions": "1. Stir together the heavy cream and sugar. Stir in the pomegranate juice, vanilla extract, and salt. Add the mixture to an ice cream maker and freeze according to the manufacturer's directions.",
  "prep": "5 mins",
  "cook": "",
  "total": "35 mins",
  "calories": "294"
},
{
  "url": "https://www.allrecipes.com/recipe/236576/holiday-pomegranate-mignonette/",
  "name": "Holiday Pomegranate Mignonette",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "3 tablespoons champagne vinegar; 1 tablespoon pomegranate juice; ½  shallot, minced; ½ teaspoon fresh cracked pepper; 1 pinch white sugar; 1 tablespoon pomegranate seeds",
  "directions": "1. Whisk vinegar, pomegranate juice, shallot, pepper, and white sugar together in a bowl until sugar dissolves. Add pomegranate seeds, cover the bowl with plastic wrap, and refrigerate until chilled, about 1 hour.",
  "prep": "10 mins",
  "cook": "",
  "total": "1 hr 10 mins",
  "calories": "14"
},
{
  "url": "https://www.allrecipes.com/recipe/214633/pretty-pomegranate-salad/",
  "name": "Pretty Pomegranate Salad",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "10 ounces fresh baby spinach leaves; 10 ounces arugula leaves; ½  red onion, thinly sliced; 1 (10 ounce) can mandarin oranges, drained; 1  pomegranate, peeled and seeds separated",
  "directions": "1. Place the spinach and arugula leaves into a mixing bowl. Add the onion, mandarin oranges, and pomegranate seeds. Toss gently by hand to mix.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "92"
},
{
  "url": "https://www.allrecipes.com/recipe/270199/freekeh-salad-with-tahini-dressing/",
  "name": "Freekeh Salad with Tahini Dressing",
  "rating": "3.7",
  "ratingcount": "3",
  "ingredients": "1 cup freekeh; 2 cups chicken broth; 3 tablespoons apple cider vinegar; 1 tablespoon tahini; 1 teaspoon honey; 2 tablespoons olive oil; salt and ground black pepper to taste; ½ cup pomegranate seeds; ¼ cup red onion, minced; 2 tablespoons minced fresh mint; 2 tablespoons minced fresh parsley; ½ cup crushed pistachios",
  "directions": "1. Stir freekeh in a medium-sized saucepan over medium-high heat until lightly toasted and fragrant, about 3 minutes. Add broth and bring to a simmer. Cover pan and cook until water is absorbed, about 20 minutes. Remove from heat and let stand 5 minutes. Transfer freekeh to a bowl to cool. 2. Meanwhile, whisk vinegar, tahini, and honey together in a small bowl. Slowly drizzle in olive oil and whisk until combined. Season with salt and pepper. 3. Add pomegranate seeds, onion, mint, and parsley to the bowl with the cooked freekeh. Drizzle in the dressing and toss to coat. Season with additional salt and pepper, if desired. Refrigerate 30 minutes. Top with pistachios right before serving so they don't soften.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "1 hr 10 mins",
  "calories": "258"
},
{
  "url": "https://www.allrecipes.com/recipe/276186/pomegranate-holiday-cocktail/",
  "name": "Pomegranate Holiday Cocktail",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "3 cups ice, or as needed; 2 fluid ounces vodka; 2 fluid ounces pomegranate juice; 1  lime, juiced; ½ fluid ounce orange-flavored liqueur; 2 ½ fluid ounces club soda, or as needed; 1 teaspoon pomegranate seeds, or to taste",
  "directions": "1. Fill 2 highball glasses and a cocktail shaker with ice. 2. Add vodka, pomegranate juice, lime juice, and orange-flavored liqueur to the cocktail shaker and secure the lid. Place one hand on the lid and one hand on the shaker; shake vigorously until the outside of the shaker frosts, about a slow count to 10. 3. Pour evenly into the prepared glasses. Top with soda and pomegranate seeds; stir before serving.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": "120"
},
{
  "url": "https://www.allrecipes.com/recipe/127167/spinach-pomegranate-salad/",
  "name": "Spinach Pomegranate Salad",
  "rating": "4.7",
  "ratingcount": "131",
  "ingredients": "1 (10 ounce) bag baby spinach leaves, rinsed and drained; ½ cup walnut pieces; ½ cup crumbled feta; ¼ medium red onion, sliced very thin; ¼ cup alfalfa sprouts (Optional); ½ cup pomegranate seeds, or to taste; 4 tablespoons balsamic vinaigrette",
  "directions": "1. Place spinach into a salad bowl. Top with walnuts, feta, red onion, alfalfa sprouts, and pomegranate seeds. Drizzle with vinaigrette.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "273"
},
{
  "url": "https://www.allrecipes.com/recipe/24325/pomegranate-relish/",
  "name": "Pomegranate Relish",
  "rating": "4.4",
  "ratingcount": "11",
  "ingredients": "2  pomegranates; 3 tablespoons olive oil; 1  shallot, minced; 1 tablespoon lime juice; salt and pepper to taste; ½ cup fresh cilantro, chopped",
  "directions": "1. Juice the pomegranates retaining the seeds and juice. 2. Heat oil in a small skillet over medium heat. Saute shallots until golden. Stir in pomegranate juice and seeds, lime juice, salt and pepper. Cook for about 3 minutes, or until slightly reduced. Remove from heat and stir in cilantro. 3. Serve at room temperature.",
  "prep": "5 mins",
  "cook": "5 mins",
  "total": "10 mins",
  "calories": "123"
},
{
  "url": "https://www.allrecipes.com/recipe/245346/yummy-pomegranate-vinaigrette-dressing/",
  "name": "Yummy Pomegranate Vinaigrette Dressing",
  "rating": "4.7",
  "ratingcount": "15",
  "ingredients": "1 cup olive oil; 1 cup pomegranate juice; 1 cup rice vinegar; ¼ cup white sugar; 2 tablespoons chopped shallots; 1 ¼ teaspoons chopped garlic; 1 teaspoon ground white pepper; kosher salt to taste",
  "directions": "1. Place olive oil, pomegranate juice, rice vinegar, white sugar, shallots, garlic, white pepper, and salt in a blender. Blend until smooth, about 2 minutes.",
  "prep": "15 mins",
  "cook": "",
  "total": "15 mins",
  "calories": "108"
},
{
  "url": "https://www.allrecipes.com/recipe/49450/khoresht-fesenjaan-chicken-with-pomegranate-sauce/",
  "name": "Khoresht Fesenjaan (Chicken with Pomegranate Sauce)",
  "rating": "3.8",
  "ratingcount": "25",
  "ingredients": "½ cup vegetable oil; 4 medium red onions, thinly sliced; 3 pounds bone-in chicken pieces; 2 cups hot water or as needed; 2 ½ cups pomegranate juice; 4 cups chopped walnuts; 2 tablespoons freshly ground cardamom; 2 tablespoons ground cinnamon; 1 medium butternut squash, seeded and cubed; ¼ teaspoon saffron powder; 1 teaspoon salt, or to taste",
  "directions": "1. Heat the oil in a large heavy skillet over medium heat. Stir in sliced onions; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more. 2. Raise heat to medium-high. Add chicken pieces, and fry until lightly browned on the outside. Pour in the water, and bring to a boil. Reduce heat to low and simmer for about 30 minutes, adding more water if necessary to keep the mixture from drying out. 3. Preheat the oven to 325 degrees F (65 degrees C). 4. Combine the walnuts and pomegranate juice in the container of a blender or food processor. Process into liquid. (This can be done in small batches if necessary.) Add walnut-pomegranate mixture to the simmering chicken. Season with cardamom, cinnamon, saffron powder, and salt. Stir in the cubed squash. Transfer the entire mixture to a 9x13-inch baking dish. 5. Bake, loosely covered, for 2 1/2 hours in the preheated oven. Serve with white rice.",
  "prep": "20 mins",
  "cook": "3 hrs 30 mins",
  "total": "3 hrs 50 mins",
  "calories": "743"
},
{
  "url": "https://www.allrecipes.com/recipe/101839/joans-pomegranate-martini/",
  "name": "Joan's Pomegranate Martini",
  "rating": "4.0",
  "ratingcount": "5",
  "ingredients": "1 (1.5 fluid ounce) jigger pomegranate juice; 3 fluid ounces citron vodka; 1 fluid ounce orange-flavored liqueur; 1 cup crushed ice; 1 fluid ounce sparkling water; 1 wedge fresh lemon; pomegranate seeds",
  "directions": "1. Combine pomegranate juice, vodka, orange liqueur, and ice in a shaker. Add sparkling water and a little lemon juice, if desired. Shake vigorously, and strain into a martini glass. Garnish with pomegranate seeds.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/114500/tres-chic-pomegranate-martini/",
  "name": "Tres Chic Pomegranate Martini",
  "rating": "4.5",
  "ratingcount": "6",
  "ingredients": "1 cup crushed ice; 1 (1.5 fluid ounce) jigger vodka; 1 (1.5 fluid ounce) jigger pomegranate juice; 1 wedge fresh lime; 1 tablespoon rimming sugar; 3 fluid ounces club soda; 1 slice fresh lime",
  "directions": "1. Combine crushed ice, vodka, and pomegranate juice in a shaker, Squeeze juice of lime wedge into mixture. Shake vigorously, and set aside. 2. Using the same lime wedge, wet the edge of a martini glass. Dip edge of glass into sugar. Strain liquid into glass, and top with club soda. Garnish with a slice of lime.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/277227/spinach-and-persimmon-salad-with-goat-cheese-and-pomegranate/",
  "name": "Spinach and Persimmon Salad with Goat Cheese and Pomegranate",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "1  Fuyu persimmon, peeled and cored; 2 cups roughly chopped spinach; 3 tablespoons pomegranate seeds; 2 ounces goat cheese, crumbled; 1 tablespoon sliced almonds; 2 tablespoons extra virgin olive oil; 1 tablespoon orange juice; ½ tablespoon lemon juice; ½ teaspoon Dijon mustard; salt and freshly ground pepper to taste",
  "directions": "1. Slice persimmon into 1/4-inch rounds, then slice each round into quarters. 2. Place chopped spinach into a salad bowl. Top with persimmon quarters, pomegranate seeds, goat cheese, and sliced almonds. 3. Whisk together olive oil, orange juice, lemon juice, Dijon mustard, salt, and pepper in a small bowl. Drizzle vinaigrette over salad and toss lightly to coat. Serve immediately.",
  "prep": "20 mins",
  "cook": "",
  "total": "20 mins",
  "calories": "287"
},
{
  "url": "https://www.allrecipes.com/recipe/245726/persimmon-pomegranate-and-massaged-kale-salad/",
  "name": "Persimmon, Pomegranate, and Massaged Kale Salad",
  "rating": "4.0",
  "ratingcount": "1",
  "ingredients": "½ cup raw macadamia nuts; 2 tablespoons maple syrup, divided; 1 pinch salt; ¼ cup orange juice; 2 tablespoons lemon juice; 1 tablespoon maple syrup; ground black pepper to taste; 2 bunches kale, stemmed and torn into pieces; 1 tablespoon olive oil; ½ teaspoon salt; 1  ripe Fuyu persimmon, peeled and thinly sliced; ¼ cup pomegranate seeds",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper. 2. Toss macademia nuts with 1 tablespoon maple syrup and pinch of salt; spread on baking sheet. 3. Toast macademia nuts in the preheated oven until lightly golden, about 5 minutes. Remove from oven and coat with 1 tablespoon maple syrup. 4. Whisk orange juice, lemon juice, 1 tablespoon maple syrup, and ground black pepper together in a small bowl to make dressing. 5. Place kale pieces, 1 tablespoon olive oil, and 1/2 teaspoon salt in a large bowl; massage with your hands until kale is tender, 3 to 5 minutes. Add persimmon slices and dressing and toss to mix. Top with pomegranate seeds and maple-roasted macademia nuts.",
  "prep": "25 mins",
  "cook": "5 mins",
  "total": "30 mins",
  "calories": "326"
},
{
  "url": "https://www.allrecipes.com/recipe/140558/pomegranate-martini/",
  "name": "Pomegranate Martini",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "1 cup ice; 1 (1.5 fluid ounce) jigger vanilla flavored vodka; 1 (1.5 fluid ounce) jigger peach schnapps; 1 (1.5 fluid ounce) jigger pomegranate juice; 1 tablespoon simple syrup; 1 teaspoon lemon juice; ⅓ tablespoon lemon-lime soda; 1 slice fresh lime",
  "directions": "1. Combine ice, vodka, schnapps, pomegranate juice, simple syrup, and lemon juice in shaker. Shake vigorously to chill. Pour into martini glass, top with a splash of chilled lemon-lime soda, and garnish glass with a slice of fresh lime.",
  "prep": "5 mins",
  "cook": "",
  "total": "5 mins",
  "calories": ""
}]