[{
  "url": "https://www.allrecipes.com/recipe/268514/instant-pot-dr-pepper-pulled-pork/",
  "name": "Instant Pot Dr Pepper Pulled Pork",
  "rating": "4.7",
  "ratingcount": "13",
  "ingredients": "4 cups caffeinated pepper-type soda (such as Dr Pepper®); 2 cups barbeque sauce (such as Sweet Baby Ray's®), divided; 1 pound pork tenderloin; 4  hamburger buns; 2 cups prepared coleslaw (Optional)",
  "directions": "1. Combine soda and 1/2 cup barbeque sauce in a multi-functional pressure cooker (such as Instant Pot). Add pork tenderloin. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 50 minutes. Allow 10 to 15 minutes for pressure to build. 2. Release pressure using the natural-release method according to manufacturer's instructions, 10 to 40 minutes. 3. Remove pork loin and drain liquid from the pot. Shred pork using 2 forks. Return to the pot and mix in remaining 1 1/2 cups barbeque sauce. 4. Serve on hamburger buns and top with coleslaw.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "627"
},
{
  "url": "https://www.allrecipes.com/recipe/245210/prosciutto-wrapped-pork-tenderloin-with-crispy-sage/",
  "name": "Prosciutto-Wrapped Pork Tenderloin with Crispy Sage",
  "rating": "4.7",
  "ratingcount": "13",
  "ingredients": "1 pound pork tenderloin; salt and ground black pepper to taste; 1 bunch fresh sage, leaves removed and stems discarded, divided; 6 ounces prosciutto; 1 tablespoon olive oil, or more as needed",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Lightly season pork with salt and black pepper. Arrange about 6 sage leaves over tenderloin. Wrap prosciutto around tenderloin and sage, overlapping prosciutto slightly; wrap in plastic wrap and refrigerate to allow prosciutto to set on pork tenderloin, 5 to 10 minutes. Remove plastic wrap. 3. Heat olive oil in a skillet over medium heat. Fry wrapped tenderloin in the hot oil until prosciutto is crispy and lightly browned on all sides, 8 to 10 minutes. Transfer wrapped tenderloin to a baking dish, reserving oil in the skillet. 4. Bake tenderloin in the preheated oven until pork is cooked through, about 20 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). 5. Heat reserved oil in the skillet over medium heat; fry remaining sage leaves until crispy, adding more oil as needed, about 5 minutes. 6. Slice tenderloin and serve with crispy sage leaves.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "294"
},
{
  "url": "https://www.allrecipes.com/recipe/16449/rosemary-pork-roast/",
  "name": "Rosemary Pork Roast",
  "rating": "4.4",
  "ratingcount": "209",
  "ingredients": "3 pounds pork tenderloin; 1 tablespoon olive oil; 2 cloves garlic, minced; 3 tablespoons dried rosemary",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Rub the roast OR tenderloin liberally with olive oil, then spread the garlic over it. Place it in a 10x15 inch roasting pan and sprinkle with the rosemary. 3. Bake at 375 degrees F (190 degrees C) for 2 hours, or until the internal temperature of the pork reaches 145 degrees F (63 degrees C).",
  "prep": "20 mins",
  "cook": "2 hrs",
  "total": "2 hrs 20 mins",
  "calories": "299"
},
{
  "url": "https://www.allrecipes.com/recipe/238401/pepper-jelly-pork/",
  "name": "Pepper Jelly Pork",
  "rating": "4.6",
  "ratingcount": "40",
  "ingredients": "2 teaspoons chili powder; 1 teaspoon freshly ground black pepper; 1 teaspoon ground cumin; ½ teaspoon salt; 1  pork tenderloin; ¼ cup hot pepper jelly; 2 tablespoons balsamic vinegar",
  "directions": "1. Preheat oven to 450 degrees F (230 degrees C). 2. Whisk chili powder, black pepper, ground cumin, and salt together in a small bowl. Rub spice mixture onto all sides of pork tenderloin. Place tenderloin in a shallow roasting pan. 3. Roast tenderloin in the preheated oven until no longer pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read 150 degrees F (65 degrees C). 4. Stir pepper jelly and balsamic vinegar together in a saucepan over low heat until jelly is completely melted, 1 to 2 minutes. Brush pepper jelly mixture over pork tenderloin and continue to bake tenderloin until jelly coating is hot, about 5 minutes more. Let pork rest for 5 minutes before slicing.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "161"
},
{
  "url": "https://www.allrecipes.com/recipe/8420615/pork-tenderloin-with-peaches/",
  "name": "Pork Tenderloin with Peaches",
  "rating": "4.0",
  "ratingcount": "4",
  "ingredients": "3 slices bacon; 1 (2 pound) package pork tenderloin; ½ teaspoon salt; ¼ teaspoon freshly ground black pepper; ¾ teaspoon ground ginger, divided; 1 ½ cups vertically sliced onion; 1 ½ teaspoons minced garlic; 2 cups peeled and sliced fresh peaches; 1 cup low-sodium chicken broth; 2 tablespoons frozen orange juice concentrate; 1 teaspoon fish sauce; 2 tablespoons water; 2 tablespoons cornstarch; fresh parsley for garnish (optional)",
  "directions": "1. Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned and crisp, about 10 minutes. Drain bacon slices on paper towels. Reserve drippings in the skillet. 2. Dry pork tenderloin with paper towels and season both sides with salt, pepper, and 1/4 teaspoon ground ginger. 3. Increase heat to medium-high and brown tenderloin in the bacon drippings on all sides, 5 to 7 minutes. Removed browned tenderloin from skillet, transfer to a plate, and keep warm. 4. Reduce heat to medium. Add onion slices to the same skillet and stir until onions are soft and beginning to take on some color, 3 to 5 minutes. Stir in garlic and cook until fragrant, about 1 minute. 5. Add sliced peaches, chicken broth, orange juice concentrate, and remaining ground ginger. Bring to a boil and return tenderloin to the skillet. Pile peaches on top of the meat, cover, reduce heat to simmer, and cook until pork is slightly pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). 6. Arrange pork and peaches on a serving platter. 7. Meanwhile, combine fish sauce, water, and cornstarch in a small bowl and stir until there are no lumps. Increase heat to medium and bring skillet contents back to a boil. Add cornstarch mixture to the liquid in the skillet and stir quickly until sauce is bubbly and thickened, about 5 minutes. 8. Pour sauce over pork and peaches. Crumble up cooked bacon and sprinkle over the peaches. Garnish with parsley, if desired, and serve warm.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "200"
},
{
  "url": "https://www.allrecipes.com/recipe/14726/grilled-pork-tenderloin/",
  "name": "Grilled Pork Tenderloin",
  "rating": "4.7",
  "ratingcount": "411",
  "ingredients": "2 (1 pound) pork tenderloins; 1 teaspoon garlic powder; 1 teaspoon salt; 1 teaspoon ground black pepper; 1 cup barbecue sauce, divided",
  "directions": "1. Preheat an outdoor grill for medium, indirect heat and lightly oil the grate. 2. Season tenderloins with garlic powder, salt, and pepper. Place 1/2 of the barbecue sauce into a small bowl for basting; set aside remaining barbecue sauce for serving. 3. Cook pork on the preheated grill over indirect heat for 30 minutes. Brush pork with barbecue sauce, turn, and brush again, using all sauce in the small bowl. Continue cooking until an instant-read thermometer inserted into the center reads 145 degrees F (63 degrees C), about 15 more minutes. Let pork rest for 10 minutes. 4. Slice pork and serve with reserved barbecue sauce.",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "185"
},
{
  "url": "https://www.allrecipes.com/recipe/16362/burgundy-pork-tenderloin/",
  "name": "Burgundy Pork Tenderloin",
  "rating": "4.3",
  "ratingcount": "1",
  "ingredients": "2 pounds pork tenderloin; ½ teaspoon salt; ½ teaspoon ground black pepper; ½ teaspoon garlic powder; ½  onion, thinly sliced; 1 stalk celery, chopped; 2 cups red wine; 1 (.75 ounce) packet dry brown gravy mix",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Place pork in a 9x13 inch baking dish, and sprinkle meat with salt, pepper and garlic powder. Top with onion and celery, and pour wine over all. 3. Bake in the preheated oven for 45 minutes. 4. When done baking, remove meat from baking dish, and place on a serving platter. Pour gravy mix into baking dish with wine and cooking juices, and stir until thickened. Slice meat, and cover with the gravy.",
  "prep": "30 mins",
  "cook": "1 hr",
  "total": "1 hr 30 mins",
  "calories": "400"
},
{
  "url": "https://www.allrecipes.com/recipe/8529787/air-fryer-pork-tenderloin-with-sweet-potatoes/",
  "name": "Air Fryer Pork Tenderloin with Sweet Potatoes",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "¼ cup olive oil, plus more for greasing; ½ cup pineapple preserves; ½ teaspoon granulated garlic; ½ teaspoon cayenne pepper; 1 teaspoon salt, or to taste; ½ teaspoon freshly ground white pepper, or to taste; 1 ½ pounds sweet potatoes, cut into 1-inch pieces; 2 ½ pounds pork tenderloins",
  "directions": "1. Preheat air fryer to 390 degrees F (200 degrees C), if recommended by manufacturer. 2. Combine olive oil, pineapple preserves, garlic granules, cayenne, salt, and white pepper in a large mixing bowl; stir to combine. 3. Place sweet potato pieces into the mixing bowl and toss with the pineapple preserves mixture. Remove sweet potatoes to a plate, reserving the remaining pineapple mixture. 4. Pat tenderloins dry with paper towels. Place in the mixing bowl with the remaining pineapple mixture and toss to coat. 5. Brush interior basket of the air fryer with the remaining olive oil. Place tenderloins in the basket, and in a single layer, add as many sweet potato pieces as will fit around the tenderloins. Set aside extra sweet potato pieces. You will cook them as a second batch. 6. Air fry for 10 minutes. Turn tenderloins over, browned side down. Stir sweet potatoes, but keep them in a single layer. Air fry until pork loin is slightly pink in the center, about 10 minutes longer. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). If the tenderloins need more cooking time, turn them again and continue cooking and testing the temperature in 5 minute increments. 7. Remove sweet potatoes from the air fryer when they are tender and caramelized. (See Cook's Note). 8. When the tenderloins test done, place them on a platter and tent with foil. Allow to rest while the remaining sweet potatoes cook, about 10 more minutes.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "472"
},
{
  "url": "https://www.allrecipes.com/recipe/14495/marinated-pork-tenderloin/",
  "name": "Marinated Pork Tenderloin",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "¼ cup soy sauce; ¼ cup packed brown sugar; 2 tablespoons sherry; 1 ½ teaspoons dried minced onion; 1 teaspoon ground cinnamon; 2 tablespoons olive oil; 1 pinch garlic powder; 2 (3/4 pound) pork tenderloins",
  "directions": "1. Place soy sauce, brown sugar, sherry, dried onion, cinnamon, olive oil, and a touch of garlic powder in a large resealable plastic bag. Seal, and shake to mix. Place pork in bag with marinade, seal, and refrigerate for 6 to 12 hours. 2. Preheat grill for high heat. 3. Lightly oil grate. Place tenderloins on grill, and discard marinade. Cook 20 minutes, or to desired doneness. Slice into medallions, and serve.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "6 hrs 30 mins",
  "calories": "278"
},
{
  "url": "https://www.allrecipes.com/recipe/141678/slow-cooker-pulled-pork/",
  "name": "Slow Cooker Pulled Pork",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "1 (2 pound) pork tenderloin; 1 (12 fluid ounce) can or bottle root beer; 1 (18 ounce) bottle your favorite barbecue sauce; 8  hamburger buns, split and lightly toasted",
  "directions": "1. Place pork tenderloin in a slow cooker; pour root beer over top. Cover and cook on Low until pork shreds easily, 6 to 7 hours. Note: the actual length of time may vary according to the individual slow cooker. 2. Drain well. Stir in barbecue sauce. Serve on hamburger buns.",
  "prep": "10 mins",
  "cook": "6 hrs",
  "total": "6 hrs 10 mins",
  "calories": "335"
},
{
  "url": "https://www.allrecipes.com/recipe/8465712/balsamic-braised-pork-tenderloins-with-fresh-figs/",
  "name": "Balsamic Braised Pork Tenderloins with Fresh Figs",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "2 (1 1/2 pound) pork tenderloins; 1 teaspoon kosher salt, or to taste; ½ teaspoon freshly ground black pepper, or to taste; 2 tablespoons olive oil; 2  shallots, thinly sliced lengthwise; 12  fresh figs, stemmed and halved; 1 cup chicken broth; ¼ cup good-quality balsamic vinegar; 1 tablespoon minced fresh rosemary; fresh rosemary sprigs for garnish (optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Pat tenderloins dry and remove silver skin, if present. Season with kosher salt and freshly ground pepper, to taste. 3. Pour oil into a large, oven-proof skillet and heat over medium-heat until oil shimmers. Carefully place seasoned tenderloins into the hot oil and brown on all sides, 7 to 10 minutes total. 4. Add sliced shallots around tenderloins and stir, about 1 minute. Add figs, chicken broth, and balsamic vinegar. When the mixture begins to bubble, sprinkle minced rosemary over everthing. 5. Cover, place in the preheated oven and bake until pork is no longer pink in the center, 25 to 30 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). 6. Using tongs, remove pork from the skillet and place on a serving platter. With a slotted spoon, remove figs from the skillet and place around the tenderloins. Cover loosely with foil. 7. Place skillet back onto the stovetop over medium-high heat. Bring pan juices to a boil and allow to reduce to about 3/4 cup, 10 to 15 minutes. 8. Slice tenderloins, drizzle reduced liquid over the meat, and garnish with fresh rosemary sprigs, if desired.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "307"
},
{
  "url": "https://www.allrecipes.com/recipe/232681/char-siu-chinese-bbq-pork/",
  "name": "Char Siu (Chinese BBQ Pork)",
  "rating": "4.5",
  "ratingcount": "114",
  "ingredients": "½ cup soy sauce; ⅓ cup honey; ⅓ cup ketchup; ⅓ cup brown sugar; ¼ cup Chinese rice wine; 2 tablespoons hoisin sauce; 2 tablespoons red bean curd (Optional); 1 teaspoon Chinese five-spice powder (Optional); 2 (1 pound) pork tenderloins",
  "directions": "1. Gather all ingredients. 2. Stir soy sauce, honey, ketchup, brown sugar, rice wine, hoisin sauce, red bean curd, and five-spice powder together in a saucepan over medium-low heat. Cook and stir until just combined and slightly warm, 2 to 3 minutes. 3. Meanwhile, slice each pork tenderloin lengthwise into 1 1/2- to 2-inch-thick strips. Place pork strips in a large, resealable plastic bag. 4. Pour marinade into the bag with the pork. Squeeze air from the bag, seal, and turn the bag a few times until pork is well coated. Marinate in the refrigerator, 2 hours to overnight. 5. When ready to cook, preheat a charcoal grill for medium-high heat and lightly oil the grate. 6. Remove pork from marinade and shake to remove excess liquid. Set aside the remaining marinade for basting. 7. Rake the hot coals into two equal piles on opposite sides of the charcoal grate. Add a small container of water to the grate. Place pork strips in the center of the grate for indirect cooking. 8. Cook pork over indirect heat, turning regularly and basting as desired, until an instant-read thermometer inserted into the center reads at least 145 degrees F (63 degrees C), 30 minutes or longer. 9. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "2 hrs 45 mins",
  "calories": "483"
},
{
  "url": "https://www.allrecipes.com/recipe/83117/asian-pork-tenderloin/",
  "name": "Asian Pork Tenderloin",
  "rating": "4.6",
  "ratingcount": "440",
  "ingredients": "1 (2 pound) fat-trimmed pork tenderloin; ⅓ cup lite soy sauce; ¼ cup sesame oil; 2 tablespoons Worcestershire sauce; 3  green onions, chopped; 4 cloves garlic, crushed; 2 tablespoons packed light brown sugar; 1 ½ tablespoons Asian chile paste; 1 ½ teaspoons pepper",
  "directions": "1. Place pork tenderloin in a shallow dish. 2. Pour soy sauce, sesame oil, and Worcestershire sauce into a medium bowl. Whisk in green onions, garlic, brown sugar, chile paste, and pepper until combined. Pour sauce over tenderloin, turning meat a few times to coat. Cover the dish and marinate in the refrigerator for 8 hours to overnight. 3. Preheat the oven to 450 degrees F (230 degrees C). 4. Transfer pork tenderloin with marinade into an aluminum foil-lined baking pan. 5. Roast in the preheated oven until an instant-read thermometer inserted into the center reads at least 145 degrees F (63 degrees C), 25 to 30 minutes. Allow to stand 5 to 10 minutes before carving.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "8 hrs 40 mins",
  "calories": "385"
},
{
  "url": "https://www.allrecipes.com/recipe/228630/slow-cooker-pork-and-sauerkraut/",
  "name": "Slow Cooker Pork and Sauerkraut",
  "rating": "4.5",
  "ratingcount": "129",
  "ingredients": "1 (1 pound) whole pork tenderloin; 1 (24 ounce) bag baby potatoes, unpeeled (Optional); 1 (20 ounce) can sauerkraut, undrained; 1 cup water, or more as needed; ¼ cup butter, cubed; salt and ground black pepper to taste",
  "directions": "1. Gather all ingredients. 2. Place whole pork tenderloin into a slow cooker. Arrange potatoes around pork; pour sauerkraut and juice over pork and potatoes. Add 1 cup water, butter cubes, salt, and black pepper. 3. Cook on Low until pork is tender, 8 to 10 hours. Add more water after 8 hours if mixture seems dry.",
  "prep": "10 mins",
  "cook": "8 hrs",
  "total": "8 hrs 10 mins",
  "calories": "358"
},
{
  "url": "https://www.allrecipes.com/recipe/246028/roasted-pork-banh-mi-vietnamese-sandwich/",
  "name": "Roasted Pork Bánh Mì (Vietnamese Sandwich)",
  "rating": "4.9",
  "ratingcount": "35",
  "ingredients": "¼ cup julienned (2-inch matchsticks) daikon radish; ¼ cup julienned (2-inch matchsticks) carrots; 1 tablespoon seasoned rice vinegar; ¼ cup mayonnaise; 1 teaspoon hoisin sauce, or to taste; 1 teaspoon sriracha hot sauce, or more to taste; 1  crusty French sandwich roll; 4 ounces cooked pork roast, thinly sliced; 2 ounces smooth pate, thinly sliced; 6 thin spears English cucumber, diced; 6 thin slices  jalapeno pepper, or more to taste; ¼ cup cilantro leaves",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil. 2. Toss radish and carrot with seasoned rice vinegar in a bowl until well coated. Let sit until veggies become slightly limp, 15 to 20 minutes. Drain and set aside or refrigerate. 3. Mix mayonnaise, hoisin sauce, and sriracha in a small bowl. 4. Split French roll just enough so you can open it like a book. Pull out some of the bread from the top half to better accommodate the filling if desired. 5. Spread the interior surfaces of roll liberally with mayonnaise mixture. Transfer roll, cut-side up, to the prepared baking sheet. 6. Bake in the preheated oven until warm and crisp with slightly browned edges, about 7 minutes. 7. Place sliced pork, paté, pickled radish and carrot, cucumber, jalapeño, and cilantro leaves in warm roll. Cut in half to serve.",
  "prep": "25 mins",
  "cook": "10 mins",
  "total": "35 mins",
  "calories": "1263"
},
{
  "url": "https://www.allrecipes.com/recipe/275977/pork-tenderloin-with-apples-and-onions/",
  "name": "Pork Tenderloin with Apples and Onions",
  "rating": "4.8",
  "ratingcount": "34",
  "ingredients": "2 (1 1/2 pound) pork tenderloins; 2 teaspoons vegetable oil; 1 teaspoon sea salt; 2 tablespoons vegetable oil, divided, or more as needed; 3 medium Granny Smith apples - peeled, cored, and sliced into eighths; 2 medium sweet onions, sliced vertically; 3 teaspoons chopped fresh thyme, divided; ¼ teaspoon ground black pepper, or to taste; 1 tablespoon Dijon mustard; 1 cup chicken stock; 1 tablespoon butter",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Trim silver skin from pork tenderloins; pat dry using paper towels. Rub 2 teaspoons vegetable oil over tenderloins, then rub with sea salt. 3. Heat 1 tablespoon vegetable oil in a large, oven-proof skillet over medium heat until it shimmers. Cook tenderloins in hot oil, rotating to brown all sides, about 10 minutes. Transfer pork to a large plate. 4. Add remaining 1 tablespoon vegetable oil to any drippings in the skillet. Cook apples and onions in hot oil, stirring occasionally, until onions turn translucent, about 5 minutes; add more oil if the skillet gets dry. Season with 1 teaspoon thyme and black pepper; stir gently to combine. Remove from heat. 5. Use a pastry brush to spread Dijon mustard evenly over tenderloins. Sprinkle with remaining 2 teaspoons thyme. Nestle tenderloins into the skillet with apple mixture. 6. Roast, uncovered, in the preheated oven until an instant-read thermometer inserted into the center of tenderloins reads at least 145 degrees F (63 degrees C), about 15 minutes. Remove the skillet from the oven and transfer pork to a large platter. Cover with aluminum foil and let rest. 7. Meanwhile, pour chicken stock into a saucepan and cook over medium-high heat until reduced by half, 8 to 10 minutes. Pour into the skillet with apple mixture. Cook over medium-high heat until boiling, about 5 minutes; stir in butter until melted. 8. Slice pork and serve over apple mixture.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "313"
},
{
  "url": "https://www.allrecipes.com/recipe/8544430/sheet-balsamic-pork-tenderloin-with-rainbow-vegetables/",
  "name": "Sheet Pan Balsamic Pork Tenderloin with Rainbow Vegetables",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "4 tablespoons olive oil, divided; 2  dates, pitted and chopped, or to taste; 3 tablespoons white balsamic vinegar; 2 teaspoons minced fresh rosemary; 1 teaspoon sliced garlic; 1 teaspoon salt, or to taste; ½ teaspoon freshly ground black pepper, or to taste; 6 cups 1/2-inch x 2-inch rainbow carrot sticks; 4 cups 1/2-inch x 2-inch peeled, seeded butternut squash chunks; ½  red onion, sliced lengthwise; 2 (1 1/4 pound) pork tenderloins",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Line a sheet pan with parchment paper or foil. 2. Place 2 tablespoons olive oil, dates, vinegar, rosemary, garlic, salt, and pepper in a blender or small food processor. Pulse several times to mix, then puree until smooth, about 1 minute. Reserve 2 tablespoons of the mixture for later use. 3. Combine rainbow carrots, butternut squash, and red onion in a large bowl. Toss with balsamic mixture, and place on the prepared sheet pan. 4. Roast vegetables, uncovered in the preheated oven for 20 minutes. 5. Meanwhile, blot tenderloins with paper towels. Heat 1 tablespoon oil in a large skillet over medium-high heat. Place tenderloins in skillet and cook until lightly browned, about 2 minutes per side. 6. Stir vegetables; nestle tenderloins into vegetables. Brush each tenderloin with 1 tablespoon reserved balsamic mixture and return the sheet pan to the oven. 7. Roast, uncovered, until vegetables are tender and pork is slightly pink in the center, about 20 minutes. The internal temperature of the meat should read at least 145 degrees F (63 degrees C). 8. Drizzle vegetables and tenderloins with remaining 1 tablespoon olive oil.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "306"
},
{
  "url": "https://www.allrecipes.com/recipe/269652/tuscan-pork-tenderloin/",
  "name": "Tuscan Pork Tenderloin",
  "rating": "4.5",
  "ratingcount": "59",
  "ingredients": "4 teaspoons minced garlic; 2 teaspoons dried rosemary; 2 teaspoons dried oregano; 1 teaspoon salt; 1 teaspoon ground black pepper; 4 pounds pork tenderloin",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Combine garlic, rosemary, oregano, salt, and pepper in a small bowl. Rub spice mixture all over pork tenderloin. Place into a baking dish. 3. Bake in the preheated oven until pork is slightly pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Remove from the oven and let stand for 5 minutes before slicing.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "169"
},
{
  "url": "https://www.allrecipes.com/recipe/176359/easy-marinated-pork-tenderloin/",
  "name": "Easy Marinated Pork Tenderloin",
  "rating": "4.7",
  "ratingcount": "820",
  "ingredients": "¼ cup olive oil; ¼ cup soy sauce; 1 clove garlic, minced; 3 tablespoons Dijon honey mustard; salt and ground black pepper to taste; 2 pounds pork tenderloin",
  "directions": "1. Whisk olive oil, soy sauce, garlic, mustard, salt, and pepper together in a bowl. 2. Place pork in a large resealable plastic bag and pour in marinade; squeeze out excess air, and seal the bag. Marinate in the refrigerator at least 1 hour before cooking. 3. Preheat the oven to 350 degrees F (175 degrees C). 4. Transfer pork to a baking dish; pour marinade over the pork. 5. Cook in the preheated oven until pork is slightly pink in the center, about 45 to 60 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
  "prep": "5 mins",
  "cook": "45 mins",
  "total": "1 hr 50 mins",
  "calories": "313"
},
{
  "url": "https://www.allrecipes.com/recipe/230213/stuffed-pork-tenderloin/",
  "name": "Stuffed Pork Tenderloin",
  "rating": "4.5",
  "ratingcount": "90",
  "ingredients": "3 tablespoons extra-virgin olive oil, divided, or as needed; 10  white mushrooms, minced; 1  shallot, minced; ½ teaspoon dried thyme; ½ teaspoon garlic powder; ½ teaspoon dried sage; ½ teaspoon ground black pepper; ¼ teaspoon salt; ¼ cup chopped fresh parsley; 2 cups fresh spinach; 1 teaspoon Dijon mustard; 1 (2 pound) pork tenderloin, butterflied and pounded flat; 4 slices prosciutto",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Heat 1 tablespoon olive oil in a skillet over medium heat; cook and stir mushrooms, shallot, thyme, garlic powder, sage, black pepper, and salt in the hot oil until liquid has evaporated and mushrooms and shallots are softened, 5 to 10 minutes. 3. Add parsley; cook and stir for 1 minute. Mix in spinach; cook and stir until spinach is wilted, about 5 minutes. Stir in mustard. Remove from heat. 4. Place pork tenderloin on a work surface; lay prosciutto atop tenderloin. Spread mushroom-spinach mixture over prosciutto, leaving a 1/2-inch border on all sides. 5. Tightly roll tenderloin around filling and tie together with kitchen string to keep closed. 6. Heat remaining 2 tablespoons olive oil in a large skillet over medium heat; place rolled tenderloin in the hot oil. Sear until all sides are golden brown, about 10 minutes. Transfer seared tenderloin to a 9x13-inch casserole dish. 7. Bake in the preheated oven until pork is slightly pink in the center, 25 to 30 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
  "prep": "25 mins",
  "cook": "45 mins",
  "total": "1 hr 10 mins",
  "calories": "296"
},
{
  "url": "https://www.allrecipes.com/recipe/241091/pork-stir-fry/",
  "name": "Pork Stir Fry",
  "rating": "4.4",
  "ratingcount": "51",
  "ingredients": "5 tablespoons reduced-sodium soy sauce; 2 tablespoons rice wine vinegar; 1 tablespoon cornstarch; 2 tablespoons sesame oil, divided; 1 (1 pound) pork tenderloin, cut into strips; 1  fresh red chile pepper, chopped; 2 cloves garlic, minced; 1  onion, chopped; 1  green bell pepper, chopped; 1 head bok choy, leaves and stalks separated, chopped; 2 crowns broccoli, chopped; 1 teaspoon ground ginger",
  "directions": "1. Whisk soy sauce, vinegar, and cornstarch together in a small bowl; set aside. 2. Heat 1 tablespoon sesame oil in a wok over medium-high heat. Cook and stir tenderloin strips in hot oil until just browned, 2 to 4 minutes. Transfer pork to a plate and return the wok to heat. 3. Add remaining sesame oil to the wok; cook and stir red chile pepper and garlic in hot oil until sizzling, 15 to 30 seconds. Add onion and bell pepper; cook and stir until onion starts to soften, 2 to 3 minutes. Stir chopped bok choy stalks into onion mixture; cook and stir until stems begin to soften, about 3 minutes. 4. Add broccoli to the wok; cook and stir until slightly softened, about 2 minutes. Add pork, chopped bok choy leaves, and soy sauce mixture; cook and stir until well-combined. Season pork mixture with ginger; cook and stir until bok choy leaves start to wilt and broccoli is tender, 5 to 7 minutes.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "40 mins",
  "calories": "188"
},
{
  "url": "https://www.allrecipes.com/recipe/231523/pork-lo-mein/",
  "name": "Pork Lo Mein",
  "rating": "4.5",
  "ratingcount": "144",
  "ingredients": "1 (8 ounce) package linguine; ⅓ cup low-sodium soy sauce; 2 tablespoons rice vinegar; 2 teaspoons cornstarch; 1 teaspoon white sugar; ½ teaspoon sesame oil; 2 tablespoons canola oil; 2 cups snap peas; 1 small sweet onion, chopped; 1 (12 ounce) pork tenderloin, cut into thin strips; 1 (8 ounce) package sliced white mushrooms; 1 medium red bell pepper, chopped; 3 cloves garlic, chopped, divided; ½ teaspoon chopped fresh ginger, or to taste; 3  green onions, sliced",
  "directions": "1. Bring a large pot of lightly salted water to a boil; cook the linguine at a boil until tender yet firm to the bite, 8 to 9 minutes; drain. 2. Meanwhile, whisk soy sauce, vinegar, cornstarch, sugar, and sesame oil together in a small bowl. 3. Heat canola oil in a large skillet over medium-high heat. Add snap peas and onion; cook and stir until onion is translucent, about 2 minutes. Add pork, mushrooms, red bell pepper, 1/3 of the garlic, and ginger; cook until pork is no longer pink, about 2 minutes. 4. Add remaining garlic to the skillet and cook until fragrant, about 1 minute. Pour in soy sauce mixture; cook and stir until sauce thickens, about 1 minute. Remove from the heat. 5. Stir linguine into the skillet until coated; sprinkle green onions over top.",
  "prep": "15 mins",
  "cook": "15 mins",
  "total": "30 mins",
  "calories": "415"
},
{
  "url": "https://www.allrecipes.com/recipe/14713/souvlaki/",
  "name": "Souvlaki",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "¼ cup olive oil; ¼ cup soy sauce; 1 medium lemon, juiced; 3 cloves garlic, crushed; 1 teaspoon dried oregano; 3 pounds pork tenderloin, cut into 1 inch cubes; 2 medium yellow onions, cut into 1 inch pieces; 2 medium green bell peppers, cut into 1 inch pieces; skewers",
  "directions": "1. Mix oil, soy sauce, lemon juice, garlic, and oregano, and garlic together in a large glass bowl. Add pork, onions, and bell peppers, and stir until coated. Cover and refrigerate for 2 to 3 hours. 2. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 3. Remove pork and vegetables from marinade and shake off excess; thread onto skewers. Discard remaining marinade. 4. Cook on the preheated grill, turning frequently, until pork is no longer pink in the middle, 10 to 15 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
  "prep": "30 mins",
  "cook": "10 mins",
  "total": "2 hrs 40 mins",
  "calories": "189"
},
{
  "url": "https://www.allrecipes.com/recipe/209691/bacon-wrapped-pork-medallions/",
  "name": "Bacon-Wrapped Pork Medallions",
  "rating": "4.7",
  "ratingcount": "578",
  "ingredients": "1 tablespoon garlic powder; 1 teaspoon seasoning salt; 1 teaspoon dried basil; 1 teaspoon dried oregano; 8 slices bacon; 2 pounds pork tenderloin; 2 tablespoons butter; 2 tablespoons olive oil",
  "directions": "1. Preheat the oven to 400 degrees F (200 degrees C). Combine garlic powder, seasoning salt, basil, and oregano in a small bowl. 2. Cook bacon in a large, oven-safe skillet over medium-high heat, turning occasionally, until lightly browned and still flexible, 6 to 7 minutes. Transfer bacon to a paper towel-lined plate. Drain any excess bacon grease from the skillet. 3. Wrap four slices bacon around each tenderloin, securing each strip with 1 to 2 toothpicks. Slice tenderloins between each bacon strip to create a total of eight medallions. Dip medallions into seasoning mix on both sides. 4. Melt butter and oil together in the same skillet over medium-high heat. Add medallions and cook for 4 minutes on each side. 5. Transfer the skillet to the preheated oven and bake until pork is no longer pink in the center, 17 to 20 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "281"
},
{
  "url": "https://www.allrecipes.com/recipe/165025/slow-cooker-teriyaki-pork-tenderloin/",
  "name": "Slow Cooker Teriyaki Pork Tenderloin",
  "rating": "4.5",
  "ratingcount": "706",
  "ingredients": "2 tablespoons olive oil; 2 pounds pork tenderloin; 1 cup chicken broth; ½ cup teriyaki sauce; ¼ cup brown sugar; ½ large onion, sliced; 4 cloves garlic, chopped; 3  fresh red chile peppers, chopped, or to taste; ¼ teaspoon black pepper",
  "directions": "1. Heat olive oil in a skillet over medium-high heat. Brown tenderloins on all sides, about 10 minutes. 2. Meanwhile, mix together chicken broth, teriyaki sauce, and brown sugar in a bowl. Stir in onion, garlic, red chile peppers, and black pepper. 3. Put browned tenderloins into a slow cooker and cover with teriyaki sauce mixture. Cook on Low for about 4 hours, turning 2 to 3 times during the cooking time to ensure even doneness. The internal temperature of the tenderloin should reach 180 degrees F (82 degrees C). 4. Remove tenderloins from the slow cooker and let rest for 5 minutes before slicing. Spoon liquid over slices when serving, if desired.",
  "prep": "25 mins",
  "cook": "4 hrs 10 mins",
  "total": "4 hrs 40 mins",
  "calories": "177"
},
{
  "url": "https://www.allrecipes.com/recipe/220214/parsley-and-parmesan-crusted-pork-tenderloin/",
  "name": "Parsley and Parmesan Crusted Pork Tenderloin",
  "rating": "4.5",
  "ratingcount": "91",
  "ingredients": "cooking spray; 2 (12 ounce) pork tenderloins; ½ cup bread crumbs; ½ cup chopped fresh parsley; ⅓ cup grated Parmesan cheese; ½ teaspoon dried thyme; ½ teaspoon salt; ¼ teaspoon freshly ground black pepper; ¼ cup Dijon mustard; 2 cloves garlic, minced",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Spray a baking dish with cooking spray. Arrange pork tenderloins in the baking dish. 3. Mix together bread crumbs, parsley, Parmesan cheese, thyme, salt, and black pepper in a bowl; set aside. 4. Stir mustard and garlic together in a bowl. Spread mustard mixture over the pork. 5. Sprinkle the bread crumb mixture over the mustard coating. 6. Bake pork in the preheated oven until no longer pink in the center, about 20 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). 7. Allow pork to rest for 5 minutes before slicing.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "252"
},
{
  "url": "https://www.allrecipes.com/recipe/22224/easy-and-elegant-pork-tenderloin/",
  "name": "Easy and Elegant Pork Tenderloin",
  "rating": "4.4",
  "ratingcount": "809",
  "ingredients": "2 cups Italian seasoned bread crumbs; ½ cup olive oil; 2 pounds pork tenderloin",
  "directions": "1. Preheat oven to 425 degrees F (220 degrees C). 2. Mix bread crumbs and olive oil in bowl to reach consistency that would be moist enough to stick to the meat when pressed. Place pork on a shallow cooking sheet. Press the crumb mixture onto all sides of the meat until there is no pink showing, usually 1/4 inch thick. 3. Bake for at least 35 minutes until a meat thermometer reads 165 degrees F (75 degrees C) or until there is no pink when the pork is cut. Let the pork rest for 10 minutes, then cut into 1/2 inch slices.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "437"
},
{
  "url": "https://www.allrecipes.com/recipe/14739/breaded-pork-tenderloin/",
  "name": "Breaded Pork Tenderloin",
  "rating": "4.4",
  "ratingcount": "158",
  "ingredients": "1 ½ pounds pork tenderloin; ¼ cup milk; 2  eggs; ½ cup Italian-style dried bread crumbs; 2 teaspoons dried oregano; 1 pinch garlic salt; salt and pepper to taste; 1 tablespoon vegetable oil, or as needed",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Line a 9x13-inch baking dish with aluminum foil. 2. Slice tenderloin into 1/4-inch rounds. Pound each slice between sheets of plastic wrap until thin. 3. Whisk milk and eggs together in a shallow dish. Whisk bread crumbs, oregano, garlic salt, oregano, salt, and pepper together in a second shallow dish. Dip tenderloins in egg mixture, then in bread crumb mixture until well coated. 4. Heat oil in a large skillet over medium-high heat. Working in batches as necessary, fry breaded tenderloins in the hot skillet and until golden brown on both sides, 2 to 3 minutes per side; they will not be cooked through. Transfer browned tenderloins to the prepared baking dish. 5. Mix any leftover egg and bread crumb mixture together, then fry it in the hot skillet. Place into the baking dish with browned tenderloins. Cover the dish tightly. 6. Bake in the preheated oven until no longer pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
  "prep": "25 mins",
  "cook": "1 hr",
  "total": "1 hr 25 mins",
  "calories": "252"
},
{
  "url": "https://www.allrecipes.com/recipe/57002/pork-tenderloin-with-dijon-marsala-sauce/",
  "name": "Pork Tenderloin with Dijon Marsala Sauce",
  "rating": "4.7",
  "ratingcount": "800",
  "ingredients": "2  pork tenderloins; 4 tablespoons Dijon mustard; 1 tablespoon oil; 2 tablespoons butter; 2  shallots, minced; 1 cup Marsala wine; 1 tablespoon Dijon mustard; 1 cup heavy cream",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Coat pork tenderloins generously with mustard. Oil a 9x13 inch baking dish. 2. Heat oil in a large skillet over medium-high heat. Arrange tenderloins in pan, and brown the meat. Turn to brown evenly. Transfer meat to prepared baking dish. 3. Bake in preheated oven for 20 minutes. Turn, and continue cooking for 20 minutes, or until desired doneness. 4. Meanwhile, melt butter over medium heat in the same pan used to cook the pork. Cook shallots in butter until soft. Stir in Marsala, mustard, and cream, and cook until volume of liquid is reduced by half. 5. Slice pork, and place on a serving dish. Spoon sauce over meat, and serve.",
  "prep": "15 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "463"
},
{
  "url": "https://www.allrecipes.com/recipe/75861/amazing-pork-tenderloin-in-the-slow-cooker/",
  "name": "Amazing Pork Tenderloin in the Slow Cooker",
  "rating": "4.2",
  "ratingcount": "3",
  "ingredients": "1 (2 pound) pork tenderloin; 1 (1 ounce) envelope dry onion soup mix; 1 cup water; ¾ cup red wine; 3 tablespoons soy sauce; 3 tablespoons minced garlic; freshly ground black pepper to taste",
  "directions": "1. Place pork tenderloin and soup mix in a slow cooker. Pour water, wine, and soy sauce on top, turning pork to coat. Carefully spread garlic over pork, leaving as much on top as possible. Sprinkle with pepper. 2. Cover and cook on Low for 4 hours or until the internal temperature reaches 145 degrees F (63 degrees C). 3. Remove pork from the slow cooker and let rest for 10 minutes. Slice and serve with cooking liquid on the side as au jus.",
  "prep": "5 mins",
  "cook": "4 hrs",
  "total": "4 hrs 15 mins",
  "calories": "180"
},
{
  "url": "https://www.allrecipes.com/recipe/62825/honey-glazed-pork-tenderloin/",
  "name": "Honey-Glazed Pork Tenderloin",
  "rating": "4.3",
  "ratingcount": "389",
  "ingredients": "2 (3/4 pound) pork tenderloins; ⅓ cup honey; 2 tablespoons soy sauce; 2 tablespoons sesame oil; 2 tablespoons balsamic vinegar; 1 tablespoon brown sugar",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). Place pork tenderloins into a roasting pan. 2. Stir honey, soy sauce, sesame oil, vinegar, and brown sugar together in a bowl until well blended. 3. Roast tenderloins in the preheated oven for 15 minutes. Reduce the temperature to 350 degrees F (175 degrees C), and baste tenderloins with honey sauce. Continue to roast, basting a few more times with remaining sauce, until pork is slightly pink in the center, about 45 more minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "210"
},
{
  "url": "https://www.allrecipes.com/recipe/169749/pork-medallions-with-balsamic-vinegar-and-capers/",
  "name": "Pork Medallions with Balsamic Vinegar and Capers",
  "rating": "4.5",
  "ratingcount": "467",
  "ingredients": "¼ cup all-purpose flour; 1 teaspoon garlic salt, or to taste; ½ teaspoon freshly ground black pepper, or to taste; 2 pounds pork tenderloin, cut into 1 1/2 inch pieces; 2 tablespoons olive oil; ⅓ cup balsamic vinegar; ½ cup chicken broth; 2 teaspoons minced lemon zest, or to taste; 1 tablespoon capers, or to taste",
  "directions": "1. Place the flour, garlic salt, and pepper into a plastic bag. Shake to mix, the add the pork tenderloin pieces, and shake again to coat. Shake off the excess flour. 2. Heat the oil in a large skillet over medium-high heat. Cook the pork medallions in the hot oil until golden-brown on both sides, 2 to 3 minutes per side. Pour in the balsamic vinegar and chicken broth. Bring to a boil, then reduce heat to medium, and simmer until the pork is no longer pink in the center, 3 to 4 minutes. Remove the pork to a serving platter, then stir the lemon zest and capers into the simmering sauce. Continue simmering until the sauce has thickened to your desired consistency.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "249"
},
{
  "url": "https://www.allrecipes.com/recipe/201010/apricot-pork-tenderloin/",
  "name": "Apricot Pork Tenderloin",
  "rating": "4.6",
  "ratingcount": "162",
  "ingredients": "2 pounds pork tenderloin; ¼ cup softened butter; salt and pepper to taste; 1 teaspoon ground thyme; 2 teaspoons garlic powder; 1 (18 ounce) jar apricot preserves; 2 tablespoons honey, or to taste; ¼ cup dry sherry",
  "directions": "1. Preheat an oven to 350 degrees F (175 degrees C). 2. Spread butter all over the pork tenderloin. Season with salt, pepper, and thyme. Combine garlic powder, apricot preserves, honey, and sherry in a separate bowl. 3. Roast the pork in the preheated oven for 30 to 40 minutes. Remove the pork from the oven and brush with the apricot sauce. Return the pork to the oven. Continue roasting, basting occasionally with the remaining sauce, until the pork is no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
  "prep": "10 mins",
  "cook": "45 mins",
  "total": "55 mins",
  "calories": "440"
},
{
  "url": "https://www.allrecipes.com/recipe/228045/crispy-pork-cutlets/",
  "name": "Crispy Pork Cutlets",
  "rating": "4.6",
  "ratingcount": "240",
  "ingredients": "2 (1 1/4 pound) fully trimmed pork tenderloins, cut into 8 pieces; salt and freshly ground black pepper to taste; 2 tablespoons all-purpose flour, or as needed; 2  eggs, beaten; 3 cups panko bread crumbs; 2 tablespoons butter; ⅓ cup diced dill pickles; 1  jalapeno pepper, seeded and minced; 1 bunch green onions, chopped, green tops reserved; 1 pinch cayenne pepper, or to taste; 1 ½ tablespoons all-purpose flour; 1 ½ cups cold milk, or more as needed; 1 teaspoon Worcestershire sauce, or to taste; ¼ teaspoon freshly ground black pepper, or more to taste; ½ cup vegetable oil for frying; salt to taste",
  "directions": "1. Place pork pieces between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound pork with the smooth side of a meat mallet to a thickness of 1/2 inch. 2. Transfer pork pieces to a plate and season both sides generously with salt and black pepper; sprinkle with 2 tablespoons of flour, lightly coating both sides. Pour eggs over pork, turning to coat. 3. Place panko in a shallow bowl; place pork pieces in panko, pressing firmly to coat on both sides. Transfer breaded cutlets to a clean plate, cover with plastic wrap, and refrigerate for 15 minutes. 4. Meanwhile, melt butter in a skillet over medium heat. Stir in pickles, jalapeño pepper, and green onions; cook and stir until onions have softened, about 3 minutes. Sprinkle in 1 1/2 tablespoons flour; cook and stir for 3 minutes. 5. Slowly stir in 2 to 3 tablespoons cold milk, whisking constantly. Stir in remaining milk, Worcestershire sauce, and black pepper. Simmer on low for 5 minutes. Taste and adjust seasoning; set sauce aside. 6. Heat 1/4 cup vegetable oil in a large skillet over medium-high heat. Add 1/2 of the breaded pork cutlets and cook until pork is no longer pink inside, and the crust is well-browned, 4 to 5 minutes per side. 7. Transfer to plate lined with paper towels. Sprinkle with salt. Repeat with remaining vegetable oil and pork cutlets. 8. Serve cutlets topped with sauce.",
  "prep": "20 mins",
  "cook": "30 mins",
  "total": "1 hr 5 mins",
  "calories": "748"
},
{
  "url": "https://www.allrecipes.com/recipe/275193/slow-cooked-pork-tenderloin/",
  "name": "Slow-Cooked Pork Tenderloin",
  "rating": "4.1",
  "ratingcount": "17",
  "ingredients": "½ cup olive oil; ½ cup balsamic vinegar; 3 cloves garlic, peeled; 3 tablespoons brown sugar; 2 tablespoons chopped fresh thyme; 1 teaspoon dry mustard; 1 teaspoon paprika; 1 (4 pound) pork tenderloin; ¼ cup dry sherry; 2 tablespoons cornstarch; 2 tablespoons water",
  "directions": "1. Place olive oil, balsamic vinegar, garlic, brown sugar, thyme, dry mustard, and paprika into a food processor; blend until combined. Pour marinade into a resealable plastic bag. Add pork tenderloin to the bag, seal, and marinate in the refrigerator for 24 hours. 2. Preheat the oven to 250 degrees F (120 degrees C). 3. Transfer pork with marinade to a Dutch oven. 4. Bake in the preheated oven for 3 hours. 5. Transfer pork from the Dutch oven to a plate, reserving drippings in the pan. Cover pork to keep warm and set aside. 6. Heat drippings in the Dutch oven over medium heat on the stovetop. Pour in sherry and bring to a boil while scraping the browned bits of food off the bottom of the pot with a wooden spoon. 7. Stir together cornstarch and water in a small bowl; add to sauce in the pot. Bring to a simmer and cook until thickened, about 15 minutes. 8. Slice pork tenderloin and serve with sauce on the side or poured on top.",
  "prep": "15 mins",
  "cook": "3 hrs 15 mins",
  "total": "1 day 3 hrs 30 mins",
  "calories": "361"
},
{
  "url": "https://www.allrecipes.com/recipe/71555/italian-pork-tenderloin/",
  "name": "Italian Pork Tenderloin",
  "rating": "4.7",
  "ratingcount": "427",
  "ingredients": "2 tablespoons olive oil; ¼ cup chopped prosciutto; 2 tablespoons chopped fresh sage; 2 tablespoons chopped fresh parsley; 2 tablespoons chopped oil-packed sun-dried tomatoes; ¼ cup chopped onion; 1 ½ pounds pork tenderloin, cut into 1/2 inch strips; ½ cup chicken broth; ½ cup heavy cream; ¼ teaspoon salt; ½ teaspoon ground black pepper",
  "directions": "1. Heat the oil in a skillet over medium-high heat. Saute the prosciutto, sage, parsley, sun-dried tomatoes, and onion 5 minutes, until onion is tender. Mix the pork strips into the skillet, and brown about 10 minutes, turning once. 2. Stir the broth and heavy cream into the skillet, and season with salt and pepper. Bring to a boil. Reduce heat to low, and simmer 20 minutes, stirring occasionally, until pork reaches a minimum temperature of 145 degrees F (63 degrees C) and sauce is thickened.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "356"
},
{
  "url": "https://www.allrecipes.com/recipe/213440/traditional-indiana-breaded-tenderloin-sandwich/",
  "name": "Traditional Indiana Breaded Tenderloin Sandwich",
  "rating": "4.7",
  "ratingcount": "124",
  "ingredients": "4 (4 ounce) slices of pork tenderloin, cut across the grain; 1 large egg, beaten; 2 tablespoons milk; 1 teaspoon salt; ¼ teaspoon ground black pepper; ¼ teaspoon garlic powder; ¼ teaspoon onion powder; ¼ teaspoon seasoned salt; ¼ teaspoon dried marjoram; ¼ teaspoon dried oregano; 1 ½ cups bread crumbs; ½ cup peanut oil for frying; 4  kaiser rolls, split; 4 teaspoons mayonnaise, or as needed (Optional); 4 teaspoons ketchup, or as needed (Optional); 4 teaspoons prepared yellow mustard, or as needed (Optional); 4 slices dill pickle (Optional); 4 slices onion (Optional); 4 slices tomato (Optional); 4 leaves lettuce (Optional)",
  "directions": "1. Flatten pork slices, one at a time, by placing in between two pieces of sturdy plastic and pounding with a meat mallet until 1/4-inch thick and about 3 1/2x5 inches in size. 2. Whisk egg and milk together in a shallow bowl; stir in salt, pepper, garlic powder, onion powder, seasoned salt, marjoram, and oregano until well blended. Place bread crumbs into another shallow bowl. 3. Dip each flattened cutlet into seasoned egg mixture, then dip into bread crumbs until thoroughly coated. Set breaded cutlets in a single layer on a piece of parchment or waxed paper. 4. Heat oil in a large skillet until shimmering. Gently lower cutlets into the hot skillet and fry until golden brown, about 4 minutes per side. Drain on paper towels. 5. Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Place kaiser rolls, split-sides up, onto a baking sheet. 6. Broil in the preheated oven until toasted and hot, about 1 minute. 7. Remove from the oven and assemble sandwiches: Place fried cutlets on roll bottoms. Add toppings in the desired order: mayonnaise, ketchup, mustard, pickle, onion, tomato, and lettuce. Top sandwiches with roll tops and serve.",
  "prep": "45 mins",
  "cook": "10 mins",
  "total": "55 mins",
  "calories": "478"
},
{
  "url": "https://www.allrecipes.com/recipe/234659/spicy-pork-curry/",
  "name": "Spicy Pork Curry",
  "rating": "4.7",
  "ratingcount": "21",
  "ingredients": "1 cup water; 1 tablespoon dried minced onion; 1 cube chicken bouillon; ½ teaspoon garlic powder; ¼ teaspoon dried rosemary; ¼ teaspoon dried thyme; ¼ teaspoon salt; 3 tablespoons coconut oil; 2 tablespoons curry powder; ½ teaspoon cayenne pepper, or more to taste; 1 pound pork tenderloin, cut into strips; 2 ½ tablespoons all-purpose flour; 1 cup coconut milk; ¼ cup natural peanut butter",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Combine water, dried onion, chicken bouillon, garlic powder, rosemary, thyme, and salt in a microwave-safe bowl. Microwave for 1 minute, then let stand until onion is rehydrated and bouillon is dissolved. 3. Meanwhile, heat coconut oil, curry powder, and cayenne in a large oven-proof skillet over medium heat, stirring constantly, until oil takes on the color of the curry powder, 5 to 6 minutes. 4. Add pork tenderloin to the skillet; cook and stir until pork begins to brown. Sprinkle flour over pork; cook and stir until pork is slightly pink in the center and cooked through; 2 to 3 minutes more. 5. Stir in bouillon mixture, coconut milk, and peanut butter. Bring to a boil, stirring constantly. Cover the skillet and transfer to the oven. 6. Cook in the preheated oven until pork is tender and sauce is bubbling, about 45 minutes. Remove from the oven, uncover, and let rest until the sauce thickens, about 10 minutes.",
  "prep": "5 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 20 mins",
  "calories": "435"
},
{
  "url": "https://www.allrecipes.com/recipe/58941/orange-marinated-pork-tenderloin/",
  "name": "Orange Marinated Pork Tenderloin",
  "rating": "4.3",
  "ratingcount": "124",
  "ingredients": "1 cup orange juice; ⅓ cup soy sauce; 2 tablespoons chopped fresh rosemary; 3 teaspoons minced garlic; 2 (3/4 pound) whole pork tenderloins; salt and freshly ground black pepper to taste",
  "directions": "1. Make the orange marinade by whisking together the orange juice, soy sauce, rosemary, and garlic. Pour over pork tenderloin and marinate for at least one hour, preferably overnight. 2. Preheat oven to 400 degrees F (205 degrees C). Drain pork, reserving the marinade, and place on a baking sheet. Season with salt and pepper to taste. Roast for about 20 minutes until internal temperature has reached 145 degrees F (63 degrees C). 3. Meanwhile, strain the reserved marinade and bring it to a simmer in a small saucepan. Serve this as a sauce for the meat.",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr 30 mins",
  "calories": "190"
},
{
  "url": "https://www.allrecipes.com/recipe/229427/southern-pork-tenderloin/",
  "name": "Southern Pork Tenderloin",
  "rating": "4.6",
  "ratingcount": "58",
  "ingredients": "2 cups panko bread crumbs; 1 tablespoon parsley flakes; 1 teaspoon garlic powder; 1 teaspoon onion powder; ½ teaspoon ground black pepper; 1 (1 pound) pork tenderloin, cut crosswise into 1/2-inch thick slices; ¼ cup olive oil",
  "directions": "1. Stir panko bread crumbs, parsley flakes, garlic powder, onion powder, and black pepper together in a bowl. Dip tenderloin slices in the crumb mixture to coat both sides. 2. Heat olive oil over medium-high heat in a skillet and fry the pork until the crumb coating is browned and the pork is no longer pink inside, 2 to 3 minutes per side. An instant-read meat thermometer inserted into the center of the pork should read at least 145 degrees F (65 degrees C).",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "360"
},
{
  "url": "https://www.allrecipes.com/recipe/275191/brown-sugar-and-balsamic-glazed-pork-tenderloin/",
  "name": "Brown Sugar and Balsamic Glazed Pork Tenderloin",
  "rating": "4.8",
  "ratingcount": "20",
  "ingredients": "½ cup brown sugar; ½ cup water; ¼ cup balsamic vinegar; 2 tablespoons soy sauce; 1 tablespoon cornstarch; 2 cloves garlic, crushed; 1 ½ teaspoons ground sage; ¾ teaspoon salt; ¼ teaspoon pepper; 2 (1 1/2 pound) pork tenderloins; 1 tablespoon olive oil, or as needed",
  "directions": "1. Combine brown sugar, water, balsamic vinegar, soy sauce, and cornstarch in a small saucepan over medium heat. Cook, stirring constantly, until mixture thickens, 4 to 6 minutes. Remove from the heat and set aside. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking sheet. 3. Combine garlic, sage, salt, and pepper in a small bowl. Rub garlic mixture over pork tenderloins. 4. Heat oil in a large skillet over medium-high heat. Arrange tenderloins in the skillet and brown evenly, 2 to 3 minutes per side. Transfer pork to the prepared baking sheet and brush with the balsamic glaze. 5. Bake in the preheated oven for 20 minutes. Turn pork, brush again with glaze, and continue cooking until pork is slightly pink in the center, about 20 minutes more, or until desired doneness. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). 6. Remove tenderloin to a platter. Allow to rest for 10 minutes. Drizzle a little extra glaze over the top. Carve and serve with remaining glaze on the side.",
  "prep": "10 mins",
  "cook": "55 mins",
  "total": "1 hr 15 mins",
  "calories": "228"
},
{
  "url": "https://www.allrecipes.com/recipe/222342/sweet-and-sour-pork-tenderloin/",
  "name": "Sweet and Sour Pork Tenderloin",
  "rating": "4.6",
  "ratingcount": "306",
  "ingredients": "1 (1 1/4 pound) pork tenderloin, trimmed of silver skin; salt and ground black pepper; ⅓ cup ketchup; ⅓ cup seasoned rice vinegar; 1 (8 ounce) can pineapple chunks, drained with juice reserved; 2 tablespoons brown sugar; 4 cloves garlic, minced; 2 teaspoons hot chili sauce (such as Sriracha®); 1 teaspoon soy sauce; 1 pinch red pepper flakes; 1 tablespoon vegetable oil; 1 teaspoon butter; ¼ cup chopped green onion (white part only); 2 tablespoons chopped green onion tops",
  "directions": "1. Cut tenderloin into 4 pieces. Arrange in a single layer between two sheets of plastic wrap and pound with a meat mallet until each is about 1-inch thick. Generously season with salt and black pepper. 2. Whisk ketchup, rice vinegar, reserved pineapple juice, brown sugar, garlic, hot chili sauce, soy sauce, and red pepper flakes in a bowl. Set aside. 3. Heat vegetable oil in a skillet over high heat. Place pork in pan; reduce heat to medium. Cook until browned on both sides and cooked through, 5 to 6 minutes per side. Transfer to a plate. 4. Return skillet to medium heat. Stir butter into hot pan. When butter melts and starts to brown, stir in pineapple chunks. Cook, stirring, until pineapple is golden brown, 3 to 4 minutes. 5. Stir in ketchup mixture and 1/4 cup green onion (white parts). Reduce heat to low and simmer until garlic and onion have softened, 5 minutes. 6. Return pork to skillet; cook, stirring, until pork is heated through. Garnish with 2 tablespoons green onion tops.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "55 mins",
  "calories": "297"
},
{
  "url": "https://www.allrecipes.com/recipe/239233/stuffed-and-rolled-pork-tenderloin/",
  "name": "Stuffed and Rolled Pork Tenderloin",
  "rating": "4.3",
  "ratingcount": "46",
  "ingredients": "1  pork tenderloin; ½ bunch flat-leaf parsley, chopped; ⅓ cup bread crumbs; ¼ cup dried currants; 3 cloves garlic, minced; 2 sprigs fresh rosemary, chopped; 1  egg; 2 tablespoons olive oil; 2 teaspoons salt; 1 ½ teaspoons ground black pepper; 1 pinch cayenne pepper; salt and ground black pepper to taste",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Remove the flap of meat at the wider end of the tenderloin and trim the last two inches off of the narrow end of the tenderloin; chop trimmings and reserve. 3. Cut from one side of the tenderloin through the middle horizontally to within one-half inch of the other side. Open the two sides and spread them out like an open book. Cut a few shallow slashes in the meat. Cover the meat with plastic wrap and pound to about 1/2-inch thick. Roll up pounded tenderloin, cover with plastic wrap, and refrigerate to keep cold. 4. Mix chopped pork trimmings, parsley, bread crumbs, currants, garlic, rosemary, egg, olive oil, 2 teaspoons salt, 1 1/2 teaspoons black pepper, and cayenne pepper together in a bowl with a fork until stuffing is well-combined. 5. Unroll tenderloin on work surface. Spread stuffing over tenderloin, leaving a 2-inch border on one of the long-sides. Roll up tenderloin, ending at the 2-inch border; tie meat with twine to secure shape. Season tenderloin all over with salt and black pepper. 6. Heat an oven-safe skillet over high heat until hot. Cook tenderloin in hot skillet until browned, 3 to 4 minutes per side. 7. Cook in the preheated oven until pork is slightly pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Transfer to a plate and let rest for 15 minutes before removing twine and slicing.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr 15 mins",
  "calories": "284"
},
{
  "url": "https://www.allrecipes.com/recipe/276778/slow-cooker-pork-tenderloin-and-potatoes/",
  "name": "Slow Cooker Pork Tenderloin and Potatoes",
  "rating": "3.8",
  "ratingcount": "4",
  "ingredients": "1 (2 pound) pork tenderloin; 2 cloves garlic, minced; 6  potatoes, peeled and cubed; 1 cup baby carrots; 4 cubes  chicken bouillon; 1 cup water",
  "directions": "1. Place pork in the slow cooker and sprinkle with garlic. Arrange potatoes, carrots, and bouillon cubes around pork. Add water. 2. Cover and cook on Low until pork is slightly pink in the center and potatoes are tender, about 4 hours. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
  "prep": "15 mins",
  "cook": "4 hrs",
  "total": "4 hrs 15 mins",
  "calories": "308"
},
{
  "url": "https://www.allrecipes.com/recipe/233480/garlic-pork-tenderloin-with-mushroom-gravy/",
  "name": "Garlic Pork Tenderloin with Mushroom Gravy",
  "rating": "4.7",
  "ratingcount": "76",
  "ingredients": "kosher salt to taste; ground black pepper to taste; 2 (1 pound) pork tenderloins; ¾ cup butter; 6 cloves garlic, minced; 1 (16 ounce) can sliced mushrooms, drained; 1 tablespoon balsamic vinegar; 1 (14 ounce) can chicken broth, or as needed; ¼ cup all-purpose flour",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Rub salt and pepper over all sides of pork tenderloins; nestle tenderloins next to each other in a 9x13-inch baking dish. 3. Melt butter in a saucepan over medium heat; add garlic and mushrooms. Bring to a boil, reduce heat to medium-low, and simmer, stirring frequently, until sauce is fragrant, about 5 minutes. Stir vinegar into mushroom sauce. Pour mushroom sauce over tenderloins, letting sauce seep between the two tenderloins. 4. Bake in the preheated oven until tenderloins are lightly pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Transfer tenderloins to a serving dish. 5. Drain the drippings, including mushrooms, from the baking dish into a measuring cup, scraping the bottom to get all the brown bits. Remove 1/4 cup of the fat from the mixture and pour into a saucepan. Add enough chicken broth to the drippings to make 2 cups; whisk flour into drippings until incorporated. Stir broth-drippings mixture into the saucepan with fat over medium heat until thickened, about 5 minutes; season with salt and pepper. 6. Slice tenderloins into medallions and top with half the gravy. Pour the remaining gravy into a gravy boat for serving.",
  "prep": "15 mins",
  "cook": "55 mins",
  "total": "1 hr 10 mins",
  "calories": "384"
},
{
  "url": "https://www.allrecipes.com/recipe/230214/cheese-stuffed-pork-tenderloin/",
  "name": "Cheese-Stuffed Pork Tenderloin",
  "rating": "4.6",
  "ratingcount": "36",
  "ingredients": "2  green onions, chopped; 2 slices cooked bacon, crumbled; 3 tablespoons shredded Cheddar cheese; 2 tablespoons cream cheese, softened; 2 tablespoons frozen chopped spinach; 2 tablespoons finely chopped white mushrooms; ¼ teaspoon chopped garlic; 1 pinch dried parsley; salt and ground black pepper to taste; 1  pork tenderloin, butterflied and pounded flat; 1 cup dry bread crumbs",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet. 2. Mix green onions, bacon, Cheddar cheese, cream cheese, spinach, mushrooms, garlic, parsley, salt, and pepper in a bowl. Spread onto one side of pounded tenderloin. Roll tenderloin around the filling in a jelly-roll fashion. Coat rolled tenderloin with bread crumbs; place on the prepared baking sheet. 3. Bake in the preheated oven until pork is no longer pink in the center, about 1 1/2 hours. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
  "prep": "20 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 50 mins",
  "calories": "349"
},
{
  "url": "https://www.allrecipes.com/recipe/269977/instant-pot-pork-tenderloin/",
  "name": "Instant Pot® Pork Tenderloin",
  "rating": "4.7",
  "ratingcount": "19",
  "ingredients": "2 teaspoons olive oil; 1 (2 pound) pork tenderloin, or to taste; 1 teaspoon Greek seasoning; salt and ground black pepper to taste; 1 cup apple juice; 1 tablespoon cornstarch",
  "directions": "1. Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function. Heat olive oil until shimmering, 3 to 5 minutes. 2. Season pork tenderloin with Greek seasoning, salt, and pepper. Add to the preheated pot and cook until browned, about 3 minutes per side. Transfer to a plate. Pour apple juice into the pot; scrape up any pork bits left on the bottom. Set rack inside the pot and place tenderloin on the rack. 3. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 10 minutes. Allow 10 to 15 minutes for pressure to build. 4. Release pressure using the natural-release method for 10 minutes according to manufacturer's instructions. Quick-release any remaining pressure. Unlock and remove the lid. Lift out tenderloin and set aside to rest for 5 minutes. 5. Meanwhile, remove 1/4 cup of the liquid from the pot and mix with cornstarch to make a slurry. Pour slurry back into the pot. Select Saute function and simmer sauce until thickened, about 5 minutes. Slice pork and drizzle sauce on top.",
  "prep": "5 mins",
  "cook": "25 mins",
  "total": "45 mins",
  "calories": "165"
},
{
  "url": "https://www.allrecipes.com/recipe/228266/marinated-grilled-pork-tenderloin/",
  "name": "Marinated Grilled Pork Tenderloin",
  "rating": "4.8",
  "ratingcount": "167",
  "ingredients": "¼ cup honey; ¼ cup soy sauce; ¼ cup oyster sauce; 2 tablespoons brown sugar; 4 teaspoons minced fresh ginger root; 1 tablespoon ketchup; 1 tablespoon minced garlic; 1 tablespoon chopped fresh parsley; ¼ teaspoon onion powder; ¼ teaspoon cayenne pepper; ¼ teaspoon ground cinnamon; 2 (12 ounce) pork tenderloins",
  "directions": "1. Make marinade: Whisk together honey, soy sauce, oyster sauce, brown sugar, ginger, ketchup, garlic, parsley, onion powder, cayenne pepper, and cinnamon in a medium bowl; pour into a resealable plastic bag. 2. Place pork tenderloins into the bag; coat with marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 1 hour or up to 24 hours. 3. Preheat the grill for medium heat and lightly oil the grate. 4. Remove pork tenderloins from marinade; shake off excess. Discard remaining marinade. 5. Cook pork tenderloins on the preheated grill until no longer pink in the center, 20 to 30 minutes, turning occasionally. An instant-read thermometer inserted into the centers should read at least 145 degrees F (63 degrees C).",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "1 hr 30 mins",
  "calories": "313"
},
{
  "url": "https://www.allrecipes.com/recipe/261610/pork-saltimbocca/",
  "name": "Pork Saltimbocca",
  "rating": "4.4",
  "ratingcount": "21",
  "ingredients": "1 (1 1/4 pound) pork tenderloin; salt and freshly ground black pepper to taste; 12  fresh sage leaves, or as needed; 4  large, thin slices prosciutto; 2 teaspoons all purpose flour for dusting; 2 tablespoons olive oil; ⅔ cup dry white wine; 1 tablespoon butter; chopped pork trimmings (optional); 1 cup homemade or low-sodium chicken broth; ½ cup water, or as needed; 1 teaspoon unflavored gelatin",
  "directions": "1. Remove silvery membrane from surface of the tenderloin with a sharp knife. Reserve the trimmings. Trim off the small \"head\" pieces of the tenderloin where there is a natural separation; this is optional. Reserve. 2. Cut tenderloin in half crosswise to make 2 equal portions. Cut each half lengthwise in half to make 4 pieces. Transfer to a bowl; refrigerate while you start the sauce. 3. Chop the reserved trimmings very fine. Melt butter in a pot over medium-high heat until caramelized and nicely browned, 4 or 5 minutes. Stir in broth and gelatin. Stir in water. Cook and stir over medium or medium-low heat at a low simmer until liquid is reduced by half, about 1 1/2 hours. Add more water if it reduces too quickly. 4. Place pork sections between to pieces of plastic wrap. Pound to a thickness of about 1/4 to 1/8 inch thick. Remove top sheet of plastic wrap. Turn each piece over. Sprinkle generously with salt and pepper. Dust very lightly with about 2 teaspoons flour. Flip back over; sprinkle with black pepper only. Press 3 sage leaves onto surface of each piece of pork. Cover completely with prosciutto, cutting or tearing strips to fit. A bit of overlap is okay. 5. Place sheet of plastic wrap back over the pork and pound very lightly to make sure the prosciutto sticks to the pork. Transfer to a plate; cover with plastic wrap. Refrigerate until chilled, at least 30 minutes. 6. Strain pork broth into a bowl. 7. Place skillet over high heat; add olive oil. When olive oil is hot and shimmering, place pork pieces in the oil prosciutto side down. Cook about 3 minutes. Carefully turn pieces and cook another minute. Remove skillet from heat. Transfer pork to warm serving plates. 8. Blot excess oil from skillet with paper towels. Add wine and pork broth. Cook over high heat until mixture thickens and reduces by about half, 4 to 5 minutes. 9. Spoon hot sauce over pork sections.",
  "prep": "20 mins",
  "cook": "1 hr 45 mins",
  "total": "2 hrs 35 mins",
  "calories": "552"
},
{
  "url": "https://www.allrecipes.com/recipe/272655/grilled-pork-tenderloin-with-balsamic-honey-glaze/",
  "name": "Grilled Pork Tenderloin with Balsamic Honey Glaze",
  "rating": "4.8",
  "ratingcount": "29",
  "ingredients": "1 tablespoon garlic powder; 1 tablespoon onion powder; 2 teaspoons chili powder; 2 teaspoons paprika; 1 teaspoon salt; 2 tablespoons olive oil, divided; 1 (3 pound) pork tenderloin; ¼ cup balsamic vinegar; 1 teaspoon honey; 1 teaspoon Dijon mustard",
  "directions": "1. Mix garlic, onion, and chili powders with paprika and salt. Rub mixture all over pork tenderloin. 2. Heat 1 tablespoon olive oil over medium-high heat. Add pork and sear until golden brown on all sides, about 2 minutes per side. Wrap tenderloin in aluminum foil. 3. Preheat an outdoor grill for medium-high heat and lightly oil the grate. Grill the pork in its foil for 20 minutes. 4. Meanwhile, mix balsamic vinegar, honey, mustard together with the remaining olive oil. Unwrap pork on the grill and liberally brush the glaze on all sides. Continue grilling, brushing on more glaze, until an instant-read thermometer inserted into the center reads 145 degrees F (63 degrees C), about 10 minutes more. 5. Allow to rest at room temperature for 5 minutes before cutting. Drizzle with any remaining glaze if desired.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "251"
},
{
  "url": "https://www.allrecipes.com/recipe/257538/authentic-tacos-al-pastor/",
  "name": "Authentic Tacos al Pastor",
  "rating": "4.5",
  "ratingcount": "4",
  "ingredients": "1  tomato; 3  dried guajillo chile peppers, seeded; 2  dried ancho chile peppers, seeded; 1  pineapple, sliced 3/4-inch thick; ½ cup orange juice; 1  onion, quartered; ¼ cup white vinegar; 2  chipotle peppers in adobo sauce; 1 tablespoon salt, or to taste; 2 cloves garlic, crushed; 3  cloves; 1 teaspoon cumin seeds; 1 teaspoon dried oregano; 2 pounds boneless pork loin, thinly sliced; ½ cup chopped onion; ½ cup chopped fresh cilantro",
  "directions": "1. Cook tomato on a ridged grill pan over medium-high heat until slightly blackened, about 5 minutes. Remove from heat and cool until easily handled. Peel off skin and remove seeds. 2. Bring a small pot of water to a boil. Add guajillo and ancho chile peppers; cook until softened, about 5 minutes. Drain. 3. Combine tomato flesh, softened chile peppers, 2 slices pineapple, orange juice, quartered onion, vinegar, chipotle peppers, salt, garlic, cloves, cumin seeds, and oregano in a blender; blend until smooth. 4. Arrange pork slices in a glass or ceramic baking dish. Pour blended mixture over pork, ensuring all sides are evenly coated. Cover baking dish with plastic wrap. 5. Marinate pork in the refrigerator, 4 hours to overnight. 6. Cook remaining pineapple slices on a ridged grill pan over medium-high heat until slightly blackened and soft, about 5 minutes per side. Chop into small pieces. 7. Wipe out grill pan and preheat over medium-high heat. Cook marinated pork in the hot pan, turning once, until browned, 4 to 5 minutes. 8. Chop pork coarsely into small pieces against the grain. Serve with pineapple, chopped onion, and cilantro.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "5 hrs",
  "calories": "204"
},
{
  "url": "https://www.allrecipes.com/recipe/51997/maple-garlic-marinated-pork-tenderloin/",
  "name": "Maple-Garlic Marinated Pork Tenderloin",
  "rating": "4.4",
  "ratingcount": "683",
  "ingredients": "2 tablespoons Dijon mustard; 1 teaspoon sesame oil; 3 cloves garlic, minced; fresh ground black pepper to taste; 1 cup maple syrup; 1 ½ pounds pork tenderloin",
  "directions": "1. Combine mustard, sesame oil, garlic, pepper, and maple syrup. Place pork in a shallow dish and coat thoroughly with marinade. Cover, then chill in the refrigerator at least eight hours, or overnight. 2. Preheat grill for medium-low heat. 3. Remove pork from marinade, and set aside. Transfer remaining marinade to a small saucepan, and cook on the stove over medium-low heat for 5 minutes. 4. Brush grate with oil, and place meat on grate. Grill pork, basting with reserved marinade, for approximately 15 to 25 minutes, or until interior is no longer pink. Avoid using high temperatures as marinade will burn.",
  "prep": "5 mins",
  "cook": "25 mins",
  "total": "8 hrs 30 mins",
  "calories": "288"
},
{
  "url": "https://www.allrecipes.com/recipe/230600/bacon-wrapped-stuffed-pork-tenderloin/",
  "name": "Bacon Wrapped Stuffed Pork Tenderloin",
  "rating": "4.2",
  "ratingcount": "44",
  "ingredients": "1  pork tenderloin; 3 slices bread, torn into small pieces; ¼ cup butter, melted; 3 tablespoons poultry seasoning; 1 medium onion, chopped fine; 1 stalk celery, chopped fine; salt and ground black pepper to taste; 6 slices bacon",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). 2. Slice the pork almost in half, but do not cut all the way through. Butterfly the sides until the pork is open enough to stuff. 3. Mix torn bread, melted butter, poultry seasoning, onion, and celery in a bowl until bread is evenly coated with butter and seasoning; season with salt and pepper. Stuff the pork tenderloin with the bread mixture. Wrap the pork around the filling and secure closed with toothpicks. Wrap bacon slices around the stuffed tenderloin. Season top of tenderloin with black pepper. 4. Cook in the preheated oven until pork is cooked through, about 45 minutes. An instant-read thermometer inserted into the center of the stuffing should read at least 145 degrees F (63 degrees C).",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "330"
},
{
  "url": "https://www.allrecipes.com/recipe/25148/roasted-pork-tenderloin/",
  "name": "Roasted Pork Tenderloin",
  "rating": "4.5",
  "ratingcount": "117",
  "ingredients": "2 pounds pork tenderloin; ½ teaspoon ground sage; garlic salt to taste; 1 (32 ounce) jar sauerkraut, drained; ½  apple; ½  onion; ⅓ cup brown sugar",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Rub tenderloin with sage and garlic salt. Place tenderloin in a baking pan or casserole. Cover meat with half of the sauerkraut. Place the apple and onion, cut side down, on top of the sauerkraut. Cover with remaining sauerkraut. Sprinkle with brown sugar. 3. Cover and bake in preheated oven for 2 to 3 hours, until the internal temperature has reached 145 degrees F (63 degrees C).",
  "prep": "10 mins",
  "cook": "3 hrs",
  "total": "3 hrs 10 mins",
  "calories": "199"
},
{
  "url": "https://www.allrecipes.com/recipe/222187/pork-tenderloin-diablo/",
  "name": "Pork Tenderloin Diablo",
  "rating": "4.8",
  "ratingcount": "819",
  "ingredients": "1 (1 pound) whole pork tenderloin; salt and freshly ground black pepper to taste; 2 teaspoons vegetable oil; ½ cup chicken broth; 2 tablespoons heavy cream; 1 tablespoon extra-hot prepared horseradish; 1 tablespoon Dijon mustard; ¼ teaspoon cayenne pepper; 1 tablespoon cold butter; 1 teaspoon chopped fresh chives",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Season pork with salt and pepper. 2. Heat oil in an ovenproof skillet over high heat. Cook pork until browned on one side, 3 to 4 minutes. Turn over pork and transfer the skillet to the preheated oven. Cook until pork is browned and still slightly pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Transfer pork to a plate. 3. Remove any excess oil from the skillet and place it over medium-high heat. Pour in chicken broth and bring to a boil, scraping any browned bits off of the bottom of the pan. Whisk in cream, horseradish, Dijon mustard, and cayenne pepper. Continue cooking until the mixture is reduced to a thick sauce, 3 to 4 minutes. Remove from heat and whisk in cold butter. Stir in chives. 4. Slice pork into 1/2-inch slices and serve topped with sauce.",
  "prep": "5 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "235"
},
{
  "url": "https://www.allrecipes.com/recipe/278038/air-fryer-mustard-crusted-pork-tenderloin-with-potatoes-and-green-beans/",
  "name": "Air Fryer Mustard-Crusted Pork Tenderloin with Potatoes and Green Beans",
  "rating": "4.8",
  "ratingcount": "16",
  "ingredients": "¼ cup Dijon mustard; 2 tablespoons brown sugar; 1 teaspoon dried parsley flakes; ½ teaspoon dried thyme; ¼ teaspoon salt; ¼ teaspoon ground black pepper; 1 ¼ pounds pork tenderloin; ¾ pound small potatoes (such as The Little Potato® Company), halved; 1 (12 ounce) package fresh green beans, trimmed; 1 tablespoon olive oil; salt and ground black pepper to taste",
  "directions": "1. Preheat an air fryer to 400 degrees F (200 degrees C) according to manufacturer's instructions. 2. Whisk mustard, brown sugar, parsley, thyme, salt, and pepper together in a large bowl. Place tenderloin into the bowl and roll through the mustard mixture until evenly coated on all sides. 3. Place potatoes, green beans, and olive oil into a separate bowl. Season with salt and pepper to taste and stir until evenly combined. Set aside. 4. Place tenderloin into the basket of the preheated air fryer and cook, undisturbed, until slightly pink in the center, about 20 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Transfer to a cutting board and let rest for 10 minutes. 5. Meanwhile, place green beans and potatoes into the air fryer basket and cook for 10 minutes, shaking halfway through cook time. 6. Slice tenderloin and serve with potatoes and green beans.",
  "prep": "10 mins",
  "cook": "30 mins",
  "total": "40 mins",
  "calories": "286"
},
{
  "url": "https://www.allrecipes.com/recipe/22331/pork-chop-suey/",
  "name": "Pork Chop Suey",
  "rating": "4.4",
  "ratingcount": "98",
  "ingredients": "1 pound pork tenderloin; ¼ cup all-purpose flour; 2 tablespoons vegetable oil, divided; 2 cups thinly sliced bok choy; 1 cup chopped celery; 1 cup red bell pepper, cut into 1/4 inch strips; 1 cup sliced mushrooms; 1 (8 ounce) can water chestnuts, sliced; 2 cloves garlic, minced; ¼ cup chicken broth; ¼ cup soy sauce; 1 tablespoon cornstarch; 1 tablespoon dry sherry; ½ teaspoon ground ginger",
  "directions": "1. Trim fat from pork, cut into 1 inch pieces. Combine flour and pork in a resealable bag, seal and shake well. 2. Heat 1 tablespoon oil in a large skillet over medium high heat. Add pork, cook 3 minutes or until browned. Remove from pan and keep warm. 3. Heat remaining tablespoon oil in pan. Add bok choy, celery, red pepper, mushrooms, water chestnuts and garlic; stir fry for 3 minutes. In a bowl combine chicken broth, soy sauce, cornstarch, sherry and ginger. Stir well with a whisk. Combine pork and broth mixture in skillet, cook 1 minute or until thick.",
  "prep": "45 mins",
  "cook": "6 mins",
  "total": "51 mins",
  "calories": "194"
},
{
  "url": "https://www.allrecipes.com/recipe/16415/pork-tenderloin/",
  "name": "Pork Tenderloin",
  "rating": "4.4",
  "ratingcount": "148",
  "ingredients": "½ cup dry sherry; ½ cup soy sauce; 3 cloves garlic, minced; 2 tablespoons fresh ginger root, minced; 2 ½ pounds pork tenderloin; ⅛ teaspoon dry mustard powder, or to taste; ⅛ teaspoon dried thyme; ¾ cup apple jelly; 2 tablespoons dry sherry; 1 tablespoon soy sauce",
  "directions": "1. Marinate the pork: Whisk sherry, soy sauce, garlic, and ginger together in a large glass baking dish. 2. Rub pork with mustard powder and thyme, then transfer to the bowl with marinade. Turn pork until well coated. Cover and refrigerate for 8 hours to overnight. 3. When ready to cook the pork, preheat the oven to 325 degrees F (165 degrees C). Remove pork from the refrigerator and uncover; leave marinade in the dish. 4. Bake in the preheated oven, basting occasionally with the marinade, until pork is slightly pink in the center, 60 to 65 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). 5. When the pork is almost finished, make the sauce: Heat apple jelly in a small saucepan over medium heat until warm. Stir in sherry and soy sauce, reduce the heat to low, and simmer gently until pork is ready. 6. Slice pork tenderloin and serve warm apple jelly sauce over top.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "9 hrs 10 mins",
  "calories": "220"
}]