[{
  "url": "https://www.allrecipes.com/recipe/245210/prosciutto-wrapped-pork-tenderloin-with-crispy-sage/",
  "name": "Prosciutto-Wrapped Pork Tenderloin with Crispy Sage",
  "rating": "4.7",
  "ratingcount": "13",
  "ingredients": "1 pound pork tenderloin; salt and ground black pepper to taste; 1 bunch fresh sage, leaves removed and stems discarded, divided; 6 ounces prosciutto; 1 tablespoon olive oil, or more as needed",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Lightly season pork with salt and black pepper. Arrange about 6 sage leaves over tenderloin. Wrap prosciutto around tenderloin and sage, overlapping prosciutto slightly; wrap in plastic wrap and refrigerate to allow prosciutto to set on pork tenderloin, 5 to 10 minutes. Remove plastic wrap. 3. Heat olive oil in a skillet over medium heat. Fry wrapped tenderloin in the hot oil until prosciutto is crispy and lightly browned on all sides, 8 to 10 minutes. Transfer wrapped tenderloin to a baking dish, reserving oil in the skillet. 4. Bake tenderloin in the preheated oven until pork is cooked through, about 20 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). 5. Heat reserved oil in the skillet over medium heat; fry remaining sage leaves until crispy, adding more oil as needed, about 5 minutes. 6. Slice tenderloin and serve with crispy sage leaves.",
  "prep": "10 mins",
  "cook": "35 mins",
  "total": "50 mins",
  "calories": "294"
},
{
  "url": "https://www.allrecipes.com/recipe/8544430/sheet-balsamic-pork-tenderloin-with-rainbow-vegetables/",
  "name": "Sheet Pan Balsamic Pork Tenderloin with Rainbow Vegetables",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "4 tablespoons olive oil, divided; 2  dates, pitted and chopped, or to taste; 3 tablespoons white balsamic vinegar; 2 teaspoons minced fresh rosemary; 1 teaspoon sliced garlic; 1 teaspoon salt, or to taste; ½ teaspoon freshly ground black pepper, or to taste; 6 cups 1/2-inch x 2-inch rainbow carrot sticks; 4 cups 1/2-inch x 2-inch peeled, seeded butternut squash chunks; ½  red onion, sliced lengthwise; 2 (1 1/4 pound) pork tenderloins",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). Line a sheet pan with parchment paper or foil. 2. Place 2 tablespoons olive oil, dates, vinegar, rosemary, garlic, salt, and pepper in a blender or small food processor. Pulse several times to mix, then puree until smooth, about 1 minute. Reserve 2 tablespoons of the mixture for later use. 3. Combine rainbow carrots, butternut squash, and red onion in a large bowl. Toss with balsamic mixture, and place on the prepared sheet pan. 4. Roast vegetables, uncovered in the preheated oven for 20 minutes. 5. Meanwhile, blot tenderloins with paper towels. Heat 1 tablespoon oil in a large skillet over medium-high heat. Place tenderloins in skillet and cook until lightly browned, about 2 minutes per side. 6. Stir vegetables; nestle tenderloins into vegetables. Brush each tenderloin with 1 tablespoon reserved balsamic mixture and return the sheet pan to the oven. 7. Roast, uncovered, until vegetables are tender and pork is slightly pink in the center, about 20 minutes. The internal temperature of the meat should read at least 145 degrees F (63 degrees C). 8. Drizzle vegetables and tenderloins with remaining 1 tablespoon olive oil.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "306"
},
{
  "url": "https://www.allrecipes.com/recipe/8529787/air-fryer-pork-tenderloin-with-sweet-potatoes/",
  "name": "Air Fryer Pork Tenderloin with Sweet Potatoes",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "¼ cup olive oil, plus more for greasing; ½ cup pineapple preserves; ½ teaspoon granulated garlic; ½ teaspoon cayenne pepper; 1 teaspoon salt, or to taste; ½ teaspoon freshly ground white pepper, or to taste; 1 ½ pounds sweet potatoes, cut into 1-inch pieces; 2 ½ pounds pork tenderloins",
  "directions": "1. Preheat air fryer to 390 degrees F (200 degrees C), if recommended by manufacturer. 2. Combine olive oil, pineapple preserves, garlic granules, cayenne, salt, and white pepper in a large mixing bowl; stir to combine. 3. Place sweet potato pieces into the mixing bowl and toss with the pineapple preserves mixture. Remove sweet potatoes to a plate, reserving the remaining pineapple mixture. 4. Pat tenderloins dry with paper towels. Place in the mixing bowl with the remaining pineapple mixture and toss to coat. 5. Brush interior basket of the air fryer with the remaining olive oil. Place tenderloins in the basket, and in a single layer, add as many sweet potato pieces as will fit around the tenderloins. Set aside extra sweet potato pieces. You will cook them as a second batch. 6. Air fry for 10 minutes. Turn tenderloins over, browned side down. Stir sweet potatoes, but keep them in a single layer. Air fry until pork loin is slightly pink in the center, about 10 minutes longer. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). If the tenderloins need more cooking time, turn them again and continue cooking and testing the temperature in 5 minute increments. 7. Remove sweet potatoes from the air fryer when they are tender and caramelized. (See Cook's Note). 8. When the tenderloins test done, place them on a platter and tent with foil. Allow to rest while the remaining sweet potatoes cook, about 10 more minutes.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr",
  "calories": "472"
},
{
  "url": "https://www.allrecipes.com/recipe/25666/creamy-slow-cooker-potato-cheese-soup/",
  "name": "Creamy Slow Cooker Potato Cheese Soup",
  "rating": "3.9",
  "ratingcount": "154",
  "ingredients": "¼ cup butter; ½  white onion, chopped; ¼ cup all-purpose flour; 2 cups water; 2 large carrots, diced; 4 stalks celery, diced; 1 tablespoon dried, minced garlic; salt and pepper to taste; 1 cup milk; 2 tablespoons chicken soup base; 1 cup warm water; 5 pounds russet potatoes, peeled and cubed; 1  bay leaf; 1 cup shredded Cheddar cheese; 6 slices crisp cooked bacon, crumbled",
  "directions": "1. Melt butter in a large saucepan over medium heat. Cook onion in butter until translucent. Stir in flour until smooth, then gradually stir in 2 cups water, carrots, celery, garlic, salt, and pepper. Heat through, then stir in milk. Dissolve chicken base in 1 cup warm water, and pour into vegetable mixture. 2. Place potatoes in slow cooker, and pour heated vegetable mixture into potatoes. Place bay leaf in pot. 3. Cover, and cook 5 hours on High, or 8 hours on Low. 4. Remove bay leaf. Puree about 4 cups of the soup in a blender or food processor, and then stir pureed soup into contents of slow cooker. Stir in cheese and bacon until cheese is melted.",
  "prep": "30 mins",
  "cook": "5 hrs",
  "total": "5 hrs 30 mins",
  "calories": "169"
},
{
  "url": "https://www.allrecipes.com/recipe/8465712/balsamic-braised-pork-tenderloins-with-fresh-figs/",
  "name": "Balsamic Braised Pork Tenderloins with Fresh Figs",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "2 (1 1/2 pound) pork tenderloins; 1 teaspoon kosher salt, or to taste; ½ teaspoon freshly ground black pepper, or to taste; 2 tablespoons olive oil; 2  shallots, thinly sliced lengthwise; 12  fresh figs, stemmed and halved; 1 cup chicken broth; ¼ cup good-quality balsamic vinegar; 1 tablespoon minced fresh rosemary; fresh rosemary sprigs for garnish (optional)",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Pat tenderloins dry and remove silver skin, if present. Season with kosher salt and freshly ground pepper, to taste. 3. Pour oil into a large, oven-proof skillet and heat over medium-heat until oil shimmers. Carefully place seasoned tenderloins into the hot oil and brown on all sides, 7 to 10 minutes total. 4. Add sliced shallots around tenderloins and stir, about 1 minute. Add figs, chicken broth, and balsamic vinegar. When the mixture begins to bubble, sprinkle minced rosemary over everthing. 5. Cover, place in the preheated oven and bake until pork is no longer pink in the center, 25 to 30 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). 6. Using tongs, remove pork from the skillet and place on a serving platter. With a slotted spoon, remove figs from the skillet and place around the tenderloins. Cover loosely with foil. 7. Place skillet back onto the stovetop over medium-high heat. Bring pan juices to a boil and allow to reduce to about 3/4 cup, 10 to 15 minutes. 8. Slice tenderloins, drizzle reduced liquid over the meat, and garnish with fresh rosemary sprigs, if desired.",
  "prep": "15 mins",
  "cook": "45 mins",
  "total": "1 hr",
  "calories": "307"
},
{
  "url": "https://www.allrecipes.com/recipe/8420615/pork-tenderloin-with-peaches/",
  "name": "Pork Tenderloin with Peaches",
  "rating": "4.0",
  "ratingcount": "4",
  "ingredients": "3 slices bacon; 1 (2 pound) package pork tenderloin; ½ teaspoon salt; ¼ teaspoon freshly ground black pepper; ¾ teaspoon ground ginger, divided; 1 ½ cups vertically sliced onion; 1 ½ teaspoons minced garlic; 2 cups peeled and sliced fresh peaches; 1 cup low-sodium chicken broth; 2 tablespoons frozen orange juice concentrate; 1 teaspoon fish sauce; 2 tablespoons water; 2 tablespoons cornstarch; fresh parsley for garnish (optional)",
  "directions": "1. Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned and crisp, about 10 minutes. Drain bacon slices on paper towels. Reserve drippings in the skillet. 2. Dry pork tenderloin with paper towels and season both sides with salt, pepper, and 1/4 teaspoon ground ginger. 3. Increase heat to medium-high and brown tenderloin in the bacon drippings on all sides, 5 to 7 minutes. Removed browned tenderloin from skillet, transfer to a plate, and keep warm. 4. Reduce heat to medium. Add onion slices to the same skillet and stir until onions are soft and beginning to take on some color, 3 to 5 minutes. Stir in garlic and cook until fragrant, about 1 minute. 5. Add sliced peaches, chicken broth, orange juice concentrate, and remaining ground ginger. Bring to a boil and return tenderloin to the skillet. Pile peaches on top of the meat, cover, reduce heat to simmer, and cook until pork is slightly pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). 6. Arrange pork and peaches on a serving platter. 7. Meanwhile, combine fish sauce, water, and cornstarch in a small bowl and stir until there are no lumps. Increase heat to medium and bring skillet contents back to a boil. Add cornstarch mixture to the liquid in the skillet and stir quickly until sauce is bubbly and thickened, about 5 minutes. 8. Pour sauce over pork and peaches. Crumble up cooked bacon and sprinkle over the peaches. Garnish with parsley, if desired, and serve warm.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "200"
},
{
  "url": "https://www.allrecipes.com/recipe/23600/worlds-best-lasagna/",
  "name": "World's Best Lasagna",
  "rating": "4.8",
  "ratingcount": "20",
  "ingredients": "1 pound sweet Italian sausage; ¾ pound lean ground beef; ½ cup minced onion; 2 cloves garlic, crushed; 1 (28 ounce) can crushed tomatoes; 2 (6.5 ounce) cans canned tomato sauce; 2 (6 ounce) cans tomato paste; ½ cup water; 2 tablespoons white sugar; 4 tablespoons chopped fresh parsley, divided; 1 ½ teaspoons dried basil leaves; 1 ½ teaspoons salt, divided, or to taste; 1 teaspoon Italian seasoning; ½ teaspoon fennel seeds; ¼ teaspoon ground black pepper; 12  lasagna noodles; 16 ounces ricotta cheese; 1  egg; ¾ pound mozzarella cheese, sliced; ¾ cup grated Parmesan cheese",
  "directions": "1. Gather all your ingredients. 2. Cook sausage, ground beef, onion, and garlic in a Dutch oven over medium heat until well browned. 3. Stir in crushed tomatoes, tomato sauce, tomato paste, and water. Season with sugar, 2 tablespoons parsley, basil, 1 teaspoon salt, Italian seasoning, fennel seeds, and pepper. Simmer, covered, for about 1 1/2 hours, stirring occasionally. 4. Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. 5. In a mixing bowl, combine ricotta cheese with egg, remaining 2 tablespoons parsley, and 1/2 teaspoon salt. 6. Preheat the oven to 375 degrees F (190 degrees C). 7. To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with 1/2 of the ricotta cheese mixture. Top with 1/3 of the mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. 8. Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray or make sure the foil does not touch the cheese. 9. Bake in the preheated oven for 25 minutes. Remove the foil and bake for an additional 25 minutes. 10. Rest lasagna for 15 minutes before serving.",
  "prep": "30 mins",
  "cook": "2 hrs 30 mins",
  "total": "3 hrs 15 mins",
  "calories": "448"
},
{
  "url": "https://www.allrecipes.com/recipe/241728/bacon-garlic-green-beans/",
  "name": "Bacon-Garlic Green Beans",
  "rating": "4.6",
  "ratingcount": "27",
  "ingredients": "3 pounds fresh green beans, trimmed; 4 slices bacon; 1 cup butter; 4 cloves garlic, minced; ½ teaspoon lemon zest",
  "directions": "1. Place green beans in a pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until beans start to soften, about 10 minutes. Drain water, leaving beans in the pot. 2. Place bacon strips on a microwave-safe plate and cook in the microwave until crisp, about 2 minutes. Cool and crumble bacon. 3. Stir butter and bacon into beans in the pot and return to medium heat; cook and stir until butter melts, 2 to 3 minutes. Add garlic; cook and stir until fragrant, 3 to 4 minutes. Top with lemon zest and stir.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "189"
},
{
  "url": "https://www.allrecipes.com/recipe/241782/bacon-wrapped-cherries/",
  "name": "Bacon-Wrapped Cherries",
  "rating": "4.7",
  "ratingcount": "6",
  "ingredients": "36  maraschino cherries, stemmed, drained and juice reserved; 18 slices bacon slices, halved; 36  toothpicks",
  "directions": "1. Set the oven rack about 6 inches from the heat source and preheat the oven's broiler. 2. Wrap each cherry with a bacon half, secure with a toothpick, and arrange on a baking sheet. Drizzle reserved cherry juice over wrapped cherries. 3. Broil in the preheated oven until bacon is crisped to your liking, 3 to 10 minutes.",
  "prep": "20 mins",
  "cook": "5 mins",
  "total": "25 mins",
  "calories": "65"
},
{
  "url": "https://www.allrecipes.com/recipe/216756/baked-ham-and-cheese-party-sandwiches/",
  "name": "Baked Ham and Cheese Sliders",
  "rating": "4.8",
  "ratingcount": "989",
  "ingredients": "¾ cup melted butter; 1 ½ tablespoons Dijon mustard; 1 ½ teaspoons Worcestershire sauce; 1 ½ tablespoons poppy seeds; 1 tablespoon dried minced onion; 24  mini sandwich rolls; 1 pound thinly sliced cooked deli ham; 1 pound thinly sliced Swiss cheese",
  "directions": "1. Gather all ingredients. 2. Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. 3. Mix butter, Dijon mustard, Worcestershire sauce, poppy seeds, and dried onion in a bowl. 4. Separate the tops from the bottoms of the rolls; arrange the bottom pieces in a layer in the prepared baking dish. Layer about 1/2 of the ham onto the rolls; add a layer of Swiss cheese and top with remaining ham slices. 5. Place the tops of the rolls onto the sandwiches. Pour mustard mixture evenly over the rolls 6. Bake in the preheated oven until the rolls are lightly browned and the cheese has melted, about 20 minutes. Slice into individual rolls through the ham and cheese layers to serve.",
  "prep": "15 mins",
  "cook": "20 mins",
  "total": "35 mins",
  "calories": "208"
},
{
  "url": "https://www.allrecipes.com/recipe/92462/slow-cooker-texas-pulled-pork/",
  "name": "Slow Cooker Texas Pulled Pork",
  "rating": "4.5",
  "ratingcount": "3",
  "ingredients": "1 teaspoon vegetable oil; 1 (4 pound) pork shoulder roast; 1 cup barbeque sauce; ½ cup apple cider vinegar; ½ cup chicken broth; ¼ cup light brown sugar; 1 tablespoon prepared yellow mustard; 1 tablespoon Worcestershire sauce; 1 tablespoon chili powder; 1 extra large onion, chopped; 2 large cloves garlic, crushed; 1 ½ teaspoons dried thyme; 8  hamburger buns, split; 2 tablespoons butter, or as needed",
  "directions": "1. Pour vegetable oil into the bottom of a slow cooker. Place pork roast into the slow cooker; pour in barbeque sauce, vinegar, and chicken broth. Stir in brown sugar, yellow mustard, Worcestershire sauce, chili powder, onion, garlic, and thyme. Cover and cook on Low for 10 to 12 hours or High for 5 to 6 hours until pork shreds easily with a fork. 2. Remove pork from the slow cooker, and shred the meat using two forks. Return shredded pork to the slow cooker, and stir to combine with juices. 3. Spread the inside of both halves of hamburger buns with butter. Toast buns, butter-side down, in a skillet over medium heat until golden brown. Spoon pulled pork into toasted buns.",
  "prep": "15 mins",
  "cook": "5 hrs",
  "total": "5 hrs 15 mins",
  "calories": "528"
},
{
  "url": "https://www.allrecipes.com/recipe/216391/easy-sausage-gravy-and-biscuits/",
  "name": "Easy Sausage Gravy and Biscuits",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "1 (16 ounce) can refrigerated jumbo buttermilk biscuits; 1 (9.6 ounce) package Jimmy Dean® Original Hearty Pork Sausage Crumbles; ¼ cup flour; 2 ½ cups milk; salt and freshly ground black pepper to taste",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Arrange biscuits 1 to 2 inches apart on an ungreased cookie sheet. Bake in the preheated oven until golden brown, about 13 to 15 minutes. 2. Meanwhile, cook sausage in a large skillet over medium heat until thoroughly heated, stirring frequently, about 5 to 6 minutes. 3. Stir in flour until well combined. Gradually add milk, stirring continuously, until the gravy thickens and comes to a boil. Reduce heat to medium-low; simmer and stir for 2 more minutes. Season to taste with salt and pepper. 4. Split biscuits in half. Place 2 halves on each of 8 plates; top with about 1/3 cup gravy.",
  "prep": "5 mins",
  "cook": "10 mins",
  "total": "15 mins",
  "calories": "333"
},
{
  "url": "https://www.allrecipes.com/recipe/21766/roasted-pork-loin/",
  "name": "Roasted Pork Loin",
  "rating": "4.5",
  "ratingcount": "1",
  "ingredients": "3 cloves garlic, minced; 1 tablespoon dried rosemary; salt and pepper to taste; 2 pounds boneless pork loin roast; ¼ cup olive oil; ½ cup white wine",
  "directions": "1. Gather all ingredients. 2. Preheat oven to 350 degrees F (175 degrees C). 3. Crush garlic with rosemary, salt, and pepper in a mortar and pestle to make a paste. 4. Pierce meat with a sharp knife in several places and press garlic paste into the openings. Rub pork loin with the remaining garlic mixture and olive oil. Set into an oven-safe pan. 5. Place pork loin into the preheated oven, turning and basting with pan liquids every 30 minutes. Cook until the pork is no longer pink in the center, 90 minutes to 2 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Remove roast to a platter and keep warm. 6. Place pan onto the stove over medium-high heat and pour wine into it. Heat wine and stir to loosen browned bits from the bottom of the pan. Simmer for 3 to 5 minutes. 7. Slice pork loin and serve with pan juices.",
  "prep": "20 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 50 mins",
  "calories": "300"
},
{
  "url": "https://www.allrecipes.com/recipe/51803/kickin-collard-greens/",
  "name": "Kickin' Collard Greens",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "1 tablespoon olive oil; 3 slices bacon; 1 large onion, chopped; 2 cloves garlic, minced; 1 pound fresh collard greens, cut into 2-inch pieces; 3 cups chicken broth; 1 teaspoon salt; 1 teaspoon pepper; 1 pinch red pepper flakes",
  "directions": "1. Gather all ingredients. 2. Heat oil in a large pot over medium-high heat. Add bacon, and cook until crisp, 5 to 7 minutes. Remove bacon from pan, crumble, and return to the pan. 3. Add onion to the pan and cook until tender, about 5 minutes. Add garlic, and cook until just fragrant. Add collard greens, and fry until they start to wilt. 4. Pour in chicken broth and season with salt, pepper, and red pepper flakes. Reduce heat to low, cover, and simmer until greens are tender, about 45 minutes. 5. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "127"
},
{
  "url": "https://www.allrecipes.com/recipe/14295/seven-layer-salad/",
  "name": "Seven Layer Salad",
  "rating": "4.7",
  "ratingcount": "690",
  "ingredients": "1 pound bacon; 1 large head iceberg lettuce - rinsed, dried, and chopped; 1  red onion, chopped; 1 (10 ounce) package frozen green peas, thawed; 10 ounces shredded Cheddar cheese; 1 cup chopped cauliflower; 1 ¼ cups mayonnaise; ⅔ cup grated Parmesan cheese; 2 tablespoons white sugar",
  "directions": "1. For the salad: Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; crumble and set aside. 2. Place chopped lettuce in a large glass dish or bowl; top with a layer of red onion, peas, shredded cheese, cauliflower, and bacon. 3. For the dressing: Whisk mayonnaise, Parmesan cheese, and sugar together in a bowl until smooth. Drizzle over salad and refrigerate until chilled.",
  "prep": "15 mins",
  "cook": "10 mins",
  "total": "25 mins",
  "calories": "387"
},
{
  "url": "https://www.allrecipes.com/recipe/13384/split-pea-soup/",
  "name": "Split Pea Soup",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "2 ¼ cups dried split peas; 2 quarts cold water, plus more as needed; 1 ½ pounds ham bone; 2  onions, thinly sliced; ½ teaspoon salt; ¼ teaspoon ground black pepper; 1 pinch dried marjoram; 3 stalks celery, chopped; 3  carrots, chopped; 1  potato, diced",
  "directions": "1. Place peas in a large stockpot and cover with several inches of cold water; let soak, 8 hours to overnight. Drain, rinse, and return peas to the pot. 2. Add 2 quarts of cold water, ham bone, onion, salt, pepper, and marjoram to the stockpot. Cover, bring to a boil, and simmer for 1 1/2 hours, stirring occasionally. 3. Remove ham bone; cut off meat, dice, and return meat to soup. Add celery, carrots, and potatoes. Cook slowly, uncovered, until vegetables are tender, about 30 to 40 minutes.",
  "prep": "15 mins",
  "cook": "2 hrs",
  "total": "10 hrs 15 mins",
  "calories": "310"
},
{
  "url": "https://www.allrecipes.com/recipe/31848/jambalaya/",
  "name": "Best Jambalaya",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "2 tablespoons peanut oil, divided; 1 tablespoon Cajun seasoning; 10 ounces andouille sausage, sliced into rounds; 1 pound boneless skinless chicken breasts, cut into 1 inch pieces; 1  onion, diced; 1 small green bell pepper, diced; 2 stalks celery, diced; 3 cloves garlic, minced; 1 (16 ounce) can crushed Italian tomatoes; ½ teaspoon red pepper flakes; ½ teaspoon ground black pepper; 1 teaspoon salt; ½ teaspoon hot pepper sauce; 2 teaspoons Worcestershire sauce; 1 teaspoon file powder; 1 ¼ cups uncooked white rice; 2 ½ cups chicken broth",
  "directions": "1. Gather all ingredients. 2. Heat 1 tablespoon of peanut oil in a large heavy Dutch oven over medium heat. Season the sausage and chicken pieces with Cajun seasoning. Sauté sausage until browned. Remove with slotted spoon, and set aside. 3. Add 1 tablespoon peanut oil, and sauté chicken pieces until lightly browned on all sides. Remove with a slotted spoon, and set aside. 4. In the same pot, saute onion, bell pepper, celery, and garlic until tender. 5. Stir in crushed tomatoes, and season with red pepper, black pepper, salt, hot pepper sauce, Worcestershire sauce, and filé powder. 6. Stir in chicken and sausage. Cook for 10 minutes, stirring occasionally. 7. Stir in the rice and chicken broth. 8. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes, or until liquid is absorbed.",
  "prep": "20 mins",
  "cook": "45 mins",
  "total": "1 hr 5 mins",
  "calories": "465"
},
{
  "url": "https://www.allrecipes.com/recipe/13218/absolutely-ultimate-potato-soup/",
  "name": "Absolutely Ultimate Potato Soup",
  "rating": "4.7",
  "ratingcount": "2",
  "ingredients": "1 pound bacon, chopped; 2 stalks celery, diced; 1  onion, chopped; 3 cloves garlic, minced; 8  potatoes, peeled and cubed; 4 cups chicken stock, or enough to cover potatoes; 3 tablespoons butter; ¼ cup all-purpose flour; 1 cup heavy cream; 1 teaspoon dried tarragon; 3 teaspoons chopped fresh cilantro; salt and freshly ground black pepper to taste",
  "directions": "1. Gather all ingredients. 2. Place bacon in a Dutch oven and cook over medium-high heat, turning occasionally, until evenly browned, 5 to 10 minutes. Drain bacon pieces on paper towels. Drain off all but 1/4 cup of the bacon grease. 3. Cook celery and onion in the reserved bacon drippings until onion is soft and translucent, about 5 minutes. Stir in garlic, and continue cooking for 1 to 2 minutes. 4. Add cubed potatoes, and toss to coat. Sauté for 3 to 4 minutes. Return bacon to the pan, and add enough chicken stock to just cover the potatoes. Cover, and simmer until potatoes are tender, 15 to 20 minutes. 5. Meanwhile, melt butter in a separate skillet over medium heat. Whisk in flour. Cook, stirring constantly, 1 to 2 minutes. Whisk in heavy cream, tarragon, and cilantro. 6. Bring cream mixture to a boil, and cook, stirring constantly, until thickened, about 5 minutes. Add cream mixture to the potato mixture; stir to combine. 7. Transfer about 1/2 of the soup to a blender and purée. Return to the Dutch oven. Adjust seasonings to taste. 8. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "30 mins",
  "total": "45 mins",
  "calories": "594"
},
{
  "url": "https://www.allrecipes.com/recipe/216888/good-new-orleans-creole-gumbo/",
  "name": "Good New Orleans Creole Gumbo",
  "rating": "4.9",
  "ratingcount": "1",
  "ingredients": "1 cup all-purpose flour; ¾ cup bacon drippings; 1 cup coarsely chopped celery; 1 large onion, coarsely chopped; 1 large green bell pepper, coarsely chopped; 2 cloves garlic, minced; 1 pound andouille sausage, sliced; 3 quarts water; 6 cubes beef bouillon; 1 tablespoon white sugar; salt to taste; 2 tablespoons hot pepper sauce (such as Tabasco®), or to taste; ½ teaspoon Cajun seasoning blend (such as Tony Chachere's®), or to taste; 4  bay leaves; ½ teaspoon dried thyme leaves; 1 (14.5 ounce) can stewed tomatoes; 1 (6 ounce) can tomato sauce; 4 teaspoons file powder, divided; 2 tablespoons bacon drippings; 2 (10 ounce) packages frozen cut okra, thawed; 2 tablespoons distilled white vinegar; 1 pound lump crabmeat; 3 pounds uncooked medium shrimp, peeled and deveined; 2 tablespoons Worcestershire sauce",
  "directions": "1. Gather all ingredients. 2. Make the roux: Whisk together flour and 3/4 cup bacon drippings in a large, heavy saucepan over medium-low heat until smooth. Cook roux, whisking constantly, until it turns a rich mahogany brown color. This can take 20 to 30 minutes; watch heat carefully and whisk constantly or roux will burn. Remove from heat; continue whisking until mixture stops cooking. 3. Make the gumbo: Place celery, onion, green bell pepper, and garlic into the work bowl of a food processor, and pulse until all vegetables are very finely chopped. 4. Stir vegetables into the roux, and mix in sausage. Bring mixture to a simmer over medium-low heat, and cook until vegetables are tender, 10 to 15 minutes. Remove from heat and set aside. 5. Combine water and beef bouillon cubes in a large Dutch oven or soup pot and bring to a boil over medium-high heat. Stir until bouillon cubes dissolve, then whisk roux mixture into the boiling water. 6. Reduce heat to a simmer and mix in sugar, salt, hot pepper sauce, Cajun seasoning, bay leaves, thyme, stewed tomatoes, and tomato sauce. Simmer soup over low heat for 1 hour; mix in 2 teaspoons of file gumbo powder at the 45-minute mark. 7. Meanwhile, melt 2 tablespoons bacon drippings in a skillet over medium heat. Add okra and vinegar and cook for 15 minutes; remove okra with a slotted spoon, and stir into the simmering gumbo. 8. Mix in reserved vegetables, crabmeat, shrimp, and Worcestershire sauce, and simmer until flavors have blended, 45 more minutes. Stir in 2 more teaspoons of file gumbo powder just before serving. 9. Serve hot and enjoy!",
  "prep": "1 hr",
  "cook": "2 hrs 40 mins",
  "total": "3 hrs 40 mins",
  "calories": "283"
},
{
  "url": "https://www.allrecipes.com/recipe/220854/chef-johns-italian-meatballs/",
  "name": "Chef John's Italian Meatballs",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "⅓ cup plain bread crumbs; ½ cup milk; 2 tablespoons olive oil; 1  onion, diced; 1 pound ground beef; 1 pound ground pork; 2  eggs; 2 tablespoons grated Parmesan cheese; ¼ bunch fresh parsley, chopped; 3 cloves garlic, crushed; 2 teaspoons salt; 1 teaspoon ground black pepper; 1 teaspoon dried Italian herb seasoning; ½ teaspoon red pepper flakes",
  "directions": "1. Cover a baking sheet with foil and spray lightly with cooking spray. Soak bread crumbs in milk in a small bowl for 20 minutes. 2. Meanwhile, heat olive oil in a skillet over medium heat. Add onion; cook and stir until onion has softened and turned translucent, about 5 minutes. Reduce heat to low and continue cooking and stirring until onion is very tender, about 15 minutes more. 3. Gently stir beef and pork together in a large bowl. Add onions, bread crumb mixture, eggs, Parmesan cheese, parsley, garlic, salt, black pepper, Italian herb seasoning, and red pepper flakes; mix together using a rubber spatula until combined. Cover and refrigerate for about one hour. 4. Preheat the oven to 425 degrees F (220 degrees C). 5. Form mixture into balls about 1 1/2 inches in diameter; arrange in a single layer on the prepared baking sheet. 6. Bake in the preheated oven until browned and cooked through, 15 to 20 minutes.",
  "prep": "20 mins",
  "cook": "35 mins",
  "total": "2 hrs 15 mins",
  "calories": "390"
},
{
  "url": "https://www.allrecipes.com/recipe/233603/bacon-wrapped-jalapeno-poppers/",
  "name": "Bacon-Wrapped Jalapeño Poppers",
  "rating": "4.7",
  "ratingcount": "484",
  "ingredients": "½ cup cream cheese; ½ cup shredded sharp Cheddar cheese; 12  jalapeno peppers, halved lengthwise, seeds and membranes removed; 12 slices bacon",
  "directions": "1. Gather ingredients. Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil. 2. Mix cream cheese and Cheddar cheese together in a bowl until evenly blended. Fill each jalapeño half with cheese mixture. 3. Put halves back together and wrap each stuffed pepper with a slice of bacon. Arrange bacon-wrapped peppers on the prepared baking sheet. 4. Bake in the preheated oven until bacon is crispy, 25 to 35 minutes. 5. Serve hot with your favorite dipping sauce. Enjoy!",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "213"
},
{
  "url": "https://www.allrecipes.com/recipe/40399/the-best-meatballs/",
  "name": "The Best Meatballs",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 pound ground beef; ½ pound ground veal; ½ pound ground pork; 1 cup freshly grated Romano cheese; 2  eggs; 2 cloves garlic, minced; 1 ½ tablespoons chopped Italian flat leaf parsley; salt and ground black pepper to taste; 2 cups stale Italian bread, crumbled; 1 ½ cups lukewarm water; 1 cup olive oil",
  "directions": "1. Combine beef, veal, and pork in a large bowl. Mix in cheese, eggs, garlic, parsley, salt, and pepper. 2. Add bread crumbs and slowly mix in water, 1/2 cup at a time, until mixture is moist but still holds its shape (I usually use about 1 1/4 cups of water); shape into meatballs. 3. Heat olive oil in a large skillet; add meatballs in batches and cook until browned on all sides, slightly crisp, and cooked through, about 10 to 15 minutes. Drain on paper towels.",
  "prep": "30 mins",
  "cook": "30 mins",
  "total": "1 hr",
  "calories": "613"
},
{
  "url": "https://www.allrecipes.com/recipe/220987/baked-bbq-baby-back-ribs/",
  "name": "Oven-Baked Baby Back Ribs",
  "rating": "4.6",
  "ratingcount": "835",
  "ingredients": "½ cup ancho chile powder; ¼ cup white sugar; ¼ cup brown sugar; ¼ cup salt; 2 tablespoons freshly ground black pepper; 1 tablespoon ground cumin; 1 teaspoon dry mustard; 1 teaspoon ground cayenne pepper; ½ teaspoon ground dried chipotle pepper; 1 rack baby back pork ribs; 1 cup barbeque sauce",
  "directions": "1. Gather ingredients and preheat the oven to 250 degrees F (120 degrees C). 2. Mix ancho chile powder, white and brown sugars, salt, black pepper, cumin, dry mustard, cayenne, and chipotle pepper in a small bowl until combined. 3. Place rib rack, meat-side down, on heavy-duty aluminum foil. Prick back of the rack several times with a knife. Generously apply a coating of dry rub to all sides of the rack. Store any remaining dry rub in an airtight container for future use. 4. With the meat facing down, fold foil around the rack to create a tight seal. Transfer to a sheet pan. 5. Bake in the preheated oven until tender and cooked through, about 2 hours. Remove and cool 15 minutes. 6. Increase oven temperature to 350 degrees F (175 degrees C). 7. Open foil, drain and discard any accumulated juices and fat. Brush barbeque sauce on all sides of the rack. 8. Turn the rack on the foil so the meat is facing up. Return to the oven, leaving the foil open and bake for 10 minutes. Remove from the oven and brush another layer of barbeque sauce on the meat side only. Repeat baking and brushing with sauce 4 more times, for a total of 50 minutes baking time. 9. Cut rack into individual rib segments and serve with more barbeque sauce.",
  "prep": "15 mins",
  "cook": "2 hrs 50 mins",
  "total": "3 hrs 20 mins",
  "calories": "488"
},
{
  "url": "https://www.allrecipes.com/recipe/213073/slow-cooker-cocktail-smokies/",
  "name": "Slow Cooker Cocktail Smokies",
  "rating": "4.5",
  "ratingcount": "259",
  "ingredients": "1 (12 ounce) bottle barbeque sauce; 1 (8 ounce) jar grape jelly; 2 (14 ounce) packages miniature smoked sausage links",
  "directions": "1. Combine barbeque sauce and grape jelly in a slow cooker. Stir in miniature smoked sausage links. Cook on High until heated through, about 2 to 3 hours.",
  "prep": "5 mins",
  "cook": "2 hrs",
  "total": "2 hrs 5 mins",
  "calories": "346"
},
{
  "url": "https://www.allrecipes.com/recipe/219170/ham-and-split-pea-soup-recipe-a-great-soup/",
  "name": "Ham and Split Pea Soup Recipe — A Great Soup",
  "rating": "4.8",
  "ratingcount": "798",
  "ingredients": "2 tablespoons butter; 2 ribs celery, diced; ½  onion, diced; 3 cloves garlic, sliced; 1 pound dried split peas, rinsed; 1 pound ham, diced; 1  bay leaf; 1 quart chicken stock; 2 ½ cups water; salt and ground black pepper to taste",
  "directions": "1. Melt butter in a large soup pot over medium-low heat. Stir in celery, onion, and sliced garlic; cook and stir until onions are translucent but not brown, 5 to 8 minutes. 2. Stir in split peas, ham, and bay leaf. Pour in chicken stock and water; stir to combine and simmer until peas are tender and soup has thickened, about 1 hour and 15 minutes. Stir occasionally. Season with salt and black pepper to serve.",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "374"
},
{
  "url": "https://www.allrecipes.com/recipe/143069/super-delicious-zuppa-toscana/",
  "name": "Super-Delicious Zuppa Toscana",
  "rating": "4.8",
  "ratingcount": "3",
  "ingredients": "1 pound bulk mild Italian sausage; 1 ¼ teaspoons crushed red pepper flakes; 4 slices bacon, cut into 1/2 inch pieces; 1 large onion, diced; 1 tablespoon minced garlic; 5 (13.75 ounce) cans chicken broth; 6 medium potatoes, thinly sliced; 1 cup heavy cream; ¼ bunch fresh spinach, tough stems removed",
  "directions": "1. Cook Italian sausage and red pepper flakes in a Dutch oven over medium-high heat until crumbly, browned, and no longer pink, 10 to 15 minutes. Drain and set aside. 2. Cook bacon in the same Dutch oven over medium heat until crisp, about 10 minutes. Drain, leaving a few tablespoons of drippings with the bacon in the bottom of the Dutch oven. Stir in onions and garlic; cook until onions are soft and translucent, about 5 minutes. 3. Stir in chicken broth and bring to a boil over high heat. Add potatoes and simmer until fork tender, about 20 minutes. Reduce heat to medium; stir in cream, cooked sausage, and spinach. Cook and stir until spinach has wilted and sausage is warmed through; serve.",
  "prep": "20 mins",
  "cook": "55 mins",
  "total": "1 hr 15 mins",
  "calories": "554"
},
{
  "url": "https://www.allrecipes.com/recipe/14704/best-egg-rolls/",
  "name": "Best Egg Rolls",
  "rating": "4.4",
  "ratingcount": "708",
  "ingredients": "1 pound ground pork; 1 teaspoon ground ginger, or more to taste; 1 teaspoon garlic powder, or more to taste; 2 cups shredded cabbage; 2 ounces shredded carrots; 2 tablespoons all-purpose flour; 2 tablespoons water; 1 quart peanut oil for frying, or as needed; 8 (7 inch square) egg roll wrappers; 2 tablespoons sesame seeds (Optional)",
  "directions": "1. Season pork with ginger and garlic powder in a large bowl; mix until thoroughly combined. 2. Place pork in a medium skillet over medium heat. Cook and stir until pork is browned and crumbly, 5 to 7 minutes. 3. Combine cooked pork, cabbage, and carrots in a large bowl; mix until egg roll filling is well combined. Mix four and water together in a small bowl until a paste forms. 4. Heat oil in a large skillet to about 375 degrees F (190 degrees C) or medium high heat. 5. While oil is heating, prepare egg rolls: Lay one egg roll wrapper on a work surface with one corner pointed toward you like a diamond. Place about 1/4 to 1/3 cup of the filling in the center of the wrapper. 6. Fold the bottom corner up and over the filling. Fold the left and right corners in toward the center. Push the egg roll away from you and roll toward the top corner. 7. Brush a bit of the flour paste over the inside of that corner to help seal the egg roll. 8. Fry egg rolls in the hot oil, turning occasionally, until golden brown and crispy, 5 to 8 minutes. Remove from oil and drain on paper towels or rack. 9. Place egg rolls on a serving plate and sprinkle sesame seeds over top.",
  "prep": "25 mins",
  "cook": "15 mins",
  "total": "40 mins",
  "calories": "334"
},
{
  "url": "https://www.allrecipes.com/recipe/24501/tangy-honey-glazed-ham/",
  "name": "Tangy Honey-Glazed Ham",
  "rating": "4.8",
  "ratingcount": "930",
  "ingredients": "1 (10 pound) fully-cooked, bone-in ham; 1 ¼ cups packed dark brown sugar; ⅓ cup pineapple juice; ⅓ cup honey, or more to taste; ⅓ large orange; 2 tablespoons Dijon mustard; ¼ teaspoon ground cloves; 1 ½ teaspoons lemon juice, or to taste (Optional)",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). Place ham on a rack set in a roasting pan. 2. Bake uncovered in the preheated oven for 2 hours. 3. While the ham is baking, combine brown sugar, pineapple juice, and 1/3 cup honey in a saucepan. Zest orange into the saucepan, then squeeze in the juice. Add Dijon mustard and ground cloves; whisk mixture over medium-high heat as it comes to a boil. Reduce heat and simmer until glaze thickens slightly, 5 to 10 minutes. 4. Taste glaze and adjust seasonings. Add lemon juice for more tang, or honey to make it sweeter. Set aside. 5. Remove ham from the oven after it has baked for 2 hours. Brush with glaze. Bake for an additional 30 to 45 minutes, brushing ham with glaze every 10 minutes. 6. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 35 mins",
  "calories": "511"
},
{
  "url": "https://www.allrecipes.com/recipe/235158/worlds-best-honey-garlic-pork-chops/",
  "name": "World's Best Honey Garlic Pork Chops",
  "rating": "4.4",
  "ratingcount": "659",
  "ingredients": "½ cup ketchup; 2 ⅔ tablespoons honey; 2 tablespoons low-sodium soy sauce; 2 cloves garlic, crushed; 6 (4 ounce) (1-inch thick) pork chops",
  "directions": "1. Preheat grill for medium heat and lightly oil the grate. Gather ingredients. 2. Whisk ketchup, honey, soy sauce, and garlic together in a bowl to make a glaze. 3. Sear the pork chops on both sides on the preheated grill. Lightly brush glaze onto each side of the chops as they cook; grill until no longer pink in the center, about 7 to 9 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). 4. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "15 mins",
  "total": "25 mins",
  "calories": "208"
},
{
  "url": "https://www.allrecipes.com/recipe/220961/leftover-ham-n-potato-casserole/",
  "name": "Leftover Ham -n- Potato Casserole",
  "rating": "4.7",
  "ratingcount": "498",
  "ingredients": "6 small potatoes, peeled and cut into 1/2-inch cubes; 7 tablespoons butter, divided; ⅔ pound leftover cooked ham, cut into 1/2-inch cubes; 1 small onion, finely chopped; 3 tablespoons all-purpose flour; 1 ½ cups milk; salt and ground black pepper to taste; 1 (8 ounce) package shredded Cheddar cheese; ¼ cup bread crumbs",
  "directions": "1. Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 10 to 15 minutes. 2. Meanwhile, preheat the oven to 350 degrees F (175 degrees C). Grease a 1 1/2-quart baking dish. 3. When the potatoes are almost finished, melt 3 tablespoons butter in a skillet over medium heat. Add ham and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Remove from the heat. 4. Drain potatoes; add to the ham mixture and stir to combine. Transfer to the prepared baking dish. 5. Melt remaining 4 tablespoons butter in a saucepan over medium heat. Whisk in flour and stir until the mixture becomes paste-like and light golden brown, about 5 minutes. 6. Gradually whisk milk into the flour mixture; season with salt and black pepper. Continue cooking and stirring until thickened, about 2 minutes. Reduce heat to medium-low and stir in Cheddar cheese until melted. 7. Pour cheese sauce over ham and potatoes. Sprinkle bread crumbs over top. 8. Bake in the preheated oven until sauce is bubbly and browned, 25 to 30 minutes. 9. Serve hot and enjoy!",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "591"
},
{
  "url": "https://www.allrecipes.com/recipe/14539/prize-winning-baby-back-ribs/",
  "name": "Prize-Winning Baby Back Ribs",
  "rating": "4.7",
  "ratingcount": "758",
  "ingredients": "1 tablespoon ground cumin; 1 tablespoon chili powder; 1 tablespoon paprika; salt and pepper to taste; 3 pounds baby back pork ribs; 1 cup barbeque sauce",
  "directions": "1. Preheat a gas grill for high heat, or arrange charcoal briquettes on one side of the barbeque. Lightly oil the grate. 2. Combine cumin, chili powder, paprika, salt, and pepper in a small jar; close the lid and shake to mix. 3. Trim the membrane sheath from the back of each rack. Run a small, sharp knife between the membrane and each rib, and snip off the membrane as much as possible. Sprinkle as much of the rub onto both sides of ribs as desired. To prevent ribs from becoming too dark and spicy, do not thoroughly rub spices into ribs. Store any unused spice mix in a jar for future use. 4. Place aluminum foil on the lower rack to capture drippings and prevent flare-ups. Lay ribs on the top rack of the grill (away from the coals, if you're using briquettes). Reduce gas heat to low and close the lid; cook ribs, undisturbed as possible, until meat pulls away easily from the bone, about 1 hour. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). 5. Brush ribs with barbecue sauce, and grill for an additional 5 minutes. Serve ribs as a whole rack, or cut between each rib bone and pile individually on a platter.",
  "prep": "30 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 35 mins",
  "calories": "441"
},
{
  "url": "https://www.allrecipes.com/recipe/84450/ukrainian-red-borscht-soup/",
  "name": "Ukrainian Red Borscht Soup",
  "rating": "4.5",
  "ratingcount": "479",
  "ingredients": "1 (16 ounce) package pork sausage; 3 medium beets, peeled and shredded; 3  carrots, peeled and shredded; 3 medium baking potatoes, peeled and cubed; ½ medium head cabbage, cored and shredded; 1 cup diced tomatoes, drained; 1 tablespoon vegetable oil; 1 medium onion, chopped; 1 (6 ounce) can tomato paste; 8 ¾ cups water, divided, or as needed; 3 cloves garlic, minced; 1 teaspoon white sugar, or to taste; salt and pepper to taste; ½ cup sour cream, for topping; 1 tablespoon chopped fresh parsley for garnish",
  "directions": "1. Crumble sausage into a skillet set over medium-high heat. Cook and stir until no longer pink. Remove from the heat and set aside. 2. Fill a large pot halfway with water (about 8 cups) and bring to a boil. 3. Add sausage to pot, cover pot, and return to a boil. Add beets and cook until they have lost their color. Add carrots and potatoes and simmer until tender, about 15 minutes. 4. Add cabbage and diced tomatoes to pot. 5. Heat oil in a skillet over medium heat. Add onion and cook until tender. Stir in tomato paste and remaining 3/4 cup water until well blended. Transfer to the pot. 6. Add garlic to the soup, cover, and turn off the heat. Let stand 5 minutes. Stir in sugar and season with salt and pepper. 7. Ladle into serving bowls. Garnish with sour cream and parsley.",
  "prep": "25 mins",
  "cook": "40 mins",
  "total": "1 hr 5 mins",
  "calories": "257"
},
{
  "url": "https://www.allrecipes.com/recipe/56927/delicious-ham-and-potato-soup/",
  "name": "Delicious Ham and Potato Soup",
  "rating": "4.8",
  "ratingcount": "14",
  "ingredients": "3 ½ cups peeled and diced potatoes; 3 ¼ cups water; ¾ cup diced cooked ham; ⅓ cup diced celery; ⅓ cup finely chopped onion; 2 tablespoons chicken bouillon granules; 1 teaspoon ground white or black pepper, or to taste; ½ teaspoon salt, or to taste; 5 tablespoons butter; 5 tablespoons all-purpose flour; 2 cups milk",
  "directions": "1. Combine potatoes, water, ham, celery, and onion in a stockpot. Bring to a boil; simmer over medium heat until potatoes are tender, 10 to 15 minutes. Stir in chicken bouillon, pepper, and salt. 2. Melt butter in a separate saucepan over medium-low heat. Add flour; cook and stir until thick, about 1 minute. Whisk in milk; cook and stir until thick, 4 to 5 minutes. 3. Pour milk mixture into the stockpot; cook and stir until warmed through.",
  "prep": "20 mins",
  "cook": "20 mins",
  "total": "40 mins",
  "calories": "195"
},
{
  "url": "https://www.allrecipes.com/recipe/18255/boston-baked-beans/",
  "name": "Boston Baked Beans",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "2 cups dry navy beans, soaked overnight; ½ pound uncooked bacon strips; 1 medium onion, diced; ½ cup ketchup; 3 tablespoons molasses; ¼ cup brown sugar; 1 tablespoon Worcestershire sauce; 2 teaspoons salt; ¼ teaspoon ground black pepper; ¼ teaspoon dry mustard",
  "directions": "1. Transfer soaked navy beans and soaking water to a saucepan. 2. Bring to a boil. Reduce heat and simmer until tender, approximately 1 to 2 hours. Drain and reserve the cooking liquid. 3. Preheat the oven to 325 degrees F (165 degrees C). 4. Arrange 1/2 of the beans in the bottom of a 2-quart casserole dish. Place 1/2 of the bacon strips over the beans and sprinkle 1/2 of the onions over top. Repeat layers once more. 5. Combine ketchup, molasses, brown sugar, Worcestershire sauce, salt, pepper, and dry mustard in a large saucepan over medium heat; bring to a boil. 6. Pour sauce over the beans. Pour in just enough reserved cooking liquid to cover the beans. Cover the casserole dish with a lid or aluminum foil. 7. Bake in the preheated oven for 1 1/2 hours. Remove the lid and continue to cook, checking every 1/2 hour or so and adding more cooking liquid if necessary to prevent the beans from getting too dry, until beans are tender, 1 1/2 to 2 1/2 more hours. 8. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "4 hrs 10 mins",
  "total": "4 hrs 20 mins",
  "calories": "382"
},
{
  "url": "https://www.allrecipes.com/recipe/80525/slow-cooker-ham/",
  "name": "Slow Cooker Ham",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "2 cups packed brown sugar; 1 (8 pound) cured, bone-in picnic ham",
  "directions": "1. Spread about 1 1/2 cups of brown sugar on the bottom of a slow cooker. 2. Place ham on the brown sugar with the flat side facing down; you might have to trim it a little to make it fit. 3. Use your hands to rub the remaining brown sugar onto the ham. 4. Cover, and cook on Low for 8 hours.",
  "prep": "5 mins",
  "cook": "8 hrs",
  "total": "8 hrs 5 mins",
  "calories": "360"
},
{
  "url": "https://www.allrecipes.com/recipe/16359/breakfast-sausage/",
  "name": "Homemade Breakfast Sausage",
  "rating": "4.7",
  "ratingcount": "804",
  "ingredients": "1 tablespoon brown sugar; 2 teaspoons dried sage; 2 teaspoons salt; 1 teaspoon ground black pepper; ¼ teaspoon dried marjoram; ⅛ teaspoon crushed red pepper flakes; 1 pinch ground cloves; 2 pounds ground pork",
  "directions": "1. Gather all ingredients. 2. Mix together brown sugar, sage, salt, black pepper, marjoram, red pepper flakes, and cloves in a small bowl until well combined. 3. Place pork in a large bowl. Add spice mixture and mix with your hands until well combined. Form mixture into 6 patties. 4. Heat a large skillet over medium-high heat. Add patties and saute until browned and crispy, about 5 minutes per side. An instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C). 5. Serve hot and enjoy!",
  "prep": "10 mins",
  "cook": "10 mins",
  "total": "20 mins",
  "calories": "409"
},
{
  "url": "https://www.allrecipes.com/recipe/19344/homemade-lasagna/",
  "name": "Homemade Lasagna",
  "rating": "4.6",
  "ratingcount": "348",
  "ingredients": "½ pound ground pork; ½ pound lean ground beef; ½ cup minced onion; 1 (28 ounce) can crushed tomatoes; 1 (8 ounce) can tomato sauce; 2 tablespoons chopped fresh parsley, divided; 1 clove garlic, crushed; 1 ½ teaspoons dried basil; 1 ½ teaspoons salt; ½ teaspoon dried oregano; ⅛ teaspoon white sugar; 1 (16 ounce) package lasagna noodles; 1 pound small-curd cottage cheese; ¾ cup grated Parmesan cheese; 3 large eggs; 2 teaspoons salt; ¼ teaspoon ground black pepper; 1 (16 ounce) package shredded mozzarella cheese",
  "directions": "1. Combine pork and ground beef in a large, deep skillet over medium-high heat; cook and stir until browned and crumbly, 5 to 7 minutes. Add onion and cook until translucent, about 5 minutes. 2. Stir in crushed tomatoes, tomato sauce, 1 tablespoon fresh parsley, garlic, basil, salt, oregano, and sugar. Reduce heat to medium-low and simmer, stirring occasionally, for 30 minutes. 3. While the sauce is simmering, bring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally, until tender yet firm to the bite, 8 to 10 minutes. Drain and set aside. 4. While the noodles are cooking, preheat the oven to 375 degrees F (190 degrees C). 5. Mix cottage cheese, Parmesan cheese, eggs, remaining 1 tablespoon fresh parsley, salt, and pepper in a large bowl until combined. 6. Assemble lasagna: Spread a spoon or two of sauce over the bottom of a 9x13-inch baking dish just to to coat it. Place two layers of noodles over the sauce to cover. Layer with 1/2 of the cheese mixture, 1/2 of the remaining sauce, and 1/2 of the mozzarella cheese. Repeat layers once more using the remaining noodles, cheese mixture, sauce, and mozzarella. Cover the baking dish with aluminum foil. 7. Bake in the preheated oven for 30 to 40 minutes. Remove the foil and bake until cheese is golden brown, 5 to 10 more minutes. 8. Remove from the oven and let stand for 10 minutes before cutting and serving.",
  "prep": "1 hr 25 mins",
  "cook": "1 hr 15 mins",
  "total": "2 hrs 50 mins",
  "calories": "638"
},
{
  "url": "https://www.allrecipes.com/recipe/236104/bobs-pulled-pork-on-a-smoker/",
  "name": "Bob's Pulled Pork on a Smoker",
  "rating": "4.7",
  "ratingcount": "257",
  "ingredients": "1 (8 pound) pork shoulder roast; 1 quart apple cider, or as needed; 5 tablespoons white sugar; 5 tablespoons light brown sugar; 2 tablespoons kosher salt; 2 tablespoons paprika; 1 tablespoon onion powder; 1 tablespoon freshly ground black pepper; 1 tablespoon garlic powder; 3 cups hickory chips, or more as needed, soaked in water; 1  onion, chopped",
  "directions": "1. Place pork shoulder in a large pot and add enough apple cider to cover. Combine white sugar, brown sugar, salt, paprika, onion powder, black pepper, and garlic powder in a bowl. Mix 1/4 cup of sugar rub into cider; reserve remaining rub. Cover the pot and refrigerate for 12 hours. 2. Preheat the smoker to 210 degrees F (99 degrees C). Add enough wood chips to the smoker. 3. Pour cider brine into the water pan of the smoker; add onion and 1/4 cup more sugar rub. 4. Spread remaining sugar rub over pork shoulder. Transfer pork to the center of the smoker. 5. Smoke pork until very tender or until it reaches an internal temperature of 200 degrees F (95 degrees C), about 8 hours. Monitor hickory chips and liquid, adding more as needed. 6. Transfer pork to a large platter and cool for 30 minutes before shredding with forks.",
  "prep": "10 mins",
  "cook": "8 hrs",
  "total": "20 hrs 40 mins",
  "calories": "442"
},
{
  "url": "https://www.allrecipes.com/recipe/235931/southern-style-collard-greens/",
  "name": "Southern-Style Collard Greens",
  "rating": "4.8",
  "ratingcount": "169",
  "ingredients": "2 medium sweet onions, finely chopped; 2  smoked ham hocks; 4 cloves garlic, finely chopped; 3 (32 ounce) containers chicken broth; 3 (1 pound) packages collard greens, trimmed; ⅓ cup apple cider vinegar; 2 tablespoons white sugar; 1 ½ teaspoons salt, or to taste; ¾ teaspoon ground black pepper, or to taste",
  "directions": "1. Gather all ingredients. 2. Combine onions, ham hocks, and garlic in a stockpot; add chicken broth. Cook mixture over medium heat until meat is falling off the bone, 1 to 2 hours. 3. Stir collard greens, vinegar, sugar, salt, and pepper into the broth mixture; cook until greens have reached desired tenderness, about 2 more hours.",
  "prep": "15 mins",
  "cook": "3 hrs",
  "total": "3 hrs 15 mins",
  "calories": "189"
},
{
  "url": "https://www.allrecipes.com/recipe/228875/maple-roasted-brussels-sprouts-with-bacon/",
  "name": "Maple Roasted Brussels Sprouts with Bacon",
  "rating": "4.7",
  "ratingcount": "488",
  "ingredients": "1 pound whole Brussels sprouts; 4 slices bacon, cut into 1/2-inch pieces; ½ teaspoon salt; ¼ teaspoon freshly ground black pepper; ¼ cup extra-virgin olive oil; 3 tablespoons pure maple syrup",
  "directions": "1. Gather all ingredients. Preheat the oven to 400 degrees F (200 degrees C). Line a rimmed baking sheet with aluminum foil. 2. Trim ends off Brussels sprouts and cut any large ones in half. Transfer to a large bowl. 3. Add bacon, salt, and pepper to the Brussels spouts. Drizzle olive oil and maple syrup over top and toss until sprouts are well coated. 4. Transfer to the prepared baking sheet and spread in a single layer. 5. Roast in the preheated oven until bacon is crispy and Brussels sprouts are caramelized, 20 to 30 minutes, stirring halfway through. 6. Serve warm and enjoy!",
  "prep": "10 mins",
  "cook": "20 mins",
  "total": "30 mins",
  "calories": "175"
},
{
  "url": "https://www.allrecipes.com/recipe/231037/pinto-beans-with-mexican-style-seasonings/",
  "name": "Pinto Beans With Mexican-Style Seasonings",
  "rating": "4.8",
  "ratingcount": "202",
  "ingredients": "1 pound dried pinto beans, rinsed; 4 cups water, or as needed; 2 (10 ounce) cans diced tomatoes with green chile peppers (such as RO*TEL®); ½ pound bacon, cut into 1/2-inch pieces; 1  yellow onion, chopped; 1 tablespoon chili powder, or to taste; 1 tablespoon ground cumin, or to taste; 1 ½ teaspoons garlic powder, or to taste; ½ bunch fresh cilantro, chopped; salt to taste",
  "directions": "1. Place pinto beans into a large pot and pour in enough water to cover by 2 to 3 inches. Let beans soak overnight. 2. Drain beans, return to pot, and pour in fresh water to cover; add tomatoes, bacon, onion, chili powder, cumin, and garlic powder. Bring to a boil, reduce heat to low, and simmer for 3 hours. Check the beans occasionally and add more water if needed. 3. Stir cilantro and salt into beans simmer until beans are soft, about 1 more hour.",
  "prep": "15 mins",
  "cook": "4 hrs",
  "total": "12 hrs 15 mins",
  "calories": "267"
},
{
  "url": "https://www.allrecipes.com/recipe/216319/homemade-sweet-italian-sausage-mild-or-hot/",
  "name": "Homemade Sweet Italian Sausage (Mild or Hot)",
  "rating": "4.7",
  "ratingcount": "241",
  "ingredients": "3 pounds ground pork; 3 tablespoons red wine vinegar; 1 ¼ tablespoons dried parsley; 1 tablespoon garlic powder; 1 tablespoon onion powder; 1 tablespoon dried basil; 1 tablespoon salt; 1 tablespoon freshly cracked black pepper; 2 teaspoons paprika; 2 teaspoons crushed red pepper flakes, or to taste; ¾ teaspoon ground fennel seed; ¼ teaspoon brown sugar; ⅛ teaspoon dried oregano; ⅛ teaspoon dried thyme",
  "directions": "1. Place pork and red wine vinegar in a large mixing bowl. Sprinkle with parsley, garlic powder, onion powder, basil, salt, black pepper, paprika, red pepper flakes, fennel seed, brown sugar, oregano, and thyme. Knead until flecks of spice are evenly distributed throughout meat. 2. Divide sausage into thirds. Form each into a 3-inch diameter log, wrap securely in plastic wrap, and place in a zip-top bag. Refrigerate for at least 12 hours before cooking. 3. When ready to cook, remove logs from the zip-top bags and place on a cutting board. Use a finely serrated knife to cut logs right through the plastic wrapping into 1/4- to 1/2-inch-thick patties. Carefully remove and discard any plastic. 4. Heat a large skillet over medium heat. Working in batches, cook sausage patties in the hot skillet until no longer pink in the center, 2 to 6 minutes per side, depending on thickness. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).",
  "prep": "20 mins",
  "cook": "15 mins",
  "total": "12 hrs 35 mins",
  "calories": "243"
},
{
  "url": "https://www.allrecipes.com/recipe/78299/boilermaker-tailgate-chili/",
  "name": "Boilermaker Tailgate Chili",
  "rating": "4.8",
  "ratingcount": "8",
  "ingredients": "2 pounds ground beef chuck; 1 pound bulk Italian sausage; 3 (15 ounce) cans chili beans, drained; 1 (15 ounce) can chili beans in spicy sauce; 2 (28 ounce) cans diced tomatoes with juice; 1 (6 ounce) can tomato paste; 3 stalks celery, chopped; 1 large yellow onion, chopped; 1  green bell pepper, seeded and chopped; 1  red bell pepper, seeded and chopped; 2  green chile peppers, seeded and chopped; 1 tablespoon bacon bits; 4 cubes beef bouillon; ½ cup beer; ¼ cup chili powder, or more to taste; 1 tablespoon minced garlic; 1 tablespoon Worcestershire sauce; 1 tablespoon dried oregano; 2 teaspoons ground cumin; 2 teaspoons hot pepper sauce (such as Tabasco®); 1 teaspoon dried basil; 1 teaspoon cayenne pepper; 1 teaspoon paprika; 1 teaspoon white sugar; 1 teaspoon salt, or more to taste; 1 teaspoon ground black pepper, or more to taste; 1 (10.5 ounce) bag corn chips (such as Fritos®); 1 (8 ounce) package shredded Cheddar cheese",
  "directions": "1. Heat a large stock pot over medium-high heat. Crumble ground chuck and sausage into the hot pan. Cook, stirring frequently, until meat is evenly browned. Drain off excess grease. 2. Pour in chili beans, spicy chili beans, diced tomatoes, and tomato paste. Add celery, onion, bell peppers, chile peppers, bacon bits, bouillon, beer, 1/4 cup chili powder, garlic, Worcestershire sauce, oregano, cumin, hot pepper sauce, basil, cayenne, paprika, sugar, 1 teaspoon salt, and 1 teaspoon black pepper. Stir to blend, then cover and simmer over low heat for at least 2 hours, stirring occasionally. 3. Taste and season with more salt, pepper, and chili powder if necessary. The longer the chili simmers, the better it will taste. Remove from the heat and serve, or cool, refrigerate, and reheat the next day. 4. To serve, ladle hot chili into bowls and top with corn chips and Cheddar cheese.",
  "prep": "30 mins",
  "cook": "2 hrs",
  "total": "2 hrs 30 mins",
  "calories": "600"
},
{
  "url": "https://www.allrecipes.com/recipe/14745/honey-glazed-ham/",
  "name": "Honey Glazed Ham",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 (5 pound) ready-to-eat ham; ¼ cup whole cloves; ¼ cup dark corn syrup; 2 cups honey; ⅔ cup butter",
  "directions": "1. Preheat oven to 325 degrees F (165 degrees C). 2. Score ham, and stud with the whole cloves. Place ham in foil lined pan. 3. In the top half of a double boiler, heat the corn syrup, honey and butter. Keep glaze warm while baking ham. 4. Brush glaze over ham, and bake for 1 hour and 15 minutes in the preheated oven. 5. Baste ham every 10 to 15 minutes with the honey glaze. During the last 4 to 5 minutes of baking, turn on broiler to caramelize the glaze. Remove from oven, and let sit a few minutes before serving. 6. Serve hot and enjoy!",
  "prep": "20 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 35 mins",
  "calories": "521"
},
{
  "url": "https://www.allrecipes.com/recipe/130358/worlds-best-pasta-sauce/",
  "name": "World's Best Pasta Sauce!",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "1 pound sweet Italian sausage, sliced; ¾ pound lean ground beef; ½ cup minced onion; 2 cloves garlic, crushed; 1 (28 ounce) can crushed tomatoes; 2 (6.5 ounce) cans tomato sauce; 2 (6 ounce) cans tomato paste; ½ cup water; 2 tablespoons white sugar; 1 ½ teaspoons dried basil; 1 teaspoon Italian seasoning; ½ teaspoon fennel seed; ½ teaspoon salt; ¼ teaspoon ground black pepper",
  "directions": "1. Cook sausage, beef, onion, and garlic in a large pot or Dutch oven over medium heat until browned; drain fat. 2. Stir in crushed tomatoes, tomato sauce, tomato paste, and water. Mix in sugar, basil, Italian seasoning, fennel seed, salt, and pepper. 3. Cover and simmer, stirring occasionally, until cooked through, about 1 1/2 hours.",
  "prep": "15 mins",
  "cook": "1 hr 40 mins",
  "total": "1 hr 55 mins",
  "calories": "157"
},
{
  "url": "https://www.allrecipes.com/recipe/23221/bbq-country-style-ribs/",
  "name": "BBQ Country-Style Ribs",
  "rating": "4.4",
  "ratingcount": "639",
  "ingredients": "10  country style pork ribs; 2 teaspoons minced garlic; 1 medium lemon, thinly sliced; 1 (18 ounce) bottle barbeque sauce",
  "directions": "1. Preheat the oven to 250 degrees F (120 degrees C). 2. Place ribs in a single layer in a shallow baking pan or roaster; salt if desired. Spread garlic on ribs, then arrange lemon slices on top. 3. Bake in the preheated oven until tender, about 2 hours. Drain any grease and liquid. Pour barbeque sauce over ribs. 4. Reduce oven temperature to 225 degrees F (110 degrees C) and cook ribs until sauce bakes into meat, about 1 hour.",
  "prep": "15 mins",
  "cook": "3 hrs",
  "total": "3 hrs 15 mins",
  "calories": "625"
},
{
  "url": "https://www.allrecipes.com/recipe/14713/souvlaki/",
  "name": "Souvlaki",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "¼ cup olive oil; ¼ cup soy sauce; 1 medium lemon, juiced; 3 cloves garlic, crushed; 1 teaspoon dried oregano; 3 pounds pork tenderloin, cut into 1 inch cubes; 2 medium yellow onions, cut into 1 inch pieces; 2 medium green bell peppers, cut into 1 inch pieces; skewers",
  "directions": "1. Mix oil, soy sauce, lemon juice, garlic, and oregano, and garlic together in a large glass bowl. Add pork, onions, and bell peppers, and stir until coated. Cover and refrigerate for 2 to 3 hours. 2. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 3. Remove pork and vegetables from marinade and shake off excess; thread onto skewers. Discard remaining marinade. 4. Cook on the preheated grill, turning frequently, until pork is no longer pink in the middle, 10 to 15 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
  "prep": "30 mins",
  "cook": "10 mins",
  "total": "2 hrs 40 mins",
  "calories": "189"
},
{
  "url": "https://www.allrecipes.com/recipe/236432/brown-sugar-ham-steak/",
  "name": "Brown Sugar Ham Steak",
  "rating": "4.7",
  "ratingcount": "169",
  "ingredients": "1 (8 ounce) bone-in fully cooked ham steak; 5 tablespoons butter, cubed; 5 tablespoons brown sugar",
  "directions": "1. Cook ham steak in a large skillet over medium heat until browned, 3 to 4 minutes per side. 2. Remove ham from skillet; drain off any fat. 3. Melt butter in the same skillet over medium-low heat. Stir in brown sugar. 4. Return ham to skillet. Cook, turning ham often, until heated through and brown sugar has dissolved, about 10 minutes. Reduce heat if brown sugar/butter mixture starts to pop or splatter.",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "521"
},
{
  "url": "https://www.allrecipes.com/recipe/214500/sausage-peppers-onions-and-potato-bake/",
  "name": "Sausage, Peppers, Onions, and Potato Bake",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "2 teaspoons olive oil; 2 pounds Italian sausage links, cut into 2-inch pieces; ¼ cup olive oil; 4 large potatoes, peeled and thickly sliced; 2 large green bell peppers, seeded and cut into wedges; 2 large red bell peppers, seeded and cut into wedges; 3 large onions, cut into wedges; ½ cup white wine; ½ cup chicken stock; 1 teaspoon Italian seasoning; salt and freshly ground black pepper to taste",
  "directions": "1. Gather all ingredients. 2. Preheat oven to 400 degrees F (200 degrees C). 3. Heat 2 teaspoons olive oil in a large skillet over medium heat, and cook and stir the sausage until browned, 5 to 10 minutes. Transfer cooked sausage to a large baking dish. 4. Pour 1/4 cup of olive oil into the skillet, and cook potatoes, stirring occasionally, until browned, about 10 minutes. 5. Place the potatoes into the baking dish, leaving some oil in the skillet. 6. Cook and stir green and red peppers and onions in the hot skillet until they are beginning to soften, about 5 minutes. 7. Add the vegetables to the baking dish. Pour wine and chicken stock over the vegetables and sausage, and sprinkle with Italian seasoning, salt, and pepper. 8. Gently stir sausage, potatoes, and vegetables together. 9. Bake in the preheated oven until hot and bubbling, 20 to 25 minutes. Serve hot.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "539"
},
{
  "url": "https://www.allrecipes.com/recipe/35151/traditional-filipino-lumpia/",
  "name": "Traditional Filipino Lumpia",
  "rating": "4.8",
  "ratingcount": "507",
  "ingredients": "1 tablespoon vegetable oil; 1 pound ground pork; ½ cup chopped onion; 2 cloves garlic, crushed; ½ cup minced carrots; ½ cup chopped green onions; ½ cup thinly sliced green cabbage; 2 tablespoons chopped fresh cilantro (Optional); 1 teaspoon ground black pepper; 1 teaspoon salt; 1 teaspoon garlic powder; 1 teaspoon soy sauce; 30  lumpia wrappers; 2 cups vegetable oil for frying, or as needed",
  "directions": "1. Heat 1 tablespoon vegetable oil in a wok or large skillet over high heat. Add pork; cook and stir until crumbly and no pink is showing, 5 to 7 minutes. Remove pork from the pan and set aside. Drain grease from the pan, leaving just a thin coating. 2. Add onion and garlic to the pan; cook and stir until fragrant, about 2 minutes. Stir in the cooked pork, carrots, green onions, cabbage, and cilantro. Season with pepper, salt, garlic powder, and soy sauce. Remove from the heat, and set aside until cool enough to handle, about 5 minutes. 3. Assemble lumpia: Place 3 heaping tablespoons of filling diagonally near one corner of a lumpia wrapper, leaving a 1 1/2 inch space at both ends. Fold the side along the length of the filling over the filling, tuck in both ends, and roll neatly and tightly to close. Moisten the other side of the wrapper with water to seal the edge. Transfer to a plate and cover with plastic wrap to retain moisture. Repeat to assemble remaining lumpia. 4. Heat 1/2 inch vegetable oil in a heavy skillet over medium heat for 5 minutes. 5. Slide 3 to 4 lumpia into the hot oil, making sure the seams are facing down. Fry, turning occasionally, until all sides are golden brown, 1 to 2 minutes. Transfer to a paper towel-lined plate to drain. Repeat to fry remaining lumpia. Serve immediately.",
  "prep": "40 mins",
  "cook": "25 mins",
  "total": "1 hr 10 mins",
  "calories": "168"
},
{
  "url": "https://www.allrecipes.com/recipe/76296/meat-pie/",
  "name": "Meat Pie",
  "rating": "4.5",
  "ratingcount": "104",
  "ingredients": "1 medium potato, peeled and cubed; ½ pound ground beef; ½ pound ground pork; ½ cup chopped onion; ⅓ clove garlic, chopped; ½ teaspoon mustard powder; ½ teaspoon dried thyme; ¼ teaspoon dried sage; ¼ teaspoon ground cloves; 1 teaspoon salt; ¼ teaspoon ground black pepper; ¼ cup water; 1 (15 ounce) package refrigerated pie crusts",
  "directions": "1. Preheat the oven to 425 degrees F (220 degrees C). 2. Place potato in a saucepan with enough water to cover. Bring to a boil, and cook until tender, about 5 minutes. Drain, mash, and set aside. 3. Meanwhile, crumble ground beef and pork into a large saucepan. Add onion, garlic, mustard powder, thyme, sage, cloves, salt, and black pepper. Stir in water. Cook over medium heat, stirring, until meat is evenly browned. 4. Remove from the heat and mix in mashed potato. 5. Ease one pie crust into a 9-inch pie plate. Fill with meat mixture, then top with the remaining pie crust. Trim any excess dough, then crimp the edges with the tines of a fork to seal. Prick top crust a few times with a knife to vent steam. Cover the edges of the crust with aluminum foil. 6. Bake in the preheated oven until crust is browned, about 25 minutes.",
  "prep": "25 mins",
  "cook": "25 mins",
  "total": "50 mins",
  "calories": "381"
},
{
  "url": "https://www.allrecipes.com/recipe/12997/baked-potato-soup-i/",
  "name": "Baked Potato Soup",
  "rating": "4.7",
  "ratingcount": "2",
  "ingredients": "12 slices bacon; ⅔ cup butter or margarine; ⅔ cup all-purpose flour; 7 cups milk; 4  large baked potatoes, peeled and cubed; 4  green onions, chopped; 1 ¼ cups shredded Cheddar cheese; 1 cup sour cream; 1 teaspoon salt; 1 teaspoon ground black pepper",
  "directions": "1. Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 8 to 10 minutes. Drain bacon slices on paper towels; crumble and set aside. 2. Meanwhile, melt butter in a stockpot or Dutch oven over medium heat. Gradually add flour, whisking until well-combined. Slowly pour in milk, whisking constantly until smooth and thickened. 3. Add potatoes and onions and bring to a boil, stirring frequently. Reduce heat and simmer for 10 minutes. 4. Stir in crumbled bacon, Cheddar cheese, sour cream, salt, and pepper. Continue cooking and stirring until cheese is melted.",
  "prep": "15 mins",
  "cook": "25 mins",
  "total": "40 mins",
  "calories": "748"
},
{
  "url": "https://www.allrecipes.com/recipe/261153/perfect-pot-stickers/",
  "name": "Perfect Pot Stickers",
  "rating": "4.7",
  "ratingcount": "111",
  "ingredients": "1 pound ground pork; 4 cloves minced garlic; ½ cup finely chopped green onions; 3 tablespoons very finely minced fresh ginger; 2 tablespoons soy sauce; 1 teaspoon soy sauce; 1 teaspoon sesame oil; 1 pinch cayenne pepper; 1 ½ cups finely chopped green cabbage; 2 ½ cups all-purpose flour, or more as needed; ¾ teaspoon kosher salt; 1 cup hot water, about 130 -150 F (55-65 C); ¼ cup seasoned rice vinegar; ¼ cup soy sauce; 6 tablespoons vegetable oil for frying, or as needed - divided; 8 tablespoons water for steaming, divided",
  "directions": "1. Place ground pork, green onions, garlic, ginger, 2 tablespoon plus 1 teaspoon soy sauce, sesame oil, and cayenne in a mixing bowl. Top with chopped green cabbage. Mix with fork until thoroughly combined. Tamp down lightly; cover with plastic. Refrigerate until chilled, about an hour. 2. Place 2 1/2 cups of flour and kosher salt in a mixing bowl. Slowly pour in hot water. Stir with a wooden spoon until mixture forms a shaggy dough. Flour your hands and transfer dough to a work surface. Knead dough until it becomes smooth and elastic, about 3 to 5 minutes. If dough seems too sticky, sprinkle with a bit more flour, up to an additional 1/2 cup, and continue to knead. Wrap dough ball in plastic, and let it rest about 30 minutes. 3. When dough has rested, divide into 4 equal pieces. Cover 3 pieces with a dish cloth while you work the first piece. Roll into a small log about the thickness of a thumb, about 3/4 inch. Divide each log into 6 equal pieces. Roll each piece into a thin 3 1/2-inch circle on a lightly floured surface to form the pot sticker wrappers. Repeat with the remaining dough pieces. 4. Lightly moisten the edges of a wrapper with your wet finger. Place a small scoop of the ground pork mixture onto the center of a wrapper. Fold up the 2 sides and pinch together in the center. Pinch together the remaining edges, forming \"pleats\" along one side. Tap the pot sticker on the work surface to slightly flatten the bottom; form a slight curve in it so it stands upright in the pan. Transfer to a well-floured plate. Repeat with remaining dough and filling. 5. Mix together seasoned rice vinegar and soy sauce in a small mixing bowl for the dipping sauce. 6. Heat oil in skillet over medium-high heat. Place about 6 or 7 pot stickers in the hot oil, flat side down. Cook until bottoms are golden brown, about 2 minutes. Drizzle in water and quickly cover the pan; steam for 3 minutes. Uncover; reduce heat to medium. Continue cooking until water evaporates and bottoms are browned and crunchy, 1 or 2 minutes. Transfer to a warm serving dish. Repeat with remaining pot stickers. Serve with dipping sauce. 7. Serve hot and enjoy!",
  "prep": "25 mins",
  "cook": "5 mins",
  "total": "1 hr",
  "calories": "439"
},
{
  "url": "https://www.allrecipes.com/recipe/275576/easy-air-fryer-pork-chops/",
  "name": "Easy Air Fryer Pork Chops",
  "rating": "4.8",
  "ratingcount": "163",
  "ingredients": "½ cup grated Parmesan cheese; 1 teaspoon paprika; 1 teaspoon garlic powder; 1 teaspoon kosher salt; 1 teaspoon dried parsley; ½ teaspoon ground black pepper; 4 (5 ounce) boneless pork chops; 2 tablespoons extra virgin olive oil",
  "directions": "1. Preheat the air fryer to 380 degrees F (190 degrees C). 2. Combine Parmesan cheese, paprika, garlic powder, salt, parsley, and pepper in a flat shallow dish; mix well. 3. Coat each pork chop with olive oil. Dredge both sides of each chop in the Parmesan mixture and set on a plate. 4. Place 2 chops in the basket of the air fryer and cook for 10 minutes; flipping halfway through cook time. Transfer to a cutting board and let rest for 5 minutes. Repeat with remaining chops. 5. Served hot and enjoy!",
  "prep": "5 mins",
  "cook": "20 mins",
  "total": "25 mins",
  "calories": "305"
},
{
  "url": "https://www.allrecipes.com/recipe/34512/real-homemade-tamales/",
  "name": "Real Homemade Tamales",
  "rating": "4.5",
  "ratingcount": "304",
  "ingredients": "1 ¼ pounds pork loin; 1 large onion, halved; 1 clove garlic; 4  dried chile peppers; 2 cups water; 1 ½ teaspoons salt; 1 (8 ounce) package dried corn husks; ⅔ cup lard; 1 (10.5 ounce) can beef broth, or as needed; 2 cups masa harina; 1 teaspoon baking powder; ½ teaspoon salt; 1 cup sour cream",
  "directions": "1. Make the filling: Place pork, onion, and garlic in a Dutch oven. Add enough water to cover and bring to a boil. Reduce heat to low and simmer until pork is cooked through, about 2 hours. 2. Meanwhile, make chile sauce: Use rubber gloves to remove stems and seeds from chiles. Place chiles in a saucepan with 2 cups water. Simmer, uncovered, for 20 minutes. Remove from heat and cool. 3. Transfer chiles and cooking water to a blender and blend until smooth. Strain mixture into a bowl and stir in salt. Set aside. 4. Shred cooked pork and mix in 1 cup chile sauce. Reserve remaining sauce for serving. 5. Prepare husks and dough: Soak corn husks in a bowl of warm water until softened, about 30 minutes. 6. While the husks are soaking, beat lard with 1 tablespoon broth until fluffy. Combine masa harina, baking powder, and salt in a separate bowl; stir into the lard mixture, adding more broth as needed to form a spongy dough. 7. Remove husks from water and pat dry. Spread dough out over husks to 1/4- to 1/2-inch thick. 8. Place 1 tablespoon pork filling over center of each. Fold the sides, top, and bottom of each husk in toward the center to enclose dough. 9. Arrange tamales in a steamer basket. Place over simmering water and steam for 1 hour. 10. Remove tamales from husks. Drizzle with remaining chile sauce and top with sour cream, or mix sour cream into chile sauce first for a creamy sauce.",
  "prep": "30 mins",
  "cook": "3 hrs",
  "total": "3 hrs 30 mins",
  "calories": "236"
},
{
  "url": "https://www.allrecipes.com/recipe/228498/slow-cooker-baby-back-ribs/",
  "name": "Slow Cooker Baby Back Ribs",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "3 pounds baby back ribs, trimmed; salt and ground black pepper, to taste; ½ cup water; ½  onion, sliced; 1 clove garlic, minced; 1 (18 ounce) bottle barbeque sauce",
  "directions": "1. Season ribs with salt and pepper. 2. Pour 1/2 cup water into the slow cooker, then add ribs. Scatter onion and garlic over top. Cover and cook on Low for 8 hours or High for 4 hours. 3. When the ribs are almost finished, preheat the oven to 375 degrees F (190 degrees C). 4. Transfer ribs from the slow cooker to a baking sheet; discard onion and garlic. Coat ribs with barbeque sauce. 5. Bake ribs in the preheated oven until sauce caramelizes and sticks to meat, 10 to 15 minutes.",
  "prep": "10 mins",
  "cook": "4 hrs 15 mins",
  "total": "4 hrs 25 mins",
  "calories": "501"
},
{
  "url": "https://www.allrecipes.com/recipe/49785/spam-musubi/",
  "name": "Spam Musubi",
  "rating": "4.6",
  "ratingcount": "181",
  "ingredients": "2 cups uncooked short-grain white rice; 2 cups water; 6 tablespoons rice vinegar; ½ cup white sugar; ¼ cup soy sauce; ¼ cup oyster sauce; 1 (12 ounce) container fully cooked luncheon meat (such as Spam); 2 tablespoons vegetable oil; 5 sheets sushi nori (dry seaweed)",
  "directions": "1. Soak uncooked rice in water to cover for 4 hours; drain and rinse. 2. Bring 2 cups water to a boil in a medium saucepan. Add rice and stir. Reduce heat, cover, and simmer for 20 minutes. 3. Remove pan from heat and stir in rice vinegar. Set aside to cool. 4. Stir together sugar, soy sauce, and oyster sauce in a medium bowl until sugar is completely dissolved. Slice luncheon meat lengthwise into 10 slices, or to desired thickness, and marinate in sauce for 5 minutes. 5. Heat oil in a large skillet over medium-high heat. Cook slices until lightly browned, about 2 minutes per side. 6. Cut nori sheets in half and lay on a flat work surface. Place a rice press in the center of a sheet, and press rice tightly inside. Top with a slice of luncheon meat, and remove press. Wrap nori around rice, sealing edges with a small amount of water. (Rice may also be formed by hand in the shape of the meat slices and about 1-inch thick.) 7. Serve musubi warm or chilled.",
  "prep": "25 mins",
  "cook": "30 mins",
  "total": "5 hrs 25 mins",
  "calories": "276"
},
{
  "url": "https://www.allrecipes.com/recipe/196732/fried-cabbage-with-bacon-onion-and-garlic/",
  "name": "Fried Cabbage with Bacon, Onion, and Garlic",
  "rating": "4.6",
  "ratingcount": "1",
  "ingredients": "6 slices bacon, chopped; 1 large onion, diced; 2 cloves garlic, minced; 1 large head cabbage, cored and sliced; 1 tablespoon salt, or to taste; 1 teaspoon ground black pepper; ½ teaspoon onion powder; ½ teaspoon garlic powder; ⅛ teaspoon paprika",
  "directions": "1. Gather all ingredients. 2. Place bacon in a large stockpot and cook over medium-high heat until crispy, about 10 minutes. 3. Add onion and garlic; cook and stir until onion caramelizes, about 10 minutes. 4. Immediately stir in cabbage and continue to cook and stir another 10 minutes. 5. Season with salt, pepper, onion powder, garlic powder, and paprika. Reduce heat to low, cover, and simmer, stirring occasionally, about 30 minutes more. 6. Enjoy!",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "194"
},
{
  "url": "https://www.allrecipes.com/recipe/34524/baked-ham/",
  "name": "Baked Ham",
  "rating": "4.6",
  "ratingcount": "145",
  "ingredients": "1 (12 pound)  bone-in ham, rump portion; ½ cup whole cloves; 1 cup packed brown sugar; 4 cups water, or as needed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Place ham in a large roasting pan; press cloves into the top at 1- to 2-inch intervals. 2. Pack the top with a layer of brown sugar. 3. Pour enough water into the bottom of the roasting pan to come to a 1-inch depth; cover the pan tightly with aluminum foil. 4. Bake in the preheated oven for 4 1/2 to 5 hours. An instant-read thermometer inserted into the center, making sure it is not touching the bone, should read at least 160 degrees F (72 degrees C). 5. Let ham rest for about 20 minutes before carving.",
  "prep": "10 mins",
  "cook": "4 hrs 30 mins",
  "total": "5 hrs",
  "calories": "635"
}]