[{
  "url": "https://www.allrecipes.com/recipe/247440/bourbon-bbq-glazed-baby-back-ribs/",
  "name": "Bourbon-BBQ Glazed Baby Back Ribs",
  "rating": "4.3",
  "ratingcount": "4",
  "ingredients": "1 rack baby back pork ribs, outer membrane removed; 4 ounces apple juice; Reynolds Wrap® Aluminum Foil; 2 tablespoons brown sugar; 1 tablespoon sea salt; 1 tablespoon freshly cracked black pepper; ¼ tablespoon garlic powder; ¼ tablespoon onion powder; ¼ tablespoon ground coriander; ¼ tablespoon dry mustard; ⅛ tablespoon cayenne pepper; ½ cup ketchup; ¼ cup bourbon whiskey; 2 tablespoons apple cider vinegar; 1 tablespoon Worcestershire sauce; ½ tablespoon Dijon mustard; 1 ½ tablespoons brown sugar; 1 tablespoon molasses; 1 clove garlic, finely minced; ½ tablespoon soy sauce; 1 teaspoon onion powder; 1 teaspoon freshly cracked black pepper; 1 pinch sea salt",
  "directions": "1. Combine all the ingredients for the dry rub in a small bowl and mix together well. 2. Tear a large enough piece of Reynolds Wrap® Aluminum Foil to place rack of ribs on it and be able to fully cover, meat side up. Evenly coat both sides of the ribs with the dry rub, pressing it in with your hands. 3. Fold up the sides of the foil to create a rim, and pour the apple juice in around the ribs. Fold the foil over the ribs and crimp it to create a tight seal. Tear off one more piece of large foil and wrap the whole thing again to ensure a tight seal. 4. Place the wrapped ribs in the fridge to marinate for 2 hours. 5. Preheat oven to 225 degrees F and cook ribs for about 4 hours. You should be able to easily pierce them with a fork, but they shouldn't be falling off the bone. 6. Combine all the BBQ sauce ingredients in a medium saucepan and bring to a boil over medium heat. Reduce to a simmer and allow the sauce to thicken and reduce by about a third, stirring occasionally. 7. Preheat grill to high heat. Cover the grill rack with Reynolds Wrap® Aluminum Foil. Place the cooked ribs meat side up on the grill and brush the top with a layer of sauce. Close grill until the sauce is mostly dried, about 5 minutes. Brush another layer of sauce on top and close grill for an additional 5 minutes. Remove ribs from grill and lightly brush with one more layer of sauce. 8. Cut the ribs into individual pieces and serve with extra sauce.",
  "prep": "15 mins",
  "cook": "4 hrs 10 mins",
  "total": "4 hrs 25 mins",
  "calories": "437"
},
{
  "url": "https://www.allrecipes.com/recipe/34530/stuffed-ribs/",
  "name": "Stuffed Ribs",
  "rating": "4.3",
  "ratingcount": "8",
  "ingredients": "1 teaspoon poultry seasoning; 1 teaspoon garlic salt; ¼ teaspoon black pepper; 2 (2 pound) slabs baby back pork ribs; 8 cups day-old bread cubes; 1  celery, diced; ½ cup minced onion; ¼ teaspoon garlic powder; ½ teaspoon salt; ¼ teaspoon black pepper; 2 teaspoons poultry seasoning; 1 cup chicken broth",
  "directions": "1. Combine 1 teaspoon poultry seasoning, garlic salt, and 1/4 teaspoon black pepper. Sprinkle over the meaty side of the ribs, and rub into the meat. Let stand while making the dressing. 2. Preheat the oven to 325 degrees F (165 degrees C). 3. In a large bowl, combine bread cubes, celery, onion, garlic powder, salt, 1/4 teaspoon black pepper, and 2 teaspoons poultry seasoning. Mix well with your hands. Pour the broth evenly over the mixture to dampen all of the stuffing. Lay one rack of the ribs on the counter, meaty side down. Top with the stuffing; pile it up! Top with the second rack of ribs, meaty side up. Wrap and tie with thread or string in about 3 places to keep them together. Transfer to a rack in a roasting pan. 4. Cover, and bake for 1 hour in preheated oven. Remove the cover, and bake an additional 45 minutes to 1 hour.",
  "prep": "15 mins",
  "cook": "2 hrs",
  "total": "2 hrs 15 mins",
  "calories": "935"
},
{
  "url": "https://www.allrecipes.com/recipe/14718/italian-country-style-ribs/",
  "name": "Italian Country Style Ribs",
  "rating": "4.5",
  "ratingcount": "112",
  "ingredients": "3 pounds country style pork ribs; 1 (32 ounce) jar spaghetti sauce; ½ cup water; 2 tablespoons olive oil",
  "directions": "1. Heat the oil in a extra-large skillet over medium-high heat. Add ribs to skillet and brown on all sides. Pour spaghetti sauce over ribs and stir in the water. Reduce heat and simmer, covered for 1 hour. Turn ribs after 1/2 hour of cooking. If the sauce gets too thick, thin it with a little more water.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "598"
},
{
  "url": "https://www.allrecipes.com/recipe/213202/sunday-afternoon-slow-cooked-spare-ribs/",
  "name": "Sunday Afternoon Slow-Cooked Spare Ribs",
  "rating": "4.6",
  "ratingcount": "75",
  "ingredients": "8  meaty pork loin spareribs; 1 tablespoon light olive oil; 1 (14 ounce) can beef broth; ½ cup ketchup; ¼ cup brown sugar; ¼ cup lemon juice; 2 tablespoons vinegar; 2 tablespoons Worcestershire sauce; 2 tablespoons soy sauce; ½ teaspoon crushed red pepper flakes; 1 tablespoon seafood seasoning (such as Old Bay®); ¼ cup dried minced onion; ½ teaspoon ground nutmeg; salt and black pepper to taste",
  "directions": "1. Place the ribs into a large pot, and cover with lightly salted water. Bring the ribs to a boil, and boil for 45 minutes. Drain off the water and set the ribs aside. 2. Heat the olive oil in a large, heavy pot or Dutch oven over medium heat until the oil shimmers, and brown the ribs on all sides, about 10 minutes per side. Remove the ribs, and pour in the beef broth, ketchup, brown sugar, lemon juice, vinegar, Worcestershire sauce, soy sauce, red pepper flakes, seafood seasoning, dried onion, nutmeg, and salt and pepper. Stir the ingredients until the sauce has dissolved any brown bits of flavor from the bottom of the pan. Bring the sauce to a simmer over medium-low heat, and transfer the ribs back into the sauce. 3. Coat the ribs with sauce, cover the pan, and simmer over low heat until the meat is very tender and falls off the bones, about 3 hours.",
  "prep": "10 mins",
  "cook": "4 hrs 15 mins",
  "total": "4 hrs 25 mins",
  "calories": "323"
},
{
  "url": "https://www.allrecipes.com/recipe/255220/pineapple-sticky-ribs/",
  "name": "Pineapple Sticky Ribs",
  "rating": "4.5",
  "ratingcount": "86",
  "ingredients": "3 pounds pork back ribs, separated and fat trimmed; 1 (12.5 ounce) can pineapple tidbits, drained; 1 cup apricot jam; ¼ cup soy sauce; 2 tablespoons white wine vinegar; 2 tablespoons brown sugar; 2 cloves garlic, minced; 1 teaspoon ground ginger; ½ teaspoon salt; ½ teaspoon ground black pepper; ¼ teaspoon cayenne pepper",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Arrange ribs in a single layer in a roasting pan. 2. Stir pineapple, jam, soy sauce, vinegar, brown sugar, garlic, ginger, salt, black pepper, and cayenne pepper together in a bowl; pour over ribs. 3. Bake in the preheated oven, basting every 15 minutes, until ribs are glazed and pull away easily from the bone, about 1 1/2 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "558"
},
{
  "url": "https://www.allrecipes.com/recipe/264148/slow-cooker-teriyaki-ribs/",
  "name": "Slow-Cooker Teriyaki Ribs",
  "rating": "4.5",
  "ratingcount": "10",
  "ingredients": "2 ½ pounds baby back ribs, cut into 2-rib portions; ½ teaspoon ground black pepper; ⅔ cup teriyaki sauce, divided; 1 tablespoon balsamic vinegar; 2 cloves garlic, pressed",
  "directions": "1. Sprinkle baby back ribs with pepper and place in a slow cooker. Pour 1/3 cup teriyaki sauce on top. Cover and cook until tender, 4 hours on High or 7 hours on Low. 2. Cut ribs apart. Combine remaining 1/3 cup teriyaki sauce, balsamic vinegar, and garlic in a saucepan over medium-high heat. Simmer uncovered for 5 minutes. Brush sauce over ribs.",
  "prep": "10 mins",
  "cook": "4 hrs 5 mins",
  "total": "4 hrs 15 mins",
  "calories": "507"
},
{
  "url": "https://www.allrecipes.com/recipe/278869/japanese-style-braised-pork-ribs/",
  "name": "Japanese-Style Braised Pork Ribs",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "3 pounds baby back pork ribs; ⅔ cup soy sauce; ⅓ cup sake; 3 tablespoons honey; 2 tablespoons olive oil; 4 cups water; 2 cups uncooked white rice; 3 medium green onions, thinly sliced",
  "directions": "1. Remove silverskin from back of ribs by sliding the pointed end of a meat thermometer under skin and pulling up. Pat ribs dry with paper towels and cut into individual ribs. 2. Mix soy sauce, sake, and honey together in a small bowl and set aside. 3. Preheat the oven to 325 degrees F (165 degrees C). 4. Heat oil in a large Dutch oven over medium-high heat until hot. Sear ribs in batches until browned and they have a nice crust, about 3 minutes per side. Remove ribs to a plate. 5. Drain Dutch oven of any excess oil. Carefully pour soy sauce mixture into the pot and scrape bottom of the pan with a wooden spoon or spatula to release any stuck-on bits. Add ribs to the pot with liquid and increase heat to medium-high. Bring to a boil. Cover tightly and remove from heat. 6. Bake in the preheated oven until ribs are tender and no longer pink, about 2 1/2 hours, flipping over halfway through cooking time. 7. Meanwhile, bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and water has been absorbed, 20 to 25 minutes. 8. Serve ribs and sauce with white rice and sprinkle with green onions.",
  "prep": "15 mins",
  "cook": "2 hrs 50 mins",
  "total": "3 hrs 5 mins",
  "calories": "699"
},
{
  "url": "https://www.allrecipes.com/recipe/85634/not-your-every-day-smoked-pork-spare-ribs/",
  "name": "Not-Your-Everyday Smoked Pork Spare Ribs",
  "rating": "4.7",
  "ratingcount": "150",
  "ingredients": "½ cup packed brown sugar; 2 tablespoons chili powder; 2 tablespoons garlic powder; 1 tablespoon paprika; 1 tablespoon freshly ground black pepper; 2 teaspoons onion powder; 2 teaspoons kosher salt; 2 teaspoons ground cumin; 1 teaspoon ground cinnamon; 1 teaspoon jalapeño seasoning salt (Optional); 1 teaspoon cayenne pepper; 6 pounds pork spareribs; 3 cups apple wood chips, soaked; 1 cup apple cider; ¾ cup apple cider vinegar; 1 medium jalapeño pepper, finely chopped (Optional); 3 tablespoons hot pepper sauce; 2 tablespoons lemon juice; 1 tablespoon onion powder; 1 tablespoon garlic powder; kosher salt and ground black pepper to taste",
  "directions": "1. Make the ribs: Mix brown sugar, chili powder, garlic powder, paprika, black pepper, onion powder, salt, cumin, cinnamon, jalapeño seasoning, and cayenne pepper together in a small bowl. 2. Place spareribs into a glass baking dish and rub generously with seasoning mixture. Cover and refrigerate for at least 4 hours, or overnight. 3. When ready to cook, prepare an outdoor charcoal grill for indirect heat, or preheat a smoker to 250 degrees F (120 degrees C). 4. While the grill is preheating, make the mop sauce: Stir cider, vinegar, jalapeño pepper, hot pepper sauce, lemon juice, onion powder, garlic powder, lemon juice, salt, and pepper together in a medium bowl. 5. When the coals are gray and ashed over, place two handfuls of soaked wood chips directly on them. Place ribs onto the grill grate, bone-side down. Cover and cook for 3 1/2 to 4 hours. Every hour, baste ribs with mop sauce and throw handfuls of soaked wood chips onto the coals. Add more coals as needed to ensure the cooking temperature doesn't drop below 225 degrees F (110 degrees C). Discard any leftover mop sauce.",
  "prep": "20 mins",
  "cook": "3 hrs 30 mins",
  "total": "7 hrs 50 mins",
  "calories": "927"
},
{
  "url": "https://www.allrecipes.com/recipe/242372/traditional-rub-for-st-louis-ribs/",
  "name": "Traditional Rub for St. Louis Ribs",
  "rating": "4.7",
  "ratingcount": "18",
  "ingredients": "¼ cup dark brown sugar; 3 tablespoons paprika; 1 tablespoon dry mustard; 1 tablespoon sea salt; 1 ½ teaspoons granulated garlic powder; 1 ½ teaspoons onion powder; ½ teaspoon ground coriander; 2 racks Smithfield extra-tender St. Louis pork spareribs, membrane removed; 1 tablespoon vegetable oil; 1 cup handful hickory or apple wood chips for smoking, soaked in water and drained; 3/4 cup apple juice, in a spray bottle",
  "directions": "1. Make dry rub: Combine brown sugar, paprika, mustard, sea salt, garlic powder, onion powder, and coriander in a small bowl; mix well. 2. Prepare ribs: Coat ribs all over with oil and sprinkle with dry rub. Set aside at room temperature for 1 hour. 3. Heat a charcoal or gas grill for indirect cooking to 230 to 250 degrees F (110 to 120 degrees C). Add drained wood chips. 4. Place ribs, meaty-side down, over a drip pan and cook on the preheated grill for 2 hours, basting occasionally with sprays of apple juice over both sides of ribs. Add about 12 coals to a charcoal grill about every 45 minutes to maintain heat. 5. Remove ribs from the grill and double-wrap each rack in heavy-duty aluminum foil. Return wrapped ribs to the grill and cook over indirect heat until ribs are very tender, 1 hour 30 minutes to 3 hours. Add more coals as needed to maintain the temperature for a charcoal grill.",
  "prep": "10 mins",
  "cook": "3 hrs 30 mins",
  "total": "4 hrs 40 mins",
  "calories": "1098"
},
{
  "url": "https://www.allrecipes.com/recipe/83511/spareribs-and-kraut/",
  "name": "Spareribs and Kraut",
  "rating": "4.0",
  "ratingcount": "23",
  "ingredients": "cooking spray; 1 rack pork spareribs, cut into 2-rib portions; salt and pepper to taste; 4  red potatoes, quartered; 1 (16 ounce) jar sauerkraut, drained",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). Coat a 9x13-inch baking dish with cooking spray. 2. Season ribs with salt and pepper and arrange in the prepared baking dish. 3. Roast in the preheated oven for 20 to 25 minutes. Remove from the oven and reduce the temperature to 350 degrees F (175 degrees C). 4. Set the ribs onto a plate and drain excess grease from the baking dish. Spread sauerkraut evenly over the bottom of the dish. Place ribs on top with the meaty sides facing up. Tuck potatoes in amongst ribs. Cover tightly with heavy-duty aluminum foil. 5. Return to the oven and bake for 30 minutes. An instant-read thermometer inserted into the ribs should read at least 145 degrees F (63 degrees C). Carefully remove the foil to avoid hot steam and serve.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "978"
},
{
  "url": "https://www.allrecipes.com/recipe/19856/barbequed-ribs/",
  "name": "Barbequed Ribs",
  "rating": "4.7",
  "ratingcount": "507",
  "ingredients": "4 pounds baby back pork ribs; 4 cloves garlic, sliced; 1 tablespoon white sugar; 1 tablespoon paprika; 2 teaspoons salt; 2 teaspoons ground black pepper; 2 teaspoons chili powder; 2 teaspoons ground cumin; ½ cup dark brown sugar; ½ cup cider vinegar; ½ cup ketchup; ¼ cup chili sauce; ¼ cup Worcestershire sauce; 1 tablespoon lemon juice; 2 tablespoons onion, chopped; ½ teaspoon dry mustard; 1 clove crushed garlic",
  "directions": "1. Preheat oven to 300 degrees F (150 degrees C). Place ribs on a rack in a shallow roasting pan. Scatter 4 cloves of sliced garlic over ribs. Cover, and bake for 2 1/2 hours. Cool slightly. 2. In a small bowl, mix together white sugar, paprika, salt, black pepper, chili powder, and ground cumin. Rub spices over cooled ribs. Cover, and refrigerate overnight. 3. In a small saucepan, mix together brown sugar, cider vinegar, ketchup, chili sauce, Worcestershire sauce, lemon juice, onion, dry mustard, and 1 clove garlic. Simmer over medium-low heat, uncovered, for 1 hour. Reserve a small amount for basting; the remainder is a dipping sauce. 4. Preheat grill for medium heat. 5. Place ribs on grill. Grill, covered, for about 12 minutes, basting with the reserved sauce, until nicely browned and glazed. Serve with remaining sauce for dipping.",
  "prep": "30 mins",
  "cook": "3 hrs",
  "total": "11 hrs 30 mins",
  "calories": "588"
},
{
  "url": "https://www.allrecipes.com/recipe/14756/filipino-ribs/",
  "name": "Filipino Ribs",
  "rating": "4.4",
  "ratingcount": "91",
  "ingredients": "6 pounds pork spareribs; 2 medium onions, cut into wedges; 1 medium onion, finely chopped; 6 tablespoons soy sauce; ¼ teaspoon ground black pepper; 6  whole star anise pods; 1 tablespoon vegetable oil; 1 tablespoon grated fresh ginger; ½ cup honey; 2 tablespoons brown sugar; 1 tablespoon Worcestershire sauce; 1 tablespoon lemon juice",
  "directions": "1. Place ribs in a 5 to 6 quart stock pot with the 2 wedged onions, 4 tablespoons of the soy sauce, pepper and star anise. Bring all to a boil. Reduce heat to medium low, cover and let simmer in meat juices until ribs are tender when pierced, about 1 1/4 hours. Stir occasionally. 2. Meanwhile, heat oil in a medium skillet over medium heat. Add remaining chopped onion and saute, stirring often, until onion is soft. Blend in the ginger, honey, sugar, Worcestershire sauce, lemon juice and remaining 2 tablespoons of soy sauce. Cook all together, stirring, until well blended. Remove from heat. 3. Preheat oven to 400 degrees F (200 degrees C). 4. Using tongs, remove ribs from stock pot and arrange in a single layer in an 11x16 inch baking dish. Brush evenly with the honey mixture and bake in the preheated oven, basting often with pan drippings, about 30 minutes or until ribs are well glazed.",
  "prep": "",
  "cook": "",
  "total": "",
  "calories": "773"
},
{
  "url": "https://www.allrecipes.com/recipe/234522/oven-roasted-ribs/",
  "name": "Oven-Roasted Ribs",
  "rating": "4.5",
  "ratingcount": "28",
  "ingredients": "1 teaspoon vegetable oil; ½ cup chopped onions; 2 cloves minced garlic; ¾ cup chili sauce; ½ cup beer; ¼ cup honey; 2 tablespoons Worcestershire sauce; ½ teaspoon dry mustard; 3 ½ pounds country style pork ribs",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Heat oil in a saucepan over medium-high heat. Cook and stir onions and garlic in hot oil until fragrant and softened, 4 to 6 minutes. Stir in chili sauce, beer, honey, Worcestershire sauce, and dry mustard. Bring to a boil, reduce heat to low, and simmer until sauce thickens and flavors develop, about 20 minutes. 3. Meanwhile, arrange ribs evenly in a large baking dish. 4. Bake ribs in the preheated oven for 1 hour. Spread sauce over ribs and continue baking until sauce bubbles and ribs are tender, about 1 hour more.",
  "prep": "15 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 45 mins",
  "calories": "634"
},
{
  "url": "https://www.allrecipes.com/recipe/24538/slow-cooker-spare-ribs/",
  "name": "Slow Cooker Spare Ribs",
  "rating": "4.2",
  "ratingcount": "342",
  "ingredients": "1 (10.75 ounce) can  condensed tomato soup; 1  onion, chopped; 3 cloves garlic, minced; 1 tablespoon brown sugar; 1 tablespoon Worcestershire sauce; 2 tablespoons soy sauce; 2 pounds pork spareribs; 1 teaspoon cornstarch (Optional); ¼ cup cold water (Optional)",
  "directions": "1. Place ribs in a large stock pot, and cover with water. Bring to a boil, and cook for 15 minutes. 2. In a mixing bowl, mix together soup, onion, garlic, brown sugar, Worcestershire sauce, and soy sauce. Remove ribs from water, and transfer to a slow cooker. Pour sauce over ribs. 3. Cover, and cook on Low for 6 to 8 hours, or until ribs are tender. 4. If sauce is too thin when cooking time is done, drain sauce from ribs, and pour into a sauce pan. Combine 1 teaspoon cornstarch with a small amount of cold water, stir into sauce, and bring sauce to boil. Cook until sauce has reached desired thickness.",
  "prep": "30 mins",
  "cook": "8 hrs 15 mins",
  "total": "8 hrs 45 mins",
  "calories": "483"
},
{
  "url": "https://www.allrecipes.com/recipe/173108/slow-smoked-pork-spareribs/",
  "name": "Slow-Smoked Pork Spareribs",
  "rating": "3.7",
  "ratingcount": "9",
  "ingredients": "¼ cup kosher salt; ¼ cup packed brown sugar; ¼ cup paprika; 3 tablespoons ground black pepper; 1 tablespoon garlic powder; 1 tablespoon onion powder; 1 teaspoon cayenne pepper; ½ teaspoon celery seed; 16 pounds pork spareribs; 1  apple, quartered; 1  orange, cut into wedges; 1  lemon, cut into wedges; 1  lime, cut into wedges; 1  onion, cut into wedges; 3 cups red wine; 3 cups water; cooking spray; ½ cup ketchup; ¼ cup soy sauce; ¼ cup lime juice",
  "directions": "1. Combine salt, brown sugar, paprika, black pepper, garlic powder, onion powder, cayenne pepper, and celery seed in a bowl; set aside. 2. Remove all heavy fat from ribs, then remove and discard the membrane covering the rib side. Cut the slabs into 3- to 4-bone portions, cutting evenly between the ribs to leave some meat on each portion. 3. Rub spice mixture into rib portions, front and back, until all of the spice mixture has been used. Place ribs into a resealable plastic bag and refrigerate, 4 hours to overnight. Letting ribs sit overnight will give them the best flavor. 4. When ready to cook, fill the water pan of your smoker with apple, orange, lemon, lime, onion, red wine, and water. If you do not have a water pan, place the ingredients into a metal bowl, and set the bowl on the drip tray, above the heat source. Smoke with wood chips of your choice at 250 to 300 degrees F (120 to 150 degrees C) until the ribs are no longer pink, and the meat easily pulls from the bone, 4 to 6 hours or more depending on the smoker and temperature. Change the wood chips according to manufacturer's directions. 5. Preheat an outdoor grill for medium-low heat, and lightly oil the grate. Stir together ketchup, soy sauce, and lime juice in a bowl to make a barbeque sauce; set aside. 6. After ribs are fully cooked, remove them from the smoker, and brush them with barbeque sauce. Cook on the preheated grill, brushing occasionally with the sauce, until the sauce has become sticky and infused into the ribs, 15 to 20 minutes.",
  "prep": "40 mins",
  "cook": "4 hrs 15 mins",
  "total": "8 hrs 55 mins",
  "calories": "878"
},
{
  "url": "https://www.allrecipes.com/recipe/231768/slow-cooker-potluck-spareribs/",
  "name": "Slow Cooker Potluck Spare Ribs",
  "rating": "4.6",
  "ratingcount": "82",
  "ingredients": "6 pounds pork spare ribs, cut into serving-size pieces; 1 ½ cups ketchup; ¾ cup packed brown sugar; ½ cup vinegar; ½ cup honey; ⅓ cup soy sauce; 1 ½ teaspoons ground ginger; 1 teaspoon salt; ¾ teaspoon ground mustard; ½ teaspoon garlic powder; ¼ teaspoon ground black pepper",
  "directions": "1. Put spare ribs into the bottom of a slow cooker. Top with ketchup, brown sugar, vinegar, honey, soy sauce, ginger, salt, mustard, garlic powder, and black pepper. 2. Cover and cook on High for 5 hours.",
  "prep": "10 mins",
  "cook": "5 hrs",
  "total": "5 hrs 10 mins",
  "calories": "524"
},
{
  "url": "https://www.allrecipes.com/recipe/21174/bbq-pork-for-sandwiches/",
  "name": "BBQ Pork for Sandwiches",
  "rating": "4.8",
  "ratingcount": "3",
  "ingredients": "1 (14 ounce) can beef broth; 3 pounds boneless pork ribs; 1 (18 ounce) bottle barbeque sauce",
  "directions": "1. Pour can of beef broth into slow cooker, and add boneless pork ribs. Cook on High heat for 4 hours, or until meat shreds easily. Remove meat, and shred with two forks. It will seem that it's not working right away, but it will. 2. Preheat oven to 350 degrees F (175 degrees C). Transfer the shredded pork to a Dutch oven or iron skillet, and stir in barbeque sauce. 3. Bake in the preheated oven for 30 minutes, or until heated through.",
  "prep": "15 mins",
  "cook": "4 hrs 30 mins",
  "total": "4 hrs 45 mins",
  "calories": "355"
},
{
  "url": "https://www.allrecipes.com/recipe/275250/air-fryer-baby-back-ribs/",
  "name": "Air Fryer Baby Back Ribs",
  "rating": "4.6",
  "ratingcount": "22",
  "ingredients": "1 rack baby back ribs; 1 tablespoon olive oil; 1 tablespoon liquid smoke flavoring; 1 tablespoon brown sugar; ½ teaspoon salt; ½ teaspoon ground black pepper; ½ teaspoon garlic powder; ½ teaspoon onion powder; ½ teaspoon chili powder; 1 cup BBQ sauce",
  "directions": "1. Remove membrane from back of ribs and dry ribs with a paper towel. Cut rack into 4 pieces. Mix olive oil and liquid smoke in a small bowl and rub on both sides of the ribs. 2. Combine brown sugar, salt, pepper, garlic powder, onion powder and chili powder in a bowl. Season both sides of the ribs generously with seasoning mix. Let ribs rest for 30 minutes to enhance the flavor. 3. Preheat an air fryer to 375 degrees F (190 degrees C). 4. Place ribs bone-side down in the air fryer basket, making sure they are not touching; cook in batches if necessary. 5. Cook for 15 minutes. Flip ribs over (meat-side down) and cook an additional 10 minutes. Remove ribs from air fryer and brush bone-side of ribs with 1/2 cup BBQ sauce. Place basket back in the air fryer and cook for 5 minutes. Flip ribs over, brush meat-side with remaining 1/2 cup BBQ sauce; cook an additional 5 minutes or until desired char is achieved.",
  "prep": "15 mins",
  "cook": "35 mins",
  "total": "1 hr 20 mins",
  "calories": "445"
},
{
  "url": "https://www.allrecipes.com/recipe/22230/slow-cooker-barbecue-ribs/",
  "name": "Slow-Cooker Barbecue Ribs",
  "rating": "4.5",
  "ratingcount": "2",
  "ingredients": "4 pounds pork baby back ribs; salt and pepper to taste; 2 cups ketchup; 1 cup chili sauce; ½ cup packed brown sugar; 4 tablespoons vinegar; 2 teaspoons dried oregano; 2 teaspoons Worcestershire sauce; 1 dash hot sauce",
  "directions": "1. Preheat oven to 400 degrees F (200 degrees C). 2. Season ribs with salt and pepper. Place in a shallow baking pan. Brown in oven 15 minutes. Turn over, and brown another 15 minutes; drain fat. 3. In a medium bowl, mix together the ketchup, chili sauce, brown sugar, vinegar, oregano, Worcestershire sauce, hot sauce, and salt and pepper. Place ribs in slow cooker. Pour sauce over ribs, and turn to coat. 4. Cover, and cook on Low 6 to 8 hours, or until ribs are tender.",
  "prep": "10 mins",
  "cook": "8 hrs 30 mins",
  "total": "8 hrs 40 mins",
  "calories": "497"
},
{
  "url": "https://www.allrecipes.com/recipe/16913/texas-pork-ribs/",
  "name": "Texas Pork Ribs",
  "rating": "4.7",
  "ratingcount": "358",
  "ingredients": "6 pounds pork spareribs; 1 ½ cups white sugar; ¼ cup salt; 2 ½ tablespoons ground black pepper; 3 tablespoons sweet paprika; 1 teaspoon cayenne pepper, or to taste; 2 tablespoons garlic powder; 5 tablespoons pan drippings; ½ cup chopped onion; 4 cups ketchup; 3 cups hot water; 4 tablespoons brown sugar; cayenne pepper to taste; salt and pepper to taste; 1 cup wood chips, soaked",
  "directions": "1. Clean the ribs, and trim away any excess fat. In a medium bowl, stir together the sugar, 1/4 cup salt, ground black pepper, paprika, 1 teaspoon cayenne pepper, and garlic powder. Coat ribs liberally with spice mix. Place the ribs in two 10x15 inch roasting pans, piling two racks of ribs per pan. Cover, and refrigerate for at least 8 hours. 2. Preheat oven to 275 degrees F (135 degrees C). Bake uncovered for 3 to 4 hours, or until the ribs are tender and nearly fall apart. 3. Remove 5 tablespoons of drippings from the bottom of the roasting pans, and place in a skillet over medium heat. Cook onion in pan drippings until lightly browned and tender. Stir in ketchup, and heat for 3 to 4 more minutes, stirring constantly. Next, mix in water and brown sugar, and season to taste with cayenne pepper, salt, and pepper. Reduce heat to low, cover, and simmer for 1 hour, adding water as necessary to achieve desired thickness. 4. Preheat grill for medium-low heat. 5. When ready to grill, add soaked wood chips to the coals or to the smoker box of a gas grill. Lightly oil grill grate. Place ribs on the grill two racks at a time so they are not crowded. Cook for 20 minutes, turning occasionally. Baste ribs with sauce during the last 10 minutes of grilling, so the sauce does not burn.",
  "prep": "30 mins",
  "cook": "5 hrs",
  "total": "13 hrs 30 mins",
  "calories": "615"
},
{
  "url": "https://www.allrecipes.com/recipe/275243/instant-pot-bbq-rib-tips/",
  "name": "Instant Pot® BBQ Rib Tips",
  "rating": "5.0",
  "ratingcount": "2",
  "ingredients": "1 cup water; ½ cup apple cider vinegar; 2 pounds rib tips; 1 teaspoon kosher salt; 1 tablespoon BBQ rub; 1 cup barbeque sauce",
  "directions": "1. Add water and vinegar to a multi-functional pressure cooker (such as Instant Pot®). Set trivet inside. Sprinkle rib tips with salt and BBQ rub and massage to coat. Set rib tips on top of the trivet. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 40 minutes. Allow 8 minutes for pressure to build. 2. Release pressure using the natural-release method according to manufacturer's instructions, about 10 minutes. Unlock and remove the lid. 3. Transfer rib tips to a baking dish and let cool for 5 minutes. Add barbecue sauce and stir to coat. 4. Preheat an outdoor grill for medium-high heat and lightly oil the grate. 5. Grill rib tips for 6 minutes, turning once after 3 minutes.",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "497"
},
{
  "url": "https://www.allrecipes.com/recipe/35753/scott-hibbs-amazing-whisky-grilled-baby-back-ribs/",
  "name": "Scott Hibb's Amazing Whisky Grilled Baby Back Ribs",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "2 (2 pound) slabs baby back pork ribs; salt and coarsely ground black pepper to taste; 1 1/2 tablespoons ground red chile pepper, divided; 2 ¼ tablespoons vegetable oil; ½ cup minced onion; 1 ½ cups water; ½ cup tomato paste; ½ cup white vinegar; ½ cup brown sugar; 2 ½ tablespoons honey; 2 tablespoons Worcestershire sauce; 1 tablespoon dark molasses; 2 teaspoons salt; 2 teaspoons garlic powder; 2 teaspoons whisky; 1 ¼ teaspoons liquid smoke flavoring; ½ teaspoon onion powder; ¼ teaspoon paprika; ¼ teaspoon coarsely ground black pepper",
  "directions": "1. Preheat the oven to 300 degrees F (150 degrees C). 2. Cut each full rack of ribs in half to make 4 half racks. Season with salt and black pepper (more black pepper than salt); sprinkle 1 tablespoon ground chile pepper over meat. Wrap each half rack in aluminum foil. 3. Bake in the preheated oven for 2 hours and 30 minutes. 4. Meanwhile, heat oil in a medium saucepan over medium heat. Cook and stir onion in hot oil for 5 minutes. Stir in water, tomato paste, vinegar, brown sugar, honey, and Worcestershire sauce. Add molasses, 2 teaspoons salt, garlic powder, whisky, remaining 1/2 tablespoon ground chile pepper, liquid smoke, onion powder, paprika, and 1/4 teaspoon black pepper. Bring to a boil, then reduce heat. Simmer uncovered until sauce thickens, about 1 hour and 15 minutes. Remove from heat and set sauce aside. 5. Preheat an outdoor grill for high heat and lightly oil the grates. 6. Remove wrapped ribs from the oven. Let stand for 10 minutes, then remove ribs from the foil. 7. Cook ribs on the preheated grill for 3 to 4 minutes on each side. Brush sauce on ribs while grilling, just before you serve them (adding sauce too early will burn ribs).",
  "prep": "20 mins",
  "cook": "2 hrs 40 mins",
  "total": "3 hrs 10 mins",
  "calories": "1029"
},
{
  "url": "https://www.allrecipes.com/recipe/274040/chef-johns-copycat-mcrib-sandwich/",
  "name": "Chef John's Copycat McRib® Sandwich",
  "rating": "4.6",
  "ratingcount": "30",
  "ingredients": "⅓ cup kosher salt; ¼ cup brown sugar; 2 tablespoons chili powder; 2 tablespoons freshly ground black pepper; 1 tablespoon ground cumin; 1 teaspoon cayenne pepper; 2 racks baby back pork ribs; 1 cup barbecue sauce, divided; 4  sesame hamburger rolls, split and toasted; 1 cup coleslaw",
  "directions": "1. Preheat the oven to 325 degrees F (165 degrees C). 2. Mix salt, brown sugar, chili powder, pepper, cumin, and cayenne together for the rub. 3. Place ribs on a foil-lined baking sheet. Season both sides generously with some of the rub. Reserve remaining rub for another use. Cover top with parchment paper and wrap foil over the edges. Cover the whole baking sheet with another large sheet of foil, sealing in the sides. 4. Bake in the preheated oven until tender, about 2 hours and 45 minutes. 5. Unwrap ribs and let cool briefly until safe to handle. Pull out the bones, stuffing any loose pieces of meat back into the holes and checking carefully for bone fragments. Wrap ribs back up and refrigerate until cold, 8 hours to overnight. 6. Cut each rack in half. Brush both sides generously with barbecue sauce. 7. Preheat a charcoal grill for high heat and lightly oil the grate. 8. Grill ribs until heated through, 3 to 4 minutes per side. Remove from grill and brush with more barbecue sauce. 9. Drizzle more barbecue sauce onto each roll. Sandwich each rib section between a roll and top with coleslaw.",
  "prep": "10 mins",
  "cook": "2 hrs 50 mins",
  "total": "11 hrs",
  "calories": "963"
},
{
  "url": "https://www.allrecipes.com/recipe/47105/drunken-ribs/",
  "name": "Drunken Ribs",
  "rating": "4.7",
  "ratingcount": "14",
  "ingredients": "2 ½ tablespoons garlic powder; 1 ½ tablespoons white pepper; 1 ½ tablespoons seasoned salt; 1 tablespoon onion salt; 1 teaspoon dried oregano; 4 pounds pork spareribs; ½ cup distilled white vinegar; 12 (12 fluid ounce) cans or bottles premium lager; 1 (20 ounce) bottle ketchup; 1 (10 fluid ounce) bottle Worcestershire sauce; 1 ½ cups maple syrup; 1 cup brown sugar; 1 cup liquid smoke flavoring; ½ cup margarine; ½ cup apple cider vinegar; ½ cup honey mustard",
  "directions": "1. In a medium bowl, mix garlic powder, white pepper, seasoned salt, onion salt, and oregano. 2. Place ribs in a large roasting pan, and rub evenly with the garlic powder mixture to coat. Pour distilled white vinegar and 1/2 the beer, or enough to cover ribs, into the pan. Cover pan, and marinate ribs in the refrigerator 8 hours, or overnight. 3. Prepare an outdoor grill for indirect, medium heat, and lightly oil grate. 4. In a large saucepan, whisk together remaining beer, ketchup, Worcestershire sauce, maple syrup, brown sugar, liquid smoke, margarine, apple cider vinegar, and honey mustard. Bring to boil. Cover, reduce heat, and simmer 15 minutes, or until a thick sauce has formed. 5. Remove ribs from the marinade mixture, and coat liberally with the sauce. Place on the prepared grill, and cook 1 1/2 to 2 hours, to an internal temperature of 160 degrees F (70 degrees C). Brush frequently with the sauce while cooking.",
  "prep": "30 mins",
  "cook": "2 hrs",
  "total": "10 hrs 30 mins",
  "calories": ""
},
{
  "url": "https://www.allrecipes.com/recipe/204890/chinese-five-spice-spare-ribs/",
  "name": "Chinese Five Spice Spare Ribs",
  "rating": "4.0",
  "ratingcount": "38",
  "ingredients": "2 tablespoons soy sauce; 1 tablespoon white wine vinegar; 1 teaspoon sesame oil; 1 tablespoon honey; 1 teaspoon Chinese five-spice powder; ½ teaspoon minced garlic; ½ teaspoon ground ginger; 2 pounds pork short spareribs",
  "directions": "1. Combine soy sauce, white wine vinegar, sesame oil, honey, five-spice powder, garlic, and ginger in a large storage bag. Shake to mix well. Add ribs to marinade; refrigerate 4 to 8 hours, turning bag occasionally. 2. Preheat an oven to 325 degrees F (165 degrees C). Remove ribs from marinade and place in a roasting pan; cover tightly with aluminum foil. 3. Cook ribs for one hour, turning occasionally. Increase oven temperature to 400 degrees F. Remove foil from pan and bake an additional 20 minutes, turning once, until ribs are nicely browned.",
  "prep": "15 mins",
  "cook": "1 hr 20 mins",
  "total": "5 hrs 35 mins",
  "calories": "855"
},
{
  "url": "https://www.allrecipes.com/recipe/260585/bbq-country-style-pork-ribs-sous-vide/",
  "name": "BBQ Country-Style Pork Ribs - Sous Vide",
  "rating": "4.0",
  "ratingcount": "3",
  "ingredients": "1 tablespoon kosher salt; 1 tablespoon white sugar; 1 pound pork spareribs; ½ teaspoon red pepper flakes, or to taste (Optional); ¼ teaspoon five-spice powder, or to taste (Optional); ¼ teaspoon ground black pepper, or to taste (Optional); 2 teaspoons liquid smoke flavoring, or to taste (Optional); ½ cup barbecue sauce, or to taste",
  "directions": "1. Mix salt and sugar together in a small bowl. Sprinkle all over ribs. Coat with red pepper flakes, five-spice powder, and black pepper. Slide ribs into a large vacuum-seal bag; pour in liquid smoke. Seal. 2. Immerse bag in a heat-proof container of water with a sous vide cooker. Set temperature to 140 degrees F (60 degrees C); cook for 8 hours. 3. Preheat oven to 450 degrees F (230 degrees C). Set oven rack about 6 inches from the heat source and turn on the broiler. Place a wire rack on top of a baking sheet. 4. Pull ribs out of the bag; spread onto the prepared baking sheet and brush with barbeque sauce. 5. Bake in the preheated oven until bubbly, 4 to 5 minutes. Flip and continue baking until other side bubbles, 2 to 3 minutes more.",
  "prep": "10 mins",
  "cook": "8 hrs 2 mins",
  "total": "8 hrs 12 mins",
  "calories": "278"
},
{
  "url": "https://www.allrecipes.com/recipe/14539/prize-winning-baby-back-ribs/",
  "name": "Prize-Winning Baby Back Ribs",
  "rating": "4.7",
  "ratingcount": "758",
  "ingredients": "1 tablespoon ground cumin; 1 tablespoon chili powder; 1 tablespoon paprika; salt and pepper to taste; 3 pounds baby back pork ribs; 1 cup barbeque sauce",
  "directions": "1. Preheat a gas grill for high heat, or arrange charcoal briquettes on one side of the barbeque. Lightly oil the grate. 2. Combine cumin, chili powder, paprika, salt, and pepper in a small jar; close the lid and shake to mix. 3. Trim the membrane sheath from the back of each rack. Run a small, sharp knife between the membrane and each rib, and snip off the membrane as much as possible. Sprinkle as much of the rub onto both sides of ribs as desired. To prevent ribs from becoming too dark and spicy, do not thoroughly rub spices into ribs. Store any unused spice mix in a jar for future use. 4. Place aluminum foil on the lower rack to capture drippings and prevent flare-ups. Lay ribs on the top rack of the grill (away from the coals, if you're using briquettes). Reduce gas heat to low and close the lid; cook ribs, undisturbed as possible, until meat pulls away easily from the bone, about 1 hour. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). 5. Brush ribs with barbecue sauce, and grill for an additional 5 minutes. Serve ribs as a whole rack, or cut between each rib bone and pile individually on a platter.",
  "prep": "30 mins",
  "cook": "1 hr 5 mins",
  "total": "1 hr 35 mins",
  "calories": "441"
},
{
  "url": "https://www.allrecipes.com/recipe/14556/dry-rub-for-ribs/",
  "name": "Dry Rub for Ribs",
  "rating": "4.6",
  "ratingcount": "654",
  "ingredients": "3 tablespoons brown sugar; 1 ½ tablespoons paprika; 1 ½ tablespoons salt; 1 ½ tablespoons ground black pepper; 1 teaspoon garlic powder",
  "directions": "1. Mix brown sugar, paprika, salt, pepper, and garlic powder together in a small bowl. Rub into pork ribs. 2. For best results, allow ribs to marinate overnight.",
  "prep": "10 mins",
  "cook": "",
  "total": "10 mins",
  "calories": "27"
},
{
  "url": "https://www.allrecipes.com/recipe/14503/maple-glazed-ribs/",
  "name": "Maple Glazed Ribs",
  "rating": "4.6",
  "ratingcount": "215",
  "ingredients": "3 pounds baby back pork ribs; ¾ cup maple syrup; 2 tablespoons packed brown sugar; 2 tablespoons ketchup; 1 tablespoon cider vinegar; 1 tablespoon Worcestershire sauce; ½ teaspoon salt; ½ teaspoon mustard powder",
  "directions": "1. Place ribs in a large pot, and cover with water. Cover, and simmer for 1 hour, or until meat is tender. Drain, and transfer ribs to a shallow dish. 2. In a small saucepan, stir together the maple syrup, brown sugar, ketchup, vinegar, Worcestershire sauce, salt, and mustard powder. Bring to a low boil, and cook for 5 minutes, stirring frequently. Cool slightly, then pour over ribs, and marinate in the refrigerator for 2 hours. 3. Prepare grill for cooking with indirect heat. Remove ribs from marinade. Transfer marinade to a small saucepan, and boil for several minutes. 4. Lightly oil grate. Cook for about 20 minutes, basting with the cooked marinade frequently, until nicely glazed.",
  "prep": "15 mins",
  "cook": "1 hr 25 mins",
  "total": "3 hrs 40 mins",
  "calories": "485"
},
{
  "url": "https://www.allrecipes.com/recipe/23221/bbq-country-style-ribs/",
  "name": "BBQ Country-Style Ribs",
  "rating": "4.4",
  "ratingcount": "639",
  "ingredients": "10  country style pork ribs; 2 teaspoons minced garlic; 1 medium lemon, thinly sliced; 1 (18 ounce) bottle barbeque sauce",
  "directions": "1. Preheat the oven to 250 degrees F (120 degrees C). 2. Place ribs in a single layer in a shallow baking pan or roaster; salt if desired. Spread garlic on ribs, then arrange lemon slices on top. 3. Bake in the preheated oven until tender, about 2 hours. Drain any grease and liquid. Pour barbeque sauce over ribs. 4. Reduce oven temperature to 225 degrees F (110 degrees C) and cook ribs until sauce bakes into meat, about 1 hour.",
  "prep": "15 mins",
  "cook": "3 hrs",
  "total": "3 hrs 15 mins",
  "calories": "625"
},
{
  "url": "https://www.allrecipes.com/recipe/220987/baked-bbq-baby-back-ribs/",
  "name": "Oven-Baked Baby Back Ribs",
  "rating": "4.6",
  "ratingcount": "835",
  "ingredients": "½ cup ancho chile powder; ¼ cup white sugar; ¼ cup brown sugar; ¼ cup salt; 2 tablespoons freshly ground black pepper; 1 tablespoon ground cumin; 1 teaspoon dry mustard; 1 teaspoon ground cayenne pepper; ½ teaspoon ground dried chipotle pepper; 1 rack baby back pork ribs; 1 cup barbeque sauce",
  "directions": "1. Gather ingredients and preheat the oven to 250 degrees F (120 degrees C). 2. Mix ancho chile powder, white and brown sugars, salt, black pepper, cumin, dry mustard, cayenne, and chipotle pepper in a small bowl until combined. 3. Place rib rack, meat-side down, on heavy-duty aluminum foil. Prick back of the rack several times with a knife. Generously apply a coating of dry rub to all sides of the rack. Store any remaining dry rub in an airtight container for future use. 4. With the meat facing down, fold foil around the rack to create a tight seal. Transfer to a sheet pan. 5. Bake in the preheated oven until tender and cooked through, about 2 hours. Remove and cool 15 minutes. 6. Increase oven temperature to 350 degrees F (175 degrees C). 7. Open foil, drain and discard any accumulated juices and fat. Brush barbeque sauce on all sides of the rack. 8. Turn the rack on the foil so the meat is facing up. Return to the oven, leaving the foil open and bake for 10 minutes. Remove from the oven and brush another layer of barbeque sauce on the meat side only. Repeat baking and brushing with sauce 4 more times, for a total of 50 minutes baking time. 9. Cut rack into individual rib segments and serve with more barbeque sauce.",
  "prep": "15 mins",
  "cook": "2 hrs 50 mins",
  "total": "3 hrs 20 mins",
  "calories": "488"
},
{
  "url": "https://www.allrecipes.com/recipe/16448/simple-bbq-ribs/",
  "name": "Simple BBQ Ribs",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "2 ½ pounds country-style pork ribs; 2 tablespoons kosher salt; 1 tablespoon garlic powder; 1 teaspoon ground black pepper; 1 cup barbeque sauce",
  "directions": "1. Gather all ingredients. 2. Place ribs in a large pot and cover with water. Stir in kosher salt, garlic powder, and pepper, and bring water to a boil over medium heat. Continue to boil until ribs are tender, 40 to 45 minutes. 3. While the ribs are boiling, preheat the oven to 325 degrees F (165 degrees C). 4. Remove ribs from the pot, and place them in a 9x13-inch baking dish. Pour barbeque sauce over ribs. Cover the baking dish with aluminum foil. 5. Bake in the preheated oven until the internal temperature of the pork has reached 160 degrees F (70 degrees C), 1 to 1 1/2 hours. 6. Serve hot and enjoy!",
  "prep": "5 mins",
  "cook": "1 hr 45 mins",
  "total": "1 hr 50 mins",
  "calories": "441"
},
{
  "url": "https://www.allrecipes.com/recipe/77408/chinese-spareribs/",
  "name": "Chinese Spareribs",
  "rating": "4.4",
  "ratingcount": "128",
  "ingredients": "3 tablespoons hoisin sauce; 1 tablespoon ketchup; 1 tablespoon honey; 1 tablespoon soy sauce; 1 tablespoon sake; 1 teaspoon rice vinegar; 1 teaspoon lemon juice; 1 teaspoon grated fresh ginger; ½ teaspoon grated fresh garlic; ¼ teaspoon Chinese five-spice powder; 1 pound pork spareribs",
  "directions": "1. Mix together hoisin sauce, ketchup, honey, soy sauce, sake, rice vinegar, lemon juice, ginger, garlic, and five-spice powder in a shallow glass dish. Place ribs in the dish and turn to coat. Cover and marinate in the refrigerator for 2 hours or up to overnight. 2. Preheat the oven to 325 degrees F (165 degrees C). Fill a broiler tray with enough water to cover the bottom. Place the grate or a rack over the tray; arrange ribs on the grate. 3. Cook in the preheated oven on the center rack for 40 minutes, turning and brushing with marinade every 10 minutes. Let marinade cook on for final 10 minutes to make a glaze. Finish under the broiler if desired. Discard any remaining marinade.",
  "prep": "5 mins",
  "cook": "40 mins",
  "total": "2 hrs 45 mins",
  "calories": "503"
},
{
  "url": "https://www.allrecipes.com/recipe/234339/grilled-country-style-ribs/",
  "name": "Grilled Country Style Ribs",
  "rating": "4.5",
  "ratingcount": "24",
  "ingredients": "½ cup Burgundy wine; ¼ cup barbeque sauce, plus more for basting; ¼ cup cider vinegar; ¼ cup hot pepper sauce; 2 tablespoons Worcestershire sauce; 2 tablespoons prepared yellow mustard; 4 pounds country-style pork ribs; 1 tablespoon onion powder; 1 tablespoon garlic powder",
  "directions": "1. Stir together wine, barbeque sauce, cider vinegar, hot pepper sauce, Worcestershire sauce, and mustard in a bowl until well mixed. Place ribs in a baking dish; pour Burgundy wine mixture over ribs and coat thoroughly. 2. Mix onion powder and garlic powder in a bowl. Dust ribs with powder mixture; let marinate for 2 hours, turning once. 3. Preheat the grill to medium-low heat and lightly oil the grate. 4. Grill ribs, covered, over indirect heat on the preheated grill for 45 minutes, turning once. 5. Baste with barbeque sauce; continue grilling until meat is tender, about 15 minutes, turning and basting frequently.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "3 hrs 15 mins",
  "calories": "577"
},
{
  "url": "https://www.allrecipes.com/recipe/275141/oven-baked-barbecue-rib-tips/",
  "name": "Oven-Baked Barbecue Rib Tips",
  "rating": "4.4",
  "ratingcount": "7",
  "ingredients": "1 ½ pounds pork rib tips; 1 tablespoon seasoned salt, or to taste; aluminum foil; ¾ cup barbecue sauce, or to taste",
  "directions": "1. Remove silver skin from the underside of rib tips if there. Rub seasoned salt all over meat. 2. Line a baking pan with aluminum foil; place seasoned meat into the pan. Cover tightly with another piece of foil and refrigerate for at least 4 hours to overnight. 3. Preheat the oven to 250 degrees F (120 degrees C). 4. Bake foil-wrapped ribs in the preheated oven for 2 1/2 hours. 5. Remove the pan from the oven and increase oven temperature to 350 degrees F (175 degrees C). 6. Uncover and drain the pan, if necessary. Brush barbecue sauce over ribs. 7. Bake in the preheated oven for 15 minutes. 8. Flip ribs and brush with additional barbecue sauce; continue baking for another 15 minutes. Repeat this step two more times. 9. Cut ribs into desired serving size, about 1 1/2 to 2 inches. 10. Turn on the oven broiler. Set an oven rack about 6 inches from the heat source. 11. Broil ribs until slightly charred, 2 to 3 minutes. Watch carefully to make sure they do not burn.",
  "prep": "10 mins",
  "cook": "3 hrs 35 mins",
  "total": "7 hrs 45 mins",
  "calories": "246"
},
{
  "url": "https://www.allrecipes.com/recipe/262225/instant-pot-baby-back-ribs/",
  "name": "Instant Pot Baby Back Ribs",
  "rating": "4.8",
  "ratingcount": "223",
  "ingredients": "2 tablespoons kosher salt; 1 tablespoon brown sugar; 1 tablespoon chili powder; 1 tablespoon paprika; 2 teaspoons garlic powder; 1 ½ teaspoons cayenne pepper; 1 teaspoon ground black pepper; 1 rack baby back pork ribs; 1 cup beef broth; ¼ cup barbeque sauce, or as needed",
  "directions": "1. Combine kosher salt, brown sugar, chili powder, paprika, garlic powder, cayenne pepper, and black pepper in a small bowl. 2. Cut rack of ribs into 4 equal portions. Rub all sides of each piece with spice mixture. 3. Pour broth into a multi-functional pressure cooker (such as Instant Pot). Add ribs in a teepee formation. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 30 minutes. Allow 10 to 15 minutes for pressure to build. 4. Preheat the oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil. 5. Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. Transfer ribs to the prepared baking sheet. Brush ribs on all sides with barbeque sauce. 6. Bake in the preheated oven for 7 minutes. Turn ribs and continue baking until meat pulls away easily from the bone, about 7 minutes more. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).",
  "prep": "10 mins",
  "cook": "55 mins",
  "total": "1 hr 10 mins",
  "calories": "335"
},
{
  "url": "https://www.allrecipes.com/recipe/22469/barbecue-ribs/",
  "name": "Barbecue Ribs",
  "rating": "4.8",
  "ratingcount": "1",
  "ingredients": "4 pounds pork spareribs; 1 cup brown sugar; ½ cup chile sauce; ¼ cup ketchup; ¼ cup soy sauce; ¼ cup Worcestershire sauce; ¼ cup rum; 2 cloves garlic, crushed; 1 teaspoon dry mustard; 1 dash ground black pepper; cooking spray",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). 2. Cut spareribs into serving size portions; wrap in double thickness of foil. 3. Bake in the preheated oven for 1 1/2 hours. Unwrap and drain drippings. (I usually freeze drippings to use later in soups.) Place ribs in a large roasting pan. 4. Mix together brown sugar, chile sauce, ketchup, soy sauce, Worcestershire sauce, rum, garlic, mustard, and pepper in a bowl. Coat ribs with sauce and marinate at room temperature for 1 hour or refrigerate for 8 hours to overnight. 5. Preheat the grill to medium heat. Position grate 4 inches above heat source; grease the grate with cooking spray. 6. Cook ribs on the preheated grill for 30 minutes, basting with marinade.",
  "prep": "15 mins",
  "cook": "2 hrs",
  "total": "3 hrs 15 mins",
  "calories": "504"
},
{
  "url": "https://www.allrecipes.com/recipe/69780/best-stovetop-bbq-ribs/",
  "name": "Best Stovetop BBQ Ribs",
  "rating": "4.4",
  "ratingcount": "201",
  "ingredients": "¼ cup steak sauce (such as A1®); ¼ cup ketchup; ¼ cup water; 1 tablespoon Worcestershire sauce; 1 tablespoon soy sauce; 1 tablespoon minced garlic; 4 (6 ounce) country style pork ribs; 1  onion, cut into rings (Optional)",
  "directions": "1. Whisk together steak sauce, ketchup, water, Worcestershire sauce, soy sauce, and garlic in a bowl until smooth. 2. Place pork ribs in a saucepan with a lid, and pour the sauce over the ribs. 3. Spread raw onion rings over the ribs, and cover the pan. 4. Bring to a boil over medium heat, and simmer the ribs in the sauce until tender, about 45 minutes.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "246"
},
{
  "url": "https://www.allrecipes.com/recipe/275255/air-fryer-bbq-baby-back-ribs/",
  "name": "Air Fryer BBQ Baby Back Ribs",
  "rating": "4.4",
  "ratingcount": "20",
  "ingredients": "3 pounds baby back pork ribs; 1 tablespoon brown sugar; 1 tablespoon white sugar; 1 teaspoon sweet paprika; 1 teaspoon smoked paprika; 1 teaspoon granulated garlic; ½ teaspoon ground black pepper; ½ teaspoon ground cumin; ½ teaspoon granulated onion; ¼ teaspoon Greek seasoning (Optional); ⅓ cup barbeque sauce",
  "directions": "1. Preheat an air fryer to 350 degrees F (175 degrees C). 2. Strip membrane from the back of ribs. Cut ribs into 4 equal portions. 3. Combine brown sugar, white sugar, sweet paprika, smoked paprika, granulated garlic, pepper, cumin, onion, and Greek seasoning in a small bowl. 4. Rub spice mixture all over ribs. Place ribs in the air fryer basket. 5. Cook ribs in the preheated air fryer for 30 minutes, turning once halfway. Brush with barbeque sauce, then air-fry for 5 more minutes.",
  "prep": "5 mins",
  "cook": "35 mins",
  "total": "40 mins",
  "calories": "615"
},
{
  "url": "https://www.allrecipes.com/recipe/17949/honey-garlic-ribs/",
  "name": "Honey Garlic Ribs",
  "rating": "4.4",
  "ratingcount": "470",
  "ingredients": "4 pounds pork spareribs; ½ cup honey; ¼ cup soy sauce; ¼ cup distilled white vinegar; 2 tablespoons brown sugar; 2 cloves garlic, minced; 1 teaspoon baking soda; 1 teaspoon garlic salt",
  "directions": "1. Preheat the oven to 375 degrees F (190 degrees C). 2. Slice ribs into individual pieces. Combine honey, soy sauce, vinegar, brown sugar, and garlic in a large bowl; stir until honey and sugar are completely dissolved, then stir in baking soda. The mixture will begin to foam. Transfer ribs to the bowl and turn to coat. 3. Cover a cookie sheet with foil; arrange ribs meat-side up on the prepared sheet. Pour excess sauce over ribs and sprinkle with garlic salt. 4. Bake in the preheated oven for 1 hour, turning every 20 minutes.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "477"
},
{
  "url": "https://www.allrecipes.com/recipe/262470/fall-off-the-bone-30-minute-instant-pot-ribs/",
  "name": "Fall-off-the-Bone Instant Pot Ribs",
  "rating": "4.8",
  "ratingcount": "88",
  "ingredients": "½ cup brown sugar; ¼ cup chili powder; 1 tablespoon dried parsley; 2 teaspoons salt; 2 teaspoons garlic powder; 2 teaspoons ground black pepper; 2 teaspoons ground cumin; 2 teaspoons onion powder; 1 teaspoon smoked paprika; 2 racks baby back ribs, membranes removed; 1 cup water; ½ cup apple cider vinegar; 1 (12 ounce) bottle barbeque sauce (such as Sweet Baby Ray's®)",
  "directions": "1. Gather all ingredients. 2. Mix brown sugar, chili powder, parsley, salt, garlic powder, pepper, cumin, onion powder, and paprika together in a bowl using a fork, breaking up any large clumps. 3. Rub spice mixture over both sides of ribs. 4. Place a steam rack inside a multi-functional pressure cooker (such as Instant Pot). Pour water and cider vinegar into the bottom of the pot. 5. Lower ribs into the pot by curving them around the edge. Close and lock the lid. Select high pressure according to manufacturer's instructions; set the timer for 25 minutes. Allow 10 to 15 minutes for pressure to build. 6. Release pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid. 7. Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil; place ribs on the foil. Top with barbeque sauce. 8. Broil ribs until sauce is bubbling, about 3 minutes.",
  "prep": "10 mins",
  "cook": "40 mins",
  "total": "55 mins",
  "calories": "415"
},
{
  "url": "https://www.allrecipes.com/recipe/25432/simple-country-ribs/",
  "name": "Simple Country Ribs",
  "rating": "4.6",
  "ratingcount": "586",
  "ingredients": "2 ½ pounds pork spareribs; 2 (18 ounce) bottles barbeque sauce; 1  onion, quartered; 1 teaspoon salt; ½ teaspoon ground black pepper",
  "directions": "1. Place spareribs in a large stockpot; add barbeque sauce, onion, salt, and pepper. Pour in enough water to cover the ribs. Bring to a low boil and simmer for 40 minutes. 2. Preheat an outdoor grill for high heat and lightly oil the grate. 3. Transfer spareribs onto the preheated grill, reserving the cooking liquid. Cook, basting with reserved cooking liquid often and turning frequently, until nicely browned, about 20 minutes.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 10 mins",
  "calories": "882"
},
{
  "url": "https://www.allrecipes.com/recipe/16429/southern-grilled-barbecued-ribs/",
  "name": "Southern Grilled Barbecued Ribs",
  "rating": "4.8",
  "ratingcount": "305",
  "ingredients": "4 pounds baby back pork ribs; ⅔ cup water; ⅓ cup red wine vinegar; 1 cup ketchup; 1 cup water; ½ cup cider vinegar; ⅓ cup Worcestershire sauce; ¼ cup prepared mustard; 4 tablespoons butter; ½ cup packed brown sugar; 1 teaspoon hot pepper sauce; ⅛ teaspoon salt",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). Place ribs in two 10x15 inch roasting pans. Pour water and red wine vinegar into a bowl, and stir. Pour diluted vinegar over ribs and cover with foil. Bake in the preheated oven for 45 minutes. Baste the ribs with their juices halfway through cooking. 2. In a medium saucepan, mix together ketchup, water, vinegar, Worcestershire sauce, mustard, butter, brown sugar, hot pepper sauce, and salt; bring to a boil. Reduce heat to low, cover, and simmer barbeque sauce for 1 hour. 3. Preheat grill for medium heat. 4. Lightly oil preheated grill. Transfer ribs from the oven to the grill, discarding cooking liquid. Grill over medium heat for 15 minutes, turning ribs once. Baste ribs generously with barbeque sauce, and grill 8 minutes. Turn ribs, baste again with barbeque sauce, and grill 8 minutes.",
  "prep": "20 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 50 mins",
  "calories": "519"
},
{
  "url": "https://www.allrecipes.com/recipe/274865/slow-cooker-pork-rib-tips/",
  "name": "Slow Cooker Pork Rib Tips",
  "rating": "4.7",
  "ratingcount": "31",
  "ingredients": "2 tablespoons brown sugar; 1 tablespoon chili powder; 1 teaspoon salt; 1 teaspoon ground black pepper; 1 teaspoon garlic powder; 1 teaspoon onion powder; 1 pound pork rib tips; 1 (18 ounce) bottle BBQ sauce, divided; 1 tablespoon liquid smoke flavoring",
  "directions": "1. Mix together brown sugar, chili powder, salt, black pepper, garlic powder, and onion powder in a large bowl until combined. Add rib tips and mix until ribs are thoroughly coated. Let rest at room temperature for 10 minutes. 2. Place coated ribs in a slow cooker. Stir together 3/4 of the BBQ sauce with liquid smoke in a medium bowl until well combined. Pour evenly over ribs. 3. Cook on Low until ribs are tender, 4 to 6 hours. 4. Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking tray or broiler rack with aluminum foil. 5. Remove ribs to the prepared tray and baste with remaining BBQ sauce. 6. Cook ribs under the preheated broiler until sauce is hot and sticky, 3 to 5 minutes per side.",
  "prep": "10 mins",
  "cook": "4 hrs 5 mins",
  "total": "4 hrs 25 mins",
  "calories": "453"
},
{
  "url": "https://www.allrecipes.com/recipe/258727/easy-st-louis-style-pork-ribs-on-gas-grill/",
  "name": "Easy St. Louis-Style Pork Ribs on Gas Grill",
  "rating": "3.9",
  "ratingcount": "9",
  "ingredients": "4 pounds St. Louis-style pork ribs, cut into 6-inch sections; 2 cups barbecue sauce, or to taste",
  "directions": "1. Heat one side of a gas grill to 300 degrees F (150 degrees C). 2. Fill a small metal can or container with water. Cover with aluminum foil; make several slits in the foil with a knife. Place on the preheated side of the grill. 3. Place ribs bone-side up on the unheated side of the grill; close the grill. Cook for 1 1/2 hours. Flip ribs and continue cooking until rib meat shrinks back from the bones, about 1 1/2 hours more. 4. Baste ribs with barbecue sauce. Transfer to the heated side of the grill; cook for 2 minutes with the lid closed. Flip and baste second side with sauce. Cook for 2 minutes with the lid closed. Flip and baste first side again with more sauce. Cook for 2 minutes with the lid closed.",
  "prep": "10 mins",
  "cook": "3 hrs 10 mins",
  "total": "3 hrs 20 mins",
  "calories": "487"
},
{
  "url": "https://www.allrecipes.com/recipe/76057/quick-baby-back-ribs/",
  "name": "Quick Baby Back Ribs",
  "rating": "4.7",
  "ratingcount": "74",
  "ingredients": "1 cup mesquite chips, soaked; 1 (2 pound) slab baby back pork ribs; 1 teaspoon salt; 1 teaspoon freshly ground pepper; 1 teaspoon Hungarian paprika; 1 teaspoon ancho chile powder; ½ teaspoon ground thyme; 1 cup barbeque sauce",
  "directions": "1. Prepare an outdoor grill for indirect heat with a pile of charcoal on one side and nothing under the food. Once it is going, spread soaked mesquite woodchips on top of charcoal embers. 2. Remove membrane from ribs. Combine salt, pepper, paprika, chile powder, and thyme in a small bowl; rub into ribs. Cut the slab of ribs in half. 3. Place ribs over indirect heat; close the lid. Cook for 20 minutes, then brush ribs with barbeque sauce. Cover and continue cooking for 30 more minutes.",
  "prep": "15 mins",
  "cook": "50 mins",
  "total": "1 hr 5 mins",
  "calories": "465"
},
{
  "url": "https://www.allrecipes.com/recipe/220280/boiled-baked-ribs/",
  "name": "Boiled & Baked Ribs",
  "rating": "4.5",
  "ratingcount": "79",
  "ingredients": "½ cup rice vinegar; ½  onion, chopped; 6 cloves garlic, crushed; 2 tablespoons kosher salt; 1 tablespoon Chinese five-spice powder; 1 teaspoon red pepper flakes; 2  bay leaves; 1 (2 pound) slab baby back ribs, cut into individual ribs; 1 ½ tablespoons soy sauce; 1 ½ tablespoons rice vinegar; 1 ½ tablespoons sambal oelek chili paste; 1 ½ tablespoons Dijon mustard; 1 ½ tablespoons ketchup; 1 ½ tablespoons honey; 1 ½ tablespoons brown sugar; ½ teaspoon Chinese five-spice powder",
  "directions": "1. Prepare ribs: Mix 2 1/2 quarts water, rice vinegar, onion, garlic, salt, five-spice powder, chili flakes, and bay leaves in a large pot. Bring to a boil; then reduce heat to low and simmer for 15 to 20 minutes. 2. Place ribs in broth; return to a simmer, then turn heat to low and cook for 1 hour. 3. Preheat the oven to 375 degrees F (190 degrees C). Line a baking sheet with a silicone baking mat. 4. Prepare glaze: Whisk together soy sauce, rice vinegar, chili paste, mustard, ketchup, honey, brown sugar, and five-spice powder in a large bowl. 5. Remove ribs from broth and transfer into the bowl with soy sauce glaze; toss to coat. 6. Transfer glazed ribs to the prepared baking sheet. Reserve extra glaze for brushing. 7. Bake ribs in the preheated oven for 15 minutes. Turn ribs and brush with more glaze. Cook 15 to 20 more minutes, brushing occasionally with remaining glaze if desired. Remove and serve.",
  "prep": "10 mins",
  "cook": "2 hrs",
  "total": "2 hrs 10 mins",
  "calories": "466"
},
{
  "url": "https://www.allrecipes.com/recipe/172967/sweet-smoked-pork-ribs/",
  "name": "Sweet Smoked Pork Ribs",
  "rating": "4.6",
  "ratingcount": "137",
  "ingredients": "¼ cup salt; ¼ cup white sugar; 2 tablespoons packed brown sugar; 2 tablespoons ground black pepper; 2 tablespoons ground white pepper; 2 tablespoons onion powder; 1 tablespoon garlic powder; 1 tablespoon chili powder; 1 tablespoon ground paprika; 1 tablespoon ground cumin; 10 pounds baby back pork ribs; 1 cup apple juice; ¼ cup packed brown sugar; ¼ cup barbeque sauce",
  "directions": "1. Gather all ingredients. 2. Prepare ribs: Stir salt, white sugar, brown sugar, black pepper, white pepper, onion powder, garlic powder, chili powder, paprika, and cumin together in a small bowl. 3. Rub spice mixture all over ribs; cover with plastic wrap and refrigerate for at least 30 minutes. 4. Make sauce: Stir apple juice, brown sugar, and barbeque sauce together until well combined. Set aside. 5. Unwrap ribs and arrange in a single layer onto the wire racks of the smoker. Place the racks into a smoker, fill the smoker pan with apple, grape, pear, or cherry chips, and heat the smoker to 270 degrees F (130 degrees C). Cook ribs for 1 hour. 6. Brush ribs with sauce. Continue cooking ribs, basting with sauce every 30 to 40 minutes, until meat is no longer pink and begins to shrink back from bones, 3 to 4 hours. 7. Brush sauce onto ribs one last time and remove them from the smoker. Wrap ribs tightly with aluminum foil and allow to rest until juices reabsorb into meat, 10 to 15 minutes. 8. Enjoy!",
  "prep": "20 mins",
  "cook": "4 hrs",
  "total": "5 hrs",
  "calories": "827"
},
{
  "url": "https://www.allrecipes.com/recipe/16091/baby-back-ribs/",
  "name": "Baby Back Ribs",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "2 pounds pork baby back ribs; aluminum foil; cooking spray; 1 (18 ounce) bottle barbecue sauce",
  "directions": "1. Cut ribs into 4 equal portions. 2. Tear off 4 pieces of aluminum foil big enough to enclose each portion of ribs. Grease each piece of foil with cooking spray. 3. Brush ribs liberally with barbecue sauce; place each portion of ribs on a piece of foil. Wrap tightly and refrigerate for 8 hours to overnight. 4. Preheat the oven to 300 degrees F (150 degrees C). 5. Bake ribs wrapped tightly in foil in the preheated oven for 2 1/2 hours. Remove ribs from foil and serve with more sauce, if desired.",
  "prep": "15 mins",
  "cook": "2 hrs 30 mins",
  "total": "10 hrs 45 mins",
  "calories": "697"
},
{
  "url": "https://www.allrecipes.com/recipe/191199/asian-style-country-ribs/",
  "name": "Asian Style Country Ribs",
  "rating": "4.1",
  "ratingcount": "222",
  "ingredients": "¼ cup lightly packed brown sugar; 1 cup soy sauce; ¼ cup sesame oil; 2 tablespoons olive oil; 2 tablespoons rice vinegar; 2 tablespoons lime juice; 2 tablespoons minced garlic; 2 tablespoons minced fresh ginger; 1 teaspoon Sriracha hot pepper sauce; 12  boneless country-style pork ribs",
  "directions": "1. Stir together the brown sugar, soy sauce, sesame oil, olive oil, rice vinegar, lime juice, garlic, ginger, and Sriracha in the crock of a slow cooker. Add the ribs; cover and refrigerate. Allow ribs to marinate in the refrigerator for 8 hours or overnight. 2. Before cooking, drain marinade and discard. Cook on Low for 9 hours. Drain cooked meat and shred, using 2 forks.",
  "prep": "10 mins",
  "cook": "9 hrs",
  "total": "17 hrs 10 mins",
  "calories": "653"
},
{
  "url": "https://www.allrecipes.com/recipe/279624/instant-pot-ribs-from-frozen/",
  "name": "Instant Pot Ribs from Frozen",
  "rating": "4.9",
  "ratingcount": "10",
  "ingredients": "½ cup water; 3 tablespoons hickory smoke seasoning (such as Savory Spice® Red Rocks); 1 rack frozen baby back ribs, membrane removed and cut into 4 slabs; ¼ cup barbecue sauce",
  "directions": "1. Pour water into a multi-functional pressure cooker (such as Instant Pot). Set the trivet inside. 2. Sprinkle hickory smoke seasoning liberally over frozen ribs; set ribs on top of the trivet. Close and lock the lid. 3. Select high pressure according to manufacturer's instructions; set the timer for 45 minutes. Allow 10 to 15 minutes for pressure to build. 4. Release pressure using the natural-release method according to manufacturer's instructions, about 15 minutes. Unlock and remove the lid. 5. Preheat the oven broiler. Set an oven rack about 6 inches from the heat source. 6. Transfer ribs to a rimmed baking sheet. Brush with barbecue sauce. Broil until glazed, 4 to 5 minutes.",
  "prep": "5 mins",
  "cook": "1 hr",
  "total": "1 hr 20 mins",
  "calories": "309"
},
{
  "url": "https://www.allrecipes.com/recipe/228498/slow-cooker-baby-back-ribs/",
  "name": "Slow Cooker Baby Back Ribs",
  "rating": "4.7",
  "ratingcount": "1",
  "ingredients": "3 pounds baby back ribs, trimmed; salt and ground black pepper, to taste; ½ cup water; ½  onion, sliced; 1 clove garlic, minced; 1 (18 ounce) bottle barbeque sauce",
  "directions": "1. Season ribs with salt and pepper. 2. Pour 1/2 cup water into the slow cooker, then add ribs. Scatter onion and garlic over top. Cover and cook on Low for 8 hours or High for 4 hours. 3. When the ribs are almost finished, preheat the oven to 375 degrees F (190 degrees C). 4. Transfer ribs from the slow cooker to a baking sheet; discard onion and garlic. Coat ribs with barbeque sauce. 5. Bake ribs in the preheated oven until sauce caramelizes and sticks to meat, 10 to 15 minutes.",
  "prep": "10 mins",
  "cook": "4 hrs 15 mins",
  "total": "4 hrs 25 mins",
  "calories": "501"
},
{
  "url": "https://www.allrecipes.com/recipe/24849/oven-baked-bbq-ribs/",
  "name": "Oven-Baked BBQ Ribs",
  "rating": "4.6",
  "ratingcount": "513",
  "ingredients": "4 pounds pork spareribs; 2 cups sliced onions; 2 cups ketchup; 2 cups water; ½ cup white vinegar; ½ cup dark brown sugar; ¼ cup Worcestershire sauce; 4 teaspoons mustard powder; 4 teaspoons salt; 1 tablespoon vegetable oil, or as needed",
  "directions": "1. Preheat the oven to 350 degrees F (175 degrees C). Split ribs down the center between the bones. 2. Mix onions, ketchup, water, vinegar, brown sugar, Worcestershire sauce, mustard powder, and salt together in a bowl. Set aside 1/2 of the sauce for basting. 3. Heat oil in a large skillet over medium-high heat. Working in several batches, add ribs and sear until browned, 4 to 5 minutes per batch. 4. Transfer ribs to two baking pans and arrange in a single layer. Pour remaining BBQ sauce over ribs. 5. Bake in the preheated oven for 3 hours. Turn and baste every 20 minutes with the reserved sauce, using all sauce after 2 hours of cooking. For the last hour, continue to turn ribs every 20 minutes, basting with the sauce in the pan. Meat should easily pull away from the bone, and an instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).",
  "prep": "15 mins",
  "cook": "3 hrs 15 mins",
  "total": "3 hrs 30 mins",
  "calories": "748"
},
{
  "url": "https://www.allrecipes.com/recipe/216985/tender-pork-spare-ribs/",
  "name": "Tender Pork Spare Ribs",
  "rating": "4.7",
  "ratingcount": "330",
  "ingredients": "1 cup brown sugar; ½ cup fajita seasoning (such as Fiesta®); 2 tablespoons Hungarian sweet paprika; 2 racks pork spareribs, fat trimmed; 1 cup beer; 3 cloves garlic, minced; 1 tablespoon honey; 3 tablespoons Worcestershire sauce; 1 tablespoon prepared brown mustard",
  "directions": "1. Mix brown sugar, fajita seasoning, and paprika in a bowl. Rub both sides of pork spareribs with the brown sugar mixture. Place spareribs in a 9x13-inch baking pan; cover and refrigerate 8 hours or overnight. 2. Preheat the oven to 250 degrees F (120 degrees C). Whisk together beer, garlic, honey, Worcestershire sauce, and mustard in a bowl. Set aside. 3. Tear off 2 large sheets of heavy-duty aluminum foil and lay them shiny-side down. Place a rack of spare ribs on each sheet, meaty-side up. Tear off 2 more sheets of foil and place them on top of the spare ribs, shiny-side up. Begin tightly folding the edges of the foil together to create a sealed packet. Just before sealing completely, divide beer mixture evenly into each packet. Complete the seal. Place the packets side-by-side on an 11x14-inch baking sheet. 4. Bake ribs in the preheated oven until the ribs are very tender, 3 1/2 to 4 hours. Carefully open each packet and drain drippings into a saucepan. You may only need the drippings from one packet. Place ribs on a foil-lined baking sheet and set aside. 5. Heat the saucepan over medium-high and simmer drippings until the sauce begins to thicken, about 5 minutes. Brush the thickened sauce over ribs. 6. Preheat the broiler and set the oven rack about 6 inches from the heat source. Return ribs to the oven and broil until the sauce is lightly caramelized, 5 to 7 minutes.",
  "prep": "20 mins",
  "cook": "4 hrs",
  "total": "12 hrs 20 mins",
  "calories": "943"
},
{
  "url": "https://www.allrecipes.com/recipe/213749/spicy-chinese-barbeque-riblets/",
  "name": "Spicy Chinese Barbeque Riblets",
  "rating": "4.8",
  "ratingcount": "73",
  "ingredients": "1 cup hoisin sauce; ⅓ cup white wine; ½ cup soy sauce; 1 cup white sugar; ½ cup tomato paste; ¼ cup chopped garlic; 2 tablespoons hot pepper sauce (such as Tabasco®), or to taste; 2 pounds baby back ribs, cut into 1-inch riblets",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Combine the hoisin sauce, white wine, soy sauce, sugar, tomato paste, garlic, and hot sauce in large bowl; mix well. 3. Place the riblets in a large roasting pan and bake in the preheated oven, uncovered, for 45 minutes. Pour sauce over riblets and toss to coat. Return the pan to the oven; bake, stirring often, until ribs are tender and sauce has thickened, about 45 minutes.",
  "prep": "15 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "774"
},
{
  "url": "https://www.allrecipes.com/recipe/64450/chinese-braised-spare-ribs/",
  "name": "Chinese Braised Spare Ribs",
  "rating": "4.0",
  "ratingcount": "25",
  "ingredients": "1 pound pork spareribs, cut into 3 inch pieces; 1 tablespoon vegetable oil; 1 (1 inch) piece fresh ginger root, sliced; 5  green onions cut into 2-inch pieces; ½ teaspoon ground cinnamon; 2 cups water; 1 ½ tablespoons soy sauce; 1 teaspoon white sugar; 1 teaspoon rice wine; ¼ teaspoon salt; ¼ teaspoon pepper",
  "directions": "1. Bring a large pot of water to a boil, then add the spareribs, and cook uncovered for 3 to 5 minutes. Drain in a colander and set aside. 2. Heat the vegetable oil in a skillet over high heat. Stir in the ginger, green onions, and cinnamon; cook and stir until fragrant. Stir in the spareribs and cook for 3 to 5 minutes. Pour in the water, soy sauce, sugar, and rice wine. Season with salt and pepper. Bring the mixture to a boil, then reduce heat to low and cover. Simmer until the spareribs are tender, about 1 hour.",
  "prep": "5 mins",
  "cook": "1 hr 15 mins",
  "total": "1 hr 20 mins",
  "calories": "244"
},
{
  "url": "https://www.allrecipes.com/recipe/60155/moms-sweet-n-sours-pork-ribs/",
  "name": "Mom's \"Sweet 'n Sours\" Pork Ribs",
  "rating": "4.7",
  "ratingcount": "244",
  "ingredients": "1 cup white sugar; ¼ cup all-purpose flour; 1 teaspoon salt; ½ teaspoon pepper; ½ teaspoon dry mustard; 2 cups water; ½ cup soy sauce; ½ cup vinegar; 2 pounds pork spareribs, cut into bite size pieces; 1 tablespoon vegetable oil; 2 cloves garlic, chopped",
  "directions": "1. Mix sugar, flour, salt, pepper, and mustard in a bowl. Stir in water, soy sauce, and vinegar. 2. Place ribs in a pot with enough water to cover. Bring to a boil, cook for 10 minutes, and drain. 3. Heat oil in a large skillet over medium heat. Brown ribs on all sides. Mix in sauce mixture. Bring to a boil, reduce heat to low, and simmer for 30 minutes. 4. Mix in garlic and continue cooking for 15 minutes, or to desired doneness.",
  "prep": "15 mins",
  "cook": "1 hr",
  "total": "1 hr 15 mins",
  "calories": "669"
},
{
  "url": "https://www.allrecipes.com/recipe/280667/salt-and-pepper-spare-ribs/",
  "name": "Salt and Pepper Spare Ribs",
  "rating": "4.4",
  "ratingcount": "40",
  "ingredients": "4 teaspoons kosher salt; 1 tablespoon freshly ground black pepper; 1 teaspoon freshly ground white pepper; 1 teaspoon cayenne pepper; ½ teaspoon garlic powder; 2 tablespoons white vinegar; 2 teaspoons Dijon mustard; 1 rack St. Louis-style pork spare ribs",
  "directions": "1. Mix salt, black pepper, white pepper, cayenne, and garlic powder together in a small bowl. Set spice rub aside. 2. Stir vinegar and Dijon mustard together in a small bowl. 3. Place ribs on a foil-lined baking sheet. Turn the ribs over so that the meat side is down. Use the tip of a small, sharp knife to make some very shallow slashes every few inches through the membrane that covers the ribs. Poke the knife 3 or 4 times between each rib bone, about 1/4 inch deep. 4. Brush about 1/2 of the Dijon mustard mixture on top. Sprinkle with about 40% of the spice rub. Turn the rack over and brush on the rest of the mustard and vinegar mixture. Sprinkle on the rest of the rub, reserving 1 or 2 teaspoons in case you want to use it to season the cooked ribs later. 5. Refrigerate the ribs, uncovered, 4 to 12 hours before baking. 6. Preheat the oven to 300 degrees F (150 degrees C). Remove ribs from the refrigerator. 7. Cook in the center of the preheated oven for 1 1/2 hours. Remove from the oven and baste with the pan drippings. Continue to cook until very tender and the tip of a knife slides in very easily, about 1 1/2 hours more. 8. Remove from the oven, baste again, and let ribs rest for 15 minutes before cutting and serving.",
  "prep": "10 mins",
  "cook": "3 hrs",
  "total": "7 hrs 25 mins",
  "calories": "400"
},
{
  "url": "https://www.allrecipes.com/recipe/216773/slow-cooker-ribs/",
  "name": "Slow Cooker Ribs",
  "rating": "4.3",
  "ratingcount": "183",
  "ingredients": "½ teaspoon steak seasoning, or to taste; ½ teaspoon garlic salt, or to taste; ¼ teaspoon ground black pepper, or to taste; ¼ teaspoon chili powder, or to taste (Optional); 1 (4 pound) package boneless country-style pork ribs; 1 cup barbecue sauce; ¼ cup Worcestershire sauce; ¼ cup soy sauce; ¼ cup teriyaki sauce; ¼ cup orange juice; 2 dashes hot pepper sauce, or to taste",
  "directions": "1. Mix together steak seasoning, garlic salt, black pepper, and chili powder in a small bowl until combined. Rub over ribs and place into the bottom of a slow cooker. Pour in barbecue sauce, Worcestershire sauce, soy sauce, teriyaki sauce, orange juice, and hot pepper sauce. Liquid should not cover ribs completely. 2. Cook on Low until ribs are tender, about 8 hours.",
  "prep": "10 mins",
  "cook": "8 hrs",
  "total": "8 hrs 10 mins",
  "calories": "665"
},
{
  "url": "https://www.allrecipes.com/recipe/75811/moms-stovetop-pork-ribs/",
  "name": "Mom's Stovetop Pork Ribs",
  "rating": "4.6",
  "ratingcount": "634",
  "ingredients": "10 pork spareribs; ½ cup soy sauce; 10 sprigs fresh parsley, divided; 10 cloves garlic, crushed; 1  lime, juiced; 1 tablespoon dried rosemary; 1 tablespoon dried oregano; 2  bay leaves; ground black pepper to taste; 2  limes, cut into wedges",
  "directions": "1. Place spareribs into a large pot and fill with just enough water to cover. Add soy sauce, 3/4 of the parsley, garlic, lime juice, rosemary, oregano, and bay leaves. Bring to a boil, then reduce heat and simmer uncovered until water has completely evaporated, about 25 minutes. 2. Remove bay leaves and continue cooking until spareribs are browned, turning occasionally. Use a spatula to scrape up browned bits and softened garlic from the bottom of the pot and toss them with spareribs; the garlic will dissolve onto meat. Remove spareribs to a paper towel-lined plate to drain. 3. Season spareribs with black pepper. Garnish with lime wedges and remaining parsley to serve.",
  "prep": "20 mins",
  "cook": "40 mins",
  "total": "1 hr",
  "calories": "461"
},
{
  "url": "https://www.allrecipes.com/recipe/258000/greek-ribs/",
  "name": "Greek Ribs",
  "rating": "4.9",
  "ratingcount": "9",
  "ingredients": "3 pounds baby back ribs, membranes removed; ½ cup finely chopped onion; ¼ cup olive oil; ¼ cup fresh lemon juice; ¼ cup chopped fresh oregano; 1 tablespoon liquid honey; 5 cloves garlic, minced; 1 teaspoon kosher salt; 1 teaspoon freshly ground black pepper; cooking spray",
  "directions": "1. Combine baby back ribs, onion, olive oil, lemon juice, oregano, honey, garlic, salt, and pepper in a large resealable plastic bag. Turn to ensure ribs are well coated. 2. Marinate in the refrigerator, turning occasionally, 4 to 8 hours. 3. Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil; grease with cooking spray. 4. Arrange ribs on the prepared baking sheet, leaving space between them. 5. Bake in the preheated oven until browned, about 10 minutes. Reduce oven temperature to 300 degrees F (150 degrees C). Continue baking until ribs are tender, about 1 hour.",
  "prep": "30 mins",
  "cook": "1 hr 10 mins",
  "total": "5 hrs 40 mins",
  "calories": "473"
}]