[{
  "url": "https://www.allrecipes.com/recipe/57576/blackened-prime-rib/",
  "name": "Blackened Prime Rib",
  "rating": "4.5",
  "ratingcount": "25",
  "ingredients": "½ cup brown sugar; 2 teaspoons ground cumin; 2 tablespoons ground black pepper; 2 tablespoons ground coriander; ¼ cup chili powder; 2 tablespoons kosher salt; ¼ cup soy sauce; ½ cup chili powder; 3 tablespoons Cajun-style blackened seasoning; 6 pounds prime rib roast, bone in; 2 cups water",
  "directions": "1. In a medium bowl, mix together the brown sugar, cumin, black pepper, coriander, 1/4 cup chili powder, kosher salt, and soy sauce. In a separate small bowl, mix together 1/2 cup chili powder and blackened seasoning. Set aside. 2. Cut ribs from roast, and place in a roasting pan. They will act as a roasting rack. Rub the meat all over with the soy sauce mixture. Then rub and coat with the Cajun seasoning mixture. Let marinate for at least one hour or wrap in plastic, and chill overnight. 3. Preheat the oven to 500 degrees F (260 degrees C). 4. Remove any plastic from roast, and place pan into the preheated oven. Roast uncovered for 15 minutes in the preheated oven. Pour water into the pan to produce moist heat. Reduce oven temperature to 300 degrees F (150 degrees C), and continue roasting for 1 hour and 10 minutes, or until the internal temperature is at least 130-140 degrees F/55-60 degrees C) for medium rare, or (145-155 degrees F/63-68 degrees C) for medium . Let the roast stand for 30 minutes before carving to let the juices return to the center.",
  "prep": "10 mins",
  "cook": "1 hr 55 mins",
  "total": "3 hrs 5 mins",
  "calories": "697"
},
{
  "url": "https://www.allrecipes.com/recipe/43808/smoked-standing-rib-roast/",
  "name": "Smoked Standing Rib Roast",
  "rating": "4.6",
  "ratingcount": "18",
  "ingredients": "15 pounds charcoal briquets; 2 pounds hickory wood chips; 1 cup bourbon whiskey; 1 (4 pound) standing rib roast, bone in; ½ cup steak seasoning",
  "directions": "1. Start at least 10 pounds of the charcoal in a torpedo style smoker. You need a fairly hot fire. Fill the secondary pan with cold water, and wait for the coals to turn white. Soak hickory chips in bourbon with enough water to cover. Rub the roast liberally with steak seasoning, being sure to coat all surfaces. 2. When the coals are ready, place the roast on the top grate. Throw a few handfuls of soaked hickory chips onto the fire, and close the lid. Check the fire every 45 minutes or so, adding more charcoal as needed to keep the fire hot. Every time you check the fire, add more wood chips. Cook for 8 to 10 hours, or to your desired doneness. Use a meat thermometer to check the roast. The meat tastes best when rare: 145 degrees F (65 degrees C), but cook to your liking.",
  "prep": "5 mins",
  "cook": "10 hrs",
  "total": "10 hrs 5 mins",
  "calories": "565"
},
{
  "url": "https://www.allrecipes.com/recipe/14623/best-prime-rib-roast/",
  "name": "Best Prime Rib Roast",
  "rating": "4.6",
  "ratingcount": "81",
  "ingredients": "3 teaspoons grated fresh ginger root; ⅓ cup orange marmalade; 4 cloves garlic, minced; 3 tablespoons soy sauce; 2 tablespoons brown sugar; ¼ teaspoon hot pepper sauce; 1 tablespoon mustard powder; 1 cup beer; 1 (8 pound) prime rib roast; ¼ cup olive oil; freshly ground black pepper",
  "directions": "1. Mix together the ginger, marmalade, garlic, soy sauce, brown sugar, hot sauce, and mustard. Stir in the beer. Prick holes all over the roast with a 2 pronged fork. Pour marinade over roast. Cover, and refrigerate for at least 2 hours, basting at least twice. 2. Preheat oven to 400 degrees F (200 degrees C). 3. Place roast on a rack in a roasting pan. Pour about 1 cup of marinade into the roasting pan, and discard remaining marinade. Pour olive oil over roast, and season with freshly ground black pepper. Insert a roasting thermometer into the middle of the roast, making sure that the thermometer does not touch any bone. Cover roasting pan with aluminum foil, and seal edges tightly around pan. 4. Cook roast for 1 hour in the preheated oven. After the first hour, remove the aluminum foil. Baste, reduce heat to 325 degrees F (165 degrees C), and continue roasting for 1 more hour. The thermometer reading should be at least 140 degrees F (60 degrees C) for medium-rare, and 170 degrees F (76 degrees C) for well done. Remove roasting pan from oven, place aluminum foil over roast, and let rest for about 30 minutes before slicing.",
  "prep": "15 mins",
  "cook": "2 hrs",
  "total": "4 hrs 15 mins",
  "calories": "630"
},
{
  "url": "https://www.allrecipes.com/recipe/235743/delicious-and-easy-prime-rib/",
  "name": "Delicious and Easy Prime Rib",
  "rating": "5.0",
  "ratingcount": "6",
  "ingredients": "1 (7 pound) bone-in prime rib, trimmed and retied to the bone; 8 cloves garlic; 2 tablespoons olive oil; 2 teaspoons kosher salt; 2 teaspoons freshly ground black pepper; 1 ounce fresh rosemary, or to taste; 1 ounce fresh thyme, or to taste",
  "directions": "1. Preheat oven to 350 degrees F (175 degrees C). 2. Slice several slits into the top of prime rib; push garlic cloves into slits. Coat prime rib with olive oil and season with salt and pepper. Arrange rosemary sprigs and thyme sprigs atop prime rib and place in a roasting pan. 3. Bake in the preheated oven until browned on the outside and pink in the center, 3 1/2 to 4 hours. An instant-read thermometer inserted into the center should read at least 125 degrees F (52 degrees C). Allow prime rib to rest 15 minutes before slicing.",
  "prep": "15 mins",
  "cook": "3 hrs 30 mins",
  "total": "4 hrs",
  "calories": "447"
},
{
  "url": "https://www.allrecipes.com/recipe/245638/reverse-sear-prime-rib-roast/",
  "name": "Reverse-Sear Prime Rib Roast",
  "rating": "4.8",
  "ratingcount": "93",
  "ingredients": "1 (10 pound) bone-in standing rib roast; 2 tablespoons kosher salt; ½ cup butter, softened; 3 tablespoons chopped fresh rosemary; 2 tablespoons chopped fresh thyme; ground black pepper to taste",
  "directions": "1. Season roast generously with kosher salt. 2. Cover loosely with plastic wrap and refrigerate, 8 hours to overnight. 3. Remove roast from the refrigerator and allow to come to room temperature, about 2 hours. 4. Preheat the oven to 200 degrees F (95 degrees C). 5. Mix butter, rosemary, thyme, and black pepper together in a small bowl. 6. Spread butter mixture over roast. Place roast in a large roasting pan. 7. Bake roast in the preheated oven until internal temperature reaches 115 degrees F (46 degrees C) for medium-rare, about 3 1/2 hours. Remove from the oven and tent with aluminum foil; allow to rest, about 20 minutes. 8. Meanwhile, increase the oven temperature to 500 degrees F (260 degrees C). 9. Once the oven has come up to temperature, uncover rested roast and return it to the oven. Bake until well-browned, 6 to 10 minutes. Slice and serve.",
  "prep": "15 mins",
  "cook": "3 hrs 40 mins",
  "total": "14 hrs 15 mins",
  "calories": "339"
},
{
  "url": "https://www.allrecipes.com/recipe/221958/chef-johns-perfect-prime-rib/",
  "name": "Chef John's Perfect Prime Rib",
  "rating": "4.8",
  "ratingcount": "2",
  "ingredients": "1 (4 pound) prime rib roast; ¼ cup unsalted butter, softened; 1 tablespoon freshly ground black pepper; 1 teaspoon herbes de Provence; kosher salt to taste",
  "directions": "1. Place prime rib roast on a plate and bring to room temperature, 2 to 4 hours. 2. Preheat the oven to 500 degrees F (260 degrees C). 3. Combine butter, pepper, and herbes de Provence in a bowl; mix until well blended. Spread butter mixture evenly over entire roast. Season roast generously with kosher salt. 4. Roast the 4-pound roast in the preheated oven for 20 minutes. (If your roast is larger or smaller than 4 pounds, multiply the exact weight times 5 minutes.) 5. Turn the oven off and, leaving the roast in the oven with the door closed, let the roast sit in the oven for 2 hours. 6. Remove roast from the oven, slice, and serve.",
  "prep": "10 mins",
  "cook": "2 hrs 20 mins",
  "total": "4 hrs 30 mins",
  "calories": "1757"
},
{
  "url": "https://www.allrecipes.com/recipe/255737/easy-standing-rib-roast/",
  "name": "Easy Standing Rib Roast",
  "rating": "4.9",
  "ratingcount": "11",
  "ingredients": "1 (4 pound) rib roast; 2 tablespoons olive oil, or as needed; ¼ cup sea salt; 2 tablespoons freshly ground black pepper; 2 cloves garlic, minced, or more to taste",
  "directions": "1. Preheat the oven to 475 degrees F (245 degrees C). Set a rack inside a shallow roasting pan. 2. Brush rib roast lightly with olive oil, then rub sea salt, pepper, and garlic all over. Place onto the rack with the fatty side facing up. 3. Roast in the preheated oven until browned, about 30 minutes. Reduce the oven temperature to 325 degrees F (165 degrees C) and tent the pan with aluminum foil. Continue cooking until an instant-read thermometer inserted into the center of the rib roast registers 140 degrees (60 degrees C) for medium, about 1 hour (or 15 minutes per pound if your roast is a different size). 4. Remove from the oven and let stand for 10 to 20 minutes, then remove the foil and carve.",
  "prep": "5 mins",
  "cook": "1 hr 30 mins",
  "total": "1 hr 45 mins",
  "calories": "440"
},
{
  "url": "https://www.allrecipes.com/recipe/219585/brians-garlicky-prime-rib/",
  "name": "Brian's Garlicky Prime Rib",
  "rating": "4.6",
  "ratingcount": "5",
  "ingredients": "1 envelope dry onion soup mix; 4 cloves garlic, minced; 3 tablespoons soy sauce; 2 tablespoons maple syrup; 1 ½ teaspoons Worcestershire sauce; 1 ½ teaspoons bacon drippings; 1 tablespoon mustard powder; ¼ teaspoon hot sauce; 1 cup amber or dark beer; 1 (5 pound) prime rib roast; 2 cloves garlic, cut into slivers; ¼ cup olive oil; salt and ground black pepper to taste",
  "directions": "1. To make marinade, mix the onion soup, 4 minced cloves of garlic, soy sauce, maple syrup, Worcestershire sauce, bacon drippings, mustard powder, and hot sauce together in a bowl; stir in the amber beer. Cut small slits into the prime rib roast and push slivers of garlic into the slits until slivers are not visible. Place the roast into a large resealable plastic bag, pour in the marinade, and refrigerate for 1 hour. Remove from refrigerator and allow roast to marinate in the bag at room temperature for an additional hour. 2. Preheat oven to 400 degrees F (200 degrees C). Place a rack into a roasting pan. 3. Remove roast from the marinade and place onto the rack in the roasting pan. Pour the marinade all over the roast, and allow to drip into the pan. Rub the olive oil thoroughly over the roast, season with salt and black pepper, and place a large sheet of aluminum foil over the meat. Seal the aluminum foil to the edges of the roasting pan. 4. Bake the roast for 1 hour. Remove the aluminum foil, and baste the meat with the pan juices. Return the uncovered pan to the oven and continue roasting until the meat is browned and an instant-read meat thermometer inserted into the thickest part, not touching bone, reads 130 to 135 degrees F (54 to 57 degrees C) for medium-rare, about 1 more hour. 5. Remove the roast from the oven, cover with a tent of aluminum foil, and allow to rest for 20 to 30 minutes before carving. As the meat rests, temperature will rise about 10 degrees to 140 to 145 degrees F (60 to 65 degrees C).",
  "prep": "15 mins",
  "cook": "2 hrs",
  "total": "4 hrs 35 mins",
  "calories": "603"
},
{
  "url": "https://www.allrecipes.com/recipe/17143/kosher-salt-encrusted-prime-rib-roast/",
  "name": "Kosher Salt Encrusted Prime Rib Roast",
  "rating": "4.7",
  "ratingcount": "399",
  "ingredients": "2 cups coarse kosher salt; 4 pounds prime rib roast; 1 tablespoon ground black pepper; 1 tablespoon seasoning salt",
  "directions": "1. Preheat oven to 210 degrees F (100 degrees C). 2. Cover the bottom of a roasting pan with a layer of kosher salt. Place the roast, bone side down, on the salt. Season the meat with the ground black pepper and seasoning salt, then cover completely with kosher salt. 3. Roast in preheated oven for 4 to 5 hours, or until the internal temperature of the meat reaches 145 degrees F (63 degrees C). 4. Remove from oven and let rest for 30 minutes. This sets the juices and makes the roast easier to carve. (Note: Be sure to remove all the salt from the roast before serving.)",
  "prep": "10 mins",
  "cook": "4 hrs 30 mins",
  "total": "4 hrs 40 mins",
  "calories": "391"
},
{
  "url": "https://www.allrecipes.com/recipe/8520971/low-and-slow-prime-rib/",
  "name": "Low and Slow Prime Rib",
  "rating": "4.3",
  "ratingcount": "6",
  "ingredients": "5 pounds prime rib roast; 1 tablespoon kosher salt; 2 tablespoons very soft unsalted butter; 1 tablespoon kosher salt; 2 teaspoons freshly ground black pepper; ⅛ teaspoon cayenne pepper",
  "directions": "1. Gather all ingredients. 2. Place beef on a pan, and rub with salt. Place meat on a rack or twisted foil so air can circulate under roast, and transfer to the fridge for 24 to 48 hours. 3. Remove from the refrigerator and let it rest for a few hours to come to room temperature (optional). 4. Preheat the oven to 300 degrees F (150 degrees C). 5. Transfer roast into a roasting pan, preferably on a rack. 6. Mix butter with coarse salt, pepper, and cayenne in a small bowl and spread onto the sides and top of the roast. Then add more salt to the top. Pour water into the bottom of the pan. 7. Roast in the preheated oven until internal temperature is 115 to 120 degrees F (46 to 48 degrees C), about 1 hour and 20 minutes (about 20 minutes per pound). Remove from the oven, cover with foil and let rest for at least 20 minutes before serving. 8. Drippings from the pan can be deglazed with broth or water, and served alongside meat.",
  "prep": "15 mins",
  "cook": "",
  "total": "1 day 1 hr 55 mins",
  "calories": "2152"
},
{
  "url": "https://www.allrecipes.com/recipe/240437/the-perfect-prime-rib-roast/",
  "name": "The Perfect Prime Rib Roast",
  "rating": "4.6",
  "ratingcount": "16",
  "ingredients": "1 teaspoon garlic powder; 1 teaspoon onion powder; 1 teaspoon dried dill weed; 1 teaspoon ground black pepper; 1 teaspoon salt (Optional); 3 pounds prime rib roast, ribs removed and trussed onto roast, or more to taste",
  "directions": "1. Preheat oven to 375 degrees F (190 degrees C). Place a rack inside a roasting pan. 2. Mix garlic powder, onion powder, dill weed, pepper, and salt together in a bowl; rub onto roast, including the ribs. Place roast, rib-side down, onto rack in roasting pan. 3. Bake roast in the preheated oven for 45 minutes. Turn off oven, keeping the door closed the entire time, and keep roast in oven for 3 hours. Turn oven back to 375 degrees F (190 degrees C) and cook roast until an internal temperature of 145 degrees F (65 degrees C) is reached, 30 minutes more.",
  "prep": "10 mins",
  "cook": "4 hrs 15 mins",
  "total": "4 hrs 25 mins",
  "calories": "393"
},
{
  "url": "https://www.allrecipes.com/recipe/8519674/prime-rib-gravy/",
  "name": "Prime Rib Gravy",
  "rating": "5.0",
  "ratingcount": "3",
  "ingredients": "1 teaspoon butter for greasing pan; ½  onion, unpeeled, sliced; ½ cup roughly chopped carrots; ½ cup roughly chopped celery; 2  beef rib bones; 4 cups beef bone broth or high quality, low-sodium beef broth; 2 cups water; 2 tablespoons unsalted butter; 1 cup sliced brown mushroom (Optional); 2 tablespoons reserved beef fat; ⅓ cup all-purpose flour; 3 ½ cups reserved beef stock; 1 teaspoon kosher salt, or to taste; Freshly ground black pepper to taste; Cayenne to taste; 1 teaspoon balsamic vinegar",
  "directions": "1. Gather ingredients. Preheat an oven to 450 degrees F (230 degrees C). Line a baking sheet with foil. 2. Spread out onions, carrots, and celery on the prepared baking sheet. Set rib bones on top. 3. Roast until bones are deep brown and onions are black, about 1 hour. Use a spatula or tongues to transfer bones and vegetables into a saucepan. Drain off and reserve any rendered fat from the baking sheet for the gravy. 4. Add broth and water to the saucepan, and bring to a boil on high heat. Reduce heat to low and simmer until meat falls off bone and is flavorless, about 4 hours. Skim any fat from the surface and reserve. 5. Strain broth and let cool to room temp. 6. Melt butter in a pot on medium-high and sauté mushrooms until well browned. Add 2 tablespoons rendered beef fat and stir until melted. Add flour and cook for a few minutes. 7. Whisk in broth, and bring to a simmer. Cook, stirring occasionally, about 5 minutes. Reduce heat to medium and simmer until gravy has thickened to desired thickness, 5 to 10 minutes more 8. Adjust salt to taste and season with freshly ground black pepper, cayenne, and balsamic vinegar. Taste again, adjust, and serve.",
  "prep": "25 mins",
  "cook": "5 hrs 10 mins",
  "total": "5 hrs 35 mins",
  "calories": "730"
},
{
  "url": "https://www.allrecipes.com/recipe/230368/prime-rib-its-easier-than-you-think/",
  "name": "Prime Rib - It's Easier Than You Think",
  "rating": "4.8",
  "ratingcount": "34",
  "ingredients": "1 (5 pound) bone-in beef prime rib roast; 1 tablespoon olive oil; 2 teaspoons Montreal-style steak seasoning (such as McCormick®); 1 teaspoon chopped garlic; 1 teaspoon Italian seasoning; 1 teaspoon mustard powder",
  "directions": "1. Place roast, bone side down, in a roasting pan. 2. Mix olive oil, steak seasoning, garlic, Italian seasoning, and mustard powder together in a small bowl; spread over the roast. Allow roast to come to room temperature, about 45 minutes. 3. Preheat oven to 450 degrees F (230 degrees C). 4. Bake roast in the preheated oven for 20 minutes. Insert a meat thermometer in the thickest part of the roast away from the bone. 5. Reduce oven temperature to 325 degrees F (165 degrees C). Continue to cook in the oven to your desired degree of doneness, or an internal temperature of 145 degrees F (65 degrees C) for medium, about 1 1/2 to 2 hours. Remove from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 10 to 15 minutes before slicing.",
  "prep": "10 mins",
  "cook": "1 hr 50 mins",
  "total": "2 hrs 55 mins",
  "calories": "437"
},
{
  "url": "https://www.allrecipes.com/recipe/240543/easy-prime-rib-roast/",
  "name": "Easy Prime Rib Roast",
  "rating": "4.7",
  "ratingcount": "19",
  "ingredients": "4 cloves garlic, finely chopped, or more to taste; ¼ teaspoon dried rosemary, or more to taste; 1 pinch crushed dried sage; 1 pinch finely ground dried thyme; salt and ground black pepper to taste; 1 (4.5 pound) bone-in prime rib roast; ¼ cup Worcestershire sauce, or more to taste; ¼ cup soy sauce, or more to taste",
  "directions": "1. Mix garlic, rosemary, sage, thyme, salt, and pepper together in a small bowl. Pat garlic mixture over entire roast. Make an incision down the middle of the roast, keeping parallel with the bones. Place the roast in a plastic roasting bag and pour Worcestershire sauce and soy sauce into the bag, concentrating on the incision in the roast. Tie the bag and refrigerate roast to marinate, turning often, at least 2 hours. 2. Remove roast from refrigerator and allow to come to room temperature, 1 to 2 hours. Remove roast from bag and discard marinade. Place roast, fat-side up, in a roasting pan. 3. Preheat an oven to 500 degrees F (260 degrees C). 4. Bake in the preheated oven for 15 minutes. Lower heat to 350 degrees F (175 degrees C) and continue cooking until an internal temperature of 145 degrees F (65 degrees C), about 1 hour. Let roast stand for 20 minutes before slicing.",
  "prep": "15 mins",
  "cook": "1 hr 15 mins",
  "total": "4 hrs 50 mins",
  "calories": "340"
},
{
  "url": "https://www.allrecipes.com/recipe/220363/classic-standing-beef-rib-roast/",
  "name": "Classic Standing Beef Rib Roast",
  "rating": "4.9",
  "ratingcount": "21",
  "ingredients": "1 (7 pound) standing rib roast; ⅛ teaspoon salt; 1 pinch ground black pepper; 6 tablespoons red wine; 2 cups Swanson® Beef Stock or Swanson® Unsalted Beef Stock; ¼ cup all-purpose flour",
  "directions": "1. Heat the oven to 325 degrees F. Season the beef with the black pepper. Place the beef into a roasting pan, rib-side down. 2. Roast for 2 hours 20 minutes for medium-rare or until desired doneness. Remove the beef to a cutting board and let stand for 20 minutes. 3. Spoon off any fat from the pan drippings. Stir the wine in the pan and heat over medium-high heat to a boil, stirring to scrape up any browned bits from the bottom of the pan. Reduce the heat to medium and cook for 5 minutes. Pour the wine mixture through a fine mesh sieve into a 2-quart saucepan. 4. Stir the stock and flour in a medium bowl with a whisk. Gradually add the stock mixture to the saucepan, stirring with a whisk. Cook and stir over medium heat for 5 minutes or until the mixture boils and thickens. Season with additional salt and black pepper, if desired. Serve the stock mixture with the beef.",
  "prep": "15 mins",
  "cook": "2 hrs 20 mins",
  "total": "2 hrs 55 mins",
  "calories": "551"
},
{
  "url": "https://www.allrecipes.com/recipe/219587/christmas-prime-rib/",
  "name": "Christmas Prime Rib",
  "rating": "4.8",
  "ratingcount": "229",
  "ingredients": "1 (6 pound) boneless prime rib roast; 2 tablespoons prepared horseradish; 2 tablespoons Dijon mustard; 2 teaspoons kosher salt; 2 teaspoons coarsely ground black pepper; 2 teaspoons dried thyme; 2 teaspoons garlic powder; 2 stalks celery, cut into 2-inch pieces; 1  carrot, cut into 2-inch pieces; 1 small unpeeled onion, quartered and separated; 2 teaspoons concentrated beef base (paste); 1 ½ cups water; 1 teaspoon cornstarch; 1 teaspoon water",
  "directions": "1. The day before serving, remove the roast from the package and dry thoroughly with paper towels. Set roast on a baking sheet, and place in refrigerator overnight. Remove from refrigerator 1 hour before cooking to allow meat to reach room temperature. Rub the roast all over with horseradish and Dijon mustard. Mix kosher salt, black pepper, thyme, and garlic powder together in small bowl; sprinkle over the roast. 2. Preheat the oven to 450 degrees F (230 degrees C). Place celery, carrot, and onion into the bottom of a roasting pan; place the roast on top. 3. Roast in the preheated oven for 30 minutes. Reduce oven temperature to 350 degrees F (175 degrees C), and roast until the meat is browned and an instant-read meat thermometer inserted into the thickest part of the roast reads 130 degrees F (54 degrees C) for medium-rare. Remove from oven, transfer roast to a platter, and cover with a tent of aluminum foil. Allow to rest for 30 minutes. The temperature of the meat will rise about 10 degrees during resting time. 4. To make au jus sauce: Skim excess fat from pan drippings in the roasting pan. Place the pan over a burner set to medium heat; stir in beef base and 1 1/2 cups of water. Bring to a boil, scraping and dissolving any brown flavor bits from the bottom of the pan. Strain out and discard vegetables. Combine cornstarch and 1 teaspoon of water in a small bowl; whisk the mixture into sauce. Allow sauce to thicken slightly; pour into a gravy boat and serve with roast.",
  "prep": "15 mins",
  "cook": "2 hrs",
  "total": "10 hrs 45 mins",
  "calories": "410"
},
{
  "url": "https://www.allrecipes.com/recipe/160399/prime-rib-au-jus-with-yorkshire-pudding/",
  "name": "Prime Rib Au Jus with Yorkshire Pudding",
  "rating": "4.6",
  "ratingcount": "79",
  "ingredients": "1 (5 pound) bone-in beef rib roast; 8 cloves garlic, quartered; ¾ teaspoon salt; 1 teaspoon freshly ground black pepper; 2 cups eggs; 2 cups milk; 1 pinch salt; 2 cups all-purpose flour; ½ cup pan drippings from prime rib; ½ cup white wine; 2 cups beef stock",
  "directions": "1. Place the roast bone-side down in a roasting pan, and use a sharp paring knife to poke 24 small holes 1 inch deep all over the roast. Stuff each hole with a sliver of garlic. Sprinkle with 3/4 teaspoon salt, and LOTS of black pepper. Allow the roast to stand at room temperature for 2 hours. This will take the chill off and allow the meat to cook more evenly. 2. Meanwhile, beat together the eggs and milk with a pinch of salt until smooth. Stir in flour until smooth. Cover the Yorkshire pudding batter, and place in the refrigerator. 3. Preheat oven to 450 degrees F (230 degrees C). 4. Cook the roast in the preheated oven for 30 minutes, then lower the heat to 350 degrees F (175 degrees C), and continue roasting until a meat thermometer inserted in the center of the meat reaches 140 degrees F (60 degrees C), about 1 hour. 5. When the roast is done, remove it from the roasting pan, cover with aluminum foil, and let rest in a warm spot while you make the Yorkshire pudding. Measure out 1/2 cup of the beef fat, and divide among 12 muffin tins; pour off the remaining fat, but save the roasting pan to make the jus. 6. Place the grease-filled muffin tins into the oven, and turn the temperature up to 425 degrees F (220 degrees C). Let the muffin tins preheat for 10 minutes, then fill 3/4 full with the refrigerated batter, and return to the oven. Bake 20 to 25 minutes until the puddings have risen tall and are golden brown. 7. While the Yorkshire puddings are baking, place the roasting pan on the stove over medium-high heat. Stir in the wine, and bring to a simmer while scraping to dissolve the pan drippings; pour in the beef stock and return to a simmer. Cook 10 minutes, then strain and serve with the roast and puddings.",
  "prep": "20 mins",
  "cook": "1 hr 30 mins",
  "total": "4 hrs 20 mins",
  "calories": "965"
},
{
  "url": "https://www.allrecipes.com/recipe/9381/prime-rib/",
  "name": "Prime Rib",
  "rating": "4.5",
  "ratingcount": "215",
  "ingredients": "1 (10 pound) prime rib roast; 6 cloves garlic, sliced; salt and ground black pepper to taste; ½ cup Dijon mustard",
  "directions": "1. Preheat the oven to 500 degrees F (260 degrees C). 2. Make slits all over the roast by pricking with a small knife. Insert slivers of sliced garlic. Season the roast with salt and pepper, then spread generously with mustard. Place on a rack in a roasting pan, and cover. 3. Roast for 60 minutes in the preheated oven. Turn off oven. Leave oven closed, and do not peek for 90 minutes. The internal temperature of the meat should be at least 140 degrees F (60 degrees C) for medium-rare, or 155 degrees F (68 degrees C) for medium.",
  "prep": "10 mins",
  "cook": "2 hrs 30 mins",
  "total": "2 hrs 40 mins",
  "calories": "443"
},
{
  "url": "https://www.allrecipes.com/recipe/219586/prime-rib-our-way/",
  "name": "Prime Rib Our Way",
  "rating": "4.2",
  "ratingcount": "5",
  "ingredients": "1 (8 pound) standing rib roast, fat trimmed; 2 tablespoons freshly ground black pepper; 1 teaspoon crushed dried rosemary; 3 ¼ cups rock salt (such as Morton® Rock Salt for Making Ice Cream), or as needed; 3 ¼ cups all-purpose flour, or as needed; ¾ cup cold water, or as needed; 6 slices bacon (Optional); 1 tablespoon butter; 1 pound fresh mushrooms, chopped; 2 (1 ounce) packets dry au jus gravy mix; 6 cups cold water, or as needed; ½ cup dry red wine",
  "directions": "1. Preheat oven to 450 degrees F (230 degrees C). Rinse the roast, and pat dry with paper towels. Sprinkle black pepper and rosemary over the top and sides of the meat, and set aside. 2. In a large bowl, mix the rock salt with the flour, and slowly work in 3/4 cup of cold water or as needed, about 1 tablespoon at a time, to make a sticky paste. Place a 1/2-inch thick layer of the rock salt paste into the bottom of a roasting pan. Lay the meat, ribs down, onto the paste. Lay the bacon strips over the top of the roast. Smear rock salt paste liberally all over the roast, coating the top, sides, and bottom of the meat. Reserve about 1/4 cup of the paste. 3. Bake the roast in the preheated oven until seared and brown, 20 to 30 minutes. Remove the roast from the oven, and check for holes in the paste coating; repair with reserved paste. Reduce oven temperature to 325 degrees F (165 degrees C). Return the roast to the oven, and cook until browned and an instant-read meat thermometer inserted into the thickest part of the meat, not touching bone, reads 130 degrees F (54 degrees C) for medium-rare, about 1 more hour. Remove the roast, and allow to stand for about 30 minutes. Temperature will rise to 140 to 145 degrees F (60 to 65 degrees C) as it rests. 4. Melt butter in a large skillet over medium heat, and cook and stir the mushrooms until browned and their liquid has almost evaporated, about 15 minutes. Stir in 6 cups of cold water, and whisk in the au jus gravy mix until smooth. Stir in the red wine. Bring the sauce to a boil, reduce heat, and simmer, stirring constantly, until the sauce has thickened. 5. To serve, break off and discard the salt crust from the meat; slice, and serve with mushroom gravy.",
  "prep": "45 mins",
  "cook": "1 hr 20 mins",
  "total": "2 hrs 35 mins",
  "calories": "709"
},
{
  "url": "https://www.allrecipes.com/recipe/262937/amazing-slow-roasted-prime-rib/",
  "name": "Amazing Slow-Roasted Prime Rib",
  "rating": "5.0",
  "ratingcount": "1",
  "ingredients": "½ cup soy-based liquid seasoning (such as Maggi®); ½ cup Worcestershire sauce; 3 cloves garlic, minced, or more to taste; 9 pounds bone-in prime rib, cut and retied to the bone",
  "directions": "1. Mix liquid seasoning and Worcestershire sauce together with garlic in a bowl. Pour over prime rib in a container. Marinate for 1 to 2 hours, turning every 30 minutes. 2. Preheat the oven to 450 degrees F (230 degrees C). 3. Place prime rib on a baking rack set inside a large baking dish. 4. Bake in the preheated oven until all juices are sealed in, about 45 minutes. 5. Reduce oven temperature to 325 degrees F (165 degrees C) and continue roasting until an instant-read thermometer inserted into the center reads 130 to 140 degrees F (54 to 60 degrees C), about 2 hours more. 6. Let prime rib sit for 30 minutes to 1 hour before slicing.",
  "prep": "5 mins",
  "cook": "2 hrs 45 mins",
  "total": "4 hrs 20 mins",
  "calories": "225"
},
{
  "url": "https://www.allrecipes.com/recipe/219589/delectable-prime-rib-and-au-jus/",
  "name": "Delectable Prime Rib au Jus",
  "rating": "4.8",
  "ratingcount": "24",
  "ingredients": "1 (10 pound) prime rib loin roast; 2 cups concentrated beef base (paste); 1 clove garlic, minced; ½ cup chopped fresh thyme; ½ cup dried oregano; ½ cup whole black peppercorns; 2 teaspoons salt; 2 ½ cups water; 1 tablespoon concentrated beef base (paste); 2 tablespoons dry red wine; 1 teaspoon finely chopped fresh thyme; 1 teaspoon dried oregano; ½ teaspoon garlic powder; ½ medium white onion, coarsely chopped; ½ medium carrot, peeled and coarsely chopped; 1 stalk celery, quartered",
  "directions": "1. Make the roast: Preheat the oven to 350 degrees F (175 degrees C). Trim any thick pieces of dense, hard fat from roast, but leave smaller areas of fat in place. 2. Mix beef base and garlic together in a bowl. Mix thyme, oregano, peppercorns, and salt together in another bowl. Rub beef base mixture generously all over roast, then sprinkle with herb mixture. Place roast into a roasting pan. 3. Roast in the preheated oven until meat has formed a brown crust, about 3 hours. An instant-read thermometer inserted into the thickest part of the roast should read 130 degrees F (54 degrees C) for medium-rare. Remove from the oven and let stand while you make the sauce; the temperature will rise 5 to 10 degrees F as it rests. 4. Make the sauce: Whisk water and beef base together in a saucepan over medium-low heat until base dissolves. Whisk in red wine, thyme, oregano, and garlic powder, then add onion, carrot, and celery. Bring to a boil, then reduce the heat and simmer, stirring frequently, until sauce reduces by about half, 20 to 30 minutes. Strain sauce and discard vegetables. Serve with roast.",
  "prep": "20 mins",
  "cook": "3 hrs 25 mins",
  "total": "4 hrs 50 mins",
  "calories": "479"
},
{
  "url": "https://www.allrecipes.com/recipe/230367/rosemary-dijon-prime-rib/",
  "name": "Rosemary Dijon Prime Rib",
  "rating": "4.9",
  "ratingcount": "19",
  "ingredients": "1 (5 pound) prime rib roast; 3 cloves garlic, thinly sliced; kosher salt to taste; ½ cup Dijon mustard, or to taste; 3 sprigs fresh rosemary, leaves stripped, or more to taste",
  "directions": "1. Preheat an oven to 450 degrees F (230 degrees C). 2. Slice small cuts along the outside edges of the roast; fill cuts with garlic slices. Generously salt the entire roast. Spread a thin layer of Dijon mustard over the entire roast; generously sprinkle mustard layer with rosemary leaves. Place roast, bone side-down, in a baking dish. 3. Bake in the preheated oven for 30 minutes. Reduce oven temperature to 350 degrees F (175 degrees C). Place a meat thermometer in the thickest part of the meat not touching the bone. Cook to your desired degree of doneness, or an internal temperature of at least 145 degrees F (65 degrees C) for medium, about 1 1/2 hours. Remove from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 10 to 15 minutes before slicing.",
  "prep": "15 mins",
  "cook": "2 hrs",
  "total": "2 hrs 25 mins",
  "calories": "436"
},
{
  "url": "https://www.allrecipes.com/recipe/92634/boneless-garlic-and-rosemary-rubbed-prime-rib-with-red-wine-mushroom-sauce/",
  "name": "Boneless Garlic and Rosemary Rubbed Prime Rib with Red Wine Mushroom Sauce",
  "rating": "4.7",
  "ratingcount": "111",
  "ingredients": "1 (5 pound) boneless rib-eye roast, left at room temperature for 2 hours before cooking; 2 tablespoons olive oil; 1 tablespoon salt; 2 tablespoons ground black pepper (you can grind whole peppercorns in a blender); 8 large garlic cloves, minced; 2 tablespoons minced fresh rosemary; ½ teaspoon minced fresh rosemary for the sauce; 2 (8 ounce) packages baby bella or domestic white mushrooms, sliced; 1 cup chicken broth; ¾ cup red wine; 1 tablespoon Dijon mustard; 1 teaspoon cornstarch; 2 teaspoons water",
  "directions": "1. Adjust the oven rack to center position and heat the oven to 250 degrees F (120 degrees C). 2. Heat a 12-inch oven-proof skillet over medium-high heat. Rub roast on all sides with oil, salt, and pepper. Turn on the exhaust fan, add roast to the hot skillet, and brown it on all sides, about 10 minutes total. Transfer roast to a plate. When cool enough to handle, rub garlic and rosemary all over. 3. Pour off all but 2 tablespoons of beef drippings. Add mushrooms to the hot skillet and sauté until well browned, about 8 minutes. Mix broth, wine, and mustard; add to mushrooms and simmer to blend flavors and reduce slightly, about 3 minutes. Pour mushroom sauce into a bowl; set aside. 4. Set a wire rack over the skillet and set roast on the rack. Slow-roast in the oven until roast reaches an internal temperature of 135 degrees F (57 degrees C) for medium-rare. For medium, 140 degrees F (60 degrees C) for medium, about 2 1/2 to 3 hours. 5. Transfer roast to a cutting board; remove rack from skillet. Pour off excess fat, if any. Set skillet over medium-high heat; return mushroom sauce to pan heat to a simmer. Stir together cornstarch and water in a liquid measuring cup. Add cornstarch slurry and continue to simmer until sauce thickens slightly, about a minute. Carve meat and serve with sauce.",
  "prep": "10 mins",
  "cook": "2 hrs 55 mins",
  "total": "3 hrs 5 mins",
  "calories": "355"
},
{
  "url": "https://www.allrecipes.com/recipe/154851/rock-salt-encrusted-prime-rib/",
  "name": "Rock Salt-Encrusted Prime Rib",
  "rating": "4.7",
  "ratingcount": "94",
  "ingredients": "20 pounds standing rib roast (weight with bones), top fat trimmed; 2 (1 ounce) packages dry onion soup mix; 2 tablespoons freshly ground black pepper; 8 cups rock salt; 8 cups all-purpose flour; 2 tablespoons crushed dried rosemary; 2 cups water, or more if needed",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). 2. Rinse roast and pat dry with paper towels. Mix soup mix and pepper together in a small bowl; rub generously over all sides of roast. Place roast onto a clean, dry baking sheet; let rest for 30 to 45 minutes. 3. Mix rock salt, flour, and rosemary together in a bowl. Gradually pour in water and mix by hand (wear gloves if desired) until batter is thick and paste-like, adding more water if necessary. 4. Spread salt batter into the bottom of a roasting pan to make a 1/2- to 3/4-inch-thick layer; reserve 1 to 2 cups batter. Place roast, with the bones facing down, on batter in the center of the pan. Pull batter up and around roast until meat is completely covered. Pat on extra batter if necessary. Insert an oven-safe meat thermometer into the roast so its gauge will be visible from the front of the oven. 5. Cook in the preheated oven for 15 to 20 minutes. Remove from the oven and patch any holes or breaks in the coating with remaining salt batter. 6. Return roast to the oven and cook until internal temperature reaches 130 degrees F (54 degrees C), about 3 hours, or to desired doneness. Remove from the oven and let rest until internal temperature reaches 140 degrees F (60 degrees C), 20 to 30 minutes. 7. Chip off and discard salt crust, then slice and serve.",
  "prep": "30 mins",
  "cook": "3 hrs 15 mins",
  "total": "4 hrs 35 mins",
  "calories": "1554"
},
{
  "url": "https://www.allrecipes.com/recipe/240305/smoked-prime-rib-roast/",
  "name": "Smoked Prime Rib Roast",
  "rating": "4.6",
  "ratingcount": "32",
  "ingredients": "2 ½ teaspoons kosher salt; 1 (5 pound) prime rib roast, bones removed; 5 tablespoons olive oil; 2 tablespoons cracked black pepper; 2 teaspoons garlic powder; 2 teaspoons dried rosemary; 2 teaspoons dried thyme; 1 teaspoon onion powder; 1 teaspoon paprika; ½ teaspoon cayenne pepper",
  "directions": "1. Sprinkle salt over entire roast; wrap roast in plastic wrap. Refrigerate for 4 hours to overnight. 2. Combine olive oil, black pepper, garlic powder, rosemary, thyme, onion powder, paprika, and cayenne pepper in a bowl. Set aside for flavors to blend, about 1 hour. 3. Pour 3/4 of the oil mixture over roast; massage into the top and sides of meat. Flip roast; pour remaining oil mixture over roast and massage. Place roast on a plate and refrigerate for at least 1 hour or up to 12 hours. 4. Preheat the smoker to 225 degrees F (110 degrees C) to 230 degrees F (107 degrees C). Add hickory or pecan wood chips to the smoker. 5. Insert an oven-safe meat thermometer into the thickest part of roast. Place roast into the smoker and cook until internal temperature reaches 145 degrees F (63 degrees C), 3 to 3 1/2 hours. 6. Preheat the oven to 500 degrees F (260 degrees C) to 550 degrees F (288 degrees C). 7. Bake roast in the preheated oven until crust is crunchy, producing a reverse sear, 15 to 20 minutes. Allow roast to rest for 10 to 15 minutes before slicing.",
  "prep": "10 mins",
  "cook": "3 hrs 15 mins",
  "total": "9 hrs 35 mins",
  "calories": "358"
},
{
  "url": "https://www.allrecipes.com/recipe/139890/restaurant-style-prime-rib-roast/",
  "name": "Restaurant-Style Prime Rib Roast",
  "rating": "4.5",
  "ratingcount": "462",
  "ingredients": "1 (14 pound) roast-ready prime rib roast (ribs cut off and tied to roast); aluminum foil; ¾ cup all-purpose flour; 2 teaspoons freshly ground black pepper; 2 teaspoons salt; 2 teaspoons paprika; 1 teaspoon onion powder; ½ teaspoon garlic powder; ¼ teaspoon celery seed",
  "directions": "1. Remove rib roast from the refrigerator. Allow it to come to room temperature for about 3 hours, depending on its size. 2. Preheat the oven to 425 degrees F (220 degrees C). Line a roasting pan with aluminum foil. 3. Place rib roast onto the prepared roasting pan; blot with paper towels. Sift together flour, pepper, salt, paprika, onion powder, garlic powder, and celery seed into a bowl. Coat roast all over with flour mixture. 4. Roast in the preheated oven until cooked to your desired degree of doneness, about 4 1/2 hours (20 minutes a pound) for medium-rare. An instant-read thermometer inserted into the center should read at least 120 degrees F (49 degrees C) for medium-rare, 130 degrees F (54 degrees C) for medium, or 140 degrees F (60 degrees C) for well-done. 5. Cover roast with aluminum foil. Let rest on the counter in a warm spot for 30 minutes to 1 hour before slicing.",
  "prep": "10 mins",
  "cook": "4 hrs 30 mins",
  "total": "8 hrs 10 mins",
  "calories": "870"
},
{
  "url": "https://www.allrecipes.com/recipe/230192/cast-iron-skillet-prime-rib-roast-and-gravy/",
  "name": "Cast-Iron Skillet Prime Rib Roast and Gravy",
  "rating": "4.7",
  "ratingcount": "45",
  "ingredients": "1 (4.5 pound) beef prime rib roast at room temperature; coarse sea salt, or as needed; freshly ground black pepper, or as needed; 1  onion, quartered; ¼ cup unsalted butter; ¼ cup all-purpose flour; ¼ cup red wine; 1 (32 ounce) carton beef stock; 4 sprigs fresh thyme",
  "directions": "1. Preheat oven to 275 degrees F (135 degrees C). 2. Rub beef roast with sea salt and black pepper. Heat a large cast-iron skillet over medium-high heat; sear roast on all sides in the hot skillet, 2 to 3 minutes per side. Turn roast so the ribs and fat side are facing up. 3. Roast prime rib in the preheated oven for 45 minutes; scatter onion quarters around roast and continue cooking until an instant-read meat thermometer inserted into the thickest part of the meat reads 130 degrees F (54 degrees C) for rare, about 2 more hours. 4. Remove roast from skillet, wrap meat in aluminum foil, and let rest for 15 to 20 minutes to let juices reabsorb into the meat. Leave onion pieces in skillet. 5. Pour drippings from skillet into a bowl and skim off excess grease. Return degreased drippings to skillet with onion pieces, place over medium heat, and melt butter in the drippings. Whisk flour into mixture to make a paste, 1 to 2 minutes. Stir red wine into flour paste until smooth. Mix beef stock into pan gravy until smooth; stir thyme sprigs into gravy. 6. Reduce heat to low and simmer gravy until thickened, 5 to 8 minutes. Strain gravy, discard onion pieces and thyme, and serve with prime rib.",
  "prep": "15 mins",
  "cook": "3 hrs",
  "total": "3 hrs 30 mins",
  "calories": "562"
},
{
  "url": "https://www.allrecipes.com/recipe/16350/kims-prime-rib/",
  "name": "Kim's Prime Rib",
  "rating": "4.5",
  "ratingcount": "79",
  "ingredients": "5 pounds rib roast; ¼ cup soy sauce; ¼ cup Worcestershire sauce; ½ teaspoon garlic powder; onion salt; 1 tablespoon browning sauce; 1 ½ cups water",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). 2. In a medium bowl, combine soy sauce, Worcestershire sauce, garlic powder, onion salt, browning sauce, and water. Place roast in a roasting pan, ribs side down, and poke deep holes in roast with a knife. Pour marinade over roast. Using a baster, squirt marinade into the holes you created with a knife and over entire roast a few times. 3. Bake for about 1 hour. (Note: Bake for 40 to 45 minutes for a smaller roast so that it does not dry out.) 4. Remove roast from the oven and reduce the temperature in the oven to 200 degrees F (95 degrees C). 5. When the oven has reached 200 degrees F (95 degrees C), return roast to the oven and continue cooking for 18 to 22 minutes per pound, or until internal temperature reaches 145 degrees F (65 degrees C).",
  "prep": "20 mins",
  "cook": "2 hrs",
  "total": "2 hrs 20 mins",
  "calories": "614"
},
{
  "url": "https://www.allrecipes.com/recipe/262936/the-best-prime-rib-ever/",
  "name": "The Best Prime Rib Ever",
  "rating": "4.3",
  "ratingcount": "3",
  "ingredients": "1 (4 pound) boneless prime rib roast; 2 tablespoons olive oil; 6 cloves garlic, minced; 3 teaspoons salt; 3 teaspoons ground black pepper; 1 teaspoon dried thyme; 1 teaspoon dried rosemary",
  "directions": "1. Preheat the oven to 500 degrees F (260 degrees C). 2. Place prime rib in a roasting pan, fat-side up. 3. Blend olive oil, garlic, salt, pepper, thyme, and rosemary together in a food processor. Pour over the roast. Let sit at room temperature, about 15 minutes. 4. Bake in the preheated oven for 20 minutes. Reduce oven temperature to 325 degrees F (165 degrees C). Cook until medium-rare or an instant-read thermometer reads at least 145 degrees F (63 degrees C), 60 to 75 minutes more.",
  "prep": "5 mins",
  "cook": "1 hr 20 mins",
  "total": "1 hr 40 mins",
  "calories": "457"
},
{
  "url": "https://www.allrecipes.com/recipe/30975/rock-salt-roast-prime-rib/",
  "name": "Rock Salt Roast Prime Rib",
  "rating": "4.3",
  "ratingcount": "29",
  "ingredients": "1 (4 pound) prime rib roast; 2 cups prepared hot mustard; 4 cups rock salt; 1 cup cream; 2 tablespoons prepared horseradish",
  "directions": "1. Preheat the oven to 450 degrees F (230 degrees C). Line a roasting pan with aluminum foil. 2. Liberally coat roast with mustard so that it is entirely covered. Put a thick layer of rock salt on the foil in the roasting pan, about the size of the bottom of roast. Set roast on salt and press down to embed salt into mustard. Completely cover roast with rock salt, pressing it into mustard. (A lot of salt will fall off into the pan, but that doesn't hurt anything). 3. Bake, uncovered, in the preheated oven until internal temperature reaches 145 degrees F (65 degrees C), about 1 hour. Let stand for 15 minutes. 4. Meanwhile, whip cream in a mixing bowl until stiff peaks form. Fold in horseradish to taste. 5. The roast will be encased in a shell of salt. Hit the shell sharply with the back of a knife; it will crack open and start to fall off. Remove the shell. 6. Place roast on a cutting board. Slice and serve with horseradish sauce.",
  "prep": "10 mins",
  "cook": "1 hr",
  "total": "1 hr 25 mins",
  "calories": ""
}]